{"result_id": "323033", "URL": "https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "timestamp": "2023-04-25 17:46:37 CEST+0200", "meta": {"description": "Vanessa Beeley examines the British Government's conflicts of interest in vaccine philanthropy, which she writes is more accurately called philanthrocapitalism. Why is the Cabinet Office setting up a Digital ID Unit?", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Who controls the British Government response to Covid–19?", "cleaned_text": "\"The welfare of humanity is always the alibi of tyrants\" — Albert Camus\n\nAs Britain hurtles headlong towards neo-feudalist governance with heightened surveillance, micro-management of society and an uptick in fascistic policing of the draconian measures imposed to combat the \"threat\" of Covid–19, it is perhaps time to analyse the real forces behind this \"new normal\".\n\nThere is now serious doubt over the correlation between lockdown and saving lives. Reality is creeping into the Covid–19 dialogue. It is becoming apparent that people are getting sick because they are being isolated and effectively living under house arrest, condemned as \"murderers\" if they so much as think about breaking curfew, being snitched on by neighbours for \"gathering\" more than two people together in their back gardens.\n\nThe following graph was produced by UK Column and demonstrates the lack of correlation between lockdown and \"saving lives\":\n\nThe numbers game is acting in many instances as a smokescreen. It is impossible to rely upon \"official\" statistics, that vary wildly from one website to another: statistics that rely upon unreliable and sporadic testing procedures. and based upon death certificates that misrepresent the actual cause of death as Covid–19, regardless of pre-existing medical conditions. Statistics, too, that were set in stone very early on in the development stages, when the perspective was limited and compressed, before a true picture could be seen. The newly emerging statistics are now increasingly undermining initial conclusions and pointing to the futility and negative consequences of lockdown.\n\nIt is now accepted that there is a high mortality rate among the elderly in care homes in the UK and globally — among the same elderly civilians who are being \"asked\" to sign DNRs (Do Not Resuscitate) forms. This amounts to signing their own death warrant, should they present any of the Covid–19 symptoms. They will be neglected, isolated from their families when at their most vulnerable and left alone to die, even though it is possible that they have not contracted the virus.\n\nInstead of offering proactive and positive suggestions that will enable our immune systems to combat the disease, the British Government is ensuring conditions that will suppress immune systems to dangerous levels and create the perfect environment for Covid–19 to flourish.\n\nBritain has now received an estimated 1.4 million new benefit claims for welfare payments, \"about seven times the normal level\". The government has pledged to bail out \"80% of pay of workers who are temporarily laid off\" but I have personally spoken to self-employed individuals who find themselves falling between the cracks that qualify them for financial support and now face an indefinite period of time without income.\n\nThese measures are being imposed in a country that, since 2012, has seen an exponential growth in child poverty to potentially sub-Victorian levels. In March 2019, the number of children living in \"absolute poverty\" grew by a staggering 200,000 in a twelve-month period, to a total of 3.7 million. How will this number be further impacted by lockdown?\n\nHow did we arrive at this point? Who steered the UK Government towards this questionable and alarmist lockdown policy? The unexamined assumption is that conclusions were formed on the basis of sound epidemiological analysis and research by doctors and scientists who care about our welfare.\n\nThe reality is what we will examine in this article. Neil Ferguson, a professor at Imperial College, was responsible for the modelling of a response to Covid–19. His virtual model was recommended by the World Health Organisation (WHO) and it passed through into policy with virtually no scrutiny. Ferguson's dramatic prediction of 500,000 deaths in the UK became the foundation of Boris Johnson's U-turn from herd immunity to collective quarantine.\n\nWhile some understood that Ferguson later reduced his mortality calculations, he actually doubled down on his projections on Twitter, insisting that without drastic lockdown measures being taken, the numbers would be even higher.\n\nFerguson is acting director of the Vaccine Impact Modelling Consortium (VIMC), which is based at Imperial College in London. According to Ferguson's biography on the website, \"much of [his] work is applied, informing disease control policy-making by public and global health institutions.\"\n\nThe professor who derailed Johnson's semblance of \"herd immunity\" strategy is no stranger to controversy and is described as having a \"patchy\" record of modelling pandemics by one of his academic peers, Professor Michael Thrusfield of Edinburgh University, an expert in animal diseases.\n\nFerguson was instrumental in the modelling of the British Government's response to Foot and Mouth Disease (FMD) in 2001, which Thrusfield describes as \"not fit for purpose\" (2006) and \"seriously flawed\" (2012). Thrusfield has highlighted the limitations of Ferguson's mathematical modelling methods, and applied the doubts he expressed over FMD to the current Covid–19 \"crisis\" response.\n\nAn estimated twelve million animals were slaughtered as a result of Ferguson's 2001 initiative. The farming community was devastated by suicides and bankruptcies that irretrievably altered the landscape of British agriculture — forcing healthy smallholdings into agri-corporate mergers and empowering the EU central governance in the agricultural sector.\n\nInsight: Slaughtered on Suspicion, a documentary made by UK Column in 2015, provides a shocking insight into the suffering precipitated by Ferguson's model and the \"new normal\" imposed upon Britain's farming community. The following is a statement made by one of the contributors to the programme:\n\nIn 2002, Ferguson predicted that up to 50,000 people would die from variant Creutzfeldt-Jakob disease, better known as \"mad cow disease\", increasing to 150,000 if the epidemic expanded to include sheep. The reality is: \"Since 1990, 178 people in the United Kingdom have died from vCJD, according to the National CJD Research & Surveillance Unit at the University of Edinburgh.\" (2017)\n\nIn 2005, Ferguson claimed that up to 200 million people would be killed by bird-flu or H5N1. By early 2006, the WHO had only linked 78 deaths to the virus, out of 147 reported cases.\n\nIn 2009, Ferguson and his team at Imperial College advised the government that swine flu or H1N1 would probably kill 65,000 people in the UK. In the end, swine flu claimed the lives of 457 people in the UK.\n\nNow, in 2020, Ferguson and Imperial College have released a report which claims that half a million Britons and 2.2 million Americans may be killed by Covid–19. The report has still not been peer-reviewed; despite this and Ferguson's glaring record of mathematical sensationalism, the British Government has adopted the devastating socio-economic lockdown that Ferguson has proposed.\n\nWhy is the British Government so quick to follow Ferguson's plan?\n\nThe VIMC is hosted by the Department of Infectious Disease Epidemiology at Imperial College. VIMC is funded by the Bill and Melinda Gates Foundation and by \"GAVI, the vaccine alliance\" (GAVI's own title for itself). Bill and Melinda Gates began funding Imperial College in 2006, four years before the Gates Foundation launched the Global Health Leaders Launch Decade of Vaccines Collaboration (GHLLDVC) and one year after Ferguson had demonstrated his penchant for overblown projections on mortality numbers from H5N1.\n\nUp to the end of 2018, the Gates Foundation has sponsored Imperial College with a whopping $185 million. That makes Gates the second largest sponsor, beaten to the top spot on the podium by the Wellcome Trust, a British research charity which began funding Imperial College prior to Ferguson's FMD débâcle and which, by the end of 2018, had already provided Imperial with over $400 million in funding. I will examine the Wellcome Trust's connections in part two of this series.\n\nThe Gates Foundation established the GHLLDVC in collaboration with the WHO, UNICEF and the US National Institute of Allergy and Infectious Diseases (NIAID). The following is taken from the Gates Foundation website:\n\nThe Collaboration's leadership council at the time included the Director-General of the WHO, the Director of NIAID, the Director of UNICEF, the President of Gates Foundation Global Health, and the Chair of the African Malaria Alliance. The steering committee included the Director of Immunisation, the UK Department of Health, and many other representatives from the WHO, UNICEF and associated organisations. It is a cluster of immunisation-focused individuals controlling the policy of world health governing bodies, who claim to be neutral.\n\nThe WHO was nominated as the \"directing and coordinating authority on international health within the United Nations system\" and was set up to be responsible for \"shaping the health research agenda\", among other tasks linked to the policy of global immunisation.\n\nUNICEF, the \"world's largest provider of vaccines for developing countries\" has on-the-ground access to children in over 150 territories and countries (2010).\n\nWe are already seeing the potential for some serious conflict of interest behind the Ferguson model on Covid–19, and this will become even more apparent as the connections are now made to an entire pharmaceutical complex potentially protecting its own interests over any genuine concerns for the health and welfare of global populations.\n\nGAVI is funded and partnered by the same network that forms the GHLLDVC, with some noticeable additions: the World Bank and donor/implementing country governments. The Gates Foundation is a primary sponsor, but is topped by the British Government, which was instrumental in creating GAVI and is its largest donor.\n\nWhile many sectors of British society have seen their living standards plummet, with the elderly severely neglected, a National Health Service in decline and homelessness on the increase, the British Government, via UKAID, has pledged £1.44 billion to GAVI for 2016–2020 and will be hosting the 2020 GAVI pledging conference, which is due to take place in June 2020 to \"mobilise at least US$ 7.4 billion in additional resources to protect the next generation with vaccines, reduce disease inequality and create a healthier, safer and more prosperous world.\" (Emphasis added)\n\nThe conference promises to bring together political leaders, civil society, public and private donors, vaccine manufacturers and governments to support GAVI, the vaccine alliance — which boasts that it has \"helped vaccinate almost half the world's children against deadly and debilitating infectious diseases\". This claim will be met with praise from the pro-vaccine lobby but concerns over the efficacy and safety of these mass vaccination programmes must be taken into account, particularly when being tested in poorer, developing countries.\n\nGlobal vaccination market revenue worldwide is projected to reach $59.2 billion by 2020; this number may well increase with the arrival of Covid–19. The British Government's investment in GAVI alongside vaccine promoter Bill Gates must, again, raise the issue of conflicts of interest. To what extent is the British Government protecting its own assets in forcing the lockdown upon its population? Vaccines are set to be a major source of income for the world's largest pharmaceutical corporations, and the British Government is invested in that lucrative future.\n\nThe GAVI replenishment conference is to be hosted by a British Government whose lockdown policy is effectively shattering the domestic economy and is collectively punishing the most vulnerable in British society.\n\nWhen Bill Gates partnered with GAVI twenty years ago, he had been considering where next to focus his philanthropy and was \"increasingly focusing on the power and potential of vaccines\". It was Gates' substantial sponsorship that launched GAVI, and ten years later Gates launched his own \"vaccine decade\" plan for the 2010s.\n\nThe Global Vaccine Action Plan (GVAP) 2012–2020, endorsed by the 194 member states participating in the World Health Assembly (2012), is led by the same members of the Gates \"vaccine decade\" consortium, promoted by the WHO, and brings together governments, elected officials, health professionals, academia, manufacturers, global agencies, research and development, civil society, media and the private sector — to promote global immunisation. This is a profit-driven corporate complex harnessing the \"humanitarian\" sector to lend credence to the claims of philanthropy, or more realistically, philanthrocapitalism.\n\nA glance at the partner page of the GAVI website reveals that not only is GAVI heavily invested in immunisation campaigns, it is also closely connected to the Gates, Microsoft and Rockefeller Foundation seed-funded ID2020 project (Digital Identity Alliance), which incorporates Accenture, Microsoft (Gates), Ideo-Org and Rockefeller Foundation into the GAVI alliance, all with ties to the ID2020 initiative.\n\nID2020 is promoting the concept that there is a need for universal biometric verification, because \"to prove who you are is a fundamental and universal human right,\" as asserted on the ID2020 website. An article by journalist Kurt Nimmo for Global Research dismantles the \"humanitarian\" alibi for tyranny.\n\nNimmo describes the potential for Covid–19 to be used as cover for mandatory biometric ID. An April article carried by Reuters confirms the suspicion that biometric ID might soon be introduced, ostensibly to \"help verify those who already had the infection and ensure the vulnerable get the vaccine when it is launched\". This may sound perfectly sensible to those who are buying the government strap-lines on Covid–19 but — as Nimmo warns us — \"COVID–19 is the perfect Trojan horse for a control freak state itching to not only micromanage the lives of ordinary citizens but also ferret out critics and potential adversaries and punish them as enemies of the state.\"\n\nPrashant Yadav, senior fellow at the US-based Center for Global Development, has said:\n\nSuch statements can easily be interpreted as the harbingers of mandatory vaccination and the inclusion of biometric ID in the \"humanitarian\" package.\n\nMartin Armstrong of Armstrong Technologies introduces an even more sinister projection into the mix. Armstrong talks about a digital certificate that verifies you have been vaccinated, developed by the Massachusetts Institute of Technology (MIT) and Microsoft, which will merge with ID2020. Covid–19 will be exploited to encourage us to accept digital implants and tracking devices that will enable authorities to keep an eye on us. Armstrong argues that just as 9/11 conditioned us to accept X-ray booths at airports, now we will be chipped alongside our dogs and cats.\n\nAt this point, it is worth remembering that UKAID is heavily involved in GAVI, and one presumes they are on board with the digital ID2020 project. Rob Laurence, director at UK-based Innovate Identity, presented proposals for the future of digital identity back in June 2019. The UK Government Verify scheme was identified as a fledgling version of the future of digital ID.\n\nLaurence describes the digital ID \"ecosystem\" that is emerging: Oliver Dowden, Minister for Implementation at the Cabinet Office (the British Government's co-ordinating department), will form a new Digital ID Unit to \"pave the way for the government to consume digital identities from the private sector\". Laurence describes 2020 as the \"now-or-never year for government and industry to collaborate\" in the creation of an \"interoperable digital identity market\".\n\nCovid19 provides the opportunity that might just fulfil these predictions.\n\nIt is no coincidence that a British start-up — Microsoft-funded Onfido — has recently raised $100 million to \"boost its ID technology\" to enable the creation of \"immunity passports\" for governments \"battling coronavirus\".\n\nIn December 2019, researchers at MIT created a \"microneedle platform using fluorescent microparticles called quantum dots (QD) which can deliver vaccines and at the same time, invisibly encode vaccination history in the skin\": the QDs can be detected by specially adapted smartphones. The \"new normal\" will mean we are tracked and monitored by our own communication systems to an even greater and more intrusive extent.\n\nThe future is being modelled — but not for our benefit\n\nIn part one of this two=part series, my intention has been to raise questions over who is driving the British Government response to Covid–19. Those who have influenced the lockdown policy have very clear conflict of interest question marks over their agenda.\n\nThe scientific clique influencing government decisions is one that is incorporated into a for-profit Big Pharma industrial network which will, undeniably, benefit from the measures being taken by the British Government — a government that is financially embedded in the same complex.\n\nWhy are the views of epidemiologists, doctors, scientists, analysts and health advisors who challenge the lockdown being ignored or censored by the media and by government? Why is the government not widening the circle of advisors to take into account these opposing perspectives that might bring an end to the misery that is a consequence of enforced quarantine? Off-Guardian has recorded these views here, here and here. It is also worth following Swiss Propaganda Research for regular updates on emerging analysis and statistics that you will not always find in the mainstream media.\n\nWorld Economic Forum report on the psychological experiment that is the Covid19 lockdown.\n\nInstead, the British Government is effectively endorsing the breeding of distrust in society, the erosion of public assembly, the isolation and state-sanctioned euthanasia of the elderly, the emerging police state, snitch lines, loss of dignity and livelihoods, greater dependency upon the state for survival, depression, suicide and voluntary incarceration.\n\nAn article in New York Times reports on the death toll in care homes which \"reflect a global phenomenon\" in a world under lockdown.\n\nThe UN has issued a warning that the economic downturn could \"kill hundreds of thousands of children in 2020\". Gates, the WHO, the British Government and UNICEF are focused on global immunisation for a \"pandemic\" that is not living up to the alarmist virtual projections sponsored by Gates and the Big Pharma complex, while children really will start to die from malnutrition, neglect and a myriad of consequence of extreme poverty generated by the \"steepest downturn since the Great Depression of the 1930s\" (IMF).\n\nIn part two, I will delve deeper into the interlocking interests of state and private corporate sectors that should not be interfering in policies which affect the welfare of British citizens. I will reveal how the same players are influencing the media response and ensuring that their interests are given the most powerful platforms to promote their agenda.\n\nThe questions must be asked: Who is really in charge of the Covid–19 response? Who benefits most? Who will suffer most from the long term consequences? And who will provide respite from those consequences when the \"pandemic\" has disappeared from view?", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/who-controls-british-government-response-covid19-part-one", "title": "Who controls the British Government response to Covid–19?", "description": "Vanessa Beeley examines the British Government's conflicts of interest in vaccine philanthropy, which she writes is more accurately called philanthrocapitalism. Why is the Cabinet Office setting up a Digital ID Unit?", "image": "https://www.ukcolumn.org/sites/default/files/bill-and-boris_0.jpg", "article:author": "Vanessa Beeley", "article:publisher": "UKColumn", "article:published_time": "2020-04-22T07:53:00+01:00", "article:modified_time": "2020-04-22T11:02:03+01:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://antilogicalism.com/wp-content/uploads/2018/03/the-plague.pdf", "https://swprs.org/a-swiss-doctor-on-covid-19/#latest", "https://twitter.com/afshinrattansi/status/1251264026274906112", "https://www.theguardian.com/world/2020/apr/18/uk-care-home-covid-19-deaths-may-be-five-times-government-estimate", "https://www.theguardian.com/world/2020/apr/16/italian-police-broaden-care-home-coronavirus-milan", "https://twitter.com/johnpilger/status/1250702443723120642", "https://www.reuters.com/article/us-health-coronavirus-britain-benefits/uk-new-welfare-benefit-claims-soar-to-1-4-million-minister-says-idUSKCN21W0L5", "https://www.independent.co.uk/news/uk/home-news/child-poverty-absolute-uk-housing-crisis-costs-austerity-conservatives-a8843381.html", "https://www.ukcolumn.org/article/retired-chief-eu-epidemiologist-how-long-can-you-keep-lockdown-democracy", "https://twitter.com/neil_ferguson/status/1243294815200124928", "https://www.imperial.ac.uk/people/neil.ferguson", "https://www.dailymail.co.uk/news/article-8164121/Professor-predicted-500-000-Britons-die-coronavirus-accused-having-patchy-record.html", "https://www.youtube.com/watch?v=Yb9iaDoXJF8", "https://www.theguardian.com/education/2002/jan/09/research.highereducation", "https://med.uth.edu/blog/2017/01/05/new-research-could-lead-to-blood-test-to-detect-creutzfeldt-jakob-disease/", "https://www.theguardian.com/world/2005/sep/30/birdflu.jamessturcke", "https://www.prb.org/avian-flu-and-influenza-pandemics/", "https://www.spectator.co.uk/article/six-questions-that-neil-ferguson-should-be-asked", "https://www.imperial.ac.uk/media/imperial-college/medicine/sph/ide/gida-fellowships/Imperial-College-COVID19-Global-Impact-26-03-2020v2.pdf", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2010/12/Global-Health-Leaders-Launch-Decade-of-Vaccines-Collaboration", "https://donations.vipulnaik.com/donee.php?donee=Imperial+College+London", "https://donations.vipulnaik.com/donee.php?donee=Imperial+College+London", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2010/12/Global-Health-Leaders-Launch-Decade-of-Vaccines-Collaboration", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2010/12/Global-Health-Leaders-Launch-Decade-of-Vaccines-Collaboration", "https://www.gatesfoundation.org/Media-Center/Press-Releases/2010/12/Global-Health-Leaders-Launch-Decade-of-Vaccines-Collaboration", "https://www.gov.uk/government/news/uk-to-host-gavi-pledging-conference-in-2020", "https://www.gavi.org/investing-gavi/resource-mobilisation-process/gavis-3rd-donor-pledging-conference-june-2020", "https://www.globalresearch.ca/uncovering-the-cover-up-scientific-analysis-of-the-vaccine-autism-connection-deeply-flawed-vaccine-policies/5491987", "https://www.pharmaceuticalprocessingworld.com/global-vaccine-market-revenue-to-reach-59-2-billion-by-2020/", "https://www.gavi.org/gavi-at-20", "https://www.who.int/immunization/global_vaccine_action_plan/GVAP_doc_2011_2020/en/", "https://www.globalresearch.ca/covid-19-perfect-cover-for-mandatory-biometric-id/5709146", "http://eclinik.net/id2020-alliance-global-mandatory-vaccinations-biometric-id-integration/", "https://www.reuters.com/article/health-coronavirus-tech/biometric-ids-can-be-gamechanger-in-coronavirus-antibody-tests-vaccine-idUSL8N2BV0BI", "https://www.reuters.com/article/health-coronavirus-tech/biometric-ids-can-be-gamechanger-in-coronavirus-antibody-tests-vaccine-idUSL8N2BV0BI", "https://www.armstrongeconomics.com/world-news/conspiracy/are-the-planning-id2020-as-mandatory-implants-for-all-as-the-solution-to-the-crisis/", "https://www.linkedin.com/in/rob-laurence-a5b50013/?originalSubdomain=uk", "http://www.innovateidentity.com/the-road-to-2020-the-future-for-digital-identity-in-the-uk/", "https://www.gov.uk/government/publications/introducing-govuk-verify/introducing-govuk-verify", "https://www.telegraph.co.uk/technology/2020/04/15/british-ai-startup-onfido-secures-100m-boost-tech-immunity-passports/", "https://www.genengnews.com/topics/drug-discovery/quantum-dots-deliver-vaccines-and-invisibly-encode-vaccination-history-in-skin/", "https://www.dailymail.co.uk/news/article-8188041/Ministers-accused-treating-Doomsday-scientist-like-demigod.html", "https://off-guardian.org/2020/03/24/12-experts-questioning-the-coronavirus-panic/", "https://off-guardian.org/2020/04/17/8-more-experts-questioning-the-coronavirus-panic/", "https://off-guardian.org/2020/03/28/10-more-experts-criticising-the-coronavirus-panic/", "https://swprs.org/a-swiss-doctor-on-covid-19/#latest", "https://www.weforum.org/agenda/2020/04/this-is-the-psychological-side-of-the-covid-19-pandemic-that-were-ignoring/?fbclid=IwAR0NgSFAkHG-2_MWR33RGrplhmcbHnpOYz1pf8UTjH0sE1pmLyPuNE-j954", "https://www.nytimes.com/2020/04/16/world/canada/montreal-nursing-homes-coronavirus.html", "https://www.reuters.com/article/us-health-coronavirus-children-un-idUSKBN21Y2X7", "https://twitter.com/VanessaBeeley/status/1251404445344292864?s=19"], "authors": [], "publish_date": "2020-04-22T07:53:00+01:00"}