{"result_id": "323025", "URL": "https://www.ukcolumn.org/video/vaccine-damage-real-people-adam", "timestamp": "2023-04-25 17:46:33 CEST+0200", "meta": {"description": "From the peak of fitness to struggling for breath, thanks to following the science. Sports physiotherapist Adam Rowland's horrible adverse reactions to a Covid injection got him ridiculed and called a drug addict.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/vaccine-damage-real-people-adam", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Vaccine Damage—Real People: Adam", "cleaned_text": "UK Column has been humbled and honoured to talk to many of those who are suffering from vaccine injury as a result of trusting the science. They have done nothing wrong—on the contrary, they have done what the propaganda told them was the decent thing to do—yet find themselves abandoned and ignored by the very people they trusted in the first place to keep them safe.\n\nAdam Rowland MSc CSCS, from the North West of England, tells his story with fortitude despite being very gravely ill indeed, on oxygen and in intense pain throughout the whole interview.\n\nAs a boy, Adam inherited his parents' love of cycling. Always active and a keen sportsman, Adam decided to make his passion into a career. He is a proud man: he never had to ask anyone for anything and did not have a day off work for over a decade. He loved his job and has had a fit and active life, with no previous medical conditions or chronic illness. He prided himself on his independence, and it was for Adam to help others, not the other way around.\n\nA well-established sports physiotherapist, Adam Rowland was at the pinnacle of his career. After his Master's degree, he pursued postgraduate study and qualified as a Strength and Conditioning Specialist. Adam went on to take further courses annually in Emergencies with the Royal College of Surgeons. He has been employed by major clubs, with the England Rugby League team among his clients.\n\nIn January 2021, because he was looking after his elderly mother-in-law, Adam was advised to have a Covid-19 injection to protect her. Eager to keep his family safe, Adam made the trip to his local vaccination centre—which, ironically, was a stadium that he had worked in previously. Never was he given a Patient Information Leaflet, and he didn’t get any information about side effects. Adam was told that all he needed to do was offer his arm up for the AstraZeneca injection and then sit for fifteen minutes afterwards to make sure all was well. Feeling fine, Adam returned home and it wasn’t until six hours later that he developed flu-like symptoms and started to feel distinctly unwell.\n\nAfter experiencing shaking and fitting symptoms in bed at night, Adam sought advice from his GP (family doctor). Lockdown meant he couldn’t visit his GP, so had to make do with a telephone appointment. He was told his symptoms were likely to be a ‘panic attack’ and nothing more serious. The fits continued, however, and Adam’s insistence that his condition was not panic attacks caused arguments in his marriage.\n\nSadly, Adam and his wife are now separated and he has had to move back to his mother’s after finding himself jobless and without income. Unable to get out of the house, Adam is now cared for full-time by his mother. His GP openly told him that he was unwilling to spend \"his\" budget on treating Adam; an attitude that, as he attests in this interview, was also evident from staff at hospitals and in paramedic services, with a few honourable exceptions.\n\nAfter a difficult, phased return to work, Adam went for a second Covid injection in May 2021, with fewer immediately evident adverse effects on him than with the first. As the months passed, Adam’s condition became even more serious; yet still, everyone he spoke to told him he was having panic attacks and wanted to treat him for depression. For nearly two years, Adam has battled the system, fighting every step of the way for justice, and had to navigate multiple agencies and departments to get the most modest of help.\n\nHe has been lied to, shouted at, accused of wasting emergency services' time, called a drug addict, refused treatment, laughed at and ridiculed. With all his savings gone, Adam wants to warn others of how those who have trusted the science have been totally let down, injured, abused and savagely treated—so that it does not happen to anyone else.\n\nIn this frank interview, we follow Adam’s long and arduous journey to get to the truth. Now, after nearly a full two years, he has been told by a careful consultant that he is critically ill—yet today, as this interview airs, Adam is still waiting for vital tests and treatment for his new diagnosis of cardiomyopathy. His message to MHRA boss Dame June Raine and all those responsible is powerful.\n\nAdam Rowland is man who used to lead a very active, independent life. His greatest ambition now is to muster the strength to push his young grandson on a swing and to walk his dog—which he has reluctantly had to give to his estranged wife, as he is no longer able to walk far.\n\nWe would like to thank Adam for telling his story out of altruism: not the propagandists' alleged altruism of volunteering for an experiment, but the kind of altruism that keeps telling the unpopular truth.\n\nAdam Rowland has a fundraiser for his treatment. He was prevailed upon to resign from his job at his old club.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/vaccine-damage-real-people-adam", "title": "Vaccine Damage—Real People: Adam", "description": "From the peak of fitness to struggling for breath, thanks to following the science. Sports physiotherapist Adam Rowland's horrible adverse reactions to a Covid injection got him ridiculed and called a drug addict.", "image": "https://www.ukcolumn.org/sites/default/files/2022-11/Adam%20thumb.jpg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/video/vaccine-damage-real-people-charlet", "https://www.ukcolumn.org/video/vaccine-damage-real-people-wayne", "https://www.ukcolumn.org/article/breaking-covid-trance-how-irish-people-were-psychologically-manipulated", "https://en.wikipedia.org/wiki/St_Helens_R.F.C.#Coaches_and_Board", "https://www.youtube.com/watch?v=ZJjiia5NdsM&t=201s", "https://www.ukcolumn.org/article/greater-manchester-vaccination-centre-and-mhras-yellow-card-adr-scam-part-1", "https://www.ukcolumn.org/search?keywords=MHRA", "https://www.gofundme.com/f/please-help-me-to-afford-life-saving-therapy", "https://www.facebook.com/OfficialSt.HelensRLFC"], "authors": [], "publish_date": "2022-11-28T14:30:13+00:00"}