{"result_id": "323044", "URL": "https://www.ukcolumn.org/video/no-smoke-without-fire-part-1-international-scientific-experts-discuss-covid-19-and-vaccines", "timestamp": "2023-04-25 17:46:43 CEST+0200", "meta": {"description": "In No Smoke Without Fire Part 1: International Scientific Experts discuss COVID 19 and Vaccines, Brian Gerrish and Debi Evans SRN are joined by top scientific experts Dr Anne-Marie Yim and Dr Herve Seligmann.", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/video/no-smoke-without-fire-part-1-international-scientific-experts-discuss-covid-19-and-vaccines", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "No Smoke Without Fire Part 1: International Scientific Experts discuss COVID-19 and Vaccines", "cleaned_text": "This vital edition of No Smoke Without Fire is the first of two parts examining events, facts, claims and statistics around COVI- 19 and the resulting enforced vaccine programme, with its catalogue of recorded vaccine adverse reactions.\n\nPart 1 is entitled 'International Scientific Experts discuss COVID 19 and Vaccines', and Part 2 'Covid 19 and Vaccine Statistics, Adult and Child Safety'.\n\nTogether, both parts provide a stark wake up call to those believing the official narrative on COVID-19 and in the efficacy and safety of the vaccines offered.\n\nBrian Gerrish is joined by top international scientific experts Dr Anne-Marie Yim and Dr Hervé Seligmann.\n\nThis highly informative and relevant discussion around COVID-19 and vaccine matters has been made possible by the outstanding research and engagement of former nurse Debi Evans SRN, whose own efforts in these complex fields have resonated with the expert views and analysis of both Dr Anne-Marie Yim and Dr Seligmann.\n\nDr Anne-Marie Yim is French and of Cambodian origin. She holds a doctorate in organic chemistry from the University of Montpellier, France. She worked as a researcher at the University of Michigan in cancer research, particularly in proteomics (the large-scale study of proteins), and was awarded a research prize in 2001 for her work in identifying membrane proteins, awarded by the Office of Technology Transfer at the University of Michigan. She has expertise in protein chemistry, with a focus on disulfide bridges in cysteine derivatives and the radical enantioselective synthesis of amino acids both in the homogenous and the supported phase, as she did her thesis in the Laboratory of Aminoacids, Peptides and Proteins at the University of Montpellier, now the IBMM, Max Mousseron Institute. Her research papers as a Post-Doctoral Research Fellow of the Carcigenosis Program at the University of Michigan Medical School include An immune response manifested by the common occurrence of annexins I and II autoantibodies and high circulating levels of IL6 in lung cancer and Global profiling of the cell surface proteome of cancer cells uncovers an abundance of proteins with chaperone function. Aside from her specialist scientific and medical work, she holds a wide range of additional qualifications, including in Intellectual Property, Patents and Trademarks.\n\nDr Hervé Seligmann was an invited professor in 2013-18 at the Emerging Infectious and Tropical Diseases Research Unit, Faculty of Medicine, Aix-Marseille University, Marseilles, France. His qualifications from the Hebrew University of Jerusalem include a B.Sc. in Biology, an M.Sc. in Plant Physiology (thesis: A morphological marker of transitions towards saltadaptation in Sorghum bicolor, supervised by Dr R.H. Lerner, Department of Plant Sciences), and a Ph.D. in lizard microevolution: Microevolution of proneness to tail loss in lizards. He has been the recipient of a Rothschild Fellowship and was a postdoctoral fellow at the University of Chicago and the University of Oslo.\n\nHe has written an extensive number of peer-reviewed scientific publications, including on key subjects in the evolution of the genetic code structure, alternative gene decoding, and the multifunctionality of mitochondrial tRNAs.\n\nIn Part 1, Dr Yim, Dr Seligmann and Debi Evans SRN discuss a range of relevant topics concerning COVID-19 and vaccines, including:\n\n- What is COVID-19 and where did it come from?\n\n- Damaged babies and death risks after vaccination. (This subject is discussed by Dr Seligmann in more detail in Part 2, using data from Israel.)\n\n- Immune system reactions: Cytokine Storm Syndrome, T cells, B cells, the process of inflammation, dealing with inflammation, the value of ivermectin, hydoxychloroquine, zinc and Vitamin D.\n\n- The work, studies and warnings of virologist Dr Geert Vanden Bossche.\n\nIn Part 2, Dr Yim, Dr Seligmann and Debi Evans SRN discuss a range of relevant topics concerning COVID-19 and vaccine statistics, together with concerns about adult and child safety. Their discussion includes:\n\n- Lessons learned from Israeli and worldwide COVID-19 and vaccine statistics.\n\n- Vaccination and its effects on the immune system.\n\n- Vaccination and its effects on the body's defences against cancer.\n\n- The lack of long-term vaccination data for pregnant women.\n\n- The silencing of scientists speaking out against vaccine policy.\n\n- Governments' and health agencies' denial of the reality of statistical results.", "opengraph": {"site_name": "UKColumn", "type": "video", "url": "https://www.ukcolumn.org/video/no-smoke-without-fire-part-1-international-scientific-experts-discuss-covid-19-and-vaccines", "title": "No Smoke Without Fire Part 1: International Scientific Experts discuss COVID-19 and Vaccines", "description": "In No Smoke Without Fire Part 1: International Scientific Experts discuss COVID 19 and Vaccines, Brian Gerrish and Debi Evans SRN are joined by top scientific experts Dr Anne-Marie Yim and Dr Herve Seligmann.", "image": "https://www.ukcolumn.org/sites/default/files/2021-07/Yim%20Seligmann%20Part%201%20Image.001.jpeg"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/search?keywords=smoke+fire", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://www.ukcolumn.org/video/no-smoke-without-fire-part-2-international-scientific-experts-discuss-covid-19-vaccine", "https://www.ukcolumn.org/video/no-smoke-without-fire-part-2-international-scientific-experts-discuss-covid-19-vaccine"], "authors": [], "publish_date": "2021-07-16T09:18:10+01:00"}