{"result_id": "323007", "URL": "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-ii-vaccine-damage", "timestamp": "2023-04-25 17:46:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/themes/custom/ukc_theme/ukc-logo-sm-sq.png", "canonical": "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-ii-vaccine-damage", "encoding": "utf-8"}, "image": null, "domain": "www.ukcolumn.org", "title": "Dr Mike Yeadon's key testimony — Part II: Vaccine Damage", "cleaned_text": "This is the second instalment of a five-webpage transcript of Dr Mike Yeadon's testimony to the 86th session of Stiftung Corona Ausschuss, held on 7 January 2022. Part I is here.\n\n\n\nIn this transcript, covering the second twenty-minute block of his testimony, Dr Yeadon sets out the known folly of jabbing the entire population, and alleges a deliberate choice on the part of manufacturers to use a method of production that obviates measured dosing.\n\nSo, to the vaccines. I worked for the biopharmaceutical industry for 32 years, so I think you can take it as read, but I'll say it again: I am in favour of innovative new medicines, provided they're well developed, used appropriately, and of course the profile is safe enough, considering the utility.\n\nSo if you were treating a terminal cancer that had evaded surgery, current chemotherapy, radiotherapy and so on, then you might be willing to take a drug that might kill five or ten per cent of the people, if it might stretch your life out for many years—especially if you're offered the chance of a cure. And with some of these gene-based vaccines, I think the original intent of people like Dr Robert Malone and others was indeed to treat things like that: you could put a protein from your cancer into one of these vaccines and force your immune system to recognise it and destroy it. And that could provide exquisitely safe novel chemotherapy.\n\nBut if you're going to treat effectively everyone on the planet—and you shouldn't do it anyway but that's certainly the state of intent—you need you need \"safety, safety, safety,\" as Peter McCullough would say. That's your first concern, even more than \"Does it work?\": you need to make sure it's very safe, because you're going to be giving it potentially to billions of people.\n\nI said earlier that my original training included toxicology. I was taught by at least two people that founded the discipline of mechanistic toxicity: Professor Jim Bridges and Dennis Park. They reminded us that in the 1950s, we didn't do toxicology in the drug industry. They would give it to two dogs and five chickens, and if the drug didn't kill them, they'd literally start giving them to people. That's how bad things were seventy years ago.\n\nWe had some strong wake-up calls at the end of the 1950s, early 1960s, with thalidomide, for example: it's a case that most people know about. At the time, they thought that babies were safe in the mother's womb, and so it really \"wouldn't be a problem\" if you gave a pregnant woman a drug. We now know that the foetus is is exquisitely sensitive to perturbations in their environment, and so we never, ever, give novel medical interventions to pregnant women. We’ll come back to that; we’re definitely doing that [with Covid injections].\n\nSo—because of my toxicological training and good understanding of what was required in new drug research and development—as soon as I looked at the [Covid] vaccines, I was really quite frightened, because they were a novel type. These have never been mass-dosed to human beings at all, so there would be no way of knowing what kind of unwanted effects might come about. And, of course, what you do is careful empirical study. You should do all of the possible studies. Your rule of thumb would be: if you can think of a worry, you need to show why why it's not going to happen, so you design an appropriate experiment. You have to try to \"drown your own puppy,\" as we used to call it. It's not a good job, but you have to do it. You can't just hope \"it'll be all right on the night\"; it really isn't.\n\nWhen I looked at the [Covid] vaccines, I had a number of concerns. One was: all four of them—AstraZeneca, Johnson & Johnson, Pfizer and Moderna—they all were fundamentally the same design, whether they used mRNA or or a viral-communicated DNA. They encoded only the spike protein: the bit sticking out from the ball-and-stick model of the virus that you've got. And I don't know to this day how they all chose just the spike protein, because we now know it's true that human immunity relies much more on understanding the depth of the molecular structure inside the ball than the spikes. So I thought it was bad, just the immunologically uneducated thing [to do], just to pick the outside part.\n\nBut secondly, [I developed concerns from] no more than half an hour of searching for research papers' abstracts and so on: not so much on coronavirus spike protein, because it's relatively new, but [research abstracts on] similar external proteins on other viruses. Within half an hour, I realised that all of them have some kind of biological properties that are unwelcome: they're not just for anchoring the virus to the surface of a cell, which they do do, but they're also biologically active—as you might expect, really They interact with the immune system and also with the coagulation system.\n\nIn fact, Wolfgang Wodarg led off, and I joined, a two-person appeal, a petition, to the European Medicines Agency to say, \"Don't approve these vaccines at this time: here are a handful of concerns that we think are going to occur, and you need to slow down.\" And I think two of the four [concerns we enunciated] have been tested and proved correct, and the third one is looking pretty ropey.\n\nSo the design of them, I would say, was toxic by design. It was always going to harm people.\n\nNext, [the design of Covid vaccines is] unlike a classical vaccine, which is usually a killed piece or preparation of the infective organism in a little bit of oil or alum, something like that. That's a unit dose, so you know how much you're injecting into each person. With these vaccines, we're giving unit dose of code. Now, that code could be copied into protein very efficiently, and might do so for a long time, in one person; in another person, it might be badly copied, inefficiently and only briefly.\n\nSo—I'm absolutely certain about this as a pharmacologist and toxicologist—by choosing this design, the range of outcomes is probably a thousand times worse than it would be for a conventional vaccine, because the actual amount of protein produced will vary by orders of magnitude more. And I thought that was the explanation for why it is that many people had no side effects whatsoever while others appeared to die.\n\nPeople would say, \"How could that possibly be true?\" I just explained [to them] that with an encoded vaccine, an unlucky individual might take up large quantities of it in their hearts, in the coronary vessels, or in the cerebral veins in the head, and produce lots of spike protein for a long time, and most people [in that unlucky category] might get myocarditis or cerebral vein sinus thrombosis, and die; and in someone else, it might be spread around the body in a less dangerous place and not make so much spike protein.\n\nI thought that was an adequate explanation, but I don't think that's the whole explanation any more. The reason I thought it was an explanation was, I made an assumption which I was entitled to make [in good faith], which is that the same stuff from a given manufacturer is in every single little glass vaccine vial. I believed—and was entitled to believe—that, to within a fraction of one per cent, we had the same consistent quality and purity in every single injection, and therefore the observed variation in in behaviour in people must be down to something such as what I just suggested.\n\nBut, as I'm going to come on to, unfortunately, we're now absolutely certain it's not the same stuff in every vial—and that means criminal acts are being committed.\n\nWhat a vaccine is and does\n\nJust before we come on to that: normally, a vaccine that you administer to a person would be one dose, sometimes two. There's never going to be a whole frame of them. [Yet] I'm seeing some countries already giving the fourth vaccine, and others have talked about an open-ended series! You need to know, vaccines are not like that. You do not need to be repeatedly dosed with something that would merit the title \"vaccine\". One or two doses, at most, [should suffice]. So it's more than that; it's not public health.\n\nBut here's the thing: a vaccine, or two at most, I think, will prevent you becoming ill with the pathogen against which you've been vaccinated. [The Covid jab model] doesn't do that, I'm afraid; it's not a vaccine. And [in a real vaccine,] as a consequence of protecting you against that organism—and it does that usually by killing off a new infection at an early stage, before you were even symptomatic—that would mean you should have low viral load in your airway, so that's what keeps you safe after vaccination or if you've acquired immunity.\n\nThe consequence of that is it usually reduces, if not stops, transmission. And we know now—[there's] lots of work in the literature—that people who've had this [Covid] virus are immune to becoming ill a second time from either the original virus or variants, and they don't transmit, either.\n\nWe know, we can see, what good immunity can look like. We've seen lots of cases of natural immunity. And authorities do agree: they concede that these [Covid] vaccines do not prevent you catching it; they don't prevent you growing the same amount in your airway as an unvaccinated person; and they don't prevent transmission.\n\nSo if someone's going to claim that [Covid vaccines] \"reduce the severity of your symptoms\", I'd like to know what black magic is invoked; because I've just told you, it goes to your airway, it grows in the same way, and transmits them the same way. I actually don't believe—there's no mechanism now for us to suddenly intervene and stop you getting ill—I don't believe it. So I think the most likely outcome now is, [Covid vaccines] don't do anything useful at all, but they are unfortunately really very harmful. They're certainly toxic.\n\nJust a brief introduction to one of the best tracking systems in the world: the Vaccine Adverse Event Reporting System, VAERS. It's a US system. It was put in place about thirty years ago, and anyone who has an adverse event following vaccination you—even if they not necessarily claiming it's necessarily caused by it, but in order to track the possibility—is urged to report that [to VAERS]. But unfortunately, the reporting rate is typically between 1% and 10% of adverse events.\n\nEvery piece of evidence has continued recently since the [Covid] vaccine started rolling out, and yet there have been more adverse events, and certainly many more deaths, associated just with the Covid vaccines than all the other vaccines in history that have been [registered] through this VAERS system.\n\nSo there is no question; it's public data, it's your database. It's not mine; I haven't put anything in it. 85% of the reports were put in there by a qualified healthcare professional. So it's not true, as some have asserted, that, \"Well, people are just putting in spoiler claims, and they're not real.\" They are, actually; they're absolutely real.\n\nit's often said that correlation is not causation, and that's true: just because there's lots of reports doesn't necessarily mean that it's the vaccine. But there are things called Bradford Hill criteria [for causation]. You can look up the Bradford Hill criteria—I think there are eleven of them—and it gives you methods whereby you can determine whether the correlation is indeed causative or not.\n\nI'll just give you a quick example: if there is acute toxicity in in the vaccine, then you would expect to see a spike in injuries and deaths in the first few days after administration; if there's no connection whatsoever, then you would expect a much more smooth, low-level profile that would not show much response to when you were vaccinated.\n\nWhen you look at it, I think more than a third of the adverse events occur on the day of dosing or the next few days, and then it rapidly falls off. So that's one of the Bradford Hill criteria [for causation met].\n\nAnother one—and I'll only mention this one other—is plausibility. If you have a theoretical reason for believing that [a treatment] will make your left leg turn blue, and you go and look at the adverse events and find lots of blue left legs, that's much more compelling than if someone ended up with a sore elbow for which you had no predictive power. What I would say is, on these this occasion we believe that these agents cause so-called thromboembolic disorders.\n\nSo [one would predict] the effect of coagulation: you may bleed or clot, and so any vessels that are plugged up by clots—like strokes or heart attacks, deep vein thrombosis, or bleeding, like subarachnoid haemorrhage—any of those things are what you would predict. And, lo and behold, they are present in VAERS at enormous numbers, unprecedented numbers.\n\nSo the timing and the plausibility convinces me that these are causative; mostly, they are causative. And other people who are used to doing this—pathologists and others—have done a very thorough job, and unfortunately it's definitely causative. Large numbers, and it's causative.\n\nSo when it comes to vaccines, wouldn't you expect—now, I put it to you—wouldn't you expect them to be deployed not just first, but only in the people who are at extraordinary risk from the from the pathogen? In this case, we know it's elderly people who are already frail. And [indeed,] that's how they started—but very swiftly, they started coming down to the working-age population: fifties, forties. And, as you're probably aware, we've now been trying to encourage people to get their children vaccinated.\n\nNow, I don't know about your part of the world, but for Sweden and Germany I looked at the public record: not one healthy child has died as a consequence of being infected by this virus. Not one. So [how would you respond] if I tell you that there are novel technology agents that are being proposed to be injected into your child—a child who's not at any risk from the virus and who also is very poor at transmitting it to other people, because children generally don't get symptoms?\n\nAnd I just told you earlier about asymptomatic transformation being a lie, so please, I'm begging you: whatever your neighbours say, or your schoolteacher or your government's advisor, I'm afraid they're lying or mistaken; you must not vaccinate your children.\n\nSo we should target these interventions to those who might benefit from them, because they generally will be willing to bear whatever the side effects are, in exchange for that benefit. So healthy younger people, certainly sixteen and down, really should not even have been on the map for vaccination, [firstly] because [if infected,] they survive; secondly, there are really good treatments, as I've mentioned, and so, with good therapies and people's strong immune system if they're younger and well, there was no need to vaccinate the world.\n\nAnd then, pregnant women. I have made a special examination of this from my toxicological background. I was just appalled when I heard a leading doctor—I think from the Royal College of Obstetrics and Gynaecology in London—[making this case]. The Royal College is meant to be the acme of medical quality, hopefully in ethics. And [yet] this woman appeared on national radio and proceeded to tell people that “if they were pregnant, they really should get vaccinated; and don't worry, these are perfectly safe.”\n\nAnd I'll look you in the eye now and tell you that the studies have not been done to examine the safety of these vaccines in pregnancy. There's been no formal study, and there's no reproductive toxicology packages complete in the industry. I worked in the industry for 32 years; I can tell you we were not allowed to dose healthy female volunteers of child-bearing age without insisting that they used highly effective contraceptive methods, and generally we didn't do it at all. We just didn't do it until we had reproductive toxicology [results in], because we were all rightly fearful of the potential to damage a growing baby.\n\nSo it's literally nonsense: this is one of those things you should wake up to. Any listener knows that thalidomide changed the landscape forever in terms of precautions, in terms of medications in pregnant women, for reasons that we understand. And so, if your country's policy includes encouraging pregnant women to get vaccinated, when they are by definition relatively young and relatively well—they probably wouldn't have got pregnant [if not relatively young and well] and are therefore not likely to suffer severe effects of the virus—why would it make any sense to administer these experimental therapies?\n\nAnd then, worse than that: I've written affidavits and opinions to say there are two or three lines of evidence that would lead me to be extremely concerned for the potential for harms, and unfortunately, it actually does look like we were right about that. But I'm not going to push it any further.\n\nMy main point is just what I said in the last few minutes: it is just to say that if this was a public health measure, you would only administer these vaccines to people who could benefit most from it: the people who are most likely to get ill and die. And that would exclude healthy young people; it would certainly exclude children; it would definitely exclude pregnant women; and—here's the other thing—it would definitely exclude anyone who's had the virus and recovered.\n\nThere are scores of papers showing that people who've had the virus and recovered have a full complement of T cells of multiple types. That means that they will recognise the virus and any variants, and will remain well—and that is, in fact, the empirical observation.\n\nSo when you see your governments threatening the unvaccinated, including people who've recovered, [bear in mind that] they are more immune than than the people who've been vaccinated. So I just don't understand how anyone can go on about, \"You're being anti-vaxx.\" No, no; I'm anti-conspiracy theory; I'm actually conspiracy facts. That's what's going on.", "opengraph": {"site_name": "UKColumn", "type": "article", "url": "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-ii-vaccine-damage", "title": "Dr Mike Yeadon's key testimony — Part II: Vaccine Damage", "image": "https://www.ukcolumn.org/sites/default/files/2022-01/Mike%20Yeadon%2C%207%20Jan%202022.jpg", "article:author": "UK Column Reporters", "article:publisher": "UKColumn", "article:published_time": "2022-01-12T08:20:00+00:00", "article:modified_time": "2023-01-13T19:17:42+00:00"}, "tags": ["Defence", "Brexit", "Justice", "Coronavirus", "Media", "Politics", "International", "Economy", "Constitution", "Health", "Mind", "Technology", "Faith", "Environment", "Science", "Children & Education"], "tweets": [], "movies": [], "links": ["https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-i-the-eight-covid-lies", "https://odysee.com/@Corona-Investigative-Committee:5/Mike-Session-86-en:0", "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-iii-the-hot-lots", "https://www.ukcolumn.org/article/dr-mike-yeadons-key-testimony-part-iv-questions-answered-1"], "authors": [], "publish_date": "2022-01-12T08:20:00+00:00"}