{"result_id": "324036", "URL": "https://usahitman.com/pfizer-stand-accused-of-experimenting-on-orphan-babies-to-test-their-covid-19-vaccine/", "timestamp": "2023-04-25 17:47:38 CEST+0200", "meta": {"description": "Allegations that Pfizer are conducting experiments on six-month-old orphans to test their Covid-19 vaccine have been made by whistleblowers", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/pfizer-stand-accused-of-experimenting-on-orphan-babies-to-test-their-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Pfizer stand accused of experimenting on orphan babies to test their Covid-19 vaccine", "cleaned_text": "Allegations that Pfizer are conducting experiments on six-month-old orphans to test their Covid-19 vaccine have been made by whistleblowers in Poland leading to a group of lawyers, medical professionals and activists demanding members of the Polish parliament and Senate organise an urgent conference on Saturday 2nd October.\n\nChildren’s Health Defense was recently alerted by Polish whistleblowers that Pfizer is conducting experiments on orphan babies 6 months old to test their new vaccines. Babies and children do not die from Covid and rarely transmit the disease. This alone should be enough to refuse any kind of clinical trials with experimental vaccines. But Pfizer seems to be operating outside legal boundaries. If this is case, it is simply unacceptable and needs to stop. Answers and action are needed.\n\nA group of lawyers, medical professionals and activists asked members of the Polish parliament and Senate to organise the following conference on Saturday October 2nd entitled:\n\n“MEDICAL TESTS ON CHILDREN AND INFANTS – MEDICAL, LEGAL AND ETHICAL ISSUES ”.\n\nThe conference is planned at 12pm CET time (Warsaw).\n\nPlease watch our re-stream here with live translations as we will follow closely on this issue.\n\nConference in EN, FR, DE, IT or ES\n\nCLICK HERE\n\nThe conference is organised by Polish associations and foundations such as The Polish Association of Independent Doctors and Scientists, The Association of Lawyers Voice of Freedom, Dobrostan Health Information Center Association, and the New Spectrum Foundation\n\nInternational speakers will feature Dr. Natalia Prego Cancelo from Spain, Dr. Meryl Nass and Mrs. Vera Sharav from the United States.\n\nHere are some of the major questions that must be answered:\n\n– Is Pfizer conducting experiments on orphan children who are the most vulnerable and have no one to take their interests at heart if things go wrong? If so why and who consented to this?\n\n– Why is Pfizer allowed to do clinical trials on babies with a product that has not completed phase 3 of the clinical trials and that is a new technology?\n\n– Why is Pfizer refusing elected officials the get access to their documents?\n\n– What is happening in the other countries where these experiments are conducted?\n\n– Are the EMA and the FDA really doing their job?\n\nAnd finally…are vaccine manufacturers operating in complete secrecy and outside any legal control?\n\nOther information on the science and ethics of the clinical trials on children have also raised our concerns. Yaffa Shir- Raz, a risk-communication researcher of the University of Haifa in Israel has published an article on the very questionable methods used by the company called ‘Serious violations and manipulations of the trial protocol: This is how Pfizer managed to obtain the FDA’s emergency authorisation for children’.\n\nThis article points to troublesome facts questioning Pfizer’s intention to demonstrate safety of the use of its vaccines in children. For example, children who suffered severe depression were suddenly found to have pre-existing psychiatric conditions that should have excluded them from the study cohort and the reporting criteria seem to have been designed to exclude signals of adverse events.\n\nVaccine developers have a long story of experimenting on the most vulnerable: orphans, mentally and physically disabled, political refugees and impoverished populations. Stanley Plotkin, who patented numerous vaccines and is nicknamed ‘the pope of vaccines’ once defended himself by saying that disabled people ‘were only human in form’.\n\nGetting rid of the weakest has always been practiced in the name of the greater good. Now is the time to take responsibility and put an end to this barbarian practice.\n\nLetter from Polish activists and medical associations on the medical tests on children and infants\n\nWe would like to invite you to participate in a conference that will be taking place on the 2nd of October 2021 at 12:00 Warsaw time in the Polish Parliament.\n\nThe conference will include medical and legal debate in regards to testing medical products on children and very young babies. This conference is apolitical and non-religious. It is organized by Polish associations and foundations such as The Polish Association of Independent Doctors and Scientists, The Association of Lawyers Voice of Freedom, Dobrostan Health Information Center Association, and the New Spectrum Foundation. Representatives of the parliament and the government as well as main stream media have been invited to passively participate and to help the public understand the depth of the issue.\n\nThis conference has been requested in connection with the theoretical and practical analysis of clinical trials involving children and infants due to the fact that children cannot consent to participate in a biomedical study and therefore additional safeguards should and must be applied to protect them. We believe this is not happening at present.\n\nWe are therefore asking for your help in defending Polish children and children in clinical trials around the world. This is now happening in at least four countries because of the misinformation and the confidential agreements imposed by Pfizer.\n\nSince June 2021, Pfizer has been conducting experimental trials on Polish children with vaccines against Covid-19. To our knowledge these experiments are done on healthy infants from 3 and 6 months of age up to age of 11.\n\nThese facts are not known to the Polish public opinion as Pfizer’s documents contain a “secret” clause. Even a member of the Polish Parliament who intervened in this matter has been refused access to the documents, in complete violation of the Polish law.\n\n8 Centers in Poland are known to be conducting the above testing however, these are small private clinics and private clinical research centers who do not seem to be equipped to run such studies.\n\nSeparately, we are aware of one more center that has not been mentioned on Pfizer’s website. This raises the question whether there may be more undisclosed sites in the 4 countries that Pfizer is claiming these tests are being done.\n\nFrom unofficial reports (we are in possession of recordings from July and August of this year) we know that children age 6 to 11 years old were already been injected with Pfizer’s product and children age 3 to 5 years old received at least 1 dose.\n\nChildren age 6 months old to 2 years old are currently being recruited however, Pfizer on its’ official website has released documents dated 20/09/2021 claiming that they are expecting results on the youngest group before the end of this year.\n\nThis suggests that trials in the youngest group started at the same time as in the older groups as Pfizer claims results of these trials will be available after 6 months.\n\nIt is estimated that there may be around 1000 children being injected in Poland.\n\nConsidering how quickly these children have been recruited for the study we strongly suspect they come from orphanages and care homes, as this already has happened with trials of other vaccines. Under Polish legislation such exceptional cases need the authorisation of a court but so far we are unable to locate any court hearings allowing for such experiments on children.\n\nConsent for these trials on infants and young children in Poland was given by Grzegorz Cessak, pharmacologist and president of the Office for Registration of Medicinal Products, Medical Devices and Biocidal Products. He is also a member of the European Medicines Agency (EMA), which seems to create a conflict of interest.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer stand accused of experimenting on orphan babies to test their Covid-19 vaccine - USAHITMAN Conspiracy News", "description": "Allegations that Pfizer are conducting experiments on six-month-old orphans to test their Covid-19 vaccine have been made by whistleblowers", "url": "https://usahitman.com/pfizer-stand-accused-of-experimenting-on-orphan-babies-to-test-their-covid-19-vaccine/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2021-10-03T23:33:36+00:00", "article:modified_time": "2023-01-15T20:49:19+00:00", "image": "https://usahitman.com/wp-content/uploads/2021/10/poef-1.jpg", "image:width": "620", "image:height": "280", "image:type": "image/jpeg"}, "tags": ["Covid", "Orphans", "Babies", "Covid Vaccine", "Poland", "Testing", "Vaccine"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.eu/live/", "https://childrenshealthdefense.eu/live-stream/", "https://www.covil.co.il/en/this-is-how-pfizer-managed-to-obtain-the-fdas-emergency-authorization-for-children/", "https://www.pfizer.com/news/press-release/press-release-detail/pfizer-and-biontech-announce-positive-topline-results", "https://theexpose.uk/2021/10/01/breaking-pfizer-stand-accused-of-experimenting-on-orphan-babies-to-test-their-covid-19-vaccine/"], "authors": ["mediahitman"], "publish_date": "2021-10-03T23:33:36+00:00"}