{"result_id": "324017", "URL": "https://usahitman.com/covid-vaccine-fatigue-study-explores-why-many-are-refusing-booster-shots/", "timestamp": "2023-04-25 17:47:11 CEST+0200", "meta": {"description": "As the world continues to move toward a post-pandemic life, Americans may have reached a state of \"vaccine fatigue,\" data suggests.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/covid-vaccine-fatigue-study-explores-why-many-are-refusing-booster-shots/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "COVID vaccine fatigue: Study explores why many are refusing booster shots", "cleaned_text": "As the world continues to move toward a post-pandemic life — and as the World Health Organization (WHO) recently predicted that as a public health emergency — Americans may have reached a state of “vaccine fatigue,” data suggests.\n\nA recent study published in the journal Nature Medicine, led by researchers from the Medical University of Vienna, surveyed 6,357 people in Austria and Italy. They found that respondents’ “readiness to get vaccinated,” on a scale of 0 to 10, was relatively low — roughly 5.8 in Italy and 5.3 in Austria.\n\nThe participants answered questions about vaccine-related costs, communication, incentives, emerging variants of the virus and vaccination requirements.\n\nThe American Medical Association defines vaccine fatigue as “unwillingness or inaction toward vaccine information or instruction due to perceived burden or burnout.”\n\nIn the U.S., evidence of vaccine fatigue can be seen in the dwindling numbers of people getting boosters for COVID vaccines.\n\nWhen the vaccines first became available in the winter of 2020-2021, there was a wave of relief — even enthusiasm in some corners — as people lined up to get the shot. By Sept. 1, 2022, 79.2% of Americans had gotten at least one dose and 67.8% had completed their full primary series of vaccines, per the Centers for Disease Control and Prevention (CDC).\n\nThere is a sharp drop-off, however, when it comes to booster numbers.\n\nAs of March 21, 2023, only 16.4% of Americans were current with their updated (bivalent) booster dose, CDC data shows.\n\nLow trust in medical institutions, governments and vaccinations was a common thread in the study findings, particularly around vaccine mandates.\n\n“Respondents in both countries reported high levels of pandemic fatigue and showed low to medium levels of trust in parliament and government,” the study authors wrote in a discussion of the findings.", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID vaccine fatigue: Study explores why many are refusing booster shots - USAHITMAN Conspiracy News", "description": "As the world continues to move toward a post-pandemic life, Americans may have reached a state of \"vaccine fatigue,\" data suggests.", "url": "https://usahitman.com/covid-vaccine-fatigue-study-explores-why-many-are-refusing-booster-shots/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-04-01T00:44:00+00:00", "article:modified_time": "2023-04-02T12:48:05+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/04/no-vaccine-sign.webp", "image:width": "720", "image:height": "405", "image:type": "image/webp"}, "tags": ["Covid", "Covid Vaccine", "Vaccine Fatigue", "Refuse", "Booster Shot", "Vaccines", "WHO", "CDC"], "tweets": [], "movies": [], "links": ["https://www.foxnews.com/category/health/infectious-disease/vaccines", "https://www.foxnews.com/health/covid-vaccine-fatigue-study-explores-many-refusing-booster-shots"], "authors": ["mediahitman"], "publish_date": "2023-04-01T00:44:00+00:00"}