{"result_id": "324011", "URL": "https://usahitman.com/arcturus-a-highly-transmissible-covid-variant-eyed-by-the-who/", "timestamp": "2023-04-25 17:47:03 CEST+0200", "meta": {"description": "A new COVID variant the World Health Organization has its eye on seems to be causing a new symptom in children rarely caused", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/arcturus-a-highly-transmissible-covid-variant-eyed-by-the-who/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "‘Arcturus,’ a highly transmissible COVID variant eyed by the WHO", "cleaned_text": "A new COVID variant the World Health Organization has its eye on seems to be causing a new symptom in children rarely caused by other Omicron spawn.\n\nXBB.1.16, dubbed Arcturus by variant trackers, is fueling a new surge of cases in India, at a time when reported cases are down in much of the rest of the world. The country’s health ministry is holding mock drills to ensure that hospitals are prepared for rising COVID cases, the BBC reported Monday, noting that some states have again made mask-wearing in public mandatory.\n\nBut XBB.1.16 may not be just another run-of-the-mill Omicron. Dr. Vipin Vashishtha—a pediatrician in India and former head of the Indian Academy of Pediatrics Committee on Immunization—tweeted Thursday that pediatric cases of COVID are on the increase for the first time in six months, and that “an infantile phenotype seems emerging.”\n\nThe symptoms he’s now seeing among children:\n\nThe latter symptom hasn’t been seen in earlier COVID waves, he noted.\n\nCOVID cases in kids under 12 in India are increasing, the Times of India reported Monday. While they’re generally mild, doctors are warning “parents of children with obesity, asthma, and [those] suffering from other immunocompromised conditions not to ignore the symptoms,” and to seek care if necessary, the publication noted.\n\nExperts told the Times they were also seeing a rise in hospitalizations of children due to adenovirus, which has symptoms similar to COVID and can also result in conjunctivitis. Adenovirus and COVID are impossible to distinguish from each other without testing.\n\nThere are “lots of anecdotals of pediatric conjunctivitis in India” right now, Raj Rajnarayanan, assistant dean of research and associate professor at the New York Institute of Technology campus in Jonesboro, Ark., and a top COVID variant tracker, tells Fortune.\n\nRichard Reithinger, an infectious disease epidemiologist at the nonprofit research institute RTI International, tells Fortune that he’s also heard such reports, but that it’s “probably too early to tell” if the virus’s symptom set has truly shifted.\n\nConjunctivitis has previously been reported as a COVID symptom, he notes, though not often.", "opengraph": {"locale": "en_US", "type": "article", "title": "‘Arcturus,’ a highly transmissible COVID variant eyed by the WHO - USAHITMAN Conspiracy News", "description": "A new COVID variant the World Health Organization has its eye on seems to be causing a new symptom in children rarely caused", "url": "https://usahitman.com/arcturus-a-highly-transmissible-covid-variant-eyed-by-the-who/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-04-11T09:49:00+00:00", "article:modified_time": "2023-04-11T23:56:03+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/04/GettyImages-1219500833.webp", "image:width": "1440", "image:height": "960", "image:type": "image/webp"}, "tags": ["Covid", "conjunctivitis", "Symptoms", "Variant", "WHO"], "tweets": [], "movies": [], "links": ["https://www.bbc.com/news/world-asia-india-65229417", "https://fortune.com/well/2023/04/10/covid-omicron-xbb116-arcturus-new-symptom-children-eyes-conjunctivitis/"], "authors": ["mediahitman"], "publish_date": "2023-04-11T09:49:00+00:00"}