{"result_id": "324014", "URL": "https://usahitman.com/rwfsmdtaf/", "timestamp": "2023-04-25 17:47:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/rwfsmdtaf/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "10 Reasons Why Flu Shots Are More Dangerous Than A Flu", "cleaned_text": "The verdict is out on flu shots. Many medical experts now agree it is more important to protect yourself and your family from the flu vaccine than the flu itself. Let’s take a look at the reasons behind this verdict:\n\n1.) There is a total lack of real evidence that young children even benefit from flu shots. A systematic review of 51 studies involving 260,000 children age 6 to 23 months found no evidence that the flu vaccine is any more effective than a placebo. Also the shots are only able to protect against certain strains of the virus, which means that if you come into contact with a different strain of virus you will still get the flu.\n\n2.) Medical journals have published thousands of articles revealing that injecting vaccines can actually lead to serious health problems including harmful immunological responses and a host of other infections. This further increases the body’s susceptibility to the diseases that the vaccine was supposed to protect against.\n\n3.) Ever noticed how vaccinated children within days or few weeks develop runny noses, pneumonia, ear infections and bronchiolitis? The reason is the flu virus introduced in their bodies which creates these symptoms. It also indicates immuno-suppression i.e. lowering of the immunity.The flu vaccines actually do not immunize but sensitize the body against the virus.\n\n4.) Its a known fact that Flu vaccines contain strains of the flu virus along with other ingredients. Now think about the impact such a vaccine can have over someone with a suppressed immune system? If you have a disease that is already lowering your body’s ability to fight a virus, taking the flu shot will put your body in danger of getting the full effects of the flu and make you more susceptible to pneumonia and other contagious diseases.\n\n5.) The Flu vaccines contain mercury, a heavy metal known to be hazardous for human health. The amount of mercury contained in a multi-dose flu shot is much higher than the maximum allowable daily exposure limit. Mercury toxicity can cause memory loss, depression, ADD, oral health problems, digestive imbalances, respiratory problems, cardiovascular diseases and many more such serious health ailments.\n\nAnd what about the elderly? Can the flu vaccine help them?\n\n6.) There is mounting evidence that flu shots can cause Alzheimer’s disease. One report shows that people who received the flu vaccine each year for 3 to 5 years had a 10-fold greater chance of developing Alzheimer’s disease than people who did not have any flu shots. Also with age the immune system weakens, thus lowering your ability to fight off infections. Introducing the flu virus in the bodies of elderly could have dangerous consequences.\n\nCan we trust the authorities who are promoting the wide-spread use of flu vaccines?\n\n7.) The Center for Disease Control appoints a 15-member Advisory Committee on Immunization Practices (ACIP). This committee is responsible for deciding who should be vaccinated each year. Almost all the ACIP have a financial interest in immunizations.It’s all about the money and may have very little to do with your health and well being. The very people pushing these vaccines stand to make billions of dollars. This itself creates a doubt on how effective these flu vaccines really are?\n\n8.) Research shows that over-use of the flu-vaccine and drugs like Tamiflu and Relenza can actually alter flu viruses and cause them to mutate into a more deadly strain. Couple this with drug resistant strains and you have virtually no benefits with much risk.\n\n9.) There is enough evidence that shows that the ingredients present in the flu vaccinations can actually cause serious neurological disorders. In the 1976 swine flu outbreak, many who got the flu shots developed permanent nerve damage. Flu vaccines can contain many harmful materials including detergent, mercury, formaldehyde, and strains of live flu virus. Is this what you want to put in YOUR body?\n\n10.) Trying to guess what strain to vaccinate against each season has proved to be no more effective than a guessing game. This has been very true in recent years with the H1N1 strain. Moreover getting multi-shots will only prove more dangerous as different strains of viruses and harmful ingredients are introduced into your body.\n\nFlu shots are indeed more dangerous than you could think, and it is best to rely on natural ways to protect against the flu rather than getting yourself vaccinated.\n\nIsn’t it interesting that the main stream public health officials never promote the various proven ways to avoid the flu other than through vaccination? How about spending some of the billions of advertising dollars teaching us natural ways to boost our immune systems and avoid the flu without harmful and sometimes deadly vaccinations.", "opengraph": {"locale": "en_US", "type": "article", "title": "10 Reasons Why Flu Shots Are More Dangerous Than A Flu - USAHITMAN Conspiracy News", "description": "The verdict is out on flu shots. Many medical experts now agree it is more important to protect yourself and your family from the flu vaccine than the flu itself. Let’s take a look at the reasons behind this verdict: 1.) There is a total lack of real evidence that young children even benefit from flu shots.  A", "url": "https://usahitman.com/rwfsmdtaf/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2013-02-11T00:54:23+00:00", "article:modified_time": "2013-02-11T02:58:40+00:00", "image": "https://usahitman.com/wp-content/uploads/flu_s640x427.jpg", "image:width": "640", "image:height": "427", "image:type": "image/jpeg"}, "tags": ["Flu", "More", "Flu Shots", "Dangerous", "10", "Vaccines", "Reasons"], "tweets": [], "movies": [], "links": ["https://usahitman.com/wp-content/uploads/flu_s640x427.jpg", "http://www.bewellbuzz.com/podcast/podcast-7-natural-treatment-for-depression/", "http://www.bewellbuzz.com/general/alzheimer-treatment/", "http://worldtruth.tv/10-reasons-why-flu-shots-are-more-dangerous-than-a-flu/"], "authors": ["mediahitman"], "publish_date": "2013-02-11T00:54:23+00:00"}