{"result_id": "324008", "URL": "https://usahitman.com/mkwcbi/", "timestamp": "2023-04-25 17:47:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/mkwcbi/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Making A Killing With Cancer: A $124.6 Billion Industry", "cleaned_text": "If you had a business selling something that made you well over a hundred billion dollars per year, would you take steps to eradicate the need for your business? Or would you make every effort for that money continue rolling in?\n\nTake cancer, for example. Don’t let all the media hype about “The Cure” fool you. No one who is in a position to do so wants to end cancer because they are all making a killing on the big business of treatment, while ordinary people go broke, suffer horribly, and die.\n\nThere will never be a “cure” brought to market because there just isn’t enough profit in eradicating the disease entirely. There will never be a governing body that protects consumers from being subjected to known carcinogens, because that, too, will stop the cash from rolling in. A great deal of research is covered up and many potential cures are ignored and discredited because there is far more money in perpetuating illness than in curing it. In 2012, the reported spending on cancer treatment was 124.6 billion dollars. Blood money.\n\nJust the word “cancer” sends a frisson of fear down the spine of the most stalwart optimist. Terrifyingly, almost one in two people will get the dreaded disease, and the numbers are only getting worse. Here are some quick stats for background:\n• Nearly half of all Americans will develop cancer in their lifetime. (source) Quick math tells us that is an astonishing 157 million victims.\n• Over half a million people in America died of cancer in 2012. (source)\n• In 2011, cancer was the #1 cause of death in the Western world, and #2 in developing countries. (source)\n• Cancer is the #1 cause of childhood death in the United States. (source)\n\nThis is a fairly recent increase. A hundred years ago, the number was far different. At that time, 1 in 33 people was stricken with the disease. And despite billions of dollars being spent to find “the cure”, the World Health Organization predicts that deaths from cancer will DOUBLE by the year 2030.\n\nIt’s being normalized. The news is full of photos of babies who are missing an eye, of beautiful bald children who have lost their hair to chemo, and of people who have had to have body parts removed in order to survive a few more years. But cancer is NOT normal. It isn’t something that “just happens.” Researchers know the things that cause cancer. Government protection agencies do, too, but they do nothing to limit these toxins in the marketplace.\n\nBecause, cancer is big business and those who are profiting have great financial interest in seeing the deadly trend continue to increase.\n\nSo what has changed? How did we go from a 3% chance of contracting cancer to a 41% chance?\n\nIt’s the advent of Big Pharma, Big Agri and Big Business. They are getting rich off of poisoning Americans through the manufacture of toxic elements that we are exposed to on a daily basis.\n\nUnless you live in a bubble and have no contact with manufactured items, outside air, or the sun, you are exposed to a staggering number of known and suspected carcinogens every day. (Check out THIS LIST to see the known and suspected carcinogens that are readily available in the United States.)\n\nThe statistics support that the cumulative build up of all these different toxins in the human body eventually results in cancer in many people.\n\nFirst, the manufacturers and the “food” producers profit when we buy their poisoned goods.\n\nThen the medical system and pharmaceutical companies profit when we become ill and must fight cancer.\n\nThe drugs alone can cost over $100,000 per year, and that is on top of exorbitant costs for radiation, chemotherapy, and physicians’ bills. In the United States, cancer is the #1 most expensive “per person” illness to treat. (source)\n\nWhy would those who profit want to prevent cancer when 95.5 BILLION DOLLARS PER YEAR is spent on treating it? There is a vested interest in this increase in illness and the people benefiting from it have no intention of reducing the cases of cancer.\n\nDon’t look to Obamacare to be the saving grace of cancer victims, either. With this type of government-controlled medicine, budgets will be strictly adhered to and the decisions on how to proceed and what will be paid for will NOT be in the hands of the ill person. Treatments, medications, and funds will be strictly allocated through what many people are referring to as “death panels.”\n\nFurthermore, Obamacare only covers 60% of your medical costs in most cases (after a hefty deductible) and none of your medication is covered. If you don’t have $50,000 or more kicking around for your co-pay, you will be out of luck, despite diligently paying your worthless monthly premiums.\n\nAvoiding carcinogens as diligently as possible is your best defense against becoming the “1 in 3”, but it isn’t easy. Furthermore, you’ll be considered an “extremist” or a “kook” by those around you who have buried their heads in the sand.\n\nSince most of us don’t live in a bubble, we will be subjected to some of these toxins – they’re impossible to avoid entirely. However, you can limit your exposure by taking the following steps to reduce your exposure to everyday poisons. (This list is expanded from the article, “The Great American Cancer Cluster” with permission from The Daily Sheeple.)\n• Purchase organic foods as often as possible. GMOs and pesticides are proven carcinogens.\n• Load your plate with colorful antioxidants. Opt for organic versions of foods like berries, colorful veggies, dark chocolate, and coffee, to name a few, are loaded with powerful, cancer-fighting antioxidants and will boost your immune system against other types of illness and disease as well.\n• Avoid processed foods. Many of the additives and preservatives featured abundantly in North America are banned in other countries precisely because of the health risks they represent.\n• Select non-toxic cookware. Nonstick cookware contains Teflon and perfluorooctanoic acid (PFOA), which emit at least toxic gases within 5 minutes of heating up that nonstick pan. Once the pans become scratched, toxic particles are leached directly into the food you’re preparing. Aluminum cookware is also potentially toxic. Cast iron, ceramic, glass, and clay are all better cookware options.\n• Limit the use of plastic in your home. BPA or Bisphenol-A are petrochemical plastics that are a major component of many water bottles, lines the inside of canned goods, and makes up the hard material of many reusable food containers, including some brands of baby bottles. They leach cancer causing endocrine disruptors into food, especially if the food is hot. Use glass containers whenever possible.\n• Select personal care products that do not contain petrochemicals. Many cosmetics and other health and beauty aids contain petrochemicals. The danger of this is their byproduct, 1,4-dioxane, a proven carcinogen. The U.S. Environmental Protection Agency classifies dioxane as a probable human carcinogen California state law has classified dioxane to cause cancer. Animal studies in rats suggest that the greatest health risk is associated with inhalation of vapors. Avoid the following ingredients:\n• Opt for natural, biodegradable food grade cleaning products. According to the website Natural Pure Organics, the average household contains up to 25 gallons of toxic materials, most of which are in cleaning products. When you use these cleaners, they linger in the air and on the surfaces, increasing your exposure to carcinogens as you inhale the toxins into your lungs or absorb them through your skin.\n• Avoid artificial sweeteners. Aspartame, for example, is a known carcinogen that breaks down into formaldehyde in the human body.\n• Refuse vaccines. Many vaccines contain formaldehyde and mercury, both of which are known carcinogens. By the age of two, if a child has received all of the recommended vaccines, he or she has received 2,370 times the “allowable safe limit” for mercury (if there is such a thing as a safe level of poison). The HPV vaccine can actually increase the risk of reproductive cancer. The polio vaccine most recently came under fire for its cancer-causing ingredients. (Learn more about the cancer causing ingredients in vaccines HERE.)\n• Avoid tap water. If you have municipal water, drink it at the risk of ingesting loads of toxins. First, there is the willful addition of sodium fluoride, a pesticide which is labeled as “deadly to humans.” Not only has the consumption of fluoride been linked to cancer, but it also lowers IQs, causes infertility, and causes hardening of the arteries. Then there is the addition of chlorine, which is used to kill bacteria that could make us sick. Unfortunately, according to Dr. Michael J. Plewa, a genetic toxicology expert at the University of Illinois, chlorinated water is carcinogenic. “Individuals who consume chlorinated drinking water have an elevated risk of cancer of the bladder, stomach, pancreas, kidney and rectum as well as Hodgkin’s and non-Hodgkin’s lymphoma.”\n• Maintain a healthy body weight. Obesity has been linked to increased risks of cancers of the esophagus, breast, endometrium, uterus, colon and rectum, kidney, pancreas, thyroid, and gallbladder.\n\nThe mindboggling thing is that those who strictly avoiding carcinogens and toxins are labeled “crazy” or “hysterical”. I can’t tell you how many times I have watched people roll their eyes or scoff when I refuse to partake in things that are hazardous. Somehow, drinking water from my own BPA-free water bottle is considered to be “extreme”. Not taking my children to McDonald’s or feeding them hot-dogs and Doritos is “mean”. Making our body care products and cleaning products from wholesome, non-toxic ingredients is “silly”.\n\nI believe that knowingly ingesting toxic ingredients is “crazy”. I believe that rubbing carcinogens on my body or spraying them around my house is “ridiculous”. I think that having poison injected into my defenseless children or feeding it to them on a colorful plate is “mean”.\n\nNever forget that the bottom line is profit. Don’t expect the FDA or the EPA to step in. They’ve proven time and again that their purpose is to serve the interests of Big Business, not the consumers.\n\nCancer represents big money to the pharmaceutical companies and the health industry. They do NOT have a vested interest in prevention. So, maybe, just maybe, subjecting your body to the tender mercies of Big Pharma and the AMA and lining their already loaded pockets is just a little bit sillier than taking steps to avoid illness altogether.\n\nThis article is dedicated to some beloved people in my life, one of whom fought it and won and the other who is fighting the good fight and will not go quietly… much love to SD and JS, and all who are touched by this icy finger.\n\nDaisy Luther is a freelance writer and editor. Her website, The Organic Prepper, where this article first appeared, offers information on healthy prepping, including premium nutritional choices, general wellness and non-tech solutions. You can follow Daisy on Facebook and Twitter, and you can email her at daisy@theorganicprepper.ca", "opengraph": {"locale": "en_US", "type": "article", "title": "Making A Killing With Cancer: A $124.6 Billion Industry  - USAHITMAN Conspiracy News", "description": "Daisy Luther Activist Post If you had a business selling something that made you well over a hundred billion dollars per year, would you take steps to eradicate the need for your business? Or would you make every effort for that money continue rolling in? Take cancer, for example. Don’t let all the media hype", "url": "https://usahitman.com/mkwcbi/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2013-12-10T00:04:26+00:00", "article:modified_time": "2013-12-10T01:04:43+00:00", "image": "https://usahitman.com/wp-content/uploads/2013/12/blood-money.jpg", "image:width": "200", "image:height": "168", "image:type": "image/jpeg"}, "tags": ["Medicine", "Scam", "Big Pharma", "Health Care", "Cure", "Money", "Killing", "Cancer", "Industry"], "tweets": [], "movies": [], "links": ["https://usahitman.com/wp-content/uploads/2013/12/blood-money.jpg", "http://www.activistpost.com/2013/12/making-killing-with-cancer-1246-billion.html", "http://www.thirdage.com/long-life-tips/41-percent-cancer", "http://www.cancer.org/acs/groups/content/@epidemiologysurveilance/documents/document/acspc-031941.pdf", "http://www.scribd.com/doc/48974229/Global-Cancer-Statistics-2011", "http://truthstreammedia.com/cancer-officially-number-one-cause-of-childhood-death-in-u-s/", "http://www.who.int/cancer/en/", "http://www.cancer.org/cancer/cancercauses/othercarcinogens/generalinformationaboutcarcinogens/known-and-probable-human-carcinogens", "http://www.ahrq.gov/research/findings/factsheets/costs/expriach/index.html#MostExpensive", "https://www.facebook.com/pages/We-Will-Not-Comply-with-Obamacare/701584733203283?ref=hl", "http://www.thedailysheeple.com/the-great-american-cancer-cluster_102012#sthash.reD2cXXJ.dpuf", "http://www.thedailysheeple.com/the-great-american-cancer-cluster_102012", "http://www.thedailysheeple.com/", "http://www.theorganicprepper.ca/gmos-not-even-in-moderation-02072013", "http://www.theorganicprepper.ca/move-over-round-up-usda-approves-2nd-gen-gmos-that-can-withstand-even-deadlier-herbicide-09012013", "http://www.theorganicprepper.ca/nutrition-101-how-processed-foods-make-us-fat-malnourished-and-sick-06222013", "http://truthstreammedia.com/do-bpa-free-plastics-still-leach-hormones-into-food/", "http://blog.cocoonapothecary.com/2010/06/25/get-petroleum-out-of-your-bathroom/", "http://www.naturalpureorganics.com/petrochemicals.htm", "http://articles.mercola.com/sites/articles/archive/2011/10/15/this-artificial-sweetener-shown-to-produce-cancer-in-rats.aspx", "http://www.naturalnews.com/037653_vaccine_additives_thimerosal_formaldehyde.html", "http://www.activistpost.com/2013/11/new-hpv-vaccines-on-horizon.html", "http://www.naturalnews.com/041345_cdc_polio_vaccine_sv40.html", "http://www.thelibertybeacon.com/2013/09/17/the-cancer-vaccines-of-2013-12239/", "http://www.theorganicprepper.ca/huh-it-must-be-something-in-the-water-01082013", "http://www.naturalnews.com/023565_water_lead_drinking.html#ixzz2HOnsIne9", "http://www.theorganicprepper.ca/", "http://www.theorganicprepper.ca/making-a-killing-with-cancer-a-124-6-billion-dollar-industry-12092013", "http://www.facebook.com/TheOrganicPrepper?ref=hl", "https://twitter.com/DaisyLuther", "mailto:daisy@theorganicprepper.ca"], "authors": ["mediahitman"], "publish_date": "2013-12-10T00:04:26+00:00"}