{"result_id": "324046", "URL": "https://usahitman.com/fbi-official-who-investigated-trump-ties-to-russia-was-just-arrested-for-illegal-ties-to-russian-oligarch/", "timestamp": "2023-04-25 17:47:51 CEST+0200", "meta": {"description": "On Saturday afternoon, former FBI agent Charles McGonigal, who was head of counterintelligence in the New York Field Office", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/fbi-official-who-investigated-trump-ties-to-russia-was-just-arrested-for-illegal-ties-to-russian-oligarch/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "FBI official who investigated Trump ties to Russia was just arrested for illegal ties to Russian oligarch", "cleaned_text": "On Saturday afternoon, former FBI agent Charles McGonigal, who was head of counterintelligence in the New York Field Office and a part of the investigation into supposed ties between Trump and Russia, was arrested over his alleged ties to Russia.\n\nCBS reports that McGonigal was arrested over “his ties to Oleg Deripaska, a Russian billionaire who has been sanctioned by the United States and criminally charged last year with violating those sanctions.”\n\nAs Business Insider reports, McGonigal “was involved in the investigation into the Trump campaign’s contacts with Russia during the 2016 election.”\n\nMichael Driscoll, the FBI assistant director in charge, said in a statement, “The FBI is committed to the enforcement of economic sanctions designed to protect the United States and our allies, especially against hostile activities of a foreign government and its actors.”\n\n“Russian oligarchs like Oleg Deripaska perform global malign influence on behalf of the Kremlin and are associated with acts of bribery, extortion, and violence,” Driscoll said. “As alleged, Mr. McGonigal and Mr. Shestakov, both U.S. citizens, acted on behalf of Deripaska and fraudulently used a U.S. entity to obscure their activity in violation of U.S. sanctions. After sanctions are imposed, they must be enforced equally against all U.S. citizens in order to be successful. There are no exceptions for anyone, including a former FBI official like Mr. McGonigal.”\n\nSergey Shestakov, a court interpreter who assisted in investigating Russian oligarchs for the FBI, was also arrested Saturday for his ties to Deripaska.\n\n54-year-old McGonigal, who retired in 2018, was arrested at JFK airport after arriving in the US from Sri Lanka.", "opengraph": {"locale": "en_US", "type": "article", "title": "FBI official who investigated Trump ties to Russia was just arrested for illegal ties to Russian oligarch - USAHITMAN Conspiracy News", "description": "On Saturday afternoon, former FBI agent Charles McGonigal, who was head of counterintelligence in the New York Field Office", "url": "https://usahitman.com/fbi-official-who-investigated-trump-ties-to-russia-was-just-arrested-for-illegal-ties-to-russian-oligarch/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-01-23T23:10:24+00:00", "article:modified_time": "2023-01-23T23:10:25+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/01/original_McGonigalTrump.jpg", "image:width": "800", "image:height": "450", "image:type": "image/jpeg"}, "tags": ["FBI", "Trump", "Arrested", "Russia", "Spie", "Foreign Agent"], "tweets": [], "movies": [], "links": ["https://thepostmillennial.com/durham-report-into-origins-of-russia-probe-into-2016-trump-campaign-nearing-completion?utm_campaign=64483", "https://abcnews.go.com/US/former-fbi-official-charles-mcgonigal-arrested-ties-russian/story?id=96609658", "https://www.businessinsider.com/exclusive-fbi-charles-mcgonigal-trump-russia-grand-jury-oleg-deripaska-2022-9", "https://thepostmillennial.com/breaking-fbi-official-who-investigated-trump-ties-to-russia-was-just-arrested-for-illegal-ties-to-russian-oligarch?utm_campaign=64483"], "authors": ["mediahitman"], "publish_date": "2023-01-23T23:10:24+00:00"}