{"result_id": "324006", "URL": "https://usahitman.com/gbbddrpbhhfs/", "timestamp": "2023-04-25 17:46:58 CEST+0200", "meta": {"description": "A dozen guns decorate the wall of the dining room. Bizarre bear and rabbit figures are watching you from every living space. Dr Phills house tour", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/gbbddrpbhhfs/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Guns, bears and bizarre designs: Dr. Phil’s strange Beverly Hills home for sale", "cleaned_text": "A dozen guns decorate the wall of the dining room. Bizarre bear and rabbit figures are watching you from every living space. Yet Dr. Phil’s Beverly Hills house— which just reached the $5.75 million market — is as rare as it comes.\n\nThe popular television host, whose real name is Phillip McGraw, purchased the property in 2007, and a family member is currently using it. With yellow walls and a clay tile roof, the exterior appears natural enough, but the interior of the 6,170-square-foot toes the line between quirky and weird.\n\nThe two-story floor plan is dominated by a wide chandelier-topped space under a black-and-white checkered rotunda. With a sweeping staircase covered in woody vines and a custom wet bar on the bar stools with antler/horn-like backrests, it draws the eye.\n\nI assume there is much more strange things to this house and Dr. Phil as we know. So look at the photos and lets see what else we can find! He’s not even living here anymore, I can’t imagine how his new house is…", "opengraph": {"locale": "en_US", "type": "article", "title": "Guns, bears and bizarre designs: Dr. Phil’s strange Beverly Hills home for sale - USAHITMAN Conspiracy News", "description": "A dozen guns decorate the wall of the dining room. Bizarre bear and rabbit figures are watching you from every living space. Dr Phills house tour", "url": "https://usahitman.com/gbbddrpbhhfs/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2020-01-03T02:23:31+00:00", "article:modified_time": "2020-01-03T02:49:32+00:00", "image": "https://usahitman.com/wp-content/uploads/ENT4IT7U4AA7Z-s.jpeg", "image:width": "1680", "image:height": "1120", "image:type": "image/jpeg"}, "tags": ["Photos", "House", "Art", "Weird", "Dr Phil", "Srange"], "tweets": [], "movies": [], "links": [], "authors": ["mediahitman"], "publish_date": "2020-01-03T02:23:31+00:00"}