{"result_id": "324038", "URL": "https://usahitman.com/frwngafs/", "timestamp": "2023-04-25 17:47:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/frwngafs/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Five Reasons Why I’ll Never Get a Flu Shot", "cleaned_text": "If you’re looking for a deeply scientific treatise on the flu shot, this isn’t it.\n\nI’m not a chemist, a physician or someone with an advanced degree in biology. I’m just a mom with an internet connection. I’m a person who has researched and compiled an assortment of worrisome facts that point in one direction: the flu shot is NOT beneficial.\n\nSome of these reasons are backed up by science, and others are an acceptance of that little voice of reason whispering “Something just isn’t right about this.” As a reader, you are welcome to take my personal instinct with a grain of salt. I strongly encourage you to do your own independent research and come to your own conclusions. Look for sources that are not linked to the dollars being earned from these flu shots – no Big Pharma funded studies, no CDC, no FDA. Check out the funding for the studies that you cite and then judge the findings accordingly.\n\nFirst of all, it just doesn’t work.\n\nThe propaganda machine will tell you that the flu shot is “60% effective”, but this is a blatant manipulation of the statistics. This article published last year at Natural News explains how the numbers are “massaged” to present the picture that Big Pharma (who funds the research) wants presented. In actuality, the flu shot prevents the flu in only 1.5 out of 100 adults. You can wade through the abstract at The Lancet here.\n\n1.5%. Let that sink in. That means that you have a 98.5% chance it WON’T work. Why would anyone possibly have something foreign injected into his or her body with those odds?\n\nPart of the reason it is ineffective it because it’s guesswork. Scientists must attempt to predict which 3 viruses (of the over-300 influenza viruses that have been identified) will be the most prevalent during a given year. If you get the flu shot and are then exposed to virus #4-300, you will have no additional immunity to those.\n\nNatural News just published an article yesterday that tells us many of the people being struck down in the current epidemic have received vaccinations, which clearly did not have the desired effect.\n\nSecondly, there are horrible things in the flu shot.\n\nThe flu shot contains some incredibly nasty stuff. Obviously it contains the virus itself, either “dead” or “attenuated” (weakened). But it also contains a host of other harmful toxins. The inclusion of these toxins is not speculation – you can read the CDC’s ingredients lists of the common vaccines in the United States HERE. Following is a little primer giving some information on the toxic ingredients that you can find in the CDC’s ingredients lists. Take the time to cross-match these toxins to the vaccine that is given in your area. You have the right to request the ingredients insert before you take the vaccine or subject your child to it.\n\nThere is a risk of terrible side effects.\n\nI’d honestly rather take my chances with the flu than to have myself injected with something that carries the risk of such side effects on the off-chance (the 1.5% off-chance) that I might avoid catching the 1% of viruses that the shot “protects” me from.\n\nBut what they don’t tell you is that not all adverse reactions are reported and that when they are, the statistics are doctored to keep the do-good reputation of the shot untarnished.\n\nAlso, consider cases like that of Desiree Jennings, the Washington Redskins cheerleader who suffered a paralyzing nerve disorder after receiving her seasonal flu shot. Not only did the industry refuse to compensate her for her trauma and enormous medical bills, vicious attempts were made to publically discredit her.\n\nJennings was a fit and healthy cheerleader up until August when she got a seasonal flu shot. Ten days after the shot she began experiencing flu like symptoms, followed by severe convulsions and black outs. After seeing around 60 doctors, Jennings was eventually diagnosed with dystonia, a paralyzing neurological disorder that causes the muscles to relentlessly contract and spasm, causing extreme difficulties with walking, talking and general body movements. Despite the fact that doctors who vigorously examined her condition at both Fairfax Inova and Johns Hopkins confirmed that she was suffering from dystonia, and that the cause of the illness was her reaction to the flu shot, numerous apologists for big pharma have ludicrously claimed that her story is a hoax and that her disease is imaginary, citing no evidence whatsoever and having had no contact with Jennings at all.\n\nNext, I do not trust the FDA.\n\nFDA approval means less than nothing to me. If the FDA approves it, it just means that the company behind it has enough money and clout to get it approved. I do not trust the FDA to look out for the best interests of me, my children, or anyone else’s children, for that matter. I wrote an article last year regarding the FDA and here are some of the observations that really show the agenda of the agency:\n\nAnd finally, when the media pushes it, I automatically decline. Seriously – anytime there is a big hype or something is made to be mandatory, my gut tells me “This isn’t good.” Look at all of the commercials for anti-depressants. Look at all the soothing newscasters telling us how “we don’t have to suffer.” Look at how GMOs are being promoted as the answer to world hunger. Real journalism is all but dead and can only be found in alternative media sources. The mainstream media is Public Enemy #1, a group of corporate whores who put on make-up and a pretty outfit in order to seduce the public into believing what the puppet masters want them to believe. The media is owned by the same tie-wearing serial killers who own Big Pharma, government agencies and the financial industry.", "opengraph": {"locale": "en_US", "type": "article", "title": "Five Reasons Why I’ll Never Get a Flu Shot  - USAHITMAN Conspiracy News", "description": "If you’re looking for a deeply scientific treatise on the flu shot, this isn’t it. I’m not a chemist, a physician or someone with an advanced degree in biology.  I’m just a mom with an internet connection.  I’m a person who has researched and compiled an assortment of worrisome facts that point in one direction:", "url": "https://usahitman.com/frwngafs/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2013-01-16T01:13:16+00:00", "article:modified_time": "2013-01-16T01:17:49+00:00", "image": "https://usahitman.com/wp-content/uploads/1297223950347_ORIGINAL.jpg", "image:width": "650", "image:height": "434", "image:type": "image/jpeg"}, "tags": ["Flu Shot", "Get", "Never", "Why", "Shots", "Five", "Vaccine", "Vaccines", "Reasons"], "tweets": [], "movies": [], "links": ["https://usahitman.com/wp-content/uploads/1297223950347_ORIGINAL.jpg", "http://www.naturalnews.com/033998_influenza_vaccines_effectiveness.html", "http://www.thelancet.com/journals/laninf/article/PIIS1473-3099%2811%2970295-X/abstract", "http://www.naturalnews.com/038648_flu_pandemic_vaccines_shots.html", "http://www.naturalnews.com/038648_flu_pandemic_vaccines_shots.html", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/b/excipient-table-2.pdf", "http://www.selfgrowth.com/articles/the_vaccination_debate_%E2%80%93_part_1_dangerous_ingredients_in_your_childs_vaccines_that_your_doc", "http://www.cdc.gov/vaccines/vac-gen/side-effects.htm#flu", "http://vaers.hhs.gov/index", "http://vaers.hhs.gov/index", "http://www.naturalnews.com/037960_flu_shots_side_effects_health_risks.html#ixzz2HmRaPudX", "http://www.prisonplanet.com/vaccine-victim-desiree-jennings-viciously-attacked-by-medical-establishment.html", "http://www.myfoxatlanta.com/dpp/health/dpgo_101309_woman_disabled_by_flu_shot_reaction_dystonia_4027780", "http://www.theorganicprepper.ca/the-sinister-corporate-agenda-of-the-fda-04142012", "http://www.theorganicprepper.ca/new-world-order-101-02262012", "http://www.theorganicprepper.ca/public-enemy-1-the-mass-media-01112012", "http://www.theorganicprepper.ca/five-reasons-why-ill-never-get-a-flu-shot-01122013"], "authors": ["mediahitman"], "publish_date": "2013-01-16T01:13:16+00:00"}