{"result_id": "324009", "URL": "https://usahitman.com/asctgoamici/", "timestamp": "2023-04-25 17:47:01 CEST+0200", "meta": {"description": "It is a human right, and global law governed under the Nuremberg Code, that vaccine specific ingredient information is disclosed.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/asctgoamici/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "American Scientists Confirm Toxic Graphene Oxide, and More, in Covid Injections", "cleaned_text": "It is a human right, and global law governed under the Nuremberg Code, that vaccine specific ingredient information is disclosed. It is critical, required and necessary information so anyone, from any country in the world, can make an informed decision whether or not to consent to medical intervention. Because the full list of ingredients of the Covid “vaccines” have not been made available, Dr. Robert Young and his team conducted research to identify the specific ingredients in the Pfizer, Moderna, AstraZeneca and Johnson & Johnson Covid injections. On 20 August, they published their findings.\n\nDr. Young is a biochemist, microbiologist, and clinical nutritionist. He and his team of scientists have confirmed what the La Quinta Columna researchers found – toxic nanometallic content which are magneticotoxic, cytotoxic and genotoxic to plants, insects, birds, animals and humans – all life on the planet. One of the “vaccines” even contained life-threatening parasites. Taken together, the “vaccine” components – which include graphene oxide among many others and which may be influenced by radiation sources external to us – create a toxic chemical and radiative soup inside our bodies. Anyone who has a Covid injection is seriously putting their lives at risk.\n\nWe previously covered some of La Quinta Columna’s research in two articles: Spanish Researchers Find Covid-19 Vaccines Contain TOXIC Levels of Graphene Oxide; and, The real pandemic – Covid-19 or Graphene Oxide? Poisonous Nano-Material found in Covid Vaccines and Face Masks. For additional resources visit Orwell City, a website that translates, transcribes and adds English subtitles to a good portion of La Quinta Columna’s materials.\n\n“Vaccines” from the four major pharmaceutical companies were analysed by Dr. Young: Pfizer/BioNTech (“Pfizer”); Moderna/Lonza mRNA-1273 (“Moderna”); Vaxzevria by AstraZeneca (“AstraZeneca”); and, Janssen by Johnson & Johnson (“Janssen”).\n\nLiposome capsids are fatty lipid capsules. We are told their purpose is to envelope the mRNA to protect the genetic material from breaking down before it has reached its target – our body’s cells. All four Covid “vaccines” contain relatively high levels of graphene oxide but both the Pfizer and Moderna liposome capsids are 100% graphene oxide (after extracting the mRNA).\n\nGraphene oxide is cytotoxic, genotoxic, and magneticotoxic. The image below shows the liposome capsid containing graphene oxide in the Pfizer “vaccine.” The liposome delivers the graphene oxide to specific organs, glands and tissues, namely: the ovaries and testes; bone marrow; heart; and, brain.\n\nAlso found in the Pfizer injection was Trypanosoma cruzi – a parasite of which several variants are lethal and is one of many causes of acquired immune deficiency syndrome or AIDS. It’s not known if this was just a random ingredient or was purposefully placed and will be found in all Pfizer “vaccines.”\n\nIn the AstraZeneca “vaccines,” Dr. Young and his team identified histidine, sucrose, poly-ethylene glycol (“PEG”) and ethylene alcohol, which were also contained in the Pfizer, Moderna and Janssen Covid injections. PEG was the only adjuvant declared on the data sheet listing the ingredients of the AstraZeneca injection.\n\nThe injection of PEG and ethylene alcohol are both known to be carcinogenic and genotoxic.\n\nJanssen also contains particles which are composed of stainless steel which are glued together with a “Carbon-based glue” of reduced graphene oxide.\n\nThis aggregate is highly magnetic and can trigger pathological blood coagulation and the “Corona Effect” or the “Spike Protein Effect”", "opengraph": {"locale": "en_US", "type": "article", "title": "American Scientists Confirm Toxic Graphene Oxide, and More, in Covid Injections - USAHITMAN Conspiracy News", "description": "It is a human right, and global law governed under the Nuremberg Code, that vaccine specific ingredient information is disclosed. ", "url": "https://usahitman.com/asctgoamici/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2021-09-01T12:04:28+00:00", "article:modified_time": "2023-01-16T18:56:29+00:00", "image": "https://usahitman.com/wp-content/uploads/2021/09/Daily-Expose-August-29e-1.png", "image:width": "617", "image:height": "462", "image:type": "image/png"}, "tags": ["Covid19", "Covid Vaccine", "Graphene Oxide", "Masks", "Vaccine", "Vaccinated"], "tweets": [], "movies": [], "links": ["https://www.drrobertyoung.com/meet-dr-young", "https://www.laquintacolumna.net/", "https://www.thelibertybeacon.com/dr-robert-young-finds-graphene-oxide-in-all-four-vaccines-and-other-disturbing-ingredients/", "https://dailyexpose.co.uk/2021/07/19/spanish-researchers-find-covid-19-vaccines-contain-toxic-levels-of-graphene-oxide/", "https://dailyexpose.co.uk/2021/07/10/the-real-pandemic-covid-19-or-graphene-oxide-poisonous-nano-material-found-in-covid-vaccines-and-face-masks/", "https://www.orwell.city/2021/08/5G-software.html", "https://www.cdc.gov/dpdx/trypanosomiasisamerican/index.html", "https://dailyexpose.co.uk/2021/08/30/american-scientists-confirm-toxic-graphene-oxide-and-more-in-covid-injections/"], "authors": ["mediahitman"], "publish_date": "2021-09-01T12:04:28+00:00"}