{"result_id": "324016", "URL": "https://usahitman.com/peaffr3/", "timestamp": "2023-04-25 17:47:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/peaffr3/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Possible Emergency Alert For FEMA Region III: DC, DE, MD, PA, VA, WV", "cleaned_text": "Below is a pretty big list of past events and current ones which are pretty much listed in order, and these events point to something big happening in FEMA Region Three which has DC, DE, MD, PA, VA, WV. Many different things are happening but they seem to be geared towards a monthly disaster that will collapse society and leave a shortage of food and possibly water. Read them below and remember this speculation on current purchases and political movement:\n\nForced Home Inspections Will Implemented sometime in 2013.\n\nFEMA purchase orders for over $14.2 million for MREs and heater meals to be delivered to Region III by October 1st.\n\nFEMA purchase orders for 22 million pouches of emergency water to be delivered to region III by October 1st.\n\nFEMA purchase orders for $13.6 million for MREs and heater meals to be delivered to Austin by October 1st.\n\nNine-week training course for UN Peacekeepers in CONUS to learn Urban Warfare, English, and US weapons systems beginning 4th week of July for 386,000 troops to be completed by October 1st. $11 million in antibiotics to be delivered to FEMA region III by October 1st ordered by CDC.\n\nWorld Health Organization held second emergency meeting in its history to discuss MERS Coronavirus. Determined a vaccine MUST be in place by October 1st.\n\n2800 MRAPs must be delivered to DHS by October 1st. No leave will be allowed for US military from September 28th thru November 5th. NORCOMM yearly training for civil unrest suspended until September 27th. To be performed in northeast coastal areas. Date for release of QE3 report moved to October 16th.\n\nAll DHS agents MUST qualify with sidearm, shotgun and AR 15 by September 28th. No mention of yearly less lethal qualification. Sporadic testing of GPS and Communications satellites is coordinated for the first time with a testing date of September 29th.\n\nPOTUS mandates to FEMA and DHS concerning support for metropolitan communities dealing with the extreme climate change MUST be complete by October 1st. These mandates were issued during the last three weeks. Over 300 school systems in the US have determined they need three-day kits for each school AND three-day kits for each student to take with them. All deliveries are scheduled for the month of September.\n\nAll National Guard units will complete riot control and disaster assistance training during this years annual two week training. All units MUST have their training complete by September 30th.\n\n Daily testing of the Emergency Broadcast System to begin on September 25th and run thru October 2nd.\n\nEastern-based Coast Guard units to perform massive group training, usually performed in the Gulf, in the Virginia and Delaware areas. This is a 10-day training mission to begin September 26th.", "opengraph": {"locale": "en_US", "type": "article", "title": "Possible Emergency Alert For FEMA Region III: DC, DE, MD, PA, VA, WV - USAHITMAN Conspiracy News", "description": "Below is a pretty big list of past events and current ones which are pretty much listed in order, and these events point to something big happening in FEMA Region Three which has DC, DE, MD, PA, VA, WV. Many different things are happening but they seem to be geared towards a monthly disaster that", "url": "https://usahitman.com/peaffr3/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2013-08-19T03:12:06+00:00", "image": "https://usahitman.com/wp-content/uploads/2013/08/region3map.jpg", "image:width": "300", "image:height": "223", "image:type": "image/jpeg"}, "tags": ["DE", "Water", "DC", "PA", "Region 3", "False Flag", "WV", "MD", "Natural Disaster", "DHS", "Food", "FEMA"], "tweets": [], "movies": [], "links": ["https://usahitman.com/wp-content/uploads/2013/08/region3map.jpg", "https://www.fbo.gov/index?s=opportunity&mode=form&id=38d3a1d5cc5a2de1c00cdc5b4836dde5&tab=core&tabmode=list&=", "https://www.fbo.gov/index?s=opportunity&mode=list", "https://www.fbo.gov/index?s=opportunity&mode=form&id=d7933a6d0ad4ba21f12ffb51340f11a8&tab=core&_cview=0", "http://www.fema.gov/region-iii-dc-de-md-pa-va-wv", "http://www.fema.gov/fy-2013-homeland-security-grant-program-hsgp-0", "http://map1.msc.fema.gov/res/0/Purchase_Order.htm"], "authors": ["mediahitman"], "publish_date": "2013-08-19T03:12:06+00:00"}