{"result_id": "324013", "URL": "https://usahitman.com/tavwcadc/", "timestamp": "2023-04-25 17:47:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/tavwcadc/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "The AIDS virus was created artificially. Documented confirmation", "cleaned_text": "The truth is not always pleasant, but in each case it makes us free. In this case the truth frees us from fear. The false AIDS epidemic in the 1980s sparked a global fear, fear of having any physical contact with unknown persons, but also with the closest.’\n\nRemember what we were told? When you make love, you do not only with that person, but with all those with whom that person had physical relations.\n\nIt was the true aim of this “epidemic”. The purpose was to make us live in fear. (Apart from earning money, secondary consequence of fear).\n\nOfficial document from the archives of the library of the Senate of the United States.\n\n The document certifies that the AIDS virus has been artificially created by the Department of Defense of the United States of America\n\nThe Feasibility program was completed in 1974-1975 and the virus between 1974 and 1979. AIDS-laced smallpox vaccine (smallpox vaccine stuffed AIDS, ndt) began to be injected at more than 100 million Africans in 1977. More than 2,000 gay white race (Operation Trojan Horse) he was injected with the vaccine against hepatitis A “modified” in 1978 to the infectious diseases control center and the blood collection centre in New York.\n\nThe development of the virus had apparently two objectives: (1) policy/ethnic to use weapon against people of color and (2) the programmatic reduction of the population.\n\nOn July 29, 1969, a few days after the Defense Department asked the Congress $ 10 million of funding for research “a synthetic biological pathogen, a substance that does not exist in nature and against whom it is not possible to develop a natural immunity”, the President of the Republican Task Force on Earth Resources and Population (Population and resources land)the Honourable George H.W. Bush stressed the urgent need for actions to control the population to deal with the “growing crisis in the third world”.\n\nThe programming of the AIDS epidemic\n\nIn 1972, under the auspices of the World Health Organization, a program of mass vaccination of the African populations against smallpox was door forward. This vaccine infected with the AIDS virus was administered to millions of black African indigent and whose number grew quickly, problem that concerned Gerald Bush, among other members of the elite, the Rockefellers, the Club of Rome and the members of the Bilderberg since 1969.\n\nThe AIDS virus has been intentionally added to the hepatitis-B vaccine.\n\n Studies on hepatitis B vaccine are now locked and in the custody of the Department of Justice in Washington and no one can access it.\n\nHIV was created in the laboratory.\n\nWith a well-founded certainty, a few years ago, might his life by telling certain passages of the truth… now it says this can be done, and that it is even necessary. This maybe a little hurt, but we think that this can be used to reconcile more gentle awareness. So many things have happened that now it would not hurt to be a little human…", "opengraph": {"locale": "en_US", "type": "article", "title": "The AIDS virus was created artificially. Documented confirmation  - USAHITMAN Conspiracy News", "description": "By John Meunier The truth is not always pleasant, but in each case it makes us free. In this case the truth frees us from fear. The false AIDS epidemic in the 1980s sparked a global fear, fear of having any physical contact with unknown persons, but also with the closest.’ Remember what we were", "url": "https://usahitman.com/tavwcadc/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2013-07-26T00:26:59+00:00", "article:modified_time": "2013-07-26T02:12:01+00:00", "image": "https://usahitman.com/wp-content/uploads/2013/07/88220149_p.jpg", "image:width": "300", "image:height": "186", "image:type": "image/jpeg"}, "tags": ["Virus", "AIDS", "Artificial", "HIV", "Documented"], "tweets": [], "movies": [], "links": ["https://usahitman.com/wp-content/uploads/2013/07/88220149_p.jpg", "https://usahitman.com/wp-content/uploads/2013/07/88220192_p.jpg", "http://seroposition.canalblog.com/archives/2013/07/10/27612267.html"], "authors": ["mediahitman"], "publish_date": "2013-07-26T00:26:59+00:00"}