{"result_id": "324045", "URL": "https://usahitman.com/amazons-ring-car-cam-next-level-tech-or-big-brother-spying-on-drivers/", "timestamp": "2023-04-25 17:47:50 CEST+0200", "meta": {"description": "While visiting Amazon.com over the weekend I noticed on the homepage they were advertising a Ring Car camera which had dual facing HD cameras", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/amazons-ring-car-cam-next-level-tech-or-big-brother-spying-on-drivers/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Amazon's Ring Car Cam: Next level tech? Or Big Brother Spying on Drivers?", "cleaned_text": "While visiting Amazon.com over the weekend I noticed on the homepage they were advertising a Ring Car camera which had dual facing HD cameras with night vision. They claim the cabin-facing camera is protect against break-ins, but you know they are data mining your face, actions, conversations gps locations and whatever else they want.\n\nBut Amazon makes you feel comfortable, it has a built in privacy cover which blocks cabin-facing camera and ‘electronically’ shuts the microphone off. Can consumers be sure this is intended to protect and keep things private in the car? I would be cautious.\n\nThere are some other features such as motion alerts, live view and two way talk which allows the ability to see inside the car and talk anyone who’s inside when a smartphone is connected on the Ring app. Will hackers be able to watch you as you drive. Amazon will claim no, but it’s always possible when a exploit hits the dark-web.\n\nNow I have a problem with the so called easy installation; The car cam plugs into your vehicle’s OBD-II port. Now this OBD port is a treasure trove of information into your cars components which could be a major security flaw in this design and it’s not necessary for a device like this to be connected to such a important vehicle system.\n\nIt’s important to note Amazon’s history of personal data; Data-breaches, privacy abuses, lawsuits but the most disturbing thing is the use of use of consumers’ biometric data, captured through use of its Rekognition facial recognition technology as well as Alexa devices. The use of this information is unknown but don’t forget they also have order histories, payment information which they do sell to advertisers.\n\nSo I would suggest be weary of adding these ring cameras in your car or home because big tech doesn’t care about your rights or privacy, they want to sell your information to the highest buyer for their own financial gain or incriminate you to the government.", "opengraph": {"locale": "en_US", "type": "article", "title": "Amazon's Ring Car Cam: Next level tech? Or Big Brother Spying on Drivers? - USAHITMAN Conspiracy News", "description": "While visiting Amazon.com over the weekend I noticed on the homepage they were advertising a Ring Car camera which had dual facing HD cameras", "url": "https://usahitman.com/amazons-ring-car-cam-next-level-tech-or-big-brother-spying-on-drivers/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-01-08T23:02:35+00:00", "article:modified_time": "2023-01-12T00:46:11+00:00", "image": "https://usahitman.com/wp-content/uploads/Ring-Car-Cam-size3.jpg", "image:width": "910", "image:height": "569", "image:type": "image/jpeg"}, "tags": ["Ring", "Amazon", "Big Brother", "Car", "Cameras", "Spying"], "tweets": [], "movies": [], "links": [], "authors": ["mediahitman"], "publish_date": "2023-01-08T23:02:35+00:00"}