{"result_id": "324043", "URL": "https://usahitman.com/antivaxartbs/", "timestamp": "2023-04-25 17:47:48 CEST+0200", "meta": {"description": "Vaccination skeptics say the US government has joined with pharmaceutical companies to shut them down, and the veil of silence over the true dangers", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/antivaxartbs/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Anti-vaccination activists refuse to be 'silenced’", "cleaned_text": "Vaccination skeptics say the US government has joined with pharmaceutical companies to shut them down, and the veil of silence over the true dangers of inoculation is secretly killing hundreds of children each year.\n\nWhen she checks on one of her three living children sleeping, Krystle Cordingley will sometimes see not their faces, but the “grey and lifeless” face of her son Corbyn, whom she found dead in his bed 14 hours after a flu vaccination.\n\nThat was over five years ago.\n\n“I’m broken. I am not suicidal or unable to function, but my heart will always be shattered. I will forever feel guilty for being the one that took my son in to be vaccinated, and I don’t know if I will ever get over the feeling that I killed him,” says Cordingley, who now dedicates her life to fighting against vaccination.\n\nShe recalls October 18, 2013, the last day of her 13 month-old son’s life, in perfect detail.\n\nFrom the uncomprehending, tearful look he gave her after the flu shot, to the meal she prepared for him before her evening shift at the hospital – which she still keeps in her freezer, unable to throw it away – to how his dad peeked into his room, thought that his son was sleeping peacefully on his stomach and didn’t come closer.\n\nThen, how when she returned home, and was preparing to nurse him, she noticed his chest was not moving, turned over his face, and screamed, aware straight away it was too late. Then, the vainly desperate attempts to revive him.\n\n“Of all my years of emergency response training I never thought the first child I would use my emergency training on would be my own,” says Cordingley. “I still have flashbacks of the medical personnel cracking my child’s sternum to continue a more productive CPR, compressing his chest like he was a rag doll.”\n\nThe official medical cause of death was the deeply unsatisfying “Unknown”.\n\nAssured only that her son did not suffocate, Cordingley, who lives in Ogden, Utah, wanted to know more, and would not let it go. She says that a third-party neuropathologist identified severe damage to Corbyn’s brain stem and hippocampus, and told the mother, that “she sees that much damage from younger SIDS [Sudden Infant Death Syndrome] babies all the time, but never in older children and she is surprised he lived as long as he did.”\n\nCordingley believes that it is not unrelated that as well as the flu shot, Corbyn received five different vaccines, including MMR, 43 days before his death.", "opengraph": {"locale": "en_US", "type": "article", "title": "Anti-vaccination activists refuse to be 'silenced’ - USAHITMAN Conspiracy News", "description": "Vaccination skeptics say the US government has joined with pharmaceutical companies to shut them down, and the veil of silence over the true dangers", "url": "https://usahitman.com/antivaxartbs/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2019-03-17T20:45:33+00:00", "article:modified_time": "2019-03-17T22:03:12+00:00", "image": "https://usahitman.com/wp-content/uploads/5c8d1c18dda4c8f31c8b45a4.jpg", "image:width": "980", "image:height": "551", "image:type": "image/jpeg"}, "tags": ["Flu", "Anti-vaccination", "Big Pharma", "Govt", "Lies", "Children", "Vaccines"], "tweets": [], "movies": [], "links": ["https://www.rt.com/news/454052-vaccination-activists-side-effects-/"], "authors": ["mediahitman"], "publish_date": "2019-03-17T20:45:33+00:00"}