{"result_id": "324026", "URL": "https://usahitman.com/thousands-protest-in-new-zealand-against-covid-19-vaccine-mandate/", "timestamp": "2023-04-25 17:47:25 CEST+0200", "meta": {"description": "New Zealand beefed up security measures at parliament as thousands of people gathered to protest against Covid-19 vaccine mandates", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/thousands-protest-in-new-zealand-against-covid-19-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Thousands protest in New Zealand against Covid-19 vaccine mandate", "cleaned_text": "New Zealand beefed up security measures at its parliament on Tuesday as thousands of people gathered to protest against Covid-19 vaccine mandates and government lockdowns.\n\nAll but two entrances to the parliament building, known as the Beehive, were closed off in the presence of unprecedented levels of police and security personnel, as mostly unmasked protesters marched through central Wellington and congregated outside parliament.\n\nWhile the demonstration was peaceful, many people were seen holding signs and placards with messages like “Freedom” and “Kiwis are not lab rats” and shouting slogans as they demanded the government roll back compulsory vaccination and lift restrictions.\n\n“I will not be coerced and I will not be forced into taking something I don’t want in my body,” a protester said outside parliament.\n\n“I’m asking (the government) to give us back 2018. Simple as that. I want my freedoms back.”\n\nNew Zealand has struggled to fight off a highly infectious outbreak of the delta variant this year, forcing Prime Minister Jacinda Ardern to move from its strategy of elimination through lockdowns to living with the virus with higher vaccinations.\n\nArdern last month said the country would require teachers and workers in the health and disability sectors to be fully vaccinated against Covid-19, and has promised to end restrictions only after 90% of the eligible population is inoculated.\n\nThat threshold is higher than many other countries and has invited criticism from people calling for more freedoms, while the mandate will be a hurdle for those looking to get back to work but still avoiding the jab.\n\n“Treat us like people!” another protester exclaimed when asked about the government’s stance on mandating the vaccine.\n\n“I’m here for freedom. The government, what they’re doing, is anti-freedom.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Thousands protest in New Zealand against Covid-19 vaccine mandate - USAHITMAN Conspiracy News", "description": "New Zealand beefed up security measures at parliament as thousands of people gathered to protest against Covid-19 vaccine mandates", "url": "https://usahitman.com/thousands-protest-in-new-zealand-against-covid-19-vaccine-mandate/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2021-11-08T02:07:00+00:00", "article:modified_time": "2023-01-20T21:13:19+00:00", "image": "https://usahitman.com/wp-content/uploads/2021/11/106972492-1636422282662-gettyimages-1352161562-a49o9749_2021110910752143.jpeg", "image:width": "740", "image:height": "416", "image:type": "image/jpeg"}, "tags": ["Freedom", "Covid19", "Protest", "Covid Vaccine", "Coronavirus", "New Zealand", "Vaccine Mandate", "Lockdowns"], "tweets": [], "movies": [], "links": ["https://www.cnbc.com/2021/11/09/thousands-protest-in-new-zealand-against-covid-19-vaccine-mandate.html"], "authors": ["mediahitman"], "publish_date": "2021-11-08T02:07:00+00:00"}