{"result_id": "324018", "URL": "https://usahitman.com/first-time-rabies-causes-a-death-in-new-zealand-experts-say-vaccine-is-needed/", "timestamp": "2023-04-25 17:47:12 CEST+0200", "meta": {"description": "The first case of rabies detected in New Zealand has resulted in a death, local health authorities say.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/first-time-rabies-causes-a-death-in-new-zealand-experts-say-vaccine-is-needed/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "First time rabies causes a death in New Zealand, experts say vaccine is needed", "cleaned_text": "The first case of rabies detected in New Zealand has resulted in a death, local health authorities say.\n\nA statement released by the national health ministry Manatū Hauora, identified the deceased person was a returned traveller from overseas, where the virus was contracted.\n\nRabies is a viral illness common in most countries and is usually transmitted to humans via bites from infected animals. Dogs are known carriers and the predominant source of disease transfer.\n\nHowever New Zealand is one of the few nations on earth that does not have rabies in human or animal populations, although around two in five nations are free of disease in dogs and people, including those in North America, Europe and Australia. Human to human transmission is exceedingly rare.\n\nIn its statement, Manatū Hauora emphasised the disease posed no threat to other members of the NZ public.\n\nRabies is usually fatal once symptoms such as fever, pain and pins and needles sensations at the wound site. Incubation can take months though, which is why vaccine after a bite from a potentially infected animal is often recommended.\n\n“Rabies is an entirely vaccine preventable disease in people and animals. It is transmitted through the bite of an infected animal, typically a domestic dog, but also sometimes wild animals,” says Professor David Hayman, an epidemiologist from Massey University (NZ).\n\n“Unfortunately, the disease is also always fatal.", "opengraph": {"locale": "en_US", "type": "article", "title": "First time rabies causes a death in New Zealand, experts say vaccine is needed - USAHITMAN Conspiracy News", "description": "The first case of rabies detected in New Zealand has resulted in a death, local health authorities say.", "url": "https://usahitman.com/first-time-rabies-causes-a-death-in-new-zealand-experts-say-vaccine-is-needed/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-04-03T13:38:19+00:00", "article:modified_time": "2023-04-03T13:38:21+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/04/rabgg.webp", "image:width": "673", "image:height": "448", "image:type": "image/webp"}, "tags": ["Death", "Rabies", "New Zealand", "Vaccine"], "tweets": [], "movies": [], "links": ["https://www.health.govt.nz/news-media/media-releases/no-risk-public-nzs-first-rabies-case", "https://cosmosmagazine.com/health/first-time-rabies-death-new-zealand/"], "authors": ["mediahitman"], "publish_date": "2023-04-03T13:38:19+00:00"}