{"result_id": "324023", "URL": "https://usahitman.com/fake-news-plays-cleanup-says-china-spy-balloons-flew-over-us-during-trump-years/", "timestamp": "2023-04-25 17:47:20 CEST+0200", "meta": {"description": "On Saturday the Biden regime admitted the China spy balloon was first spotted a week earlier in Alaska back on January 28,", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/fake-news-plays-cleanup-says-china-spy-balloons-flew-over-us-during-trump-years/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Fake News Plays Cleanup: Says China Spy Balloons Flew Over US During Trump Years", "cleaned_text": "The China spy balloon tracking model over the continental US.\n\nOn Saturday the Biden regime admitted the China spy balloon was first spotted a week earlier in Alaska back on January 28, flew from there into Canada and down into the continental US. On Tuesday the balloon entered Idaho and crossed the US for the next four days. The China spy balloon was then shot down after it left US territory and had collected all of its data for the Chinese Communist Party. This was an unprecedented event in US history.\n\nThe event is the latest example of the not only ineptness but absolute dereliction of duty of this far left administration. The Bidens are a national threat. We now know the Biden administration was hoping to hide this from the American public due to an upcoming trip by the Secretary of State to China that was planned for this weekend. It’s clear the Biden regime is compromised.\n\nNow we have this.\n\nThe fake news is hoping to convince Americans that these China spy balloons cross the US all the time. In fact, fake news insisted that this happened during the Trump years – three times.\n\nOn Sunday morning a FOX News reporter pushed back on these claims. She spoke with John Bolton, Ric Grenell, Former Defense Secretary Mark Esper, and others who said they had never heard of this happening. And if it did, they were not notified – which is just as bad.\n\nOn Sunday morning a FOX News reporter pushed back on these claims. She spoke with Michael Bolton, Ric Grenell, Former Defense Secretary Mark Esper, and others who said they had never heard of this happening. And if it did, they were not notified – which is just as bad.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fake News Plays Cleanup: Says China Spy Balloons Flew Over US During Trump Years  - USAHITMAN Conspiracy News", "description": "On Saturday the Biden regime admitted the China spy balloon was first spotted a week earlier in Alaska back on January 28,", "url": "https://usahitman.com/fake-news-plays-cleanup-says-china-spy-balloons-flew-over-us-during-trump-years/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-02-04T00:16:48+00:00", "article:modified_time": "2023-02-06T00:19:37+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/02/china-balloon-track.jpg", "image:width": "679", "image:height": "494", "image:type": "image/jpeg"}, "tags": ["Joe Biden", "Spy Balloon", "Trump", "Fake News", "China"], "tweets": [], "movies": [], "links": ["https://www.forbes.com/sites/mattnovak/2023/02/04/yes-chinese-spy-balloons-flew-over-the-us-when-president-trump-was-in-office-too/?sh=1c4b5f383ea3", "https://www.thegatewaypundit.com/2023/02/fake-news-plays-cleanup-says-china-spy-balloons-flew-us-trump-years-trump-officials-deny-reports-video/"], "authors": ["mediahitman"], "publish_date": "2023-02-04T00:16:48+00:00"}