{"result_id": "324032", "URL": "https://usahitman.com/international-monetary-fund-urges-zimbabwe-stop-the-use-of-the-gold-coins-as-currency/", "timestamp": "2023-04-25 17:47:33 CEST+0200", "meta": {"description": "Your first thoughts are the Rothchild's are involved and the IMF says you cant you use gold as currency in Zimbabwe", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/international-monetary-fund-urges-zimbabwe-stop-the-use-of-the-gold-coins-as-currency/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "International Monetary Fund urges Zimbabwe stop the use of the gold coins as currency", "cleaned_text": "Your first thoughts are the Rothchild’s are involved and that is true as you’ll read below but many of the headlines on the mainstream media are misleading since they are all around the same title as: Zimbabwe’s Gold Coins Sell Above $2,000 Each For The First Time. But that isn’t true or why the gold coin has skyrocketed in value, buried deep in the articles on all of the new websites you see this quote:\n\nThe so-called “Mosi-oa-Tunya” gold coin, named after Victoria Falls, a key tourism site which straddles the border between Zimbabwe and Zambia, were priced at $2,002.51 for a one-ounce coin on Monday, according to data on the Reserve Bank of Zimbabwe’s website. Spot gold was at $1,914.21 an ounce at 2:45 p.m. in London.\n\nThe central bank introduced the gold coins to halt a collapse of the Zimbabwean dollar and to help ease demand for US dollars. Smaller units were brought into circulation in November. But why does the IMF want the country to avoid using gold coins as currency?\n\nThe IMF would rather have Zimbabwe and it’s citizens suffering from a hyperinflation fiat currency which has no buying power on a global scale of trade. But with the power of gold, there is no longer a sanctions or price increase due to conversions of currency. Gold is a hard asset which is a global price across the board.\n\nBut some history; Following an extended period of British rule, Zimbabwe Rhodesia finally gained its independence from the United Kingdom, forming the Republic of Zimbabwe on April 18, 1980. Now you might ask where or how could the Rothchild’s be involved? Well the Rothchild’s funded Cecil Rhodes in the creation of the African colony of Rhodesia.", "opengraph": {"locale": "en_US", "type": "article", "title": "International Monetary Fund urges Zimbabwe stop the use of the gold coins as currency - USAHITMAN Conspiracy News", "description": "Your first thoughts are the Rothchild's are involved and the IMF says you cant you use gold as currency in Zimbabwe", "url": "https://usahitman.com/international-monetary-fund-urges-zimbabwe-stop-the-use-of-the-gold-coins-as-currency/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-01-20T20:00:34+00:00", "article:modified_time": "2023-01-20T20:10:45+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/01/skynews-mangudya-zimbabwe-gold_5845442.jpg", "image:width": "2048", "image:height": "1152", "image:type": "image/jpeg"}, "tags": ["Gold", "Currency", "Zimbabwe", "IMF", "Hyperinflation", "Rothchild"], "tweets": [], "movies": [], "links": ["https://en.wikipedia.org/wiki/Cecil_Rhodes"], "authors": ["mediahitman"], "publish_date": "2023-01-20T20:00:34+00:00"}