{"result_id": "324029", "URL": "https://usahitman.com/implanted-microchip-tech-will-predict-blood-clotting-vaxxed-must-have/", "timestamp": "2023-04-25 17:47:29 CEST+0200", "meta": {"description": "Engineering microfluidic solutions for the rapid and accurate diagnosis of blood clots by simulating human vessels on small chips.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://usahitman.com/implanted-microchip-tech-will-predict-blood-clotting-vaxxed-must-have/", "encoding": "UTF-8"}, "image": null, "domain": "usahitman.com", "title": "Implanted Microchip Tech Will Predict Blood Clotting - Vaxxed Must Have", "cleaned_text": "Fatal cases have been reported in COVID-19 vaccine recipients caused by blood clotting. Concerns of blood clots hindered the vaccine rollout for the general public and no efficient screening tests are available for the prediction of blood clotting, negatively impacting national economy and social freedom. In response to this grand challenge, this project aims to develop efficient point-of-care (POC) microdevices to help people predict their risk of blood clots risks when making health choices, such as COVID-19 vaccination.\n\nOrgan-on-chip is a promising solution for assessing blood clot formation and holds great potential for marketable POC microdevices. To this end, chief investigators Dr. Arnold Ju and Dr. Freda Passam are spearheading the Grand Challenge aiming to engineer innovative microdevices and assess why some people are more susceptible to blood clotting than others. Specifically, we will build disease-mimicking artificial blood vessels on a microfluidic chip, or ‘Endo-chip’, by combining photo-lithography and tissue engineering to mimic haemodynamic conditions in the circulatory system. In the first instance, we will apply this technology to screen individuals for increased clotting tendency after receiving COVID-19 vaccination. This project is of utmost national importance with the continuing spread of COVID-19 and need for vaccination.", "opengraph": {"locale": "en_US", "type": "article", "title": "Implanted Microchip Tech Will Predict Blood Clotting - Vaxxed Must Have - USAHITMAN Conspiracy News", "description": "Engineering microfluidic solutions for the rapid and accurate diagnosis of blood clots by simulating human vessels on small chips.", "url": "https://usahitman.com/implanted-microchip-tech-will-predict-blood-clotting-vaxxed-must-have/", "site_name": "USAHITMAN Conspiracy News", "article:published_time": "2023-04-16T12:08:53+00:00", "article:modified_time": "2023-04-16T12:08:54+00:00", "image": "https://usahitman.com/wp-content/uploads/2023/04/clotchip-sensor.png", "image:width": "309", "image:height": "118", "image:type": "image/png"}, "tags": ["Covid", "Covid Vaccine", "Microchip", "Vaccines", "Blood Clots", "Technology", "Blood Clot", "Implant"], "tweets": [], "movies": [], "links": ["https://www.sydney.edu.au/nano/our-research/grand-challenges/2022/organ-on-chip-for-blood-clot-assessment.html"], "authors": ["mediahitman"], "publish_date": "2023-04-16T12:08:53+00:00"}