{"result_id": "325007", "URL": "https://usawatchdog.com/trump-cv19-vax-contract-violated-by-pfizer-karen-kingston/", "timestamp": "2023-04-25 17:48:04 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Karen Kingston is a biotech analyst and former Pfizer employee who understands complicated medical and biological contracts. Kingston has been doing a deep dive into the contract President Trump signed with Pfizer for their version of the CV19 vax. The contract proves Trump required Pfizer to follow the", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/trump-cv19-vax-contract-violated-by-pfizer-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Trump CV19 Vax Contract Violated by Pfizer – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a biotech analyst and former Pfizer employee who understands complicated medical and biological contracts. Kingston has been doing a deep dive into the contract President Trump signed with Pfizer for their version of the CV19 vax. The contract proves Trump required Pfizer to follow the law to produce a safe and effective vaccine. The Pfizer vax was not safe or effective and violated the contract. On top of that, the Pfizer vax turned out to be a bioweapon. Pfizer says it produced 63% of the 13 billion injections worldwide. Kingston explains, “Unlike any other contract I have ever read before, the contract says right up front the President said they had to produce a safe and effective vaccine, and they would have to promise it would protect against SARS-Cov-2 infections and all its variants. Oh, and by the way, all those Emergency Use Authorization (EUA) laws that give you immunity under Obama and Bush, Jr., you are going to forfeit those. . . . Trump said he wanted it by October 31, and the vaccine must be safe and effective. This was not safe and effective under the emergency use vaccine even though it was going to be EUA authorized. They cite the FDA laws under initial new drug applications that it must adhere to. In fact, Pfizer had to adhere to initial new drug application laws that were separate from EUA laws. On top of that, it had to be guaranteed to be safe and effective. . . . The contract that Trump had Pfizer sign made them guarantee this was safe and effective. So, they broke the contract, and Pfizer is not protected under the EUA law. . . . The way the contract is written, it looks to me, Trump said if we need a vaccine to reopen the country, you have to make sure it was safe and effective. . . . The phrase is in there over a dozen times. There is no gray area that the product (Pfizer CV19 vax) had to be safe and effective.”\n\nThe bioweapon/vax is research that has been under development for a couple of decades. Kingston contends, “Even Bobby Kennedy said the last 20 years of Fauci (NIH) and Ralph Baric (UNC) research was bioweapon research. Bioweapon research is based in mRNA technology. So, anyone working on mRNA technology under the guise of vaccines and gene therapy was really working on a bioweapon. This is exactly what Lt. General Kirillov, who heads up Russia’s bioweapon program, stated that this is what mRNA technology is. He said they are artificial viruses . . . pathogens based in mRNA technology. Basically, they are technology pathogens. They are meant to cause disease, disabilities and death in humans. They have developed this under the guise of vaccines. . .”\n\nKingston has been trying to get the leaders around the country and in Congress to stop ignoring the extreme death and disabilities caused by the CV19 bioweapon/vax. The evidence is now overwhelming, and, yet, this huge ongoing bioweapon attack is being ignored. Kingston says, “The NIH, CDC and FDA were co-conspirators, that’s what they are. They were complicit in developing mRNA bioweapons and deploying them, not just in the United States, but deploying them globally. By ignoring the crime, you become complicit in the crime. My concern is also for President Trump. These are clearly defined as bioweapons . . . that do not prevent infection, or transmission, does not prevent hospitalization and was done under criminal and fraudulent experimentation, that is the definition of a bioweapon, especially when it causes harm. . . .This is my warning to America and Congress. We cannot ignore that a bioweapon was developed by American companies and unleashed on the global population. If you continue to ignore this, then you are complicit in a crime. . . . You don’t want a foreign power to come in and take care of this. The way Russia takes care of many criminals is they execute them or assassinate them. This is not something that America wants another global military power to take care of.”\n\nIn closing, Kingston says, “We must stop mRNA technology because it will be used to destroy humanity.”\n\nThere is much more in the 1-hour and 16-minute in-depth interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she gives an update on the bioweapon mRNA injections and why they need to be stopped for 3.17.23.\n\nTo look at some of the data and documents on the Trump Pfizer CV19 vax contract or proof the CV19 vax is a bioweapon and a psyop released on an unsuspecting public, go to the [email protected]\n\nTo support Kingston financially, you can become a subscriber by clicking here.\n\nIf you want to donate to Kingston electronically so she can continue informing the public, please click here.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2023/03/Karen-Kingston-3.18.23-pic.png", "https://usawatchdog.com/", "https://karenkingston.substack.com/p/karen-kingstons-med-legal-analysis", "https://karenkingston.substack.com/", "https://usawatchdog.com/donations/", "https://karenkingston.substack.com/", "https://karenkingston.substack.com/subscribe?utm_source=menu&simple=true&next=https%3A%2F%2Fkarenkingston.substack.com%2F", "https://www.givesendgo.com/kingston", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/"], "authors": [], "publish_date": "03/18/2023  •"}