{"result_id": "325021", "URL": "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/", "timestamp": "2023-04-25 17:48:20 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. Betsy Eads has been fighting to get the truth out about the debilitating and deadly CV19 bioweapon injections form the very beginning. The truth is coming out showing Dr. Eads was right all along even though the Lying Legacy Media (LLM) was suppressing her life saving data and analysis. In", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Tsunami of Vax Deaths Coming in Next Two Years – Dr. Betsy Eads | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Betsy Eads has been fighting to get the truth out about the debilitating and deadly CV19 bioweapon injections form the very beginning. The truth is coming out showing Dr. Eads was right all along even though the Lying Legacy Media (LLM) was suppressing her life saving data and analysis. In August, Dr. Eads predicted the human damage from the CV19 bioweapon was going to get far worse, and increasing numbers of vax deaths and injuries show she was right again. Dr. Eads now predicts, “. . . We are in the millions (of vax deaths) in America right now, and I am projecting a tsunami of deaths coming in the next two years. The problem is you cannot turn off this messenger RNA spike protein producing factory mechanism. People are still lockstep getting in line to take boosters, which have 70 million copies of the messenger RNA.\n\nThe lies the CDC, FDA, Big Pharma and the LLM told were all designed to get the unsuspecting public to take an experimental vax injection that they all knew was deadly and dangerous. Florida Governor Ron DeSantis is leading his state to hold people accountable for the CV19 vax lies and human destruction. On Tuesday, Governor DeSantis asked for a statewide grand jury to investigate Covid vaccine-related injuries. Is this the beginning of what may turn into a Nuremberg 2.0 for crimes against humanity in which the Germans were held accountable after World War II? Eads says, “DeSantis is going to . . . petition the Florida Supreme Court to convene a grand jury to investigate every case of malpractice or misinformation regarding the Covid vaccine shots. He is going after all those people who did not give informed consent. . . . Florida has a law about giving misinformation regarding side effects of drugs. . . . DeSantis is going after anyone who gave misinformation about Covid vaccines, anyone who harmed anybody or gave misinformation regarding informed consent.”\n\nThere were so many lies and misinformation given to get people to take the injections. One of the biggest was the vax was 95% effective and very safe. A total lie on both counts. Eads says, “It was absolutely not ‘safe and effective.’ The numbers from the early Pfizer studies were fudged. It was not 95% effective. It was actually 15% or less effective.”\n\nThe lies came from everywhere, and they were paid lies. Dr. Eads says, “The propaganda coming from the media, sports stars and Hollywood were all paid off by Big Pharma to put out misinformation.”\n\nThey knew one of the big medical problems for anyone who took the injections was permanent heart damage. Dr. Eads points out, “What’s been all over the news the last month? Sudden cardiac death, sudden death, died suddenly. It is just insane we cannot get this message out through the mainstream media. It is crimes against humanity. These people need to be arrested and tried. . . . We are going to have Nuremberg trials here in America this coming summer. We need to have them now. People are dropping dead now. People need to be held accountable now.”\n\nDr. Eads also talks about why you need to get Ivermectin whether you are vaxed or unvaxed. She also talks about many other helpful treatments that can help offer some hope for these huge and growing numbers of harmed people caused by the deadly bioweapon injections falsely passed off as vaccines.\n\nThere is much more in the 48-minute interview.\n\nJoin Greg Hunter as he talks to 25-year veteran Dr. Elizabeth Eads, DO, as she continues to highlight the worsening carnage of the CV19 bioweapon vax.\n\nYou can follow Dr. Elizabeth (Betsy) Eads on Twitter, or you can follow her on Telegram.\n\nTo find out about Impact Health Sharing click here.\n\nTo find out about Chlorine Dioxide and its inventor click here.\n\nTo order Chlorine Dioxide “A” and “B” click here.\n\nIf you are looking to buy physical gold and silver coins, check out our sponsor Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/12/Betsy-Eads-12.13.22-pic.png", "https://usawatchdog.com/", "https://www.thegatewaypundit.com/2022/12/developing-governor-desantis-calls-grand-jury-investigate-covid-vaccine-related-injuries-video/", "https://usawatchdog.com/donations/", "https://twitter.com/eads_elizabeth", "https://t.me/s/Dr_BetsyChannel/2603", "https://www.impacthealthsharing.com/providers", "https://andreaskalcker.com/en/", "https://kvlab.com/chlorine-dioxide-products/chlorine-dioxide-kit-w-hcl-activator-NKP-H4", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/", "https://usawatchdog.com/at-least-1-billion-dead-or-disabled-from-cv19-bioweapon-dr-betsy-eads/", "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/", "https://usawatchdog.com/paul-craig-roberts-nuke-war-coming-mysterious-deaths-dont-stop-dems-cant-win/", "https://usawatchdog.com/framing-trump-again-tsunami-of-vax-lies-tanking-economy/"], "authors": [], "publish_date": "12/13/2022  •"}