{"result_id": "325026", "URL": "https://usawatchdog.com/people-are-dying-from-the-cv19-vax-its-preventable-dr-pierre-kory/", "timestamp": "2023-04-25 17:48:25 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com World renowned CV19 critical care and pulmonary expert Dr. Pierre Kory is fast becoming one of the top CV19 vaccine injury experts in the country. It’s not only injuries Dr. Kory is concerned about, but it is the huge amount of death from these bioweapon injections. The dark powers did not", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/people-are-dying-from-the-cv19-vax-its-preventable-dr-pierre-kory/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "People are Dying from the CV19 Vax & It’s Preventable – Dr. Pierre Kory | Greg Hunter’s USAWatchdog", "cleaned_text": "World renowned CV19 critical care and pulmonary expert Dr. Pierre Kory is fast becoming one of the top CV19 vaccine injury experts in the country. It’s not only injuries Dr. Kory is concerned about, but it is the huge amount of death from these bioweapon injections. The dark powers did not tell you the dangers of the CV19 so-called vaccines, and now, they are covering up and ignoring lifesaving therapies to combat it. Dr. Kory explains, “Every day it’s just endless reports in the newspapers and all around us of young people dying. By the way, it’s not normal for people to die suddenly at 32 years of age, or at 42 or even at 50. You see droves and droves of people dying, this is not to mention the number of celebrities dying and the amount of artists getting sick, canceling concerts and developing cancers. Have you ever seen so many famous people getting sick all the time and not being able to do their duties, sing or do all these things? It’s dystopian. People are dying, and they are dying at rates we have never seen before. There is a cause (CV19 bioweapon/vax), and it’s preventable.”\n\nDr. Kory has completely shifted his direction to vax injuries and shedding injuries. Dr. Kory says, “There is no vaccine injury clinic – period. You cannot have a clinic for a disease that you shall not speak its name.” (CV19 bioweapon/vax)\n\nDr. Kory has seen the amount of vax injuries explode over the last year in his new practice, and he says they are increasing. What does Dr. Kory use for his baseline treatment to combat vaccine injuries? It’s Ivermectin, but the medical community is not pushing this life saving treatment, and many are saying it’s ineffective and unsafe — a total lie. This is why Dr. Kory is coming out with a book in April called “The War on Ivermectin.”\n\nDr. Kory says, “Ivermectin is demonstrably, provably one of the safest medicines in the history of medicine. It is really hard to overdose on Ivermectin, and this gives it a really wide range of dosing. In fact, you could probably take 100 times a standard dose. (Standard dose is 9mgs per 100 pounds.) So, there is a wide dosing range. . . . There has not been one provable documented death with Ivermectin. . . . The safety is unparallel. Even the World Health Organization (WHO) . . . it’s on their list of essential medicines around the world, and they say most side effects are minor. I use it all the time. . . . As a physician, it is such a great medicine to work with because of its safety. You don’t have to worry about Ivermectin. . . . In my practice, we have an evolving array of therapies that work to treat what I call vaccine injury syndrome. Most of the patients that come to see me have syndromes. That is a constellation of symptoms, and that is different than a post-vaccine complication. . . . I see patients that are essentially disabled. The three cardinal symptoms are: severe fatigue . . . post exertional malaise . . . they cannot tolerate physical exertion, and then the third cardinal symptom is what we call brain fog. . . . Those are the three big ones.”\n\nIn closing, Dr. Kory says, “We have a pandemic of the vaccinated. Now, we have millions injured from the (CV19) vaccine for which, in my opinion, Ivermectin is one of the most effective medicines to help them. How are they going to get Ivermectin? How are they going to find a doctor to use Ivermectin?”\n\nDr. Kory answers many questions in the 1-hour and 10-minute in-depth interview.\n\nJoin Greg Hunter as he goes One-on-One with Dr. Pierre Kory, one of the top pulmonary and Covid Critical Care experts on the planet, who is co-founder of the Front Line Covid-19 Critical Care Alliance (flccc.net) and author of the upcoming book “The War on Ivermectin” for 2.7.23.\n\nAll the information is free on the Front Line Covid-19 Critical Care Alliance website flccc.net.\n\nIf you want to preorder Dr. Kory’s book (coming out in October) “The War on Ivermectin,” click here.\n\nTo contact Dr. Pierre Kory, you can reach his CV19 vax injury practice at DrPierreKory.com.\n\nIf you want donate to the FLCCC Alliance, click here.", "opengraph": {}, "tags": ["https://www.britannica.com/topic/realpolitik"], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2023/02/Dr.-Kory-7.9.22-pic.png", "https://usawatchdog.com/", "https://drpierrekory.com/", "https://www.simonandschuster.com/books/War-on-Ivermectin/Pierre-Kory/9781510773868", "https://usawatchdog.com/donations/", "https://usawatchdog.com/wp-content/uploads/2023/02/1aaqaa.png", "https://covid19criticalcare.com/", "https://www.simonandschuster.com/books/War-on-Ivermectin/Pierre-Kory/9781510773868", "https://drpierrekory.com/", "https://covid19criticalcare.com/donate/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-vax-deaths-injuries-are-an-ignored-humanitarian-catastrophe-dr-pierre-kory/", "https://usawatchdog.com/global-cv19-vax-propaganda-means-mass-casualties-dr-pierre-kory/", "https://usawatchdog.com/guilty-are-now-hiding-humanitarian-catastrophe-dr-pierre-kory/", "https://usawatchdog.com/cv19-vax-destroys-hearts-brains-of-billions-of-people-dr-sucharit-bhakdi/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/"], "authors": [], "publish_date": "02/07/2023  •"}