{"result_id": "325005", "URL": "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "timestamp": "2023-04-25 17:48:03 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of the so-called CV19 vaccines. Kingston has uncovered documents that prove everybody knew or should have known the deadly effects of these criminal injections. Kingston says documents with the drug", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Everybody Knew CV-19 Vax Was a Criminal Bioweapon – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of the so-called CV19 vaccines. Kingston has uncovered documents that prove everybody knew or should have known the deadly effects of these criminal injections. Kingston says documents with the drug makers, FDA and CDC listed the deadly and debilitating “side effects” of the injections. Kinston shows that vaccine makers gave a list to the FDA of “side effects” or “possible adverse event outcomes” from the injections. Kinston says, “Common side effects should be muscle aches, headaches, fever and pain. With these injections, common side effects are Guillain-Barre, . . . inflammation of your brain and your spinal cord, meningitis, stroke, narcolepsy, anaphylaxis, heart attack, myocarditis, pericarditis, auto immune disease, death, pregnancy and birth outcomes, fetal injuries, fetal mutations, spontaneous abortion. . . and vaccine enhanced disease. . . . So, they knew this was not mild side effects. . . . This is not me speaking. This is literally their documents. . . .This information is just the tip of the iceberg, which show how really sick and perverse these CV19 injections are.”\n\nKingston asks, “How much longer are doctors going to defend the safety of these injections? Why are people not waking up? Their trusted leaders and their family doctors are telling them these mRNA injections are safe and effective. . . . In legal terms, it is the definition of extrinsic fraud. . . . These are gene editing technologies, and the FDA does not have the right to call these injections a vaccine. They are not even gene therapies because they cause disease, disabilities and death. . . . They are bioweapons.”\n\nKingston goes on to say, “This is fraud. The claim that these injections are safe and effective are all based on fraud. It is blatant misrepresentation of facts to the American people. This was parroted and repeated to the American people through the mainstream media as well as through all of the healthcare organizations. We are in a real pickle, we really are because those who know the truth are being hammered down, myself included. This is premeditated battery and murder of adults and children. They knew what was going to happen, and they authorized it any way. Keep in mind, your entire medical industrial complex, which includes your local family practitioner, nurses and pediatricians, went along with it. Why? If they were not getting large financial incentives and being pressured to go along with it, they would have never stuck these shots in people’s arms. . . . They were getting peer pressure, and everyone else was doing it. So, how bad could it be? We can’t get caught if we all agree to the lie. Again, this is called extrinsic fraud. Extrinsic fraud is brought against a large population or party when there are many people involved. This is exactly what has happened with these mRNA injections, which are bioweapons. . . . It is a group of people who are all in a club together who agreed to go along with the lie. They got financial incentives, which gave them additional power. . . . They followed the orders of tyranny believing they were going to get away with it. They went against our God-given rights, and they think they are going to get away with it with no costs because they are all in agreement together. They let other people suffer for their gain, and they don’t have to lose their jobs, and they don’t have to miss out on these financial incentives called Covid19. That’s what has happened.”\n\nIn closing, Kingston says, “Look, they are burning down the house with you and the baby in it. My concern is that people have been told nothing can stop what is coming. . . . They are going to do what they attempted to do for centuries. . . . We are going to exterminate a lot of humans and enslave the rest of them. . . . There are too many people in power who have been bought and sold. . . . A crime has been brought against all Americans and all of humanity. We have to stand in the truth, and truth in evidence and God and not false idols. I think a lot of people know that they have been fooled, but they have been told you might as well go along with this until the ride is over.”\n\nThere is much more in the 1-hour and 7-minute presentation.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she gives a mind-blowing update on the bioweapon injections for 12.3.22.\n\nTo look at some of the data and documents Kingston shows to prove the CV19 vax is a criminal act of releasing a bioweapon on an unsuspecting public, go to the [email protected]\n\nTo support Kingston financially, you can become a subscriber by clicking here.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/12/Karen-Kingston-12.3.22-pic.png", "https://usawatchdog.com/", "https://karenkingston.substack.com/p/intended-consequences-mrna-vaccines?utm_source=post-email-title&publication_id=1103773&post_id=87587260&isFreemail=true&utm_medium=email", "https://karenkingston.substack.com/", "https://usawatchdog.com/donations/", "https://karenkingston.substack.com/", "https://karenkingston.substack.com/subscribe?utm_source=menu&simple=true&next=https%3A%2F%2Fkarenkingston.substack.com%2F", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/"], "authors": [], "publish_date": "12/03/2022  •"}