{"result_id": "325040", "URL": "https://usawatchdog.com/cv19-virus-vax-about-control-not-health-dr-michael-yeadon/", "timestamp": "2023-04-25 17:48:40 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. Michael Yeadon was a chief scientist in drug discovery research and also a VP at Pfizer for 20 years. He has been sounding the alarm about the Covid “lies” being told and warning the so-called vaccines for CV19 are “neither safe or effective.” Yeadon contends the entire Covid plandemic is", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-virus-vax-about-control-not-health-dr-michael-yeadon/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Virus & Vax About Control Not Health – Dr. Michael Yeadon | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Michael Yeadon was a chief scientist in drug discovery research and also a VP at Pfizer for 20 years. He has been sounding the alarm about the Covid “lies” being told and warning the so-called vaccines for CV19 are “neither safe or effective.” Yeadon contends the entire Covid plandemic is just a piece of the puzzle in a much wider plan by “evil” globalists. Yeadon contends, “Governments all around the world have lied to their people in the same set of absurd ways simultaneously. So, it’s not a mistake. It’s not copycat because it’s so obviously stupid that if a neighboring country did it and you weren’t in on it, you would say I don’t want to do that, it’s literally absurd, and yet every country except Sweden did it. . . . Pretty much all the countries of the world did the same absurd things at the same time. The reason why I have said this repeatedly is you will not get stronger evidence of ‘Super-National’ evidence behind the scenes. There ain’t no way this happens by telepathy . . . They must have agreed to do this.”\n\nWhen will the medical tyranny be over? Dr. Yeadon says, “It’s never going to be over. . . . Why would they do this? I think it’s to end the model of free humanity. It’s literally going to do that. It’s going to smash the currency, and that will bring an end to the economic system that has taken 300 or 400 years to build, and we don’t have a suitable replacement. Let’s say the currency does not buy anything. What will governments do? Let them starve or ration the food that is remaining? I think they will do the latter, and then they will need an ID system to make sure you don’t get two rations. You see where this is going? I think this was designed to end the world we just came out of. The objective is control. It’s not about money. . . . It’s not about to make a bit more loot out of our hides. I am not saying some people have not made money. Yes, they have, but is it the driving underlying motive? I don’t think it is in any way, shape or form. It’s control. How would they get control? I think ultimately by marking you with a vaccine, and you don’t need a vaccine.”\n\nOn the mRNA first-of-a-kind gene therapy vaccines, Dr. Yeadon, who was chief Pfizer scientist in drug discovery research, warns, “We have no mass market so-called gene-based vaccines. They use DNA and messenger RNA to encode a piece of the virus, and then it hijacks your cells to become factories for a bit of the virus. There is no precedent for that whatsoever. It’s a hideous, dangerous thing. Why? I describe it like a little go-cart or racing cart. The engine is running, and someone puts a big house brick on the throttle and then lets it go. That’s like these gene-based vaccines. There is no off switch! Some people will make lots and lots of whatever it’s coding, which is the virus or spike protein. They will make loads of it for ages. . . . none of the manufacturers were required to study how long their material would stay in the body. . . . So, when people rolled up their sleeve, my word, they were trusting. I read the packages, and I said I am not going to have this stuff . . . When they say the CV19 vax is safe, I say you have no idea if it is safe. You have literally not done the experiments.”\n\nDr. Yeadon also talks about Monkey Pox, more lies on future vaccines, mass murder and the fight we face, which Dr. Yeadon describes as, “It’s evil what has gone on, and I do think this is a diabolical push.”\n\nThere is much more in the in-depth 1 hour and 18 minute interview.\n\nJoin Greg Hunter as he talks to Dr. Michael Yeadon, former 20-year Pfizer VP, as he explains why the so-called CV19 vax is “dangerous,” “not effective” and is “being used for control,” not your health.\n\nDr. Yeadon has written what he calls “The 12 Lies of Covid.” Click here to read it for free.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/05/Dr.-Mike-Yeadon-5.24.22-pic.png", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://home.solari.com/doctors-for-covid-ethics-the-covid-lies/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/proven-ion-virus-germ-killing-tech-blocked-by-dark-powers-weston-warren/", "https://usawatchdog.com/abortion-at-center-of-evil-control-over-usa-bo-polny/", "https://usawatchdog.com/mysterious-vax-deaths-gun-control-diversion-food-crisis/", "https://usawatchdog.com/financial-system-lawless-criminal-control-syndicate-catherine-austin-fitts/"], "authors": [], "publish_date": "05/24/2022  •"}