{"result_id": "325016", "URL": "https://usawatchdog.com/fda-documents-show-cv19-vax-produces-a-bioweapon-karen-kingston/", "timestamp": "2023-04-25 17:48:14 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Karen Kingston is a former Pfizer employee and top biotech analyst who has researched and written about many cutting edge pharmaceutical issues. Kingston contends the so-called vaccines are in fact bioweapons and she can prove it with the FDA’s own data Kingston also says the FDA’s own research", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/fda-documents-show-cv19-vax-produces-a-bioweapon-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "FDA Documents Show CV19 Vax Produces a Bioweapon – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a former Pfizer employee and top biotech analyst who has researched and written about many cutting edge pharmaceutical issues. Kingston contends the so-called vaccines are in fact bioweapons and she can prove it with the FDA’s own data Kingston also says the FDA’s own research shows they have known it is the vax bioweapons that have caused all the deaths and injuries. Kingston explains, “More people got Covid 19 (from the vax) than they got from placebos, but they pulled 409 people out of the vaccine group because now they are saying that was a side effect. The side effect is the disease. The FDA document is incriminating evidence. If Janet Woodcock (Janet Woodcock is the Acting Commissioner of the FDA) would read this in front of the Senate, she should be put in handcuffs for conspiring to commit aggravated assault and murder of American children and adults through poison. . . .They are calling them side effects. When you have a meeting two months before you approve and you list a bunch of severe chronic diseases that induce morbidity and mortality in children and adults, and you say you know this is going to happen, that is not a side effect. That is an intended consequence. That is the effect of the vaccines. The effect of the vaccines is to cause havoc within your immune system. That immune imbalance results in heart attacks, heart inflammation; it results in neurological disorders ranging from fatigue to paralysis to brain fog to rapid onset to disorders, to narcolepsy, to death, to pregnancy stillborns, birth defects and miscarriages. They knew this was going to happen. In the FDA data for Pfizer, they say, look, more people got Covid 19 that got vaccinated. They said that was a side effect. It is not a side effect–it is the effect. . . . The majority of people are in agreement that the Wuhan lab spike protein that was put up on the genome web January 10th of last year is a bioweapon. If you read the FDA approval letter, what is the vaccines’ ingredients? It is the synthetic mRNA code, the computer-generated artificial intelligence generated code, which was injected in your body that produces, and I am telling you this verbatim, it says it produces the ‘Wuhan-Hu-1 full sequence spike protein from genome web.’ It says in the (FDA) approval letter the vaccine produces the bioweapon. It says in the data that more people are getting Covid19 from the vaccine than from not being treated. People say I should be an expert witness. I don’t need to be an expert witness. We just need the FDA to read their own documents.”\n\nIn closing, Kingston says, “I think we can work with science at the molecular level to heal this, but if people don’t know they are sick, then millions of Americans are going to die and our children are going to be part of this sacrifice. I am filled with deep, deep sorrow.”\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she blows the lid off the FDA authorized CV19 bioweapon. (11.06.21)\n\nIf you want to see the documents that Kingston was referring to in the interview click here.\n\nKingston has sacrificed much to bring you the truth and analysis that few people can give about the complicated biotech industry. Kingston is being punished and shunned by Big Pharma that is freezing her out of work for blowing the whistle. Please support the truth-tellers, so the truth will continue to be told.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/11/Karen-Kingston-11.6.21-pic.png", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://drive.google.com/file/d/17a3IE0Wi6hJAdDPkanQMGtbPTc4uxpfv/view", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/"], "authors": [], "publish_date": "11/06/2021  •"}