{"result_id": "325036", "URL": "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/", "timestamp": "2023-04-25 17:48:35 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Dr. Elizabeth (Betsy) Eads is back to update us from the frontlines of medicine and the growing problems of CV19 vax induced AIDS (acquired immunodeficiency syndrome). Dr. Eads is treating patients who have been injected with the experimental CV19 so-called “vaccines,” and new data is showing the injections", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Vax Causing Extreme Disease – Dr. Betsy Eads | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Elizabeth (Betsy) Eads is back to update us from the frontlines of medicine and the growing problems of CV19 vax induced AIDS (acquired immunodeficiency syndrome). Dr. Eads is treating patients who have been injected with the experimental CV19 so-called “vaccines,” and new data is showing the injections are causing the explosion of many types of extreme disease. We start with a recent patient Dr. Eads has that got her CV19 booster, and not long after that got cancer. Dr. Eads says, “I basically told her this is most likely vaccine induced cancer. We know cancers are up, according to Dr. Ryan Cole and several other pathologists . . . They are up close to 2,000%. . . . I told her to find an oncologist . . . who is awake to those types of aggressive cancers. I am seeing a lot of unusual cancers, and so is Dr. Ryan Cole.”\n\nDr. Eads says the CV19 vaccines are causing a form of AIDS (acquired immunodeficiency syndrome). Dr. Eads explains, “It’s a common misconception that acquired immune deficiency is only caused by HIV. It’s simply not true. There are other secondary reasons for AIDS. I am going to read a few to you: Radiation and chemotherapy, of course, HIV, Leukemia, malnutrition, drugs, medications and now vaccines are included.”\n\nThe DOD is also seeing exploding illness in the military population that started after our service men and women were coerced to be injected. Dr. Eads says, “Let me read you the latest Department of Defense numbers, and these just came out: “Myocarditis is up 2,800%, cancer is up 900%, infertility both genders is up 500%, miscarriage is up 300%, neurological disorders are up over 1,000%, demyelinating disorders are up over 1,000%, Multiple Sclerosis is up 600%, Guillain-Barré, which is a progressive paralysis, that’s up 500%, HIV is up 500%, pulmonary embolism, which are blood clots in the lungs, are up over 400%. Those are the equivalent of the VAERS (Vaccine Adverse Event Reporting System) for the Department of Defense.”\n\nDr. Eads says there are treatments for vax injury, but Dr. Eads says totally stopping the ill effects from the CV19 injections are not known. Dr. Eads says, “We don’t know what the mechanism is to turn this off. Right now, there is no way documented to turn that off. So, if you got the Pfizer or the Moderna, that mRNA is going to continue to make spike protein. We do not know the endpoint. We need to study this, and we are in the process of doing that. . . . but we know the effect of the spike protein on the immune system and the fact it is dysregulating . . .and causing cancers. We are two years out, and my feeling is we are going to continue to have spike proteins made over the next x-number of years until we figure a way to turn off the lipid nano mRNA envelope.”\n\nJoin Greg Hunter as he talks to 25-year veteran Dr. Elizabeth Eads, DO, as she continues to highlight the real unreported effects of the CV19 bioweapons.\n\nYou can follow Dr. Elizabeth (Betsy) Eads on Twitter or you can follow her on Telegram.\n\nFor the Stanford study finding spike proteins 60 days after the CV19 vax, click here.\n\nFor the Expose’ story on the young in the UK and U.S. getting sick after the CV19 vax, click here.\n\nFor the UK Gov. information on permanent damage to the immune system after the CV19 vax, click here.\n\nClick here for the Bioweapons used in Ukraine against Russia we did not get to in the interview.\n\nFor the latest on criminal prosecutions on creators and facilitators of the CV19 bioweapon and murderous so-called “vaccines,” click here. (This is only 11 mins. long and well worth the listen.)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/05/Dr-Betsy-Eads-pic-5.21.22.png", "https://usawatchdog.com/", "https://t.me/Dr_BetsyChannel", "https://usawatchdog.com/donations/", "https://twitter.com/eads_elizabeth", "https://t.me/Dr_BetsyChannel", "https://www.cell.com/cell/fulltext/S0092-8674(22)00076-9", "https://expose-news.com/2022/05/17/covid-jabs-increase-risk-heart-attack-death-young-adults/", "https://halturnerradioshow.com/index.php/en/news-page/world/british-government-admits-covid-19-vaccines-permanently-damage-natural-immune-system", "https://russiaun.ru/en/news/unsc_130522", "https://rumble.com/v153ybt-dr.-david-e-martin-gives-explosive-jaw-dropping-information-in-canadian-zoo.html", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/at-least-1-billion-dead-or-disabled-from-cv19-bioweapon-dr-betsy-eads/", "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/unpayable-debt-vax-causing-hell-on-earth-ed-dowd/", "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/"], "authors": [], "publish_date": "05/21/2022  •"}