{"result_id": "325024", "URL": "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/", "timestamp": "2023-04-25 17:48:23 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of Covid 19 and the so-called vaccines. Kinston has long said both covid and the vax were nothing more than bioweapons, and this past week in a first ever ‘Gain-of-Function’", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Vax Nothing Short of Horrific Experiment – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of Covid 19 and the so-called vaccines. Kinston has long said both covid and the vax were nothing more than bioweapons, and this past week in a first ever ‘Gain-of-Function’ Senate hearing, medical experts testifying agreed the CV19 virus was a bioweapon. Kingston explains, “Specifically, they said the work that is done in ‘Gain-of-Function’ (CV19 and other deadly viruses being weaponized now) in the laboratory is strictly for war and the development of bioweapons. These are military grade weapons. Dr. Kevin Esvelt said, ‘”The problem is that we are so used to thinking of pandemics as a health and safety issue that we have missed the national security implications of identifying viruses that could be deliberately unleashed to kill millions of people. . . .’”\n\nKingston says the so-called “vaccines” treating CV19 are also “bioweapons,” and Big Pharma has been given a free hand with zero liability to have human experiments. It’s all made possible by the “Emergency Use Authorization” (EUA) approved by Congress through the laws it passed. Kingston contends, “The Food and Drug Consumer Protection Act requires a 10-year timeline for most drugs and vaccines, and a 15-year timeline for viral gene-based therapies, which is what theses (CV19 vaccines) are. These were brought to market in 10 months, less than a year. So, this is nothing short of a horrific experiment on the American people. . . . These mRNA injections created new markets for Big Pharma. On top of that, this lipid nanoparticle technology is so dangerous, as is the mRNA, that it never would have gone through our consumer protection act laws, which are 10 to 15 years to bring the product to market. So, they need to declare an emergency just like 9/11 where they overrode our privacy laws. They needed to override our drug safety laws in order to bring these products forward. . . . They are a trillion dollar market every year. . . . In order for them to sustain this for mRNA and lipid nanoparticle technology and that is combined, well, that market can’t survive or thrive under the current FDA laws. They need everything constantly to be under ‘Emergency Use Authorization.’ . . . .They need to go straight to humans by simply saying this may work and it may be effective.”\n\nNow, we know the CV19 injections are not effective with Dr. Fauci and President Biden getting a total of four so-called “vaccines” each, and both still recently getting Covid. Even Dr. Deborah Brix, who was one of the top Doctors on the Covid response team in the White House, now says, ‘I knew these vaccines were not going to protect against infection. And I think we overplayed the vaccines. . .’ After nearly 600 million doses of CV19 vax in America alone, Dr. Birx admits she never thought the Vax would work?? What gives? Kingston says, “There are some things called non-prosecution agreements and plea bargaining when you are going to be brought in as an expert witness. . . . This would appear to be a plea-bargaining agreement from a legal perspective, I would say. So, this is why she is coming forward, and likely she is having her sentence reduced for coming forward and telling the American public the truth about what happened.”\n\nKingston says the death totals and injury totals will be “significantly higher in the next five years,” because of the CV19 bioweapons being passed off as vaccines. Kingston would not give a hard number. Kingston also predicted, “I think the infertility number is going to be jaw-dropping because these injections were designed to target women’s ovaries. They were also designed to target the male reproductive system, as well. I think that is going to be very, very alarming.”\n\nThere is much more in the 50-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she updates us about the bioweapon injections being forced on people, 8.06.22.\n\nPlease help support the Truth Tellers. If you want to donate to Kingston so she can continue informing the public, please click here.\n\nTo look as some of the data and documents Kingston shows to prove the CV19 vax is a bioweapon, click here.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/08/Karen-Kingston-8.6.22-pic.png", "https://usawatchdog.com/", "https://www.c-span.org/video/?522133-1/hearing-virus-research-funding", "https://www.foxnews.com/media/dr-deborah-birx-knew-covid-vaccines-not-protect-against-infection", "https://www.bloomberg.com/graphics/covid-vaccine-tracker-global-distribution/", "https://usawatchdog.com/donations/", "https://www.givesendgo.com/kingston", "https://qrcgcustomers.s3-eu-west-1.amazonaws.com/account17374898/26325178_1.pdf?0.40131390972122594", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/trump-cv19-vax-contract-violated-by-pfizer-karen-kingston/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/"], "authors": [], "publish_date": "08/06/2022  •"}