{"result_id": "325028", "URL": "https://usawatchdog.com/up-to-700-million-worldwide-will-die-from-cv19-vax-by-2028-dr-david-martin/", "timestamp": "2023-04-25 17:48:28 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. David Martin has a deep medical science and investment resume. Dr Martin also runs a company (M·CAM International) that finances cutting edge innovation worldwide. He is also one of the key people seeking justice in lawsuits suing medical companies and the federal government involved in delivering the so-called vaccines", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/up-to-700-million-worldwide-will-die-from-cv19-vax-by-2028-dr-david-martin/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "700 Million Worldwide Will Die from CV19 Vax by 2028 – Dr. David Martin | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. David Martin has a deep medical science and investment resume. Dr Martin also runs a company (M·CAM International) that finances cutting edge innovation worldwide. He is also one of the key people seeking justice in lawsuits suing medical companies and the federal government involved in delivering the so-called vaccines for CV19. In simple terms, according to Dr. Martin, the CV19 vaccines are “bioweapons.” Big Pharma and the government knew it and also knew it would cause massive deaths and permanent injuries. Dr. Martin says, “It’s going to get much worse. . . . It is not a Corona virus vaccine. It is a spike protein instruction to make the human body produce a toxin. . . . The fact of the matter is the injections are an act of bioweapons and bioterrorism. They are not a public health measure. The facts are very simple. This was premeditated. . . . This was a campaign of domestic terror to get the public to accept the universal vaccine platform using a known biological weapon. That is their own words and not my interpretation.”\n\nHow many will die from the CV19 bioweapons? Dr. Martin says, “By their own estimate, they are looking for 700 million people globally, and that would put the U.S. participation in that of the injected population as 75 million to 100 million people. . . . There are a lot of reasons why they hope it will be between now and 2028 because there is this tiny little glitch of the illiquidity of the Social Security, Medicare and Medicaid programs. So, the fewer recipients of Social Security, Medicare and Medicaid, the better. Not surprisingly, the recommendation was people over the age of 65 were the first ones to get injected.”\n\nDr. Martin thinks the catastrophic effects of the CV19 injections will hit the medical industry soon. Dr. Martin explains, “The dirty secret is . . . there are a lot of pilots having micro vascular and clotting problems, and that keeps them out of the cockpit, which is a good place to not have them if they are going to throw a clot for a stroke or a heart attack. The problem is we are going to see that exact same phenomenon in the healthcare industry and at a much larger scale. So, we now have, along with the actual problem . . . of people getting sick and people dying, we actually have that targeting the healthcare industry writ large. Which means we are going to have nurses and doctors who are going to be among the sick and dead. That also means the sick and the dying are also not going to get care.”\n\nDr. Martin and his group are suing everybody from President Biden along with the FDA, CDC, Pfizer, Moderna and many others over the deaths and injuries from the CV19 bioweapons fraudulently passed off as “vaccines.” The next big court case is July 6, 2022, in federal court in Utah. Dr. Martin contends “this is far worse” than the Nuremberg trials of Nazis after WWII and adds, “This is organized crime. . . . They have hidden behind the immunity shield that absolves them of product liability by naming the delivery of a bioweapon–a vaccination program. . . . This is actually a criminal act. This is an act of domestic terror, and it is an anti-trust violation. This is racketeering. This is old school racketeering, and it is no different than the mob in the 1920’s. This is old school racketeering for personal gain and profit at the expense of human lives. You need to call it what it is, and it’s organized crime. I would say the Nazis were better than the people who are doing this. . . . The real question is why did American citizens develop a weapon to kill Americans and get paid to do it? That is a morally outrageous question, and, unfortunately, almost no one is asking it.”\n\nThere is much more in the 1-hour and 3-minute interview.\n\nJoin Greg Hunter od USAWatchdog.com as he interviews Dr. David Martin, the top expert in the ongoing and unfolding CV19 vax genocide and litigation for 6.21.22.\n\nYou can follow the CV19 vax cases at ProsecuteNow.io\n\nIf you would like to make a donation to fund the court cases against Big Pharma and the federal government over CV19 bioweapons, click here.\n\nYou can follow Dr. Martin on DavidMartin.world or FullyLiveAcademy.com.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/06/Dr.-David-martin-pic-6.21.22.png", "https://usawatchdog.com/", "https://prosecutenow.io/", "https://www.davidmartin.world/", "https://usawatchdog.com/donations/", "https://prosecutenow.io/", "https://www.fullyliveacademy.com/donate", "https://www.davidmartin.world/", "https://www.fullyliveacademy.com/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/40-million-in-us-west-without-water-in-2023-dane-wigington/", "https://usawatchdog.com/god-will-act-against-worldwide-swamp-bo-polny/", "https://usawatchdog.com/the-west-needs-wwiii-martin-armstrong/", "https://usawatchdog.com/there-may-not-be-a-2024-election-martin-armstrong/"], "authors": [], "publish_date": "06/28/2022  •"}