{"result_id": "325023", "URL": "https://usawatchdog.com/millions-get-aids-from-vax-by-fall-dr-elizabeth-eads/", "timestamp": "2023-04-25 17:48:22 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. Elizabeth Eads is on the frontline of medicine, treating patients who have been injected with the experimental CV19 so-called “vaccines.” Dr. Eads is now seeing first-hand Acquired Immunodeficiency Syndrome, commonly referred to as AIDS. Let that sink in. Dr. Eads explains, “Yes, we are seeing vaccine related acquired immunodeficiency in", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/millions-get-aids-from-vax-by-fall-dr-elizabeth-eads/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Millions get AIDS from Vax by Fall – Dr. Elizabeth Eads | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Elizabeth Eads is on the frontline of medicine, treating patients who have been injected with the experimental CV19 so-called “vaccines.” Dr. Eads is now seeing first-hand Acquired Immunodeficiency Syndrome, commonly referred to as AIDS. Let that sink in. Dr. Eads explains, “Yes, we are seeing vaccine related acquired immunodeficiency in the hospital now from the triple vaxed. . . . It is a vax injury, and we are not really certain how to treat this. We are kind of throwing the kitchen sink at it. . . . .We are trying to use everything we can think of to boost up the CD4 and CD8 counts and reverse this collapse or calamity of this immune collapse. It’s very stunning.”\n\nDr. Eads says it is particularly bad in the double CV19 vaxed and boosted. She calls the third injection “The Kill Shot, the Money Ball or whatever you want to call it. It is just devastating to the immune system, and I’ll tell you why. If you look at the recent Stanford study, and I am just going to read a couple of sentences from the Stanford study: ‘The spike protein in the CV19 vaccines that everyone is talking about is called the Lentivirus. The Lenti contains a combination of HIV, types one through three, SRV/1, which is AIDS, MERS and SARS. In the Stanford study, the best-known Lentivirus is the human immune deficiency pathogen, which causes AIDS. This is why we are seeing autoimmune and neurodegenerative decline after the Covid 19 (Vax) especially the booster. . . . It permanently changes the genome of the cell. That is why this is so terrifying to us in the medical community. We just don’t know how to attack this.”\n\nThere is a similar report out last week by the UK government that also points to the triple vaxed getting AIDS. So, the CV19 vaccines are actually injecting people with AIDS? Dr. Eads says, “That is exactly what I am telling you. That is what the Spike Lentivirus is. It is made up of HIV and AIDS along with SARS and MERS. That’s why the vaccinated and boosted are so sick. That’s why they dominate the hospitalizations regarding Covid illness as well.”\n\nBecause the immune system is depleted, many kinds of disease such as cancer can spread like wildfire. Dr. Ryan Cole says he’s seeing cancer up as much as 2,000% from the vaccines. Eads says, “I have some stunning numbers from the Defense Medical Epidemiology Database (DMED) . . . . I am just going to read a few cancers: malignant neo-plasma of the esophagus up 794%. malignant neo-plasma of the stomach, colon and pancreas up 524%. Breast cancer up 387%. . . . Ovarian cancer up 537%, Testicular cancer up 269%. These are numbers from 2021. . . . When they found out attorney Thomas Renz and the whistleblower had the data, they scrubbed the data and altered it, which is totally against the law.”\n\nDr. Eads is treating vaxed and unvaxed in her practice. She will tell you what you can do to help yourself, especially if you have been vaxed. Dr. Eads talks about the ongoing propaganda to get you to take the so-called boosters. Dr. Eads explains why you should stop all CV19 shots now. Dr. Eads also contends there is a huge disinformation campaign going on to make you think the CV19 shots are safe and not causing blood clots, heart attacks, strokes, cancer and a host of other diseases–including AIDS.\n\nJoin Greg Hunter as he talks to 25-year veteran Dr. Elizabeth Eads as she continues to highlight the real unreported effects of the CV19 bioweapons and the dangerous lies by Big Pharma, the FDA, CDC and mainstream media.\n\nYou can follow Dr. Elizabeth (Betsy) Eads on Twitter or you can follow her on Telegram.\n\nThis segment is sponsored by Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/03/Dr.-Elizabeth-Eads-pic-3.22.22.png", "https://usawatchdog.com/donations/", "https://dailyexpose.uk/2022/03/13/gov-report-proves-triple-vaccinated-have-ade/", "https://www.ronjohnson.senate.gov/2022/2/sen-johnson-to-secretary-austin-has-dod-seen-an-increase-in-medical-diagnoses-among-military-personnel", "https://usawatchdog.com/donations/", "https://twitter.com/eads_elizabeth", "https://t.me/Dr_BetsyChannel", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/", "https://usawatchdog.com/millions-about-to-lose-everything-bo-polny/", "https://usawatchdog.com/nightmare-fall-of-united-states-martin-armstrong/", "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/", "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/"], "authors": [], "publish_date": "03/23/2022  •"}