{"result_id": "325029", "URL": "https://usawatchdog.com/fda-cdc-lying-about-vax-deaths-injuries-mark-skidmore/", "timestamp": "2023-04-25 17:48:28 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Michigan State University Economics Professor Mark Skidmore is an expert in public finance and policy evaluation. About this time last year, Dr. Skidmore identified a public policy to withhold lifesaving CV19 drugs such as hydroxychloroquine (HCQ) that cost at least 100,000 needless deaths. Skidmore is out with a new report that", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/fda-cdc-lying-about-vax-deaths-injuries-mark-skidmore/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "FDA, CDC Lying About Vax Deaths & Injuries – Mark Skidmore | Greg Hunter’s USAWatchdog", "cleaned_text": "Michigan State University Economics Professor Mark Skidmore is an expert in public finance and policy evaluation. About this time last year, Dr. Skidmore identified a public policy to withhold lifesaving CV19 drugs such as hydroxychloroquine (HCQ) that cost at least 100,000 needless deaths. Skidmore is out with a new report that says at least 1.4 million have been killed or seriously injured, so far, from the CV19 injections. Dr. Skidmore contends the FDA and CDC are covering up serious danger and harm being done to people. Dr. Skidmore explains, “We need actual scientific studies, but we are not getting them. . . . If the FDA and CDC are only claiming 9 fatalities from the (CV19) vaccine, then clearly that is not the truth. The Pfizer documents show that (1,200 vax deaths reported to Pfizer early on). The DOD data . . . shows that. The VAERS data shows that. Then I have my survey (with about 300,000 vax deaths) that adds to this growing evidence. Then you look at all the soccer players, and the rate of collapses and fatalities among professional soccer players is four times anything we have ever seen before. The Orange County, California, school district is now requiring a heart examination, including an EKG in order to participate in athletics. Why does a 17-year-old healthy person need an EKG?”\n\nDr. Skidmore points out a serious loss of confidence in the watchdog agencies overseeing everything Covid. Dr. Skidmore says, “The FDA and CDC official stance is there has been only 9 fatalities from the inoculation. We have overwhelming evidence it is far more than that. So, you know they are not telling the truth there. If they are not telling the truth there, then what else are they not telling the truth about? Then you go down the rabbit hole, and it’s very troubling. It’s an enormous societal problem for us to wrap our minds around that these institutions are compromised. Then you have to go about how to operate in a world where that is true. How do you get good information? . . . One of the things in the study is if you listened to mainstream media or official government sources, you were far more likely to be inoculated. If you listened to alternative media, you were less likely to be inoculated. So, what’s a good source? That’s the question we have now.”\n\nDr. Skidmore also found out that people who watched a family member or friend have a death or bad reaction to the so-called vaccines were highly likely not to get the CV19 inoculation. Skidmore also says, “The government says 76% have got the inoculation, but in my study, it is closer to 50%.”\n\nSkidmore says people witnessing a bad inoculation reaction likely kept the actual number of vaxed to be much lower than the Biden/Obama Administration was hoping for.\n\nDr. Skidmore says the trend is for increasing death and injuries from the CV19 inoculations. Skidmore uses the term “inoculation” because he says “it’s not a vaccine, it’s gene therapy. They changed the definition of ‘vaccine’ to accommodate this experiment. . . . So, I use the term ‘inoculation,’ and I explain this in my paper.”\n\nDr. Skidmore’s new cutting-edge original work is called “How Many People Died from the Covid-19 Inoculations?”\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with Michigan State University Professor Mark Skidmore, founder of Lighthouse Economics. (There is much more in the 57-minute interview.)\n\nDr. Skidmore has a website called Lighthouse Economics, and you can find it at Mark-Skidmore.com. Dr. Skidmore is a prolific writer, and his work and analysis are free to the public.\n\nTo read Dr. Skidmore’s latest work called “How Many People Died from the Covid-19 Inoculations?” click here.\n\nTo donate by snail mail, use the address below: (This is the only way to support Dr. Skidmore at this time.)\n\nThis segment is sponsored by Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/03/Mark-Skidmore-3.15.22-pic.png", "https://usawatchdog.com/donations/", "https://mark-skidmore.com/2022/02/15/how-many-people-died-from-the-covid-19-inoculations/", "https://mark-skidmore.com/", "https://usawatchdog.com/donations/", "https://mark-skidmore.com/", "https://mark-skidmore.com/2022/02/15/how-many-people-died-from-the-covid-19-inoculations/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-vax-deaths-injuries-are-an-ignored-humanitarian-catastrophe-dr-pierre-kory/", "https://usawatchdog.com/mysterious-vax-deaths-gun-control-diversion-food-crisis/", "https://usawatchdog.com/guidestones-blown-up-vax-deaths-blow-up-economy-blows-up/", "https://usawatchdog.com/dem-gun-confiscation-nato-war-more-unexpected-deaths-economy-tanking/", "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/"], "authors": [], "publish_date": "03/15/2022  •"}