{"result_id": "325032", "URL": "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "timestamp": "2023-04-25 17:48:31 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of Covid 19 and the so-called vaccines. Her long-standing position is the entire CV19 plandemic was, in fact, a manmade bioweapon from infection to injection. Kingston has now found all the patents to", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 AI Bioweapon from Infection to Injection -Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of Covid 19 and the so-called vaccines. Her long-standing position is the entire CV19 plandemic was, in fact, a manmade bioweapon from infection to injection. Kingston has now found all the patents to prove that the CV19 vaccines are made to destroy humanity. Kinston is back again with a mind-blowing update on extremely advanced medical technology that has already been injected 600 million times alone into unsuspecting Americans. Kingston explains, “This is an AI (artificial intelligence) bioweapon. It is part technology and part biology. It is designed to hijack the human genome. It can be used to experiment on humans, and it can also be used to exterminate them. We are walking around calling it a vaccine, and this needs to stop immediately. . . . There is an advanced technology called Qdot and lipid nanoparticles that is in these injections. Under EUA law (Emergency Use Authorization) . . .under premarket application, the user, inventor or applicant does not have to disclose the technology if it is not of public purview. This patent for Qdot was made a trade secret . . . and it was a trade secret, and that means they did not have to disclose it. Once that FDA approval happened on August 23, (for Comirnaty) they had two weeks to disclose it, and somehow or another all of America and the globe were convinced that it really didn’t happen. Read my Substack. It absolutely happened, all the documentation is there. . . . So, what is going on with the children is nothing more than aggravated assault, murder and experimentation. It’s way worse than what happened in the camps in Nazi Germany, and I am not being hyperbolic. It’s time we stop being deceived by these lies.”\n\nKingston says the CV19 injections are not just extremely deadly and dangerous, but demonic technology. Kingston says, “The former head of infectious disease at Moderna states ‘The devil is absolutely in the details’ as far as lipid nanoparticles are concerned. He’s telling us they are working with demonic technology. The takeaway of this article (posted on Kingston’s Substack) is that mRNA molecules are so fragile that they can’t get into cells on their own. They need lipid nanoparticles. That means the SARS‑CoV‑2 virus . . . could never get into your body on its own. It needs this technology. . . . They took biology and they merged it with technology. . . .This technology is infecting us with trillions of spike proteins, which are part biology and part technology. What they are calling spike proteins is a lipid nanoparticle bioweapon backed by artificial intelligence. . . .It’s alive and cognitive, and it is functioning with Quantum dot. This is basically parasitic in nature. That’s what people are shedding, it is this AI bioweapon. When people are removing blood clots, those are bio-synthetic structure parasites. . . .When embalmers remove them, they can continue to develop without the host. They don’t need the human anymore.”\n\nAnother mind-blowing fact is the AI bioweapons injected into the body are activated by light and also 5G frequencies. Kingston explains, “When you look at the patents (also on Kingston’s Substack) it’s based on optics. It’s based on photons or light particles. Quantum dots are in LED lights. It is what gives LEDs their bright colors. It gives your TV bright colors too, and it is in these injections per the patent you can find on Moderna’s website. Good thing I saved a copy of it last year because now they turned it into a trade secret. . . .Before we had 5G, this technology was useless. It was powerless. It cannot be activated without the 5G towers. If fiber optics and 5G technology disappears, so does this demonic AI technology. . . . this can be used for tag, track and trace, and they can be used for more than that. They can be used for control. . . . We are at war, and we are being deceived. We are loving the technology that is going to end up exterminating us. The U.S. military just put up 80 . . . towers with AT&T over the last six months. They are flying up Starlink up into the sky, and this is where all this data goes to. We are being told it is for our military operations and our defense. No. When they activate this stuff ,it will execute our military. It is to execute the American people. There is no good in evil. . . . God’s people can take this stuff down, and if we don’t, God will. That’s the way out of this. This is all activated with optics. . . . Why do we have 5G? It does not benefit us. It is to kill us and spawn this new technology out of our bodies. . . .This technology is the most infectious technology this planet has ever seen. We have all been affected. If we take these stupid LED lights and 5G down, it deactivates the technology. It doesn’t mean you are going to be cured, but it stops it in its tracks.”\n\nThere is much more in the 1-hour and 1-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she gives a mind-blowing update on the bioweapon injections for 10.25.22.\n\nTo support the campaign created by Karen Kingston called “Take Down Covid-19” that will, in part, “STOP all COVID-19 emergency powers and financial funding and ban and recall all COVID-19 products and technologies,” click here.\n\nTo look at some of the data and documents Kingston shows to prove the CV19 vax is a bioweapon, go to the [email protected] To support Kingston financially, you can become a subscriber.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/10/Karen-Kingston-10.25.22-pic-2.png", "https://karenkingston.substack.com/", "https://karenkingston.substack.com/", "https://karenkingston.substack.com/", "https://usawatchdog.com/donations/", "https://www.givesendgo.com/TakedownCOVID19", "https://www.givesendgo.com/TakedownCOVID19", "https://karenkingston.substack.com/", "https://karenkingston.substack.com/subscribe?utm_source=menu&simple=true&next=https%3A%2F%2Fkarenkingston.substack.com%2F", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/"], "authors": [], "publish_date": "10/25/2022  •"}