{"result_id": "325030", "URL": "https://usawatchdog.com/trump-vax-quicksand-musk-tweets-bioweapon-rumors-of-war/", "timestamp": "2023-04-25 17:48:29 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (WNW 562 12.30.22) President Donald Trump doubled down on his pro vax stance in a new interview this week. It looks like Trump has waded into the vax quicksand, and it’s going to take him under if he doesn’t pull out soon. Even though host Wayne Root is firmly anti-CV19 vax,", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/trump-vax-quicksand-musk-tweets-bioweapon-rumors-of-war/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Trump Vax Quicksand, Musk Tweets Bioweapon, Rumors of War | Greg Hunter’s USAWatchdog", "cleaned_text": "President Donald Trump doubled down on his pro vax stance in a new interview this week. It looks like Trump has waded into the vax quicksand, and it’s going to take him under if he doesn’t pull out soon. Even though host Wayne Root is firmly anti-CV19 vax, Trump told him the CV19 bioweapon/vax is a “miracle of modern science” and “saved millions of lives.” Donald Trump cannot back up the claim this bioweapon saved “millions of lives” because bioweapons are designed to maim and kill. That is exactly what this CV19 injection has done and is still doing. Sticking to his guns on the bioweapon passed off as a vaccine is so far afoul of the injury and death data is disturbing for a man who wants to be President again. Before it’s over, I predict President Trump will have to do an about face on the vax. I hope he does not wait too long. With the overwhelming negative scientific evidence on the CV19 bioweapon, I am surprised Trump has not already done so. What good are Trump’s policies if nobody is left alive to enjoy them in 2025? Repent Donald Trump.\n\nElon Musk has taken a wrecking ball to Twitter censorship when he took over as CEO. Now, Musk is tweeting out “Gain-of-Function” with the word “bioweapon.” Musk is saying the CV19 infection was a bioweapon in clear terms. Do you think Musk has been watching Karen Kingston on USAWatchdog? Kingston is calling out everything CV19 from “infection to injection” and saying, “It’s all a lie.” Data and documents show CV19 is, in fact, a man-made military bioweapon. There is no virus, according to biotech analyst Kingston. It’s just lipid nanoparticles or a “biohybrid microrobot.” This is what the Big Pharma patents say, and everybody at the top knows CV19 from “infection to injection” is a bioweapon.\n\nWe have so many “wars and rumors of wars” going on today around the world that the prediction from Jesus, more than 2,000 years ago, is looking more and more like a prophesy coming true. The Pentagon is threatening to kill Putin, according to the Russians. Ukraine is a war with no end in sight, Iran is threatening to nuke Israel, and China is threatening Taiwan on a regular basis. These are just to name a few of the “wars and rumors of wars” happening now.\n\nThere is much more in the 47 min. newscast.\n\nJoin Greg Hunter of USAWatchdog.com as he talks about these stories and more in the final Weekly News Wrap-Up of 2022.\n\nLoy Brunson is the guest for the Saturday Night Post. Brunson will talk about his historic Supreme Court case on the docket next week that could overturn the Election of 2020. A positive Supreme Court ruling on the Brunson case could kick nearly 400 people out of Congress, and also including President Joe Biden and VP Harris.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/12/1aaaaa.png", "https://www.thegatewaypundit.com/2022/12/wayne-root-11th-interview-president-trumpand-anti-covid-vaxx-tv-host-will-always-support-pro-covid-vaxx-president/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://usawatchdog.com/donations/", "https://goldenageofgaia.com/2022/12/12/supreme-court-brunson-v-alma-s-adams-et-al-case-summary-and-timeline/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/j6-committee-treason-bioweapon-vax-deaths-ignored-fed-still-raising-rates/", "https://usawatchdog.com/mccarthy-fails-big-bioweapon-vax-awakening-gold-shining-in-2023/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/"], "authors": [], "publish_date": "12/30/2022  •"}