{"result_id": "325041", "URL": "https://usawatchdog.com/cv19-vaccines-are-poison-karen-kingston/", "timestamp": "2023-04-25 17:48:41 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Post) Karen Kingston is a top pharmaceutical analyst who has researched and written about many cutting edge drugs. She has been ostracized and attacked by Big Pharma because she is speaking out about the great harm being done by the so-called CV19 vaccines. Everything from heart failure, cancer and even", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-vaccines-are-poison-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Vaccines are Poison – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a top pharmaceutical analyst who has researched and written about many cutting edge drugs. She has been ostracized and attacked by Big Pharma because she is speaking out about the great harm being done by the so-called CV19 vaccines. Everything from heart failure, cancer and even ED are just some of the side effects of the vax injections. More and more is coming out about how the “vaccines” are hurting and killing people. Kingston, who has read and studied hundreds of pages of CV19 vaccine patents, says, “They are not vaccines. They are only intended to poison, mutate, cause genetic mutations, and kill adults and children. They contain advanced medical technologies called lipid nanoparticles that are made of hydrogel, which contains graphene oxide (poison to humans). . . . There are strong immunosuppressants, different types of chemotherapies that could suppress your immune system while being injected by something that is going to highjack your immune system . . . . and actually produce this disease causing genetic material that can cause cancers, inflammatory diseases, genetic disorders, infertility and etc. That’s when I cried, not for myself or my family, but for God’s children basically.”\n\nNew research has come out this week from pathologist Dr. Ryan Cole, and he is seeing cancers in the fully vaccinated 20 times higher than normal. Kingston is not surprised and says, “I believe that’s (20 fold increase of cancers) a very conservative estimate as far as the increase of cancers we are going to witness in people who are injected with these ‘Emergency Use Authorization’ injections. What happened with the FDA is they violated their own laws. . . . They actually have to prove that they have done all the tests and prove there is minimal risk to humans. That would be the pre-clinical testing or the animal testing, but they skipped the animal testing . . .”\n\nKingston says another bad side effect of the CV19 vaccinations is Erectile Dysfunction or ED, but it doesn’t stop there. Kingston explains, “Erectile Dysfunction, I believe, is a very common side effect in men with these mRNA vaccines. Why? Because they cause the proliferation or production of spike protein. What do these spike proteins do? . . . They cause blood clotting. According to the FDA, this is called disseminated thrombolytic coagulation. This is a fancy word for blood clots throughout your body and small blood clots. So . . . if your capillaries have small blood clots in them, they will experience Erectile Dysfunction. I believe a lot of men who have been vaccinated are probably experiencing this problem. . . . Some people are sick right now from the vaccines and may not even know it. . . . One of the first symptoms is chronic fatigue syndrome. So, if you are exhausted and you are injected, it is probably a side effect from that injection. This is why I brought up ED. People are considering this to be a lifestyle condition. So, whether it’s ED or exhaustion, they are not attributing it to the vaccine.”\n\nKingston says these side effects are only the beginning of increasing sickness caused by the vaccines.\n\nKingston would not speculate on how many people would die from the CV19 injections, but she did say many fully vaxed people will keep getting sicker. Kingston talks about the unvaxed getting sick from the vaxed. Kingston also talks about natural immunity and what it means. Kingston tells pregnant women not only to not take the injections, but stay away from people who have been fully vaxed.\n\nJoin Greg Hunter as he goes One-on-One with pharmaceutical and medical device analyst Karen Kingston. (9.18.21)\n\nKingston also says she believes that the new cancers and diseases are being created on purpose by Big Pharma. This way they can invent new treatments and drugs for the new diseases being created by the CV19 injections. Kingston says all the new diseases and cancers could mean a new $50 trillion windfall for Big Pharma.\n\nIf you want to follow Karen Kingston, you can do so in LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/09/Karen-Kingston-9.18.21.png", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/trump-cv19-vax-contract-violated-by-pfizer-karen-kingston/"], "authors": [], "publish_date": "09/18/2021  •"}