{"result_id": "325002", "URL": "https://usawatchdog.com/cv19-injections-will-cause-massive-death-dr-elizabeth-eads/", "timestamp": "2023-04-25 17:47:59 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. Elizabeth Eads is on the front line of medicine treating patients who have been injected with the experimental CV19 so-called “vaccines.” Dr. Eads has 25 years of experience in North East Florida hospitals. Dr. Eads contends the injections (or jabs) are not vaccines. They are", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-injections-will-cause-massive-death-dr-elizabeth-eads/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Injections Will Cause Massive Deaths – Dr. Elizabeth Eads | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Elizabeth Eads is on the front line of medicine treating patients who have been injected with the experimental CV19 so-called “vaccines.” Dr. Eads has 25 years of experience in North East Florida hospitals. Dr. Eads contends the injections (or jabs) are not vaccines. They are “bioweapons,” and the jabs are not medicine that is intended to help or cure people. Dr. Eads says, “We are seeing from the jabs all kinds of under-reported side effects. We are seeing infertility in women. We are seeing miscarriages. We are seeing myocarditis, pericarditis, pulmonary embolisms and blood clots everywhere in the body. We are seeing swollen lymph nodes and swollen testicles. Dr. Ryan Cole has reported an increase of cancers, and we are seeing that as well in the hospitals. We are seeing blood clots and strokes and hemorrhagic strokes, dementias and strokes and blood clots in young people too.”\n\nDr. Eads says the adverse reactions and deaths are way undercounted. Dr. Eads contends doctors are keeping quiet to keep their jobs just like Nazi Germany before WWII. Dr. Eads explains, “This is worse than Nazi camps and Dr. Mengele and his experimentation. MIT came out last week with an estimate of 500,000 deaths (because of CV19 injections). They looked at all of the reporting agencies . . . and their numbers are close to 500,000 deaths already, and we know that VAERS (Vaccine Adverse Event Reporting System) only reports one percent. . . . . We are looking at 500,000, and we are going into flu season now. These people who received the jab have no immune system left. There are going to be mass deaths this winter, and I bet we are going to reach numbers in the millions.”\n\nDr. Eads goes on to highlight how medically reckless the CV19 jabs and the mass experimental human drug trials really are. Dr. Eads says, “There are no control groups. This is completely out of control. There is no oversight. There is absolutely no FDA, no CDC, no review board oversight, nobody is following up on those that were in the study or following up on their progress, adverse reactions or antibody levels. . . . When this vaccine was rolled out, the boxes came with a completely blank package insert—completely blank. That is against all prescribing rules. Even as of this week, the package insert for ingredients is still blank. . . .This is completely out of control and completely dangerous. There is no informed consent being given. How can you give informed consent to a patient when you don’t know what’s in it? You can’t say because we don’t have any study on what the adverse effects are.”\n\nThere is much more in the 45 minute interview, including how much the hospital gets paid for getting you on a ventilator, which few survive.\n\nJoin Greg Hunter as he talks to 25 year veteran Dr. Elizabeth Eads, DO, exposing the lies that Big Pharma, CDC, FDA and NIH are telling the public. Dr. Eads will highlight the real unreported effects of the CV19 injections/jabs and how it’s all gone completely out of control in hospitals across the country.\n\nYou can follow Dr. Elizabeth (Betsy) Eads on Twitter or you can follow her on Telegram.\n\nThis segment is sponsored by Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/11/Dr-Betsy-Eads-pic-11.02.21.png", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://twitter.com/eads_elizabeth", "https://t.me/Dr_BetsyChannel", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/", "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/", "https://usawatchdog.com/at-least-1-billion-dead-or-disabled-from-cv19-bioweapon-dr-betsy-eads/"], "authors": [], "publish_date": "11/02/2021  •"}