{"result_id": "325031", "URL": "https://usawatchdog.com/fda-lied-vax-not-approved-still-experimental/", "timestamp": "2023-04-25 17:48:30 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Updated and corrected 10/14/21) The big news the FDA had given “full approval” to the Pfizer CV19 vaccine is a HUGE lie. The FDA has granted approval to a vaccine called “Comirnaty.” (FDA approved the biologics license application (BLA) submitted by BioNTech Manufacturing GmbH for COMIRNATY (COVID-19 Vaccine, mRNA). (The FDA scrubbed", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/fda-lied-vax-not-approved-still-experimental/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "FDA Lied–Vax Not Approved Still Experimental | Greg Hunter’s USAWatchdog", "cleaned_text": "The big news the FDA had given “full approval” to the Pfizer CV19 vaccine is a HUGE lie. The FDA has granted approval to a vaccine called “Comirnaty.” (FDA approved the biologics license application (BLA) submitted by BioNTech Manufacturing GmbH for COMIRNATY (COVID-19 Vaccine, mRNA). (The FDA scrubbed that letter off the record and replaced it, but I have a hard copy of the original and Martin Armstrong has it downloaded to his server. So, it cannot be changed, scrubbed or altered. The original FDA to Pfizer letter is dated August 23, 2021, and it is to Pfizer employee “Ms. Elisa Harkins.”) You cannot get Comirnaty now because it is simply not available. Who knows when, in the future, they will manufacture it here in the U.S., but the FDA says, “is the same formulation as the PfizerBioNTech COVID-19 Vaccine and can be used interchangeably with the Pfizer-BioNTech COVID-19 Vaccine.” Comirnaty is currently used in Europe and Australia. At the end of page 11 and the top of page12 of the same letter it also says, “All descriptive printed matter, advertising, and promotional material relating to the use of the Pfizer-BioNTech COVID‑19 Vaccine clearly and conspicuously shall state that: This product has not been approved or licensed by FDA, but has been authorized for emergency use by FDA, under an EUA to prevent Coronavirus Disease 2019 (COVID-19) for use in individuals 12 years of age and older;“What you can get is the same old experimental Pfizer vaccine that is under Emergency Use Authorization (EUA). It appears all the FDA did was extend the EUA for the crap they were already injecting and Pfizer gets to keep full immunity for liability under the EUA. Sweet deal for Pfizer and a huge lie to people thinking they were getting some safe and effective vax that is fully approved. They approved the same stuff with a new name but vaccinations are being done with the old name. Got it? This is the vaccine that is available for the forced mandates to civilians and military alike. It’s still a total experimental vaccine, and they lied to the public and said it was “fully approved” and “safe and effective.” In a letter to Pfizer on Monday, the FDA said, “. . . the EUA will remain in place for the Pfizer-BioNTech COVID-19 vaccine for the previously-authorized indication and uses. . .” There it is in black and white from the criminal Nuremberg Code violating liars at the FDA.\n\nDon’ take my word for it. Dr. Robert Malone, inventor of the mRNA (that is found in the so-called vaccines), says there are “two vaccines.” Today, Dr. Malone explained what the FDA did on Steve Bannon’s “War Room.” Dr. Malone said, “There was one approval for a future vaccine, and one extension of the Emergency Use Authorization for the vaccine being used now.” Is this a huge lie to trick the public into taking the experimental shot? I say yes.\n\nGreg Hunter talks about the huge lie that the FDA just told the public that will force them to participate in an experimental drug trial through a new round of jab mandates(Which we now know are totally bogus and phony.)\n\nDr. Robert Malone on the War Room with Steve Bannon earlier today that explains the big FDA Pfizer vax approval lie.\n\nTo see the viral video of Dr. Sean Brooks at the Talawanda School Board, click here. It’s only four very educational minutes long. The MSM is calling it a “scare video.” Don’t believe the liars at the MSM who are currently lying about the Pfizer vax approval.\n\nFinally, take 10 minutes to watch Friar Alexis Bugnolo. If he is half right, you better prepare for very rough times in the not-so-distant future.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/", "https://www.armstrongeconomics.com/wp-content/uploads/2021/08/FDA-Letter-Final_Pfizer-LOA-to-issue-with-BLA-approval-08.23.21_v2.pdf", "https://www.encyclopedia.com/science/medical-magazines/nuremberg-code-establishes-principle-informed-consent", "https://usawatchdog.com/donations/", "https://www.freedomman.org/video/dr-sean-brooks-covid-vaccine-testimony/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/"], "authors": [], "publish_date": "08/24/2021  •"}