{"result_id": "325035", "URL": "https://usawatchdog.com/they-killed-people-for-vaccine-profits-paul-craig-roberts/", "timestamp": "2023-04-25 17:48:34 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Corrected and updated) International award winning journalist and former Assistant Treasury Secretary Dr. Paul Craig Roberts says the evidence is clear Covid vaccines are not safe and effective. Dr. Roberts says, “So, why the push for overriding everyone’s civil rights to vaccinate when you have information it doesn’t protect. It doesn’t", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/they-killed-people-for-vaccine-profits-paul-craig-roberts/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "They Killed People for Vaccine Profits – Paul Craig Roberts | Greg Hunter’s USAWatchdog", "cleaned_text": "International award winning journalist and former Assistant Treasury Secretary Dr. Paul Craig Roberts says the evidence is clear Covid vaccines are not safe and effective. Dr. Roberts says, “So, why the push for overriding everyone’s civil rights to vaccinate when you have information it doesn’t protect. It doesn’t reduce infections, and we have all these cases of illnesses caused by the vaccine. We also see Biden saying, quick, let’s give it full approval. Why do they want to give it full approval? If they have to admit there are cures after all, they have to stop using the vaccine. This will affect the profits. This will affect all the inflated stock prices of the vaccine companies. They will all collapse. . . . So, they are protecting the investment in the Covid deception.”\n\nRoberts also points out, “We have a government pushing forward with a policy that Pfizer’s own internal documents show it is 120% erroneous. That is what needs to be explained. Why, when the information is now out, and not just on the internet, but in the presstitute media itself in the New York Times and in the Washington Post. We now know the vaccine (Pfizer) does quote, ‘nothing to reduce the overall risk of death from Covid,’ closed quote. The so-called ‘breakthroughs’ are concentrated among the vaccinated, not among the unvaccinated. Also, the vaccinated spread the virus as easily as the unvaccinated. This is in the internal (Pfizer) document that got out, and it’s been in the New York Times and the Washington Post. . . . It also says to proceed with vaccination is a huge serious mistake. It makes no sense. . . . There are agendas that they kept secret. We know one of them is profit. One of them is control. Then the question remains, are there other darker agendas such as population control? Did they want a vaccine that makes women infertile? Did they want a vaccine that kills people in order to reduce population? We don’t know. But given that they are pushing ahead to vaccinate the unvaccinated when they know for a fact it is going to do more harm than good, it gives a lot of credibility to the so-called conspiracy theories.”\n\nDr. Roberts also points out, only a small number of the adverse vaccine reactions are reported. Roberts says for a more accurate number, multiply the 1.8 million European injuries and 18,000 to 20,000 deaths by a factor of 10. Roberts says, “You get 18 million injuries and 200,000 deaths in Europe. Do the same math in America, and you get a huge number, and that is only the United States and Europe. So, clearly, these potential numbers far exceed the exaggerated amount of Covid deaths. . . . The fear generated in the first year of Covid makes people terrified, and it leads them to get the vaccine. . . . Now, they are getting confused, and they are telling the vaccinated you are not protected, you have to wear a mask even though you are vaccinated. . . . This is the reason the narrative is falling apart. This is also why they are so determined to get the experimental basis off so it won’t be challenged by cures . . .such as Ivermectin and HCQ.”\n\nDr. Roberts contends, “They are withholding cures from people so they can continue the vaccine profits. This is grounds for arrest and indictment of every one of them: Fauci, the Head of the FDA, the Head of the CDC and everybody involved. This is legitimate evidence for arresting them, indicting them and putting them on trial. They killed people for vaccine profits by withholding cures. . . . The deaths from Covid, but they would not let them use HCQ, Ivermectin, and now they are blocking a cure from Eli Lilly. This, I think, is the only case we need to make. . . . We have proof they withheld treatment. We know that. It’s not speculative and not a theory. It is an absolute known fact. They withheld treatment, and they are continuing to withhold treatment so they can sell a vaccine.”\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with award winning journalist Dr. Paul Craig Roberts. (There is much more in the 54 min. interview.)\n\nTo see Dr. PCR on a regular basis, go to PaulCraigRoberts.org. All the articles are free, and Dr. PCR is a prolific writer.\n\nTo buy one of Dr. Roberts’ 13 books, click here.\n\nTo Donate to Dr. Paul Craig Roberts, click here.\n\nThis segment is sponsored by Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/08/PCR-8.5.21-pic.png", "https://usawatchdog.com/", "https://jonathanturley.org/2021/07/31/twitter-suspends-science-writer-after-he-posts-results-of-pfizer-clinical-test/", "https://www.paulcraigroberts.org/", "https://usawatchdog.com/donations/", "https://www.paulcraigroberts.org/", "https://www.paulcraigroberts.org/pages/books/", "https://www.paulcraigroberts.org/pages/donate/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/provoking-nuclear-war-with-russia-dr-paul-craig-roberts/", "https://usawatchdog.com/nuke-war-bioweapon-awakening-dollar-dies-paul-craig-roberts/", "https://usawatchdog.com/paul-craig-roberts-nuke-war-coming-mysterious-deaths-dont-stop-dems-cant-win/", "https://usawatchdog.com/third-of-global-population-killed-in-next-war-cycle-charles-nenner/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/"], "authors": [], "publish_date": "08/05/2021  •"}