{"result_id": "325022", "URL": "https://usawatchdog.com/desperate-deep-state-planning-intense-chaos-in-2023-alex-newman/", "timestamp": "2023-04-25 17:48:21 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Award-winning journalist Alex Newman, author of the popular book “Deep State,” says the world is waking up fast to the global genocide caused by the CV19 bioweapon passed off as a vaccine. Because of this public awakening, Newman says the desperate Deep State is planning intense chaos in multiple areas to", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/desperate-deep-state-planning-intense-chaos-in-2023-alex-newman/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Desperate Deep State Planning Intense Chaos in 2023 – Alex Newman | Greg Hunter’s USAWatchdog", "cleaned_text": "Award-winning journalist Alex Newman, author of the popular book “Deep State,” says the world is waking up fast to the global genocide caused by the CV19 bioweapon passed off as a vaccine. Because of this public awakening, Newman says the desperate Deep State is planning intense chaos in multiple areas to cover their tracks and distract the public away from the extreme crimes globalist elites have committed. Newman explains, “What they are going to be doing over the coming year is massive numbers of crises and expanding and accelerating existing crises. They will be fomenting new crises such as food crises, immigration crises, border crises, currency crises and terrorism crises. You name it because that is what they do. The U.N. is standing by to provide ‘solutions’ to this. The World Health Organization is working on digital IDs and vaccine passports to deal with the health crises. The Bank for International Settlements (BIS) is working on the Central Bank Digital Currency (CBDC) to deal with the currency crises. The U.N. Food and Agriculture Organization, the FAO, is working on solutions to the food crises that they are unleashing on humanity. So, we are going to see a lot more of this, and I forgot the energy crisis. This is what we talked about a few weeks ago when we talked about the U.N. climate summit (COP 27) in Egypt. They are dismantling our energy infrastructure for the purpose of causing an energy crisis, and they say this is what they are doing. . . .They are starting . . . a ‘new energy order’ to take control and limit our energy use.”\n\nNewman says, “. . . Totalitarians like to create the poison and the antidote all in the same laboratory. That’s what these globalists, Deep Staters and insiders are working on. They create the poison and antidotes in the same laboratory to take our freedoms, and population control is going to be a very big part of it.”\n\nThis brings us back to the CV19 bioweapon/vax. Newman says what is unfolding in 2023 is a “mass unstoppable awakening” to the genocide that is CV19 from infection to injection. This is mass murder, and that is what people will wake up to in 2023. Newman says, “These people are on the record with statements and speeches where they claim there are too many people consuming too many resources, and we need to reduce the population of the earth. . . . I think the evidence for mass murder and genocide is so overwhelming that it would be hard for a court not to convict. . . . .We have to understand the global elites, the global predators behind this atrocity, that, in my mind, have killed millions and millions of people, are not going to say ‘You got us. We give up, take us to jail. We are going to have another Nuremberg.’ They are not going to do that. They are going to deploy the next part of their plan. Based on what we have seen so far, we can expect to see some sort of crisis of epic proportions to try to take the focus off it (the CV19 bioweapon/vax genocide).”\n\nIn closing, Newman says, “The main issue is . . . What we are dealing with is a battle against evil. In Ephesians 6, you get a clear picture about what we are fighting. We are not just fighting George Soros, Klaus Schwab or Joe Biden. . . . Apostle Paul in the Bible calls this ‘powers and principalities’ or demonic entities. These are fallen angels and demons that are behind the scenes that govern huge parts of the world. . . . Many people do not understand they are being ruled by demonic forces. They have been turned over to a reprobate mind. They think they are worshipping money or some statue . . . in reality, they are worshipping Satan. . . . In Ephesians 6, there is really clear instruction on how to deal with this. It talks about taking the shield of faith to quench all the fiery darts of the wicked ones. . . . It talks about taking the sword of the spirit, which is the word of God, the Bible. That is our offensive weapon. When you read the Bible, you get an accurate depiction of reality that you won’t get from the lying fake media. The reality is Satan knows he has limited time on Earth. He wants to take as many souls down to Hell with him so he uses lies, fear, ignorance, trickery, temptation and evil. Unfortunately, most of the rulers are in league with this evil force. We know how this ends, and it’s not going to end well for them. . . . There are only two sides to this fight, and you want to make sure you are on the right side because there are eternal consequences for this.”\n\nThere is much more in the 40-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with hard hitting journalist Alex Newman, founder of LibertySentinel.org and author of the book “Deep State” for 1.3.23.\n\nNewman’s website is called LibertySentinel.org. There is lots of free information and articles.\n\nTo get a copy of “The Great Reset” DVD, click here.\n\nTo get a copy of “Transhumanism: War on Humanity & God” DVD, click here.\n\nFor a copy of Alex Newman’s popular book “Deep State” click here.\n\nTo support Alex Newman with electronic donations, click here.\n\nYou can also use Snail Mail below:", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2023/01/Alex-Newman-pic1.3.23.png", "https://usawatchdog.com/", "https://libertysentinel.org/", "https://libertysentinel.org/product/deep-state-the-invisible-government-behind-the-scenes", "https://usawatchdog.com/donations/", "https://libertysentinel.org/", "https://libertysentinel.org/product/the-great-reset-a-biblical-look-dvd", "https://libertysentinel.org/product/transhumanism-war-on-humanity-god-dvd", "https://libertysentinel.org/product/deep-state-the-invisible-government-behind-the-scenes", "https://libertysentinel.org/donate", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/deep-state-predators-need-to-terrify-everyone-alex-newman/", "https://usawatchdog.com/deep-state-absolutely-wants-to-kill-you-alex-newman/", "https://usawatchdog.com/deep-state-naked-running-through-streets-alex-newman/", "https://usawatchdog.com/cop27-global-meeting-to-destroy-america-alex-newman/", "https://usawatchdog.com/2023-will-be-year-from-hell-martin-armstrong/"], "authors": [], "publish_date": "01/03/2023  •"}