{"result_id": "325038", "URL": "https://usawatchdog.com/cv-19-vaccine-warning-cv-19-cure-must-watch-videos/", "timestamp": "2023-04-25 17:48:38 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com 3.30.2021 The Covid 19 (CV-19) headlines out so far this week are downright confusing and contradictory. One says “Covid-19’s Fourth Wave is hitting the U.S Hard.” Another says, “Texas Hits Record Low Covid Cases 3 Weeks After Lifting All Pandemic Restrictions.” What are you to believe? The mainstream media (MSM), CDC", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv-19-vaccine-warning-cv-19-cure-must-watch-videos/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV-19 Vaccine Warning – CV-19 Cure – Must Watch Videos | Greg Hunter’s USAWatchdog", "cleaned_text": "The Covid 19 (CV-19) headlines out so far this week are downright confusing and contradictory. One says “Covid-19’s Fourth Wave is hitting the U.S Hard.” Another says, “Texas Hits Record Low Covid Cases 3 Weeks After Lifting All Pandemic Restrictions.” What are you to believe? The mainstream media (MSM), CDC and most politicians have been lying about almost everything. The idea they are pushing that only a vaccine is the answer to what many people call a “Plandemic” is a huge lie. Let me prove it.\n\nPlease join Greg Hunter of USAWatchdog.com as he posts three videos: An intro- duction video by Hunter along with two “must watch” videos by top experts, so you can be informed about taking a vaccine (or not) or a treatment that can save your life. Big Tech, MSM and the CDC do not want you to hear what these experts have to say.\n\n\n\n There have been lots of reported problems with the so-called vaccines when, in fact, they are approved for “emergency use only” and, therefore, are “experimental.” This is not told to the public. Also, being kept from the public are the many reported problems after taking the shots. Some of these problems include, but are not limited to: blood clotting, sterilization of young women, miscarriages, Bell’s palsy and even death that far exceed death rates of many other vaccines — combined. It is also not explained to the public that this plan to fight CV-19 is simply a mass drug trial masquerading as some sort of vaccine. It is, in fact, “genetic engineering” where DNA is modified or changed. These are all sourceable medical facts that are provided by top medical doctors and even the “vaccine” manufacturers themselves. The most stunning fact is the vaccine makers have zero liability for the damage this experimental medical test causes. I have two videos I am embedding for you to see. The first, I am calling a “CV-19 Vaccine Warning.”\n\nIs vaccinating everyone on a global basis the right thing to do? Not according to one of the top virology experts in the world. His name is Dr. Geert Vanden Bossche. He is appealing to the World Health Organization (WHO) in the following video to stop these mass vaccinations immediately and to engage in public scientific debate on the best way to combat CV-19. Dr. Vanden Bossche says mass global vaccines are not the answer and gives a chilling reason why. If Big Tech gets its way, this urgent message from one of the world’s top virus doctors will never see the light of day. Please watch his 2 minute video I am calling a “CV-19 Vaccine Cry of Distress,” which contains a dire warning given to the WHO by Dr. Vanden Bossche below: (This is being embedded from YouTube, so you better watch it before they take this down.)\n\nThe second video, I am calling a “CV-19 Cure.” This video was taken off YouTube mid-March 2021 after tens of thousands of views. The video featured Dr. Pierre Kory during a Senate hearing in mid-December 2020 about alternative treatments to CV-19. Dr. Kory is an academic and expert in critical care. In his hearing, he is advising the use of the “miracle drug” called Ivermectin. Dr. Kory testifies that many peer reviewed medical studies say that Ivermectin will “cure CV-19” if taken long before people reach the hospital for treatment in dire condition. This video is less than 10 minutes long, and it is well worth your time.\n\nThis is Greg Hunter, and I say, “The MSM is lying to you. I worked in the MSM for 9 years, and I can tell you it has really turned into a propaganda arm of the New World Order Globalists, Deep State, Democrats and even some Republicans too. I left CNN in 2008 and started USAWatchdog.com in 2009. If there is one thing I know how to do, it is to know what a verifiable reliable source is with top credentials. Please do your own research, and listen to the experts who put their reputations on the line to inform the public and save lives.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" title=\"YouTube video player\" src=\"https://www.youtube.com/embed/RTStSXgDjxE\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/RTStSXgDjxE"}], "links": ["https://usawatchdog.com/wp-content/uploads/2021/03/1a.png", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/warning-signs-of-americas-destruction-jonathan-cahn/"], "authors": [], "publish_date": "03/30/2021  •"}