{"result_id": "325017", "URL": "https://usawatchdog.com/vp-biden-disrespected-vaccine-debate-not-allowed-economy-still-tanking/", "timestamp": "2023-04-25 17:48:15 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (WNW 472 3.19.2021) Vice President Biden (stealing an election does not make you a legitimate President) is being disrespected globally. They know Biden has dementia, and surely they all know he was cheated in by the Deep State globalists (this includes Republicans like Mitch McConnell). Vladimir Putting has challenged VP Biden", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/vp-biden-disrespected-vaccine-debate-not-allowed-economy-still-tanking/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "VP Biden Disrespected, Vaccine Debate NOT Allowed, Economy Still Tanking | Greg Hunter’s USAWatchdog", "cleaned_text": "Vice President Biden (stealing an election does not make you a legitimate President) is being disrespected globally. They know Biden has dementia, and surely they all know he was cheated in by the Deep State globalists (this includes Republicans like Mitch McConnell). Vladimir Putting has challenged VP Biden to a debate. Of course, Biden, I mean his handlers, declined. Kim Jung Un of North Korea will not accept a phone call from VP Biden, and the President of Mexico is the one who is going to crack down on the illegal immigrants on the southern U.S. border that is facing a meltdown. There are consequences for fraud, and the entire world knows Joe and his crew are illegitimate and incompetent.\n\nWe are being told to take the CV19 vaccine by virtually all top politicians, but we are not being told much else. Nobody admits or talks about all the CV vaccines being totally “experimental.” That is a fact. Even President Trump is telling people to get the vaccine. Mr. President, can’t we have a debate about this “Warp Speed” project, which some experts in vaccines say has some big downside risks? The answer is NO. Debates are not allowed. You are only allowed to submit and keep quiet or you will be removed from all social media. Drug companies and politicians have no idea what the long term effects of CV vaccines will be. There are also lots of reports of problems, including death in some cases that go unreported or under-reported. This is nothing short of the biggest live drug trial the world has ever seen. We are told that the multiple CV19 vaccines are safe, but many doctors say they have NOT been proven safe. Some doctors also adamantly say to not take any CV19 vaccines. Instead, take HCQ, Ivermectin and other treatments early on, and you will be cured. All this to say you will not hear any debate on CV19 vaccines or alternatives to treat this virus. As I said, debate is not allowed. You are supposed to roll up your sleeve and agree to be a Guinee pig in the biggest global experimental drug trial in history.\n\nThe economy is still sucking, and a fresh 770,000 new unemployment claims this week proves it. Some areas are doing better such as construction, but many other areas are far from back to normal and may never get there. All this while the Fed and our politicians continue to spend money on a pace never seen before in human history. What could go wrong? Are we about to find out?\n\nJoin Greg Hunter of USAWatchdog.com as he talks about these stories and more in the Weekly News Wrap-Up for 3.19.2021.\n\nNick Barisheff, CEO and Founder of Bullion Management Group, will be the guest for the Saturday Night Post. Barisheff says gold and silver’s best days are ahead, and Fed policies guarantee it.\n\nThis segment is sponsored by Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/03/1a-2.jpg", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://bmg-group.com/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/election-psyop-trump-won-economy-still-tanking/", "https://usawatchdog.com/dem-gun-confiscation-nato-war-more-unexpected-deaths-economy-tanking/", "https://usawatchdog.com/framing-trump-again-tsunami-of-vax-lies-tanking-economy/", "https://usawatchdog.com/russia-may-nuke-dems-will-cheat-economy-already-tanking/", "https://usawatchdog.com/ndaa-stops-vax-first-amendment-crime-economy-tanking-hard/"], "authors": [], "publish_date": "03/19/2021  •"}