{"result_id": "325034", "URL": "https://usawatchdog.com/cv19-booster-shot-also-a-bioweapon-karen-kingston/", "timestamp": "2023-04-25 17:48:33 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Karen Kingston is a biotech analyst and a former Pfizer employee who has researched and written about many cutting edge pharmaceutical issues. Kingston thinks that Covid 19 and the so-called vaccines and boosters are here to stay for a long time. Kingston explains, “The reason why it keeps", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-booster-shot-also-a-bioweapon-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Booster Shot Also a Bioweapon – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a biotech analyst and a former Pfizer employee who has researched and written about many cutting edge pharmaceutical issues. Kingston thinks that Covid 19 and the so-called vaccines and boosters are here to stay for a long time. Kingston explains, “The reason why it keeps going is because Covid 19 is now a multi-trillion dollar industry many times over that has been forecasted out for the next ten years and beyond. I do have numerous business plans that have been put up on numerous biotech industry websites. I am in the mecca of the biotech industry. I am in San Diego, and most people do not know we are the biotech industry of the world.”\n\nKingston says there are untold billions of dollars being invested into CV19 injections. Just one fund alone has already invested a half billion dollars into research, and Kingston points out, “There is a $500 million fund that has a partnership with Qualcomm that will map out all the genetic variations of Covid 19. Covid 19 is really just code for human beings, and they want to map out our genetic makeup. So, if Covid 19 goes away, where does the half billion dollar project go? . . . They just announced here in Carlsbad, California, that they are going to create a new manufacturing facility to produce 600 million rapid Covid 19 tests a year. If Covid 19 goes away, where does that manufacturing facility and the billion dollar a year company go? These are just two small examples of tens of thousands of examples. So, that’s why it’s not going away. . . .That’s why there are such strong mandates for our schools and for our city and state employees. . . . 740 of the 1,850 police here in San Diego are not vaccinated and don’t want to be. Mayor Todd Gloria gave them two choices: You can surrender your body to be injected with this biological agent, or you can surrender your badge and gun. I gave the police a third option which was arrest the Mayor.”\n\nKingston says the CV19 so-called vaccines are not vaccines but bioweapons and goes on to say, “The hot water that Pfizer is in is they never demonstrated anything even remotely being a vaccine, and their mechanism of action is defined by the FDA under viral gene-based therapy, which is what it is. They met no criteria as a vaccine. On top of that, the FDA has approved other products in this category for cancer treatments. So, if there is a serious attorney out there that wants to engage me and my analysts, this is actually a big case. Pfizer broke their (liability) shield, and the FDA was grossly negligent. The data is right there to show you this goes beyond false and misleading labeling and off-label claims . . . . They told doctors that this was a vaccine–when it’s not.”\n\nDr. Fauci now claims that a booster is “essential” for protection against CV19. Does Kingston recommend a CV19 booster shot? Kingston warns, “I don’t think anyone should inject themselves with a bioweapon, so, no. I also think nobody should have the right to inject their children with a bioweapon. This is a firm No. This has to stop. . . . If I did not have any bad reactions (from the CV19 injections), I would drop to my knees and thank God. . . . I would pray for forgiveness that I was deceived.”\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she warns people NOT to get the bioweapon booster shot.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.\n\nKingston is working on a new website called MiFight.com, so be on the lookout for it.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/11/Karen-Kingston-1127.21-pic.png", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/"], "authors": [], "publish_date": "11/27/2021  •"}