{"result_id": "325008", "URL": "https://usawatchdog.com/global-cv19-vax-absolute-insanity-dr-ryan-cole/", "timestamp": "2023-04-25 17:48:05 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchddog.com (Saturday Night Post) Board-certified pathologist Dr. Ryan Cole has treated more than 500,000 patients, and he is an expert in postmortem examination. Dr. Cole has a long resume, including a five-year stint at the Mayo Clinic. Dr. Cole was one of the very first doctors to come out and question the", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/global-cv19-vax-absolute-insanity-dr-ryan-cole/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Global CV19 Vax Absolute Insanity – Dr. Ryan Cole | Greg Hunter’s USAWatchdog", "cleaned_text": "Board-certified pathologist Dr. Ryan Cole has treated more than 500,000 patients, and he is an expert in postmortem examination. Dr. Cole has a long resume, including a five-year stint at the Mayo Clinic. Dr. Cole was one of the very first doctors to come out and question the entire Covid19 narrative and the extreme push for CV19 vaccine injections for all. He has been attacked relentlessly and lost half his medical diagnostic business, but he’s still fighting and telling the truth about the huge lies and deadly mistakes by the medical establishment, especially when pushing the CV19 injections. Dr. Cole says, “I know there was a lot of coercion, which is very unfortunate because it’s not what we do in medicine, yet, for whatever reason, we went into this mass psychosis societally and said, hey, it’s great to experiment on an entire world population, which is absolute insanity. . . . So, we are using a dangerous gene-based product without long term safety studies. A lot of people have received it. We are seeing damage and autoimmune disease. We are seeing death from all causes at increased rates. . . . Scientifically, we are at the beginning . . . . as we go through the complexed mechanisms of what this is doing to the body, I think we are seeing the tip of the iceberg right now. My warning to humanity is don’t get another one of these (CV19 vaccines). It’s a dose dependent poison curve. The more you get, the worse off you are going to be. . . . This is immunological insanity. We need to stop this . . . . Plus, that persistent mRNA, we don’t know when that turns off, and we know that is causing all this immune harm. We need to stop this immediately. We need to stop the FDA and CDC and what they are pushing. . . . We need to wake up and acknowledge there is vaccine harm.”\n\nDr. Cole goes on to explain, “This shot was a mistake. We rolled it out on humanity as an experiment. We were told it was approved, safe and effective, and they lied to humanity. The problem is it’s a nuclear bomb platform. It’s a Lipid Nanoparticle plus a modified mRNA that you can’t turn off. It’s a nuclear bomb, and we don’t know the long-term safety and outcomes.”\n\nDr. Cole is seeing dramatic increases in all types of illness such as aggressive cancers, heart disease, strokes, brain problems and autoimmune disease to name a few. Dr. Cole says, “We are damaging the immune system. Why are so many people getting sick with other things right now? Because their immune system is suppressed. . . . Is there malicious intent behind what they are doing? I can’t prove that. Do I think with all the harm we are seeing that there are very unfortunate characters knowing that they are doing harm to people? Yeah, I do. Genocide for profit are strong words, but it’s hard to argue with it at this point. We are seeing so much harm, and we are not seeing anybody stopping it.”\n\nWhat is the trend line for injuries and deaths from the CV19 injections? Dr. Cole says, “The trend line is going up. We can see that in the data . . . and it is considerable. We are seeing that the people who have gotten the shots are getting Covid at higher rates and other diseases at higher rates. We are seeing all-cause mortality, those who have gotten too many shots, are dying at a much higher rate.”\n\nOne thing that is getting stopped is scientific investigations in the form of autopsies. Dr. Cole says only a few thousand autopsies have been done on people killed by the CV19 vax, and there should have been100,000 autopsies done by now. Dr. Cole points out, “Autopsies are how we learn about disease. When Dr. Fauci said publicly early on ‘don’t do autopsies,’ I thought because you are covering up the findings. You can’t find for that for which you don’t look. . . . To deny this opportunity to the professionals and scientists of the world, or to tell them not to do autopsies, that’s corrupt.”\n\nDr. Cole says anyone who has a family member, especially a young family member, with an unexplained or mysterious death, should demand an autopsy to find out if the CV19 vax killed your loved one.\n\nThere is much more information in the one-hour and eight-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes one-on-one with pathologist Dr. Ryan Cole, as he exposes the covid lies that will cost millions their lives.\n\nYou can get lots of free information on Dr. Cole’s website by clicking here.\n\nThere is also free information on GlobalCovidSummit.org. There, you can tell your vax injury story without fear of it being censored or canceled.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/06/Dr-Ryan-Cole-6.4.22-pic.png", "https://usawatchdog.com/", "https://www.rcolemd.com/", "https://usawatchdog.com/donations/", "https://www.rcolemd.com/", "https://globalcovidsummit.org/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/global-cv19-vax-propaganda-means-mass-casualties-dr-pierre-kory/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/hell-no-to-any-cv19-vax-lt-col-theresa-long-md/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/", "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/"], "authors": [], "publish_date": "06/04/2022  •"}