{"result_id": "325027", "URL": "https://usawatchdog.com/ndaa-stops-vax-first-amendment-crime-economy-tanking-hard/", "timestamp": "2023-04-25 17:48:26 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (WNW 559 12.09.22) In a very rare occurrence, Congress halted the military from continuing a widespread program of CV19 vaccination. Stopping it was part of the NDAA (National Defense Authorization Act) that gave the military $858 billion to spend on its operations. This sort of legislation is unprecedented and clearly shows", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/ndaa-stops-vax-first-amendment-crime-economy-tanking-hard/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "NDAA Stops Vax, First Amendment Crime, Economy Tanking Hard | Greg Hunter’s USAWatchdog", "cleaned_text": "In a very rare occurrence, Congress halted the military from continuing a widespread program of CV19 vaccination. Stopping it was part of the NDAA (National Defense Authorization Act) that gave the military $858 billion to spend on its operations. This sort of legislation is unprecedented and clearly shows members of Congress know the CV19 vax is unsafe, deadly, debilitating and is not a vaccine. They also know what is coming in terms of death and injuries from this bioweapon, and I think they are wanting some cover. This is yet another sign the vax hoax is ending. It is being revealed as a genocidal attack on America and the world. Nothing can stop the truth from coming out. Severe repercussions are in store for the people responsible for this murder program.\n\nThe so-called “Twitter Files” Elon Musk is leaking out show huge national security concerns. The suppression of the Hunter Biden laptop story by the FBI and Twitter was a huge operation just before the 2020 Election. The laptop contains documented bribes and deals with foreign enemy powers. It was falsely called Russian fake news to discredit it. Shame on the FBI for not acting and gaslighting the public. It is also coming out the government of the United States was suppressing free speech using back door channels in Twitter. This is the biggest First Amendment violation in history, and lawsuits by the hundreds are sure to follow. The coming out party is just getting started.\n\nEverywhere you look this week, you can see the economy not just slowing down–but plunging. Housing is tanking, used car prices are collapsing at the fastest pace on record and unemployment is surging. Meanwhile, the Fed is going to continue raising interest rates to fight inflation and support the U.S. dollar. There is not going to be a “pivot.” Buckle up, it’s going to be a rough 2023!\n\nThere is much more in the 55-minute newscast.\n\nJoin Greg Hunter of USAWatchdog.com for these stories and more in the Weekly News Wrap-Up for 12.09.22.\n\nFinancial expert David Morgan will be the guest for the Saturday Night Post. Morgan will give some riveting 2023 predictions.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/12/1aqyt.jpg", "https://usawatchdog.com/", "https://usawatchdog.com/donations/", "https://www.themorganreport.com/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/election-psyop-trump-won-economy-still-tanking/", "https://usawatchdog.com/dem-gun-confiscation-nato-war-more-unexpected-deaths-economy-tanking/", "https://usawatchdog.com/framing-trump-again-tsunami-of-vax-lies-tanking-economy/", "https://usawatchdog.com/russia-may-nuke-dems-will-cheat-economy-already-tanking/", "https://usawatchdog.com/russia-ukraine-intensifies-germany-tanking-food-inflation-and-drought/"], "authors": [], "publish_date": "12/09/2022  •"}