{"result_id": "325037", "URL": "https://usawatchdog.com/cv19-vax-destroys-hearts-brains-of-billions-of-people-dr-sucharit-bhakdi/", "timestamp": "2023-04-25 17:48:37 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Saturday Night Post) World renowned microbiologist and virologist professor Sucharit Bhakdi MD has won many medical and scientific awards and has more than 300 peer reviewed research papers. Dr. Bhakdi was one of the first top global doctors to warn about the deadly and debilitating effects of the CV19 vax. He", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-vax-destroys-hearts-brains-of-billions-of-people-dr-sucharit-bhakdi/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Vax Destroys Hearts & Brains of Billions of People – Dr. Sucharit Bhakdi | Greg Hunter’s USAWatchdog", "cleaned_text": "World renowned microbiologist and virologist professor Sucharit Bhakdi MD has won many medical and scientific awards and has more than 300 peer reviewed research papers. Dr. Bhakdi was one of the first top global doctors to warn about the deadly and debilitating effects of the CV19 vax. He was right. Dr. Bhakdi says there is proof that if the injections reach the heart or the brain, they will be damaged beyond repair. Dr. Bhakdi brings up one autopsy that found this and explains, “In multiple parts of the brain in this deceased man, the doctor found the same thing. . . . He found the damned spike proteins in the smallest capillaries of the brain. . . There is no repair because what the doctor found was these small vessels were attacked by the immune system and destroyed. The doctor found irrefutable evidence of brain cell damage of cells that are dead and dying. This poor fellow died because his brain cells were dying. . . . The same patient that died . . . . had this multifocal, meaning at many different locations, necrotizing, meaning dying, encephalitis. . . . He had typical things being seen now in people post vax. They lose their personality. They lose their minds. They lose their capacity to think. They become demented. They can’t hear. They can’t speak. They can’t see. They are no longer the humans that they were. They are destroyed human beings. Their brains are destroyed. The doctor found something so terrible he had to publish right away. This was published October 1, 2022, in “Vaccine,” which is a leading scientific journal. It’s peer reviewed, and it was accepted right away. . . . It can be read by anyone. I beseech you to read it for yourself. The doctor doing the autopsy found apart from these terrible things happening to the brain, the same things were happening in the heart. It was happening in the heart of the same patient. He saw these same damned devil designed spike proteins. This means the gene that the perpetrators injected into billions of people reach the vessels of the brain and the heart. They are killing people. They are killing people in the most terrible, terrifying and tormenting way.”\n\nDr. Ryan Cole, Dr. Mike Yeadon and I always sing the same thing. You have to realize we did not know each other until Covid came, and there are so many others. They are not stupid, and they are wonderful and intelligent people, and if everyone is saying the same thing, you have to start thinking we may be right. If we are right, and I say it’s not me, I am one of thousands, and these thousands are right maybe, you are killing yourself and your children and your loved ones. Why do you do this? Why?”\n\nDr. Bhakdi contends that the world should stop the injections now. . . . and Covid is a “criminal hoax.”\n\nIn closing, Dr. Bhakdi says, “I am afraid to say it, but up until one and a half years ago, I was a scientist. Now, I see what is going on. I have to admit that the colleagues and friends of mine that have been telling me that this is genocide may be right. I don’t know, but I feel in my mind there can be no other agenda. There is no other explanation. There is no other explanation because it is clear these gene-based vaccines are not needed because we are not dealing with a killer virus that is destroying mankind. Anyone who says otherwise is obviously lying to your face. Second, it is obvious these so-called vaccines could never ever have protected against infection. . . . Third, and the worst, these gene-based vaccines are the most terrible instruments that have ever been introduced into the human body to destroy humans. . . . These vaccines are going to destroy mankind.”\n\nThere is much more in the 53-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes one on one with world renowned microbiologist and virologist, professor Sucharit Bhakdi MD for 10.29.22.\n\nDr. Bhakdi says the German government is persecuting him with totally false charges of antisemitism, but he is really being punished for speaking out against the CV19 vax. Early on he told people not to get the CV19 injections. If convicted, Dr. Bhakdi says he faces 5 years in prison. His trial is in 2023.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/10/Sucharit-Bhakdi-10.29.22-pic.png", "https://usawatchdog.com/", "https://www.mdpi.com/2076-393X/10/10/1651", "https://usawatchdog.com/donations/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/people-are-dying-from-the-cv19-vax-its-preventable-dr-pierre-kory/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/everything-about-to-blow-up-as-god-destroys-evil-bo-polny/", "https://usawatchdog.com/hell-no-to-any-cv19-vax-lt-col-theresa-long-md/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/"], "authors": [], "publish_date": "10/29/2022  •"}