{"result_id": "325014", "URL": "https://usawatchdog.com/cv19-vax-deaths-injuries-are-an-ignored-humanitarian-catastrophe-dr-pierre-kory/", "timestamp": "2023-04-25 17:48:12 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) World renowned CV19 critical care and pulmonary expert Dr. Pierre Kory says his clinic is seeing an explosion of people seeking treatment for CV19 vaccine sickness and injury. Dr. Kory reports, “We just started seeing more and more vaccine injured, and they are really quite ill. It’s a", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/cv19-vax-deaths-injuries-are-an-ignored-humanitarian-catastrophe-dr-pierre-kory/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "CV19 Vax Deaths & Injuries are an Ignored Humanitarian Catastrophe – Dr. Pierre Kory | Greg Hunter’s USAWatchdog", "cleaned_text": "World renowned CV19 critical care and pulmonary expert Dr. Pierre Kory says his clinic is seeing an explosion of people seeking treatment for CV19 vaccine sickness and injury. Dr. Kory reports, “We just started seeing more and more vaccine injured, and they are really quite ill. It’s a very complex illness. We are working on treatments that work and understanding the path of physiology. . . . By the way, there is not a lot published on vaccine injury. As you know, they don’t want to call attention to it. The big high impact (medical) journals will not publish on it. . . . It’s hard to become an expert on vaccine injury when it’s a disease that is being ignored. . .. Nobody has a post vaccine injury clinic, and there are really no suggestions on how to treat it.”\n\nDr. Kory is developing new treatment protocols for treating the vax injured. Dr. Kory and his team at Front Line Covid 19 Critical Care Alliance (flccc.net) have an “Updated Post-Vaccine Syndrome Protocol.” Dr. Kory says it’s not a cure—yet, but it’s a good start. Dr. Kory explains, “I think it is a good general guide, but we need to know a lot more. I will tell you that what I was doing two months ago with these patients is a lot different than what I am doing now.”\n\nDr. Kory, who is writing a book called “The War on Ivermectin,” said early treatment for CV19 with medication such as Ivermectin could have saved nearly a million lives. Now, Dr. Kory’s base medicine for the vax injured is also Ivermectin. It’s a drug that won a Nobel Prize in medicine in 2015 because it is safe and effective. Dr. Kory says, “For different reasons, Ivermectin is my first go-to medicine. There are a number of reasons for that. Number one, it’s one of the most tightly binding medicines to the spike protein. The vaccine injured are causing what I call a spike-opathy (or spike disease). It’s the spike protein, which is triggering a bunch of pathologic mechanisms. The lipid nanoparticles are also a problem . . . but for the spike protein, specifically, the Ivermectin seems to counter it. Also, Ivermectin is a very potent anti-inflammatory. It’s the medicine that works the best, but it does not work in everybody.”\n\nDr. Kory freely admits there is “a lot we don’t know about CV19 vaccine injury,” and, thus, a lot to learn to treat it. What Dr. Kory is sure of is there are massive amounts of deaths and injuries from the CV19 injections that are being ignored by the government regulators, medical community and the mainstream media. Dr. Kory contends, “This is a humanitarian catastrophe, and it has been ignored. It has been suppressed. It has been censored, but you cannot hide from this data when it’s in your face. The system is going to have to address this in some way at some point. . . . We figured out how to treat Covid, and we did a good job . . . . Now, we have to try and do the same thing with the vaccine injured, and it’s a much different problem.”\n\nIn closing, Dr. Kory points out one big thing with all the CV19 vaccines, “It’s all experimental. That’s right, experimental. We don’t have long-term safety data. We don’t know the long-term consequences. We don’t know the true rise in cancers and what it has to do with the immune system. These are all worries and concerns. . . . There has been no approved vaccine used in America since the beginning of Covid. . . . it’s all experimental.”\n\nThere is much more in the nearly 57 min. interview.\n\nJoin Greg Hunter as he goes One-on-One with Dr. Pierre Kory, one of the top Pulmonary and Covid Critical Care experts on the planet, who is co-founder of the Front Line Covid-19 Critical Care Alliance (flccc.net) and author of the upcoming book “The War on Ivermectin.”\n\nAll the information is free on Front Line Covid-19 Critical Care Alliance website flccc.net.\n\nIf you want to preorder Dr. Kory’s book (coming out in September) “The War on Ivermectin,” click here, or click here.\n\nIf you want donate to the FLCCC Alliance, click here.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/06/Dr.-Kory-6.11.22-pic.png", "https://usawatchdog.com/", "https://covid19criticalcare.com/", "https://www.amazon.com/War-Ivermectin-Medicine-Millions-Pandemic/dp/151077386X/ref=sr_1_1?crid=3ACECBPN8TA79&keywords=the+war+on+ivermectin&qid=1654888392&sprefix=the+war+on+ivermectin%2Caps%2C115&sr=8-1", "https://usawatchdog.com/800000-lives-could-have-been-saved-with-ivermectin-and-hcq-dr-pierre-kory/", "https://covid19criticalcare.com/", "https://www.simonandschuster.com/books/War-on-Ivermectin/Pierre-Kory/9781510773868", "https://usawatchdog.com/donations/", "https://covid19criticalcare.com/", "https://www.simonandschuster.com/books/War-on-Ivermectin/Pierre-Kory/9781510773868", "https://www.amazon.com/War-Ivermectin-Medicine-Millions-Pandemic/dp/151077386X/ref=sr_1_1?crid=3ACECBPN8TA79&keywords=the+war+on+ivermectin&qid=1654888392&sprefix=the+war+on+ivermectin%2Caps%2C115&sr=8-1", "https://covid19criticalcare.com/network-support/support-our-work/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/guilty-are-now-hiding-humanitarian-catastrophe-dr-pierre-kory/", "https://usawatchdog.com/people-are-dying-from-the-cv19-vax-its-preventable-dr-pierre-kory/", "https://usawatchdog.com/global-cv19-vax-propaganda-means-mass-casualties-dr-pierre-kory/", "https://usawatchdog.com/fda-covered-up-cv19-vax-biological-catastrophe-dr-peter-mccullough/", "https://usawatchdog.com/ignoring-cv19-bioweapon-deaths-radioactive-ukraine-more-bank-calamity/"], "authors": [], "publish_date": "06/11/2022  •"}