{"result_id": "325044", "URL": "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "timestamp": "2023-04-25 17:48:44 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of Covid 19 and the so-called vaccines. It’s now become obvious, with dramatically rising death and injuries, the CV19 injections were bioweapons passed off as lifesaving vaccines. Kingston has many", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "FDA Criminally Approved Bioweapon as Safe & Effective Vaccine – Karen Kingston | Greg Hunter’s USAWatchdog", "cleaned_text": "Karen Kingston is a biotech analyst and former Pfizer employee who has researched and written about many aspects of Covid 19 and the so-called vaccines. It’s now become obvious, with dramatically rising death and injuries, the CV19 injections were bioweapons passed off as lifesaving vaccines. Kingston has many documents from the government and vax manufacturers to prove this point. Kingston says, “In America, you cannot legalize murder. . . . The original timeline was they were going to submit for FDA approval (for the CV19 injection) in June of 2025. Because they were trying to push the mandates, and Americans were saying you cannot mandate an experimental product, they said, oh, it’s now FDA approved. They moved that timeline up exponentially. The reason why that is a problem is that it is legally distinct from an ‘emergency use’ product. Once the approval happened on August 23, 2021 (Comirnaty), that broke the liability shield for the ‘emergency use’ product. So, the FDA fraudulently and criminally approved a bioweapon as a safe and effective vaccine. . . . People were under the impression they were getting an approved product. . . . they were actually getting a bioweapon. . . .If they never had done the approval, you could not bring these civil charges against Pfizer, and there are dozens and dozens of them as well as criminal charges. . . . Call these shots what they are. They are bioweapons. I don’t care what our government said in the past. I don’t care what little memo they got from HHS or their employer. What they have done is wrong, and they need to be held to account.”\n\nKingston goes on to say, “I know people are saying anyone who says there is technology in these shots is a conspiracy theorist or crazy. I just showed you Pfizer says on their website that this is technology. The lipid nanoparticles are technically called biohybrid microrobots. That sounds bad, so they call them lipid nanoparticles to make it not sound so scary. So, there is technology in the CV19 injections.”\n\nThe CV19 bioweapons can cause a variety of deadly health effects. Kingston thinks, “25% of the fully vaxed could die of a heart attack or end up with severe heart problems such as Myocarditis.”\n\nKingston lists many other deadly or debilitating effects of these bioweapons such as neurological disease, autoimmune disease, extreme and fast spreading cancers and severely weakened immune systems, just to name a few. The shots did zero good and massive damage that people are now waking up to. According to Kingston, this is what these CV19 bioweapons were supposed to do.\n\nKingston says, “More experts are coming together in January and calling these bioweapons. They will be sharing this evidence from the manufacturers and our government. People also need to recognize there was never a virus. We were attacked with a nano-weapon. . . . Not only is the so-called vaccine a bioweapon, you cannot vaccinate against a technology. The whole thing was a lie.”\n\nThere is much more in the 1-hour and 26-minute in-depth interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with biotech analyst Karen Kingston as she gives an update on the bioweapon injections and criminals behind them for 12.24.22.\n\nTo look at some of the data and documents Kingston shows to prove the CV19 vax is a criminal act of releasing a bioweapon on an unsuspecting public, go to the [email protected]\n\nTo support Kingston financially, you can become a subscriber by clicking here.\n\nIf you want to donate to Kingston, so she can continue informing the public, please click here.\n\nIf you want to make a snail mail donation to Karen Kingston, please do so at:\n\nIf you want to follow Karen Kingston, you can do so on LinkedIn.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/12/Karen-Kingston-12.24.22-Pic.png", "https://usawatchdog.com/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://www.thestreet.com/investing/pfizer-gets-full-fda-approval-for-comirnaty-coronavirus-vaccine", "https://karenkingston.substack.com/", "https://usawatchdog.com/donations/", "https://karenkingston.substack.com/", "https://karenkingston.substack.com/subscribe?utm_source=menu&simple=true&next=https%3A%2F%2Fkarenkingston.substack.com%2F", "https://www.givesendgo.com/kingston", "https://www.linkedin.com/in/karenkingstonkk/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/everybody-knew-cv-19-vax-was-a-criminal-bioweapon-karen-kingston/", "https://usawatchdog.com/cv19-ai-bioweapon-from-infection-to-injection-karen-kingston/", "https://usawatchdog.com/pfizer-cv19-bioweapon-vax-public-enemy-1-karen-kingston/", "https://usawatchdog.com/cv19-vax-nothing-short-of-horrific-experiment-karen-kingston/", "https://usawatchdog.com/trump-cv19-vax-contract-violated-by-pfizer-karen-kingston/"], "authors": [], "publish_date": "12/24/2022  •"}