{"result_id": "325010", "URL": "https://usawatchdog.com/hell-no-to-any-cv19-vax-lt-col-theresa-long-md/", "timestamp": "2023-04-25 17:48:07 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (Saturday Night Post) Lt. Col. Theresa Long is a Medical Doctor at Fort Rucker who is one of the U.S. Army’s top Flight Surgeons and an expert on public health. Dr. Long makes sure military pilots are ready and able to fly America’s complicated and lethal aircraft. Dr. Long has been", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/hell-no-to-any-cv19-vax-lt-col-theresa-long-md/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "“Hell No” to Any CV19 Vax – Lt. Col. Theresa Long MD | Greg Hunter’s USAWatchdog", "cleaned_text": "Lt. Col. Theresa Long is a Medical Doctor at Fort Rucker who is one of the U.S. Army’s top Flight Surgeons and an expert on public health. Dr. Long makes sure military pilots are ready and able to fly America’s complicated and lethal aircraft. Dr. Long has been a skeptic of the so-called Covid-19 experimental vaccines from the beginning. After months of medical observation of the devastating effects of these injections, she’s come to a conclusion the top Army Brass does not like. When asked if she would recommend the CV19 vax to pilots she evaluates, Dr. Long, who is unvaxed, says, “If you think for a moment that the very same doctors, politicians or whoever that told you this was safe and effective, if you are waiting and holding your breath for them to come back and say, oops, we made a mistake, it’s dangerous and deadly, that’s never going to happen.”\n\nAnd if an Army pilot walked into Dr. Long’s office and asked if the CV19 vax was safe? What would she tell them? Dr. Long says, “I would tell them, ‘Hell no, I don’t think it’s safe.’”\n\nWhat is Dr Long seeing first hand after the CV19 injections? Dr. Long says, “I have seen everything from strokes, to clots in the spleen and liver, cancers, testicular pain, infertility, miscarriages, menstrual irregularity, lung issues, thyroid disfunction, erratic heart rates . . . a lot of things that I don’t see in someone flying an aircraft. . . . You can see myocarditis and pericarditis weeks and months after vaccines.”\n\nThe U.S. Military is very familiar with the problems Lt. Col. Long has reported. Dr. Long testified n a Senate hearing last November with doctors and medical researchers who treat CV19 vaccine injuries, along with patients who have experienced adverse events due to the CV19 vaccine. Dr. Long also made a highly publicized affidavit against the Biden Administration’s vax mandates as a whistleblower under the Military Whistleblower Protection Act in September of 2021. The military brass are well aware of who Dr. Long is and the many problems she is reporting with the so-called vaccines.\n\nWhat are her superiors telling her? Dr. Long says, “It’s always disheartening when people come to me and say privately, I completely agree with you. I completely agree with you that we should stop these vaccinations, but publicly I will disown you. That’s not being a leader. It’s just straight up cowardice when you know you are doing the wrong thing and you refuse to change.”\n\nDr. Long estimates there are “200,000 to 400,000 military members who are not vaccinated,” and the Pentagon and Defense Secretary Lloyd Austin have threatened to kick them all out of the service. Are the military leaders this stupid, this compromised or simply committing treason?\n\nDr. Long’s plea to the military brass is, “Pray for wisdom and courage.”\n\nThere is much more in the 1-hour and 6-minute video.\n\nJoin Greg Hunter as he goes One on One with Lt. Col Theresa Long, Medical Doctor and Flight Surgeon at Fort Rucker, Alabama, who is putting her career and life on the line to protect soldiers from the CV19 vax and is blowing the whistle on the deadly and dangerous problems surrounding the forced injections of our military.\n\nLt. Col. Long is continuing her work at Fort Rucker as an MD, Flight Surgeon and an Aerospace Medicine Specialist to evaluate pilots for aviation duties.\n\nIf you would like to follow Lt. Col. Thresa Long MD on Twitter, click here.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/08/Lt.-Col.-Theresa-Long-8.13.22-Pic.png", "https://usawatchdog.com/", "https://thehighwire.com/videos/lieutenant-colonel-theresa-long-testimony/", "https://americasfrontlinedoctors.org/2/wp-content/uploads/2021/09/AFFIDAVIT_OF_LTC2_Long.pdf", "https://twitter.com/LTCTheresaLong", "https://usawatchdog.com/donations/", "https://twitter.com/LTCTheresaLong", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/war-on-trump-died-suddenly-continues-brace-for-long-recession/", "https://usawatchdog.com/2023-will-be-year-from-hell-martin-armstrong/", "https://usawatchdog.com/unpayable-debt-vax-causing-hell-on-earth-ed-dowd/", "https://usawatchdog.com/7-different-patented-poisons-in-cv19-injections-karen-kingston/"], "authors": [], "publish_date": "08/13/2022  •"}