{"result_id": "325042", "URL": "https://usawatchdog.com/medical-financial-political-war-disasters-getting-worse-dr-chris-martenson/", "timestamp": "2023-04-25 17:48:43 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. Chris Martenson holds a PhD in toxicology from Duke University, is a futurist and economic researcher. He is also a Wall Street Journal best-selling author with his new revised book called “Crash Course.” Martenson said in August 2021 on USAWatchdog that the FDA approval of Pfizer’s CV19 vaccine named Comirnaty", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/medical-financial-political-war-disasters-getting-worse-dr-chris-martenson/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Medical, Financial, Political & War Disasters Getting Worse – Dr. Chris Martenson | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Chris Martenson holds a PhD in toxicology from Duke University, is a futurist and economic researcher. He is also a Wall Street Journal best-selling author with his new revised book called “Crash Course.” Martenson said in August 2021 on USAWatchdog that the FDA approval of Pfizer’s CV19 vaccine named Comirnaty was “actually a fraud.” He was right. Now, Martenson is warning that medical, financial and war troubles abound and people need to get ready to deal with a reality that no human has ever seen before. Martenson starts with the medical disaster called the CV19 vax and explains, “As you give these (CV19 injections) to people,, their immune system gets worse and worse and worse. That’s what is about to come through with common knowledge. You can see them fighting it, but people are starting to notice, hey, my friend who is quadruple jabbed is getting sick all the time now with colds, Covid, whatever. It is very clear this is the single most disastrous medical intervention in all of human history.”\n\nIn short, the death and disabilities from the CV19 so-called vaccine will continue and be a huge drag on the economy and society.\n\nThen there is the debt-based economy that is in the process of collapsing under a mound of unpayable debt. The problem was started with 0% and negative interest rates that went on for almost a decade. When interest rates went up, the value of the debt went way down. Dr. Martenson says, “Now, they are sitting on huge, massive losses. . . . That is a small example of what happened to Silicon Valley Bank (SVB). In 2019, there were $19 trillion in negative interest rate bonds. The bonds are not just under water, there are trillions of dollars in losses, and the question is who is going to eat those losses? . . . . We don’t just have a banking crisis. This is just a reflection of the monetary sickness because we were led by idiots or intentionally harmful individuals. . . . Zero percent interest rates caused damage every year it was done, and now the damage is already done. To me, a very long period of very stupid monetary policy is now about to erupt.”\n\nMartenson says, “People need to be ready for a vast punishing return of inflation . . . and a decade of shortages on everything because of years of price suppression.”\n\nMartenson also says we have been lied to about the Ukraine war. Russia has been winning and not losing. Martenson predicts it will not end well for NATO.\n\nOn the political front, Martenson says a Trump indictment signals banana republic time, and that will “guarantee Trump will win in a landslide in 2024.”\n\nThere is much more in the 54-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he goes One-on-One with Dr. Chris Martenson, founder of PeakProsperity.com, and best-selling author of the revised book called “Crash Course” for 3.21.23.\n\nThere is lots of totally free information and analysis on PeakProsperity.com\n\nFor even more actionable cutting edge information and analysis, you can subscribe to PeakProsperity.com by clicking here.\n\nTo get a copy of the Wall Street Journal best-selling book “Crash Course,” click here.\n\nIf you are looking to buy physical gold and silver coins, check out our sponsor Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2023/03/Chris-Martenson-3.21.23-pic.png", "https://usawatchdog.com/", "https://www.barnesandnoble.com/w/the-crash-course-chris-martenson/1142015889?ean=9781394168866", "https://usawatchdog.com/comirnaty-cv19-vax-approval-is-actually-fraudulent-chris-martenson/", "https://peakprosperity.com/", "https://www.barnesandnoble.com/w/the-crash-course-chris-martenson/1142015889?ean=9781394168866", "https://usawatchdog.com/donations/", "https://peakprosperity.com/", "https://peakprosperity.com/membership/", "https://www.barnesandnoble.com/w/the-crash-course-chris-martenson/1142015889?ean=9781394168866", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/", "https://usawatchdog.com/unstoppable-crash-worse-than-2008-coming-james-rickards/", "https://usawatchdog.com/one-giant-financial-std-and-everybody-is-infected-bill-holter/", "https://usawatchdog.com/save-dollar-or-financial-system-not-both-bill-holter/", "https://usawatchdog.com/financial-system-lawless-criminal-control-syndicate-catherine-austin-fitts/"], "authors": [], "publish_date": "03/21/2023  •"}