{"result_id": "325039", "URL": "https://usawatchdog.com/fda-covered-up-cv19-vax-biological-catastrophe-dr-peter-mccullough/", "timestamp": "2023-04-25 17:48:39 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com Dr. Peter McCullough is a renowned cardiologist who fought the accepted government CV19 vax narrative from the beginning. Dr. McCullough said, “The injections should have been halted in February of 2021.” Instead, the government mandated the clot shots, and the CDC and FDA covered up the problems. The FDA is still", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/fda-covered-up-cv19-vax-biological-catastrophe-dr-peter-mccullough/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "FDA Covered Up CV19 Vax Biological Catastrophe – Dr. Peter McCullough | Greg Hunter’s USAWatchdog", "cleaned_text": "Dr. Peter McCullough is a renowned cardiologist who fought the accepted government CV19 vax narrative from the beginning. Dr. McCullough said, “The injections should have been halted in February of 2021.” Instead, the government mandated the clot shots, and the CDC and FDA covered up the problems. The FDA is still covering up massive deaths and injuries from the mRNA shots. Dr. McCullough explains, “It’s the great gamble of the Covid19 vaccine program. It was the gamble of a lifetime, if not a gamble of all-time. The vaccines install the genetic code for the lethal Wuhan spike protein that was engineered in a bio-security lab in Wuhan, China. This is the worst idea ever to install a fatal protein and have it installed for an uncontrolled duration and an uncontrolled quantity in the human body. . . . This is a biological catastrophe in unspeakable proportions. . . . Nobody wants these shots now, and they are still mandating them and forcing them on people.”\n\nAccording to Dr. McCullough, the FDA admits the shots cause fatal heart damage, Fatal blood clotting, strokes, neurological injuries and other problems. When the evidence mounted on how deadly and debilitating the CV19 injections were, the FDA covered it all up instead of pulling them off the market. Dr. McCullough says, “Now, we have the additional deaths from the CV19 vaccines. The CDC shows 14,000 died the next day, and that is a gross under-reporting. . . The World Council for Health points out four agencies, including VAERS with 40,000 certified deaths, and that may be an under-reporting of 100 to 1. It’s a vast number, and no governments are doing investigations. The United States should be doing a full stop on this. Pfizer knew about 1,223 deaths within 90 days of release of their product . . . Pfizer logged all these deaths, but they didn’t pull their product off the market, and the FDA’s lawyer wanted to block that information from Americans for 55 years. So, the FDA is involved in a cover-up with Pfizer, and almost certainly with Moderna and Johnson & Johnson. It’s an ongoing biological catastrophe.”\n\nMcCullough contends that Covid is waning but warns, “What we are left with is just the vaccine injuries and damage itself. I can tell you we are going to have to be quite vigilant. The blood clots and heart damage, I have never ordered so many cardiac MRIs and ultrasound tests for blood clots. People need to be hyper-vigilant. They have put a foreign genetic code in their bodies. It’s produced the lethal Wuhan spike proteins. It’s in their brains, and it’s in their hearts. People can’t feel good that have taken this into their bodies. They have to know they have taken an extraordinary risk. . . . There are over 1,000 papers in the peer-reviewed literature. Not a single paper shows a benefit of these vaccines. 100 percent of it is bad news.”\n\nThere is much more in the 47-minute interview.\n\nJoin Greg Hunter of USAWatchdog.com as he interviews top cardiologist and CV19 expert Dr. Peter McCullough.\n\nTo find out more about The Wellness Company, click here.\n\nYou can find out much more about Dr. Peter McCullough by clicking here,", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/09/Dr.-Peter-McCullough-9.20.22-pic.png", "https://usawatchdog.com/", "https://www.petermcculloughmd.com/", "https://usawatchdog.com/donations/", "https://www.twc.health/", "https://www.petermcculloughmd.com/", "https://www.heartplace.com/dr-peter-a-mccullough", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/cv19-vax-deaths-injuries-are-an-ignored-humanitarian-catastrophe-dr-pierre-kory/", "https://usawatchdog.com/cv19-bioweapon-vax-bell-has-rung-cv19-vax-dead-piling-up-and-inflation-economy/", "https://usawatchdog.com/guilty-are-now-hiding-humanitarian-catastrophe-dr-pierre-kory/", "https://usawatchdog.com/fed-cannot-fight-inflation-peter-schiff/", "https://usawatchdog.com/inflation-will-win-and-is-here-to-stay-peter-schiff/"], "authors": [], "publish_date": "09/20/2022  •"}