{"result_id": "325001", "URL": "https://usawatchdog.com/trump-vax-mistake-vax-doesnt-work-fragile-economy-warning-10-22-21/", "timestamp": "2023-04-25 17:47:57 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (WNW 500 10.22.21) President Trump is still pushing the horrible injections he calls vaccines from his “Operation Warp Speed.” I don’t know who is telling him these are working well when death and injuries on VAERS (Vaccine Adverse Event Reporting System) outnumber all vax deaths and injuries for the past 30", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/trump-vax-mistake-vax-doesnt-work-fragile-economy-warning-10-22-21/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Trump Vax Mistake, Vax Doesn’t Work, Fragile Economy Warning | Greg Hunter’s USAWatchdog", "cleaned_text": "President Trump is still pushing the horrible injections he calls vaccines from his “Operation Warp Speed.” I don’t know who is telling him these are working well when death and injuries on VAERS (Vaccine Adverse Event Reporting System) outnumber all vax deaths and injuries for the past 30 years. By every metric, the vaccines Trump is still pushing are a growing disaster, just ask former Secretary of State Colin Powell. Oh wait, Powell was fully vaccinated, and he just died of complications from Covid 19. Stop the shots, Mr. President, and admit you are wrong. The nation will forgive you, but not the people who lied.\n\nThere is a new study done by Harvard (posted on National Institutes of Health website), and it basically says the vax injections do not work. The highest counties in America have the highest Covid transmission rates, and the lowest vaccinated counties have the lowest Covid transmission rates. It was the same overseas in high vaxed countries such as Israel. Dr. Chris Martenson simply says “We’ve been had.” I say it was a deadly money making scam for Big Pharma and government co-conspirators. They all should be prosecuted under the Nuremberg code of 1947. They hung Nazi doctors for experimenting on people against their will and without informed consent. Sound familiar?\n\nThere is no stopping the rising inflation trend we find ourselves in. There are supply chain disruptions and dramatically rising prices for just about everything. Inflation is going to force the Fed to raise interest rates. Trends researcher Gerald Celente summed it all up perfectly this past week on USAWatchdog.com and said, “When they raise interest rates, this thing goes down — end of story.”\n\nJoin Greg Hunter as he talks about these stories and more in the Weekly News Wrap-Up 10/22/21.\n\nPierre Kory, a top critical care Covid 19 doctor, will be the guest for the Saturday Night Post. He will be talking about the fight to get Ivermectin recognized as a cure for CV19 and cut through the huge lies being told by the government and Big Pharma that could cost you your life.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/10/1a-1.jpg", "https://usawatchdog.com/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8481107/", "https://usawatchdog.com/donations/", "https://covid19criticalcare.com/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/election-psyop-trump-won-economy-still-tanking/", "https://usawatchdog.com/framing-trump-again-tsunami-of-vax-lies-tanking-economy/", "https://usawatchdog.com/warning-signs-of-americas-destruction-jonathan-cahn/", "https://usawatchdog.com/fed-kills-the-economy-dem-blues-vax-keep-killing/", "https://usawatchdog.com/voting-vax-economy-frauds-will-end-quickly/"], "authors": [], "publish_date": "10/22/2021  •"}