{"result_id": "325033", "URL": "https://usawatchdog.com/covid-vaccine-lies-more-youtube-covid-censorship-economic-update/", "timestamp": "2023-04-25 17:48:32 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com (WNW 473 3.26.2021) Just about everything we have been told about Covid is a lie or lies by omission. We are told the Vaccine is the only way to beat Covid. We are also told there are no other treatments available. Those are lies. We are not told that the so-called", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/covid-vaccine-lies-more-youtube-covid-censorship-economic-update/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Covid Vaccine Lies, More YouTube Covid Censorship, Economic Update | Greg Hunter’s USAWatchdog", "cleaned_text": "Just about everything we have been told about Covid is a lie or lies by omission. We are told the Vaccine is the only way to beat Covid. We are also told there are no other treatments available. Those are lies. We are not told that the so-called vaccine is “experimental” and that all these so-called vaccines were only approved on an emergency basis. We are not told that these vaccines permanently alter your DNA with genetic engineering and that vaccine manufacturers have zero liability if you are permanently injured or die from a shot. Also, manufacturers of these so-called vaccines and the medical community have no idea what the effects will be in the short or long term. This makes what is going on today around America, with vaccine centers to push an unproven medical test, a huge reckless risk. Instead of giving the public actual information for “informed consent,” an idea that came out of the 1947 Nurnberg trials of Nazis, we have what I call “misinformed consent” based on lies, fraud and fear. The Nazis would be proud.\n\nYouTube has taken down another lifesaving video about the “wonder drug” called Ivermectin. This is an anti-viral drug that is decades old. It’s been proven safe with little downside risk when treating and preventing Covid19. Dr. Pierre Kory testified in the Senate about repurposing Ivermectin and the “mountains of evidence showing the miraculous effectiveness of Ivermectin.” The public is not allowed to hear alternatives to experimental vaccines. As I said last week, debates and alternative scientific information is NOT allowed. YouTube has taken down the Senate testimony of Dr. Kory (But you can watch it here) to censor any and all scientific alternatives to vaccines.\n\nThe economy is getting better—NOT. Another 684,000 initial unemployment claims were reported this week. Some financial experts are excited because it was not more than 700,000 claims. Not what I would consider a cause for celebration. Also, a huge cargo ship is blocking a major shipping choke point, and that is causing big economic problems in an already fragile global economy.\n\nJoin Greg Hunter of USAWatchdog.com as he talks about these stories and more in the Weekly News Wrap-Up for 3.26.2021.\n\nAnalyst Bo Polny, founder of Gold2020Forecast.com, will be the guest for the Saturday Night Post. Polny says April will be “The Greatest Time Point in Human History.” Polny will explain in detail what he says is coming.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2021/03/1a-3.jpg", "https://usawatchdog.com/", "https://fromthetrenchesworldreport.com/moderna-chief-medical-officer-admits-mrna-alters-dna/283512", "https://www.infowars.com/posts/youtube-bans-video-of-distinguished-doctor-claiming-ivermectin-is-a-miracle-cure/", "https://usawatchdog.com/donations/", "https://www.gold2020forecast.com/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/trump-fights-censorship-vax-lies-collapsing-inflation-going-higher/", "https://usawatchdog.com/fda-criminally-approved-bioweapon-as-safe-effective-vaccine-karen-kingston/", "https://usawatchdog.com/lies-dont-last-woke-broke-inflation-spiral/", "https://usawatchdog.com/framing-trump-again-tsunami-of-vax-lies-tanking-economy/", "https://usawatchdog.com/fraud-lies-psyops-cheating-for-midterms-more-vax-dead-more-war/"], "authors": [], "publish_date": "03/26/2021  •"}