{"result_id": "325009", "URL": "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/", "timestamp": "2023-04-25 17:48:06 CEST+0200", "meta": {"description": "By Greg Hunter’s USAWatchdog.com In May, Dr. Elizabeth Eads revealed the CV19 vax was causing extreme disease. Few doctors were sounding the alarm on the death and carnage from the bioweapon injections, and it’s going to get much worse before it’s over. Dr. Eads says, “Worldwide there are 10,000 deaths from these Covid vaccines daily.", "lang": "en", "keywords": "", "favicon": "apple-touch-icon.png", "canonical": "https://usawatchdog.com/mass-medical-bankruptcy-collapse-coming-dr-elizabeth-eads/", "encoding": "UTF-8"}, "image": null, "domain": "usawatchdog.com", "title": "Mass Medical Bankruptcy & Collapse Coming – Dr. Elizabeth Eads | Greg Hunter’s USAWatchdog", "cleaned_text": "In May, Dr. Elizabeth Eads revealed the CV19 vax was causing extreme disease. Few doctors were sounding the alarm on the death and carnage from the bioweapon injections, and it’s going to get much worse before it’s over. Dr. Eads says, “Worldwide there are 10,000 deaths from these Covid vaccines daily. That’s a culmination of data . . . collected from Israel, UK, Canada, the U.S. and Brazil. So,10,000 a day and they are estimating we are already up to 12 million deaths worldwide.” Dr. Eads thinks the death and injuries from the CV19 bioweapon will be orders of magnitude higher in the next five years.\n\nDr. Fauci, Dr. Birx, the FDA and CDC see what is coming. According to Dr. Eads, “They know this. They planned for it. They knew the consequences. They manipulated the vaccines as they went along and what was going into the vaccines . . . to make the booster shots more lethal. . . . Your immune system is absolutely destroyed with these shots. Every time you get a shot, you lose more of your immune system. You lose 30% after the first shot, 60% to 70% after the second shot, 80% or more after the third shot, and you lose 100% of your immune system after the 4th shot. You also have the propensity to develop vaccine induced aids.”\n\nYou can also get heart disease, blood clots, strokes, brain disease, extreme shingles and develop fast spreading extreme cancers, just to name a few of the effects of the bioweapon so-called vaccines, according to Dr. Eads.\n\nDr. Eads goes on to say, “People are waking up and saying, ‘Oh my gosh, what did I do to my immune system,’ and this is irreversible. It’s irreversible because you cannot not turn off the intercellular mechanism. You cannot turn off the nano particle system that is making these long clot-like structures in veins and arteries. . . . There is no such thing as ‘Sudden Adult Death Syndrome. These are side effects of the vaccine. Nobody dies of ‘Sudden Death’ when they are otherwise healthy adults. There is no such thing. . . . Here are the numbers I pulled off Attorney Todd Callender’s site. (He’s suing the U.S. military over the CV19 vax.) The all-cause mortality rate in the military is up 1,100%. . . . The top five life insurance companies are banding together and are going to file a class-action lawsuit against Big Pharma.”\n\nThat’s not all, according to Dr. Eads, as she sees not only Big Pharma liable for damages but hospitals, doctors, nurses, drug store chains and all sorts of people who helped make this bioweapon genocide possible. Dr. Eads says, “You are talking about billions of dollars, and they are not going to be able to afford to pay out all these claims. . . .It’s going to bankrupt Big Pharma, and Big Pharma will end up collapsing. Hospitals will also end up collapsing because they were complicit in death by ventilators and remdesivir. Mass medical bankruptcies are coming 100%. This is going to be the collapse of the Rockefeller medical industry.”\n\nDr Eads says there are treatments that can help both the vaxed and unvaxed with removing harmful spike proteins. Two she named are Ivermectin and Hydroxychloroquine (HCQ). Dr. Eads says there are some other helpful treatments and procedures as well.\n\nThere is much more cutting edge, frontline medical information in the nearly 1-hour and 19-minute interview.\n\nJoin Greg Hunter as he talks to 25-year veteran Dr. Elizabeth Eads, DO, as she continues to highlight the worsening, and now obvious, effects of the CV19 bioweapon vax.\n\nYou can follow Dr. Elizabeth (Betsy) Eads on Twitter, or you can follow her on Telegram.\n\nMore from Attorney Todd Callender in an April 2022 interview, click here.\n\nThe Pfizer documents Dr. Eads talked about with pregnant women are here. Start on page 65.\n\nTo find out about Chlorine Dioxide and its inventor click here.\n\nTo order Chlorine Dioxide “A” and “B” click here.\n\nIf you are looking to buy physical gold and silver coins, check out our sponsor Discount Gold and Silver Trading. Ask for Melody Cedarstrom, the owner, at 1-800-375-4188.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://usawatchdog.com/wp-content/uploads/2022/08/Dr-Eads-8.23.22-pic.png", "https://usawatchdog.com/", "https://yournews.com/2022/08/19/2398411/mike-adams-10000-people-a-day-being-killed-by-covid/", "https://t.me/KashDiscussion/22686", "https://t.me/Dr_BetsyChannel", "https://usawatchdog.com/donations/", "https://twitter.com/eads_elizabeth", "https://t.me/Dr_BetsyChannel", "https://zeeemedia.com/interview/todd-callender-c-investigative-committee/", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://andreaskalcker.com/en/", "https://kvlab.com/chlorine-dioxide-products/chlorine-dioxide-kit-w-hcl-activator-NKP-H4", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://usawatchdog.com/discount-gold-and-silver-trading/", "https://satellitephonestore.com/special-promo?affiliate=usawatchdog?utm_source=USA%20Watch%20Dog%20-%20Greg%20Hunter&utm_medium=Podcast&utm_campaign=USA%20Watch%20Dog%20-%20Greg%20Hunter", "https://dry-element.myshopify.com", "https://readymaderesources.com", "https://www.westonscientificllc.com", "https://usawatchdog.com/join/", "https://usawatchdog.com/advertise/", "https://usawatchdog.com/tsunami-of-vax-deaths-coming-in-next-two-years-dr-betsy-eads/", "https://usawatchdog.com/medical-financial-political-war-disasters-getting-worse-dr-chris-martenson/", "https://usawatchdog.com/more-money-for-war-cv19-vax-mass-awakening-autos-economy-plunge/", "https://usawatchdog.com/global-cv19-vax-propaganda-means-mass-casualties-dr-pierre-kory/", "https://usawatchdog.com/cv19-vax-causing-extreme-disease-dr-betsy-eads/"], "authors": [], "publish_date": "08/24/2022  •"}