{"result_id": "326041", "URL": "https://vaccineimpact.com/2018/science-vs-cdc-is-the-flu-vaccine-more-dangerous-than-the-flu/", "timestamp": "2023-04-25 17:49:18 CEST+0200", "meta": {"description": "CDC’s strategy to use fear to ramp up flu vaccine sales ­­­­requires the agency to exaggerate both flu risks and vaccine efficacy. Pharmaceutical companies and public health officials vastly overstate flu cases and deaths in order to market influenza “as a threat of great proportions.” Simple fact-checking shows that since October 2017, only 14.7% of the almost 447,000 “flu” specimens tested by clinical laboratories working with CDC have tested positive for influenza. This proportion has remained relatively constant for the past two decades. According to the British Medical Journal’s Peter Doshi, “Even the ideal influenza vaccine…can only deal with a small part of the ‘flu’ problem because most ‘flu’ appears to have nothing to do with influenza.” Actual influenza deaths not only rank lower than the major killers such as heart disease and cancer but also are lower down in the mortality rankings than ulcers and hernias. Incredibly, even though most “flu” is not influenza and flu vaccine effectiveness is as low as 10%, public health authorities keep telling everyone from six months of age on up (including pregnant women) that the flu shot is “better than nothing” and the “best tool we have.” However, there are many unanswered questions about influenza vaccines that warrant rigorous investigation. Recent peer-reviewed studies suggest that the shots may actually make people more susceptible to serious problems (as with the recently recalled dengue vaccine) and that getting flu shots year after year may be lowering subsequent vaccine effectiveness as well as drastically increasing risks for Alzheimer’s disease. Getting vaccinated against one strain of influenza may increase risks for other severe respiratory viruses. Unfortunately, most members of the public are not reading this alarming science. The public should make health decisions based on sound science, not scare tactics.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/2018/science-vs-cdc-is-the-flu-vaccine-more-dangerous-than-the-flu/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "Science vs. CDC: Is the Flu Vaccine More Dangerous than the Flu? - Vaccine Impact", "cleaned_text": "Every year, the Centers for Disease Control and Prevention (CDC) and pharmaceutical companies mount an aggressive campaign in the mainstream media to persuade Americans to get their flu shots.\n\nFlu shots are big business: industry analysts estimate that within the next five years, the U.S. flu vaccine market will be worth almost $3 billion annually.\n\nAnd profit margins are growing as manufacturers increase price premiums for the newer four-strain vaccines. The U.S. expects to distribute roughly 166 million doses for the 2017-18 flu season, up from 146 million doses in the previous year.\n\nAs pharmaceutical companies bombard American consumers with ubiquitous billboards, drugstore enticements and radio announcements to “get your flu shot now,” the CDC has advised the industry to hike demand through the use of a “recipe” of scare-mongering messaging. (See Figure 1) CDC recommends “creating concern, anxiety and worry” among the American public.\n\nUsing spokespeople like Paul Offit and Peter Hotez as well as its extensive media partnerships and captive bureaucrats at CDC, the pharmaceutical industry has effectively banished the scientific debate about flu shot safety and efficacy from the public square.\n\nWhat ARE the scientific facts about the flu shot?\n\nThe science indicates significant risks and low efficacy, both in the U.S. and internationally.\n\nIn 2010, for example, Australia suspended its influenza vaccination program for children under five after one in 110 children experienced convulsions and other serious reactions within hours of getting their flu shots.\n\nIn Italy in 2014, authorities suspended half a million doses of an influenza vaccine containing a proprietary adjuvant after 13 suspicious deaths occurred in people who got the shot.\n\nCloser to home, local news includes a steady stream of reports about healthy individuals acknowledged to have died on the heels of receiving their flu shot in recent years:\n• A flu-vaccinated 12-year-old boy died at home after health workers failed to recognize that he was ill (January 2018, Sterling Heights, MI).\n• A 5-year-old girl succumbed to influenza-related cardiac arrest after contracting “the same [influenza] strain for which she had been vaccinated” (January 2015, Las Vegas, NV).\n• Two female health care workers in their twenties and thirties were required to get flu shots for their jobs and developed apparent flu-related sepsis (January 2015, Pleasant Prairie, WI and December 2014, Lee’s Summit, MO).\n• Fourteen-year-old and 3-year-old girls who died after receiving flu shots were described as being “weakened…so severely that secondary complications made it impossible for them to survive” (January 2015, Des Moines, IA).\n• A 7-year-old girl died four days after receiving a flu shot at her annual well-child check-up (January 2012, Barton, VT).\n\nMany other flu shot deaths may have been missed since the stubbornly incurious media rarely report the vaccination status of children who die of ‘flu’ or ‘flu-like’ symptoms.\n\nIn a typical tragic case, doctors in Visalia, CA “misdiagnosed” the flu in a 12-year-old girl who died suddenly in January; the listed causes of death (“cardiac arrest and septic shock”) were remarkably similar to symptoms experienced by other flu shot victims, although news reports did not disclose the Visalia girl’s vaccination status.\n\nLikewise, authorities could not verify whether a third-grade girl who died in mid-January of “flu complications” in Alabama had received a flu shot.\n\nAlthough all vaccines have the potential to cause serious harm to both children and adults, influenza vaccines—which contain neurotoxic and carcinogenic ingredients such as thimerosal, aluminum and formaldehyde as well as bacterial endotoxin—lead the pack in U.S. reports of serious vaccine injuries.\n\nMore than four out of five (83%) of the vaccine injury cases (275/332) settled through the National Vaccine Injury Compensation Program (NVICP) for the nine-month period from mid-November 2016 through mid-August 2017 were flu-vaccine-related, including four deaths.\n\nNotably, almost four in ten of the reported non-fatal injuries for that period were for the highly debilitating and potentially life-threatening Guillain-Barre syndrome (GBS). Studies have linked GBS to flu vaccines for many years, suggesting plausible biological mechanisms to explain the relationship. The other non-fatal flu vaccine injuries reported to VAERS in 2016-17 read like a catalogue of ordinarily rare diseases.\n\nFrom 2014 to 2015, the NVICP flu shot settlements increased from $4.9 million to $61 million—an 1100% increase.\n\nAs the Vaccine Adverse Event Reporting System (VAERS), a voluntary surveillance system, is acknowledged by the government to capture as little as one percent of actual adverse events, the flu vaccine injuries and deaths are substantially underreported.\n\nIn a rational world, untainted by Pharma money, low flu shot efficacy would also inform consumer choice about vaccine risks and benefits. This year in Santa Barbara County, California, seven out of eight senior citizens who reportedly died from the flu had dutifully gotten their flu shots and had taken “flu-fighting medications” (which have their own set of problems).\n\nThe County’s public health officer attributed the higher-than-normal mortality to the flu strain that is “particularly resistant to vaccination.”\n\nShe still continues to advocate for flu shots as a “life or death” choice, even though infectious disease experts peg the vaccine’s effectiveness at an abysmal 10% this year.\n\nFigure 1. Cartoon from CDC’s “Increasing Awareness and Update of Influenza Immunization” presentation made to the National Academies of Science, Engineering and Medicine.\n\nCDC’s strategy to use fear to ramp up flu vaccine sales ­­­­requires the agency to exaggerate both flu risks and vaccine efficacy.\n\nPharmaceutical companies and public health officials vastly overstate flu cases and deaths in order to market influenza “as a threat of great proportions.”\n\nSimple fact-checking shows that since October 2017, only 14.7% of the almost 447,000 “flu” specimens tested by clinical laboratories working with CDC have tested positive for influenza. This proportion has remained relatively constant for the past two decades.\n\nAccording to the British Medical Journal’s Peter Doshi,\n\nActual influenza deaths not only rank lower than the major killers such as heart disease and cancer but also are lower down in the mortality rankings than ulcers and hernias.\n\nIncredibly, even though most “flu” is not influenza and flu vaccine effectiveness is as low as 10%, public health authorities keep telling everyone from six months of age on up (including pregnant women) that the flu shot is “better than nothing” and the “best tool we have.”\n\nHowever, there are many unanswered questions about influenza vaccines that warrant rigorous investigation. Recent peer-reviewed studies suggest that the shots may actually make people more susceptible to serious problems (as with the recently recalled dengue vaccine) and that getting flu shots year after year may be lowering subsequent vaccine effectiveness as well as drastically increasing risks for Alzheimer’s disease.\n\nGetting vaccinated against one strain of influenza may increase risks for other severe respiratory viruses.\n\nUnfortunately, most members of the public are not reading this alarming science. The public should make health decisions based on sound science, not scare tactics.\n\nFor more information, see the World Mercury Project’s flu articles, facts sheet and brochure.", "opengraph": {"locale": "en_US", "site_name": "Vaccine Impact -", "type": "article", "title": "Science vs. CDC: Is the Flu Vaccine More Dangerous than the Flu? - Vaccine Impact", "description": "CDC’s strategy to use fear to ramp up flu vaccine sales ­­­­requires the agency to exaggerate both flu risks and vaccine efficacy. Pharmaceutical companies and public health officials vastly overstate flu cases and deaths in order to market influenza “as a threat of great proportions.” Simple fact-checking shows that since October 2017, only 14.7% of the almost 447,000 “flu” specimens tested by clinical laboratories working with CDC have tested positive for influenza. This proportion has remained relatively constant for the past two decades. According to the British Medical Journal’s Peter Doshi, “Even the ideal influenza vaccine…can only deal with a small part of the ‘flu’ problem because most ‘flu’ appears to have nothing to do with influenza.” Actual influenza deaths not only rank lower than the major killers such as heart disease and cancer but also are lower down in the mortality rankings than ulcers and hernias. Incredibly, even though most “flu” is not influenza and flu vaccine effectiveness is as low as 10%, public health authorities keep telling everyone from six months of age on up (including pregnant women) that the flu shot is “better than nothing” and the “best tool we have.” However, there are many unanswered questions about influenza vaccines that warrant rigorous investigation. Recent peer-reviewed studies suggest that the shots may actually make people more susceptible to serious problems (as with the recently recalled dengue vaccine) and that getting flu shots year after year may be lowering subsequent vaccine effectiveness as well as drastically increasing risks for Alzheimer’s disease. Getting vaccinated against one strain of influenza may increase risks for other severe respiratory viruses. Unfortunately, most members of the public are not reading this alarming science. The public should make health decisions based on sound science, not scare tactics.", "url": "https://vaccineimpact.com/2018/science-vs-cdc-is-the-flu-vaccine-more-dangerous-than-the-flu/", "article:published_time": "2018-01-31T20:56:53+00:00", "article:modified_time": "2018-01-31T20:56:53+00:00"}, "tags": ["flu shot promotions", "flu vaccine"], "tweets": [], "movies": [], "links": ["http://vaccineimpact.com/wp-content/uploads/sites/5/2018/01/01-29-Flu-Vaccine_Featured_Image.jpg", "https://worldmercuryproject.org/news/caveat-emptor-science-versus-cdc-on-scary-flu-shot-promotions/", "https://worldmercuryproject.org/news/caveat-emptor-science-versus-cdc-on-scary-flu-shot-promotions/", "https://www.medgadget.com/2017/08/united-states-flu-vaccine-market-2017-industry-trend-and-forecast-2024.html", "https://www.newsmax.com/health/health-news/quadrivalent-vaccines-drug-manufacturers-drug-profits-4-in-1-flu-vaccines/2013/09/19/id/526666/", "https://www.cdc.gov/flu/about/qa/vaxsupply.htm", "https://www.cdc.gov/flu/professionals/vaccination/vaccinesupply-2016.htm", "https://worldmercuryproject.org/wp-content/uploads/01-29-CDC-flu-uptake-presentation-Nowak.pdf", "https://worldmercuryproject.org/wp-content/uploads/flu-shots-brochure-world-mercury-project-2017.pdf", "http://www.watoday.com.au/wa-news/flu-vaccination-ban-goes-national-after-fever-convulsions-in-children-20100422-tglp.html", "http://www.cidrap.umn.edu/news-perspective/2014/12/novartis-flu-vaccine-hold-italy-after-suspicious-deaths", "http://people.com/human-interest/12-year-old-boy-dies-after-flue-screening-negative/", "http://www.spokesman.com/stories/2015/jan/21/popular-downtown-hot-dog-vendor-dies-flu/#/0", "http://www.fox5vegas.com/story/27906527/3rd-child-in-clark-co-dies-as-result", "http://www.wisn.com/article/kenosha-woman-26-dies-of-flu/6324953", "http://fox4kc.com/2014/12/29/blue-springs-woman-dies-from-flu-at-age-37-ku-hospital-seeing-high-number-of-people-hospitalized/", "https://www.desmoinesregister.com/story/news/health/2015/01/05/flu-deaths-iowa-amber-gray/21314709/", "https://www.sevendaysvt.com/vermont/flu-shot-or-not-state-health-officials-warn-against-alarmist-reaction-to-young-girls-death/Content?oid=2183309", "http://abc7news.com/health/california-girl-dies-from-infection-doctors-misdiagnosed-as-flu/2919817/", "http://www.abc-7.com/story/37303341/alabama-third-grader-dies-from-flu", "https://www.ncbi.nlm.nih.gov/pubmed/29241647", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/b/excipient-table-2.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC274722/", "http://vaccineimpact.com/wp-content/uploads/sites/5/2017/09/DOJ-Report-9.8.17.pdf", "http://www.thinktwice.com/Images/gsb.pdf", "http://www.themomstreetjournal.com/increase-in-vaccine-injury-payouts/", "https://healthit.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://www.independent.com/news/2018/jan/08/flu-kills-eight-santa-barbara-residents-two-weeks/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1914480/", "https://www.cbsnews.com/news/this-years-flu-vaccine-may-only-be-10-effective-experts-warn/", "http://vaccineimpact.com/wp-content/uploads/sites/5/2018/01/Capture.png", "http://www.bmj.com/content/346/bmj.f3037", "https://www.cdc.gov/flu/weekly/index.htm", "http://vaxxter.com/wp-content/uploads/2018/01/Influenza-disease-15-2.pdf", "http://www.bmj.com/content/346/bmj.f3037", "http://www.huffingtonpost.ca/lawrence-solomon/death-by-influenza_b_4661442.html", "http://www.sciencemag.org/news/2017/09/why-flu-vaccines-so-often-fail", "http://beta.latimes.com/local/california/la-me-ln-flu-deaths-20180112-story.html", "http://www.straitstimes.com/asia/se-asia/philippines-recalls-worlds-first-dengue-vaccine-dengvaxia-over-safety-concerns", "https://academic.oup.com/cid/article/56/10/1363/404283", "https://www.newsmax.com/Health/Headline/flu-shots-vaccine-thimerosal/2014/11/20/id/608614/", "https://academic.oup.com/cid/article/54/12/1778/455098", "https://worldmercuryproject.org/mercury-facts/mercury-in-vaccines/flu-vaccines/#articles", "https://worldmercuryproject.org/mercury-facts/mercury-in-vaccines/flu-vaccines/#articles", "https://worldmercuryproject.org/wp-content/uploads/flu-shots-brochure-world-mercury-project-2017.pdf", "https://worldmercuryproject.org/news/caveat-emptor-science-versus-cdc-on-scary-flu-shot-promotions/", "https://healthimpactnews.com/revive/www/delivery/ck.php?n=af3e0a62&cb=INSERT_RANDOM_NUMBER_HERE"], "authors": [], "publish_date": "2018-01-31T20:56:53+00:00"}