{"result_id": "326030", "URL": "https://vaccineimpact.com/tag/mandatory-vaccines/", "timestamp": "2023-04-25 17:49:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/tag/mandatory-vaccines/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "mandatory vaccines - Vaccine Impact", "cleaned_text": "No, You Don’t Have a “Right” to Demand that Others are Vaccinated\n\nIt's hard to think of a more fundamental right than the right to determine what happens to one's own body. Forcing someone to undergo medical treatment against their will violates this most basic of rights—the right to be free from physical assault. To begin with, nobody has a \"right\" to a germ-free environment outside of their own property (and good luck establishing one there). Proponents of vaccine mandates assert this \"right\" as if it is a long-standing social or legal norm, but it is not. Human beings have been living among each other for millennia, and there has never been a widely asserted right to freedom from any and all pathogens at others' expense. There has, historically, been a widely held and asserted expectation of quarantine in the case of exceptionally dangerous illnesses. However, this is not at all what the proponents of mandated vaccines are calling for. Quarantine is simply the demand that those who are already infected with a disease remain isolated in their homes or elsewhere until they are no longer able to infect others. This is profoundly different from what the pro-mandate crowd demands: that those who are not infected undergo a medical procedure to minimize their chances of becoming infected. This is a much more intrusive demand and a potentially dangerous one. Furthermore, measles—the scariest thing the mandate pushers can come up with—is not even on the list of federally quarantinable diseases.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://vaccineimpact.com/2019/no-you-dont-have-a-right-to-demand-that-others-are-vaccinated/"], "authors": [], "publish_date": null}