{"result_id": "326048", "URL": "https://vaccineimpact.com/tag/measles-vaccine/", "timestamp": "2023-04-25 17:49:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/tag/measles-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "measles vaccine - Vaccine Impact", "cleaned_text": "Dr. Suzanne Humphries is a practicing nephrologist (kidney physician). In this lecture, she addresses a study done in Croatia where a child who was vaccinated with the MMR vaccine was tested positive for the measles vaccine strain Schwarz eight days after vaccination. This was a significant finding, because the child's symptoms were thought to be similar to rubella, and without testing, the sickness would have been possibly mis-diagnosed as rubella, or the wild-type strain of measles the vaccine is designed to protect against. Since this study in 2010, others studies have also confirmed that those vaccinated with the MMR vaccine are susceptible to becoming infected with measles, the vaccine measles virus, and not the wild virus. Are health officials testing cases of measles in the current outbreak in the United States, to determine if the measles strain is the wild strain of the vaccine strain? Not likely, and it is not likely that the mainstream media \"TV doctors\" will even discuss this as they falsely vilify parents who choose not to administer the MMR vaccine to their children as the cause of these outbreaks. Some of these cases are confirmed to be among those who have received the MMR vaccine, and for those who have not been vaccinated, is it possible they were infected from those recently vaccinated when the vaccine was still \"shedding,\" and that the vaccine-strain of measles was passed on from the vaccinated child to the unvaccinated child?", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://vaccineimpact.com/2015/dr-suzanne-humphries-m-d-vaccine-strain-of-measles-virus-found-in-measles-outbreaks/"], "authors": [], "publish_date": null}