{"result_id": "326033", "URL": "https://vaccineimpact.com/tag/vaccine/", "timestamp": "2023-04-25 17:49:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/tag/vaccine/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "vaccine - Vaccine Impact", "cleaned_text": "FDA Cover-up? New Data Obtained Shows MMR Vaccine Approved on Clinical Trials of Only 342 Children – Half Suffered Side Effects\n\nAs we have previously reported here on Health Impact News, pharmaceutical giant Merck has been fighting a criminal case regarding its MMR (Measles, Mumps, Rubella) vaccine in court for over 8 years, as their own scientists became whistle-blowers regarding fraud in the development of the vaccine. Now, Del Bigtree, founder of the non-profit Informed Consent Action Network (ICAN), has announced that a new Freedom of Information Act disclosure from the Federal Food and Drug Administration (FDA) has revealed that the MMR vaccine was licensed based on clinical trials which in total had less than 1,000 participants, and only 342 children. “Thanks to the laws in this country that for now at least permit access to various government records, we now know the MMR vaccine was licensed using an irresponsibly small and limited group of children,” says Bigtree. “But what’s even more alarming is learning about the serious adverse events that were known and acknowledged, yet ignored in order to license the MMR vaccine,” Bigtree adds, noting “This was after only tracking adverse events for 42 days after injection – imagine what they might have found had they tracked safety for three years against an appropriate control, like they do for drugs.”", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://vaccineimpact.com/2019/fda-cover-up-new-data-obtained-shows-mmr-vaccine-approved-on-clinical-trials-of-only-342-children-half-suffered-side-effects/"], "authors": [], "publish_date": null}