{"result_id": "326046", "URL": "https://vaccineimpact.com/tag/dr-sohrab-lutchmedial/", "timestamp": "2023-04-25 17:49:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/tag/dr-sohrab-lutchmedial/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "Dr. Sohrab Lutchmedial - Vaccine Impact", "cleaned_text": "Cardiologist Medical Doctor who Wanted to Punch Anti-Vaxxers in the Face DEAD After COVID Booster Shot\n\nA 52-year-old cardiologist, hospital director and hockey coach is dead after spending much of 2021 belittling the non-vaxxed. Dr. Sohrab Lutchmedial promoted mRNA injections for 12-year-olds and made the false, very dangerous claim that the shots are “undeniably safe.” Dr. Lutchmedial then advocated violence against so-called anti-vaxxers, saying he wants to “punch those people in the face.” Whether you call it ironic, prophetic or something else, Dr. Lutchmedial said via Facebook on March 5, “99.999999% of all the decisions and actions we make during our lives means absolutely nothing when we die.” The post was in response to the death of Walter Gretzky, father of NHL great Wayne Gretzky. Dr. Lutchmedial received his third injection, aka “booster,” on October 24. His last Facebook post was published on November 7 at 3:10 p.m. local time. It was about visiting friends and family (his kids) at the University of Guelph in Ontario. Dr. Lutchmedial “died in his sleep” on November 8, according to CBC News. He worked at the New Brunswick Heart Centre for more than 20 years. Dr. Lutchmedia was part of a team to perform the first MitraClip procedure in Eastern Canada. It repairs the heart’s mitral valve without open-heart surgery.", "opengraph": {}, "tags": ["News"], "tweets": [], "movies": [], "links": ["https://vaccineimpact.com/2021/cardiologist-medical-doctor-who-wanted-to-punch-anti-vaxxers-in-the-face-dead-after-covid-booster-shot/"], "authors": [], "publish_date": null}