{"result_id": "326037", "URL": "https://vaccineimpact.com/tag/vaccines/", "timestamp": "2023-04-25 17:49:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/tag/vaccines/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "Vaccines - Vaccine Impact", "cleaned_text": "We hear all the time that “the science is clear: vaccines save lives.” But where is that science? If it exists, then why can nobody show it? Vaccines are a religion and vaccinations are a (barbaric) religious ritual. That means that any kind of mandatory vaccination law is unconstitutional. Some people might still play semantics and say that a belief system is not the same as a religion. But let’s look at the vaccine religion. – You are expected to go to preparation classes (prenatal check-ups) – You are expected to give birth in the temple (=hospital). – As soon as the baby is born you are confronted with the temple servants (doctors/nurses/midwives) who want to submit your baby to the standard ritual (two injections) – If you decline they usually will try to convince or coerce you – At set times after birth you need to bring your baby to another temple (doctor’s practice) for more rituals – If you don’t want to submit your baby to the rituals you can expect extremely negative reactions, which can become aggression and end up with you not being welcome in the temple anymore – If you lose the faith (or never join in the first place) you can expect social exclusion and often serious family trouble. Some grandparents even consider “saving their grandchildren” by bringing them to the temple themselves, without the parents permission. Vaccinations have almost every characteristic of a religion, so the desperate argument that a belief system doesn’t equal a religion doesn’t hold up.", "opengraph": {}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://vaccineimpact.com/2019/vaccines-are-religion-not-science/"], "authors": [], "publish_date": null}