{"result_id": "326010", "URL": "https://vaccineimpact.com/", "timestamp": "2023-04-25 17:48:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "Vaccine Impact", "cleaned_text": "Will America’s Addiction to Computer Technology be it’s Downfall?\n\nAmerica is the most technology-dependent society in the world, by far. As I reported last week, the United States has the ability to spy on its citizens at a greater percentage than even China, due to the fact that a higher percentage of U.S. citizens are connected through technology and their cell phones than citizens in China, where over one third of the people in China do not even own cell phones yet. There is another way to measure America's dependency on technology besides cell phone and Internet usage, and that is by looking at how many data centers are in the U.S. that host all the server hardware that is required to keep all this technology running. In this category, the U.S. has no serious competitors. In fact, the U.S. owns more data centers than almost all other countries of the world combined, according to Statista.com. These physical computers, which are housed in physical buildings in physical locations, require tremendous resources to operate, which include energy resources and human resources, to keep it all running. Almost everything connected to the Internet today is run by these data centers that provide Cloud Computing. And all of these computers are primarily owned by three companies: Amazon.com and \"Amazon Web Services\" (AWS), Microsoft and \"Microsoft Azure,\" and Google with their Cloud Services. If an enemy of the United States wanted to totally cripple our country, including military and intelligence operations, all they would have to do is take down the data centers owned by these three companies. The physical locations of these data centers is a matter of public knowledge, and I was able to find lists of their physical locations by using their own search engines, in less than 5 minutes.", "opengraph": {"locale": "en_US", "site_name": "Vaccine Impact -", "type": "website", "title": "Vaccine Impact -", "url": "https://vaccineimpact.com/"}, "tags": ["News", "Headline"], "tweets": [], "movies": [], "links": ["https://vaccineimpact.com/2023/will-americas-addiction-to-computer-technology-be-its-downfall/"], "authors": [], "publish_date": null}