{"result_id": "326011", "URL": "https://vaccineimpact.com/2016/study-unvaccinated-children-healthier-than-vaccinated-kids-doctors-agree/", "timestamp": "2023-04-25 17:48:55 CEST+0200", "meta": {"description": "A recent peer-reviewed study comparing health outcomes of vaccinated and unvaccinated children, provisionally published in a journal of public health and assigned a DOI number (a digital object identifier given by publishers to identify content and provide a persistent link on the internet), found that completely unvaccinated children have less chronic disease and a lower risk of autism than vaccinated children. According to the abstract, the team of four scientists found that completely unvaccinated children were significantly more likely to get chickenpox and whooping cough but significantly less likely to suffer from ear infections, pneumonia, allergies, and brain or central nervous system disorders, including autism. In this investigative report, Dr. Jennifer Margulis interviews medical doctors, health experts, and parents, parents who have both vaccinated and unvaccinated children, confirming the conclusion of this new study that unvaccinated children are generally healthier than vaccinated children.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/2016/study-unvaccinated-children-healthier-than-vaccinated-kids-doctors-agree/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "Study: Unvaccinated Children Healthier Than Vaccinated Kids – Doctors Agree - Vaccine Impact", "cleaned_text": "Sarah Carrasco never thought twice about vaccines. She and her husband, who married while still in college, were delighted with their brown-haired brown-eyed baby. At the one-year check-up David already knew most of the alphabet and could say five words: “Mom,” “Dad,” “Brober,” (the happy couple was talking about having another baby), “Hi,” and “Bye.”\n\nSarah remembers the pediatrician predicting her son would be a genius.\n\nBut after David had the one-year round of shots, he spiked a 103 fever, arched his back as if in pain, passed mucous-filled green diarrhea, and could not stop crying.\n\nBaby David was so sick that Sarah brought him back to the pediatrician two days later and several times after that. As documented in his voluminous medical file, her son was having eight to ten bouts of diarrhea a day and lost his ability to speak.\n\nA week after the vaccine visit, he also stopped making eye contact.\n\nThe doctor reassured Sarah there was nothing to worry about.\n\nSarah is 38 years old and lives in Lakewood, Colorado. But her story is eerily familiar. She is one of thousands—if not hundreds of thousands—of American parents who report that they followed their doctor’s orders, got every vaccine on the current CDC childhood schedule, and watched their children suffer from brain and immune damage.\n\nMedical Doctors, Not Just Parents, Report Vaccine Damage in Children\n\nKelly Sutton, M.D., an integrative physician based in Fair Oaks, California who has been practicing medicine for 45 years, says that she sees patients who have been vaccine-injured every day.\n\nStudy: Unvaccinated Children have Less Chronic Disease and a Lower Risk of Autism than Vaccinated Children\n\nA recent peer-reviewed study comparing health outcomes of vaccinated and unvaccinated children, provisionally published in the journal Frontiers in Public Health and assigned a DOI number (a digital object identifier given by publishers to identify content and provide a persistent link on the internet), confirmed what parents like Sarah Carrasco have observed: that completely unvaccinated children have less chronic disease and a lower risk of autism than vaccinated children.\n\nThe researchers collected health information on over 660 children from a survey conducted in 2012 of mothers of children between six and twelve years old in four states (Florida, Louisiana, Mississippi, and Oregon). According to the abstract, the team of four scientists found that completely unvaccinated children were significantly more likely to get chickenpox and whooping cough but significantly less likely to suffer from ear infections, pneumonia, allergies, and brain or central nervous system disorders, including autism.\n• Vaccinated children were more than twice as likely to have some chronic illness.\n• Vaccinated children were nearly four times as likely to have learning disabilities, attention deficit hyperactivity disorder, and autism spectrum disorder.\n• Vaccinated children who were born prematurely were more than six times more likely to have brain or central nervous system disorders, including autism.\n\nDoctors See Link Between Vaccines and Autism Rates\n\nRavenel, 78, admits that in his long career practicing medicine he used to dismiss the idea vaccines are connected to autism or other health problems in children. But now, after attending autism conferences, researching the peer-reviewed scientific literature, and paying more attention to parents’ experiences, he has changed his mind.\n\nRavenel insists that any doctor who does the research, instead of just heedlessly following the recommendations of his professional medical organizations, will come to the same conclusion.\n\nParents With Vaccinated and Unvaccinated Children Notice That Their Unvaccinated Children are Healthier\n\nUnaware that her son’s growing health problems might be related to vaccines, Sarah Carrasco continued to vaccinate, though family members begged her not to.\n\nAt David’s two-year check-up she mentioned to the doctor that her mother thought it might be safer to delay some vaccines. The doctor became enraged.\n\nDavid became extremely violent and self-injurious—banging his head against the wall until he bled, hitting himself. At three he was diagnosed with Sensory Integration Disorder and the doctors told her they suspected psychosis. At four and a half, he was diagnosed with autism.\n\nBy then Carrasco had another baby, Aidan, who was also being vaccinated, though on a delayed schedule (a different doctor told her it was fine to delay some vaccines as long as he was caught up by the time he went to school).\n\nSo Aidan had the vaccine against measles, mumps, and rubella (MMR) at age two, instead of between 12 and 15 months, which is the current CDC recommendation. Immediately afterwards he spiked a fever of 105 and started high-pitched screaming.\n\nAidan has since been diagnosed with ADHD and soft teeth, which her dentist told her can be caused by very high fever in early childhood.\n\nSo when Sarah’s third son was born almost four years ago, she refused vaccines.\n\nBrooks is a talkative, active, imaginative preschooler who adores his older brothers, loves to play outside, and draws colorful stick figures of The Joker and Harley Quinn. The difference between his health and his older brothers’ is startling.\n\nThat doesn’t surprise Kelly Sutton, the doctor based in Fair Oaks, California.\n\nAllison Rogers, a 29-year-old mom of four in Austin, Texas, has two vaccinated and two unvaccinated children. Allison will never forget the drive to the pediatrician’s office when her oldest was 18 months old.\n\nAfter the immunizations, Hudson slept for six and a half hours and could not be roused. Both Hudson and his brother Adler, born 19 months later and also vaccinated, are on the autism spectrum.\n\nToday Hudson is seven years old, disengaged, and non-verbal.\n\nLike Sarah, when Allison became pregnant for the third time, she decided not to do any vaccines. Her completely unvaccinated four year old, Graham, and her unvaccinated 15-month old, Beckett, are both in excellent health and neurotypical. Allison is sure that it is not a coincidence.\n\nAre parents like Sarah Carrasco and Allison Rogers “irresponsible,” “selfish,” and “crazy,” as the mainstream media proclaims? Are the hundreds of medical doctors and other health care practitioners now voicing concerns over the current CDC vaccine schedule and delaying vaccines for their own families “quacks” who should lose their medical licenses?\n\nStanford graduate J.B. Handley, a successful entrepreneur who has a child affected by autism, says no.\n\nNeuroscientist Rene Anand, Ph.D., is a professor in the Department of Chemistry and Pharmacology at Ohio State University’s medical school who is researching how the environment and genes interact to increase susceptibility to brain disorders. Anand—who is quick to credit vaccines with saving millions of lives and to point out he is pro-vaccine—insists it is not scientifically accurate to disregard the possibility that vaccines may be triggering autism in genetically susceptible children.\n\nGiven the fact that so many parents report witnessing a decline in their children’s immune systems and cognitive functioning directly following vaccination, the possible connection, Anand says, must be thoroughly investigated.\n\nTommy Redwood, M.D., an emergency room doctor based in Atlanta, Georgia who has been practicing medicine for 26 years, suspects over-vaccination is playing a causal role in poor health outcomes among today’s children. Instead of trying to force vaccine compliance among vaccine-hesitant families, Redwood believes the medical community needs to appropriately and reasonably address parents’ concerns.\n\nRedwood says, adding that he thinks ignoring parents’ observations is a mistake, and that the most responsible medical doctors always listen carefully to their patients.\n\nLike Redwood, children’s health advocates, vaccine safety activists, and medical professionals have been calling for a well-designed publicly funded large-scale study comparing completely unvaccinated children with fully vaccinated children for years.\n\nSo far the government has refused.\n\nEven when well-designed small-scale privately funded studies are conducted, you may never read them.\n\nThe study I cited earlier passed the rigorous peer-review process and had been accepted for publication. But just a few days after the abstract was posted on-line, it was pulled by the journal’s editor without explanation.\n\nJennifer Margulis, Ph.D., is an award-winning science journalist and book author. A Fulbright grantee and sought-after speaker, she has been researching and writing about issues related to children’s health for over ten years. She is the author of Your Baby, Your Way and the co-author (with Dr. Paul Thomas, M.D.) of The Vaccine-Friendly Plan. Dr. Paul Thomas has over 13,000 patients in his integrative practice in Portland, Oregon; about ten percent of whom are unvaccinated. “As unpopular as this observation might be, my unvaccinated children are by far the healthiest,” he says.\n\nListen to an interview with Dr. Jennifer Margulis who appeared on the National Safe Child Show with Tammi Stefano to discuss vaccines and children’s health:\n\nLeaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people.\n\nIn this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine.\n\nOne of the sane voices when it comes to examining the science behind modern-day vaccines, no pro-vaccine extremist doctors have ever dared to debate her in public.\n\nMedical Doctors Opposed to Forced Vaccinations – Should Their Views be Silenced?\n\nOne of the biggest myths being propagated in the compliant mainstream media today is that doctors are either pro-vaccine or anti-vaccine, and that the anti-vaccine doctors are all “quacks.”\n\nHowever, nothing could be further from the truth in the vaccine debate. Doctors are not unified at all on their positions regarding “the science” of vaccines, nor are they unified in the position of removing informed consent to a medical procedure like vaccines.\n\nThe two most extreme positions are those doctors who are 100% against vaccines and do not administer them at all, and those doctors that believe that ALL vaccines are safe and effective for ALL people, ALL the time, by force if necessary.\n\nVery few doctors fall into either of these two extremist positions, and yet it is the extreme pro-vaccine position that is presented by the U.S. Government and mainstream media as being the dominant position of the medical field.\n\nIn between these two extreme views, however, is where the vast majority of doctors practicing today would probably categorize their position. Many doctors who consider themselves “pro-vaccine,” for example, do not believe that every single vaccine is appropriate for every single individual.\n\nMany doctors recommend a “delayed” vaccine schedule for some patients, and not always the recommended one-size-fits-all CDC childhood schedule. Other doctors choose to recommend vaccines based on the actual science and merit of each vaccine, recommending some, while determining that others are not worth the risk for children, such as the suspect seasonal flu shot.\n\nThese doctors who do not hold extreme positions would be opposed to government-mandated vaccinations and the removal of all parental exemptions.\n\nIn this article, I am going to summarize the many doctors today who do not take the most extremist pro-vaccine position, which is probably not held by very many doctors at all, in spite of what the pharmaceutical industry, the federal government, and the mainstream media would like the public to believe.", "opengraph": {"locale": "en_US", "site_name": "Vaccine Impact -", "type": "article", "title": "Study: Unvaccinated Children Healthier Than Vaccinated Kids – Doctors Agree - Vaccine Impact", "description": "A recent peer-reviewed study comparing health outcomes of vaccinated and unvaccinated children, provisionally published in a journal of public health and assigned a DOI number (a digital object identifier given by publishers to identify content and provide a persistent link on the internet), found that completely unvaccinated children have less chronic disease and a lower risk of autism than vaccinated children. According to the abstract, the team of four scientists found that completely unvaccinated children were significantly more likely to get chickenpox and whooping cough but significantly less likely to suffer from ear infections, pneumonia, allergies, and brain or central nervous system disorders, including autism. In this investigative report, Dr. Jennifer Margulis interviews medical doctors, health experts, and parents, parents who have both vaccinated and unvaccinated children, confirming the conclusion of this new study that unvaccinated children are generally healthier than vaccinated children.", "url": "https://vaccineimpact.com/2016/study-unvaccinated-children-healthier-than-vaccinated-kids-doctors-agree/", "article:published_time": "2016-12-15T17:51:11+00:00", "article:modified_time": "2017-02-18T17:20:21+00:00"}, "tags": ["Jennifer Margulis", "unvaccinated"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe loading=\"lazy\" width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/NvEgd0IlK9g?start=1383&amp;feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/NvEgd0IlK9g?start=1383&feature=oembed"}], "links": ["http://www.cdc.gov/vaccinesafety/vaccines/mmr-vaccine.html", "https://vaccineimpact.com/2015/medical-doctors-opposed-to-forced-vaccinations-should-their-views-be-silenced/", "https://vaccineimpact.com/2015/medical-doctors-opposed-to-forced-vaccinations-should-their-views-be-silenced/", "http://jennifermargulis.net/about/", "https://www.amazon.com/Your-Baby-Way-Pregnancy-Childbirth/dp/1451636091/", "https://www.amazon.com/Vaccine-Friendly-Plan-Effective-Health-Pregnancy/dp/1101884231/", "https://healthytraditions.com/healthytraditions/books/dangers-of-medicine-books/rising-from-the-dead.html", "https://vaccineimpact.com/2015/medical-doctors-opposed-to-forced-vaccinations-should-their-views-be-silenced/", "https://vaccineimpact.com/2015/medical-doctors-opposed-to-forced-vaccinations-should-their-views-be-silenced/", "https://healthytraditions.com/products/a-guide-to-healing-from-vaccine-injuries-ebook?_pos=6&_sid=59d560278&_ss=r", "https://healthimpactnews.com/revive/www/delivery/ck.php?n=af3e0a62&cb=INSERT_RANDOM_NUMBER_HERE"], "authors": [], "publish_date": "2016-12-15T17:51:11+00:00"}