{"result_id": "326001", "URL": "https://vaccineimpact.com/2022/the-technocrats-new-world-order-advances-expect-cyber-attacks-soon/", "timestamp": "2023-04-25 17:48:46 CEST+0200", "meta": {"description": "As I wrote yesterday, the \"leaks\" to the media this past weekend that show the U.S. health agencies have been concealing data that prove the COVID-19 \"vaccines\" are deadly signify that a major move is about to happen as the next \"crisis\" is being planned to shift the public's attention away from the COVID-19 vaccine crimes against humanity. After weeks of both sides in the Ukrainian conflict blaming each other for escalating the situation needlessly, seemingly out of the blue Russian President Vladimir Putin appeared in public and signed documents that reportedly state that Russia is recognizing the national sovereignty of Donetsk and Luhansk, republics currently part of the Ukraine, but with historical ties to Russia. This appears to me to be the implementation of a script that has already been written that charts a course now that will move the world on to the next big crisis, with the end goal of uniting the world under a central, technological state. U.S. President Biden then was handed his script, which he read earlier today. For months now the U.S. corporate media has been preparing the public for future \"cyber attacks,\" which will now obviously be blamed on Russia. Newsweek just published an \"exclusive\" report on these coming cyber attacks this past Sunday: Exclusive: FBI Braces for Russian Cyber Attacks in US as Ukraine Tensions Rise. And last night (Monday, Feb. 21) Fox News did the same thing: Ukraine-Russia Crisis: Cyberattacks could affect U.S. As I have been warning for the past few weeks, it is imperative that you be prepared for disruptions to basic services like water, power, fuel, and frozen bank accounts. Ian Davis, an independent journalist out of the UK, has just published an excellent piece that will help you cut through the propaganda that the corporate media is publishing and drill down to just what the Globalists are planning in this next phase. It was published at Unlimited Hangout, and I am going to republish it here as well. It is one of the most thorough reports on the move to a technocratic centralized government that I have read so far, and well worth the time to read through and digest. Much of this policy is set by the World Economic Forum, led by Klaus Schwab, and the evidence is strong that world leaders such as Trudeau, Putin, Xi, and Biden are following the script that the World Economic Forum has laid out. And for those of you still hanging on to your faith in Trump, here is a clip put together by High Impact Flix (HIF), highlighting President Donald Trump's cozy relationship to Klaus Schwab and the WEF, where Trump was a featured speaker in 2018, and then again in January of 2020, just weeks before the COVID-19 scam was unleashed to the world. I know this will not sway the die-hard Trump cult members who will excuse him as either being \"ignorant\" and not smart enough to know the true motives of Klaus Schwab and the WEF, or that he is at least better than [fill in the blank - usually Hillary Clinton or Joe Biden]. But I share all of this, not to discourage people, but to make you wise and understand who your true enemies are. We are not without hope, but hope will soon vanish if we continue to cling to the false idea that people can vote their way out of this mess by simply choosing the correct politicians.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/2022/the-technocrats-new-world-order-advances-expect-cyber-attacks-soon/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "The Technocrats New World Order Advances – Expect “Cyber Attacks” Soon - Vaccine Impact", "cleaned_text": "As I wrote yesterday, the “leaks” to the media this past weekend that show the U.S. health agencies have been concealing data that prove the COVID-19 “vaccines” are deadly signify that a major move is about to happen as the next “crisis” is being planned to shift the public’s attention away from the COVID-19 vaccine crimes against humanity. See:\n\nCDC Withholding Data on COVID-19 Vaccines Because “They might be misinterpreted as the vaccines being ineffective” and “The figures would be misrepresented by anti-vaccine groups”\n\nAfter weeks of both sides in the Ukrainian conflict blaming each other for escalating the situation needlessly, seemingly out of the blue Russian President Vladimir Putin appeared in public and signed documents that reportedly state that Russia is recognizing the national sovereignty of Donetsk and Luhansk, republics currently part of the Ukraine, but with historical ties to Russia.\n\nThis appears to me to be the implementation of a script that has already been written that charts a course now that will move the world on to the next big crisis, with the end goal of uniting the world under a central, technological state.\n\nU.S. President Biden then was handed his script, which he read earlier today.\n\nFor months now the U.S. corporate media has been preparing the public for future “cyber attacks,” which will now obviously be blamed on Russia.\n\nNewsweek just published an “exclusive” report on these coming cyber attacks this past Sunday:\n\nExclusive: FBI Braces for Russian Cyber Attacks in US as Ukraine Tensions Rise\n\nAnd last night (Monday, Feb. 21) Fox News did the same thing:\n\nAs I have been warning for the past few weeks, it is imperative that you be prepared for disruptions to basic services like water, power, fuel, and frozen bank accounts.\n\nIain Davis, an independent journalist out of the UK, has just published an excellent piece that will help you cut through the propaganda that the corporate media is publishing and drill down to just what the Globalists are planning in this next phase.\n\nIt was published at Unlimited Hangout, and I am going to republish it here as well. It is one of the most thorough reports on the move to a technocratic centralized government that I have read so far, and well worth the time to read through and digest.\n\nMuch of this policy is set by the World Economic Forum, led by Klaus Schwab, and the evidence is strong that world leaders such as Trudeau, Putin, Xi, and Biden are following the script that the World Economic Forum has laid out.\n\nAnd for those of you still hanging on to your faith in Trump, here is a clip put together by High Impact Flix (HIF), highlighting President Donald Trump’s cozy relationship to Klaus Schwab and the WEF, where Trump was a featured speaker in 2018, and then again in January of 2020, just weeks before the COVID-19 scam was unleashed to the world.\n\nI know this will not sway the die-hard Trump cult members who will excuse him as either being “ignorant” and not smart enough to know the true motives of Klaus Schwab and the WEF, or that he is at least better than [fill in the blank – usually Hillary Clinton or Joe Biden].\n\nBut I share all of this, not to discourage people, but to make you wise and understand who your true enemies are. We are not without hope, but hope will soon vanish if we continue to cling to the false idea that people can vote their way out of this mess by simply choosing the correct politicians.\n\nTechnocracy: The Operating System For The New International Rules-Based Order\n\nThe International Rules-Based Order (IRBO) is under threat and global power is shifting. As East and West rekindle old enmities we are led to believe that this struggle will determine the future of international relations and the direction of nation states. However, the global transformation is not led by national governments but by a global network of stakeholders and global technocracy is their goal.\n\nIn this article, we will explore the true nature of the international rules-based order (IRBO) and examine the forces that shape it. We will consider if the narratives we are commonly fed stack up.\n\nIt is widely accepted that the IRBO is undergoing disruptive change. That transformation is often reported as an eastward shift in the balance of power between nation states.\n\nIt is said that this new, emerging international order will be founded upon a global multipolar system of sovereign states and international law. This new system allegedly stands in opposition to the fading, western “rules-based” model.\n\nThis time, rather than relying upon western imperialism, the new international law-based system will emphasise multipolar cooperation, trade and respect for national sovereignty. It will instead be led by a Eurasian economic and technological power-block.\n\nThe apparent, ongoing antagonism of geopolitics looks likely to maintain the East-West divide we are familiar with. However, what is now being framed as the multipolar order is, in reality, the multistakeholder order.\n\nAs we shall discover, nation states are not the driving force behind the current restructuring of global governance. The geopolitical narratives we are given are frequently superficial.\n\nThose leading the transformation have no allegiance to any nation state, only to their own globalist network and collective aspirations. In their hands, international law is no more of an impediment to their ambitions than a vague commitment to “rules.”\n\nNational governments are partners within this network formed of both state and non-state actors. Despite professed animosities, they have collaborated for decades to fashion the global governance complex that is now emerging.\n\nNo matter who is said to lead it, the IRBO is set to continue in a new form. As the post WWII system recedes, the framework being imposed to take its place is completely alien to the people who live in the former western, liberal democracies.\n\nThus, we too must be transformed if we are to accept the realignment. We are being conditioned to believe in the promise of the new IRBO and the global technocracy it is built upon.\n\nIn 2016, Stewart Patrick of the Council on Foreign Relations (CFR) published World Order: What, Exactly, are the Rules? In it, he described the post WWII era as the “international rules-based order” (IRBO).\n\nRooted firmly in American exceptionalism, Patrick described how the so-called IRBO acted as a mechanism for hegemonic control of global politics, the world’s economy and the international monetary and financial system (IMFS):\n\nWhile international law is a component of the IRBO, it is not in and of itself law. Professor Malcolm Chalmers, writing for the UK Royal United Services Institute (RUSI), described the IRBO as a combination of universal security and economic systems combined with international agreement and conflict resolution processes.\n\nThe current IRBO is supposedly a western system of international norms and institutions. Based upon both the post WWI and WWII settlements, what is suggested as order is little more than a realisation of “might is right” on the international stage.\n\nIn the West, we have been educated to have faith in the IRBO. It is sold to us as an arrangement that establishes normative behaviour for nation states. A basis for international relations is supposedly agreed upon and acceptable behaviour ordained.\n\nFar from being a set of rules to facilitate peaceful coexistence between nation states, the IRBO has always been a tool for manipulation. The question is who wields it?\n\nThe recent joint statement between the Russian Federation and the People’s Republic of China appeared to explicitly redefine the current IRBO. Presidents Vladimir Putin and Xi Jinping agreement read, in part:\n\nBy contrast, the speech delivered by UK Foreign Secretary Liz Truss to the Lowy Institute, a Rothschild backed Australian policy think-tank with a focus upon the Asia-Pacific region, illustrated the western position. She said:\n\nTaken on face value, we would inevitably conclude that, while the axis is in flux, the adversarial stand-off continues. To a great extent, this is a fabrication.\n\nIn discussing the IRBO, we immediately run into a nomenclature problem. Sometimes referred to as the “rules-based international order;” at other times the “international order” or “rules-based system;” or occasionally the “rules-based international system,” now we seemingly need to add “international law-based world order.”\n\nWhile there is no settled definition for this alleged system of global governance, it all amounts to the same thing. The fulcrum may have moved, but the ruse remains intact.\n\nThis definition problem illustrates the primary flaw with any notion of a global rules-based order. It is ill-defined and transient. It relies more upon the realpolitik of the day than any genuine moral, legal or political precepts.\n\nWhile Truss accurately outlined how that so-called order can be seized and exploited, she misled her audience in regards to who the abusers are. Nor is the existing IRBO founded upon democracy and freedom. Her claims were a deceit.\n\nRecently the US Department of Homeland Security (DHS) stated that undermining trust in the government was achieved by individuals spreading “false” narratives and that this was tantamount to terrorism. In other words, no US citizen has any right to question government policy. If they do, they are spreading disinformation. Consequently, the DHS suggests that not trusting the government should be prosecuted as a crime.\n\nThis is the claimed justification for the focus of the new domestic terrorism unit working alongside the US Justice Department’s National Security Division. Assistant Attorney General Matthew Olsen told a Senate Judiciary Committee that the unit was created to combat the growing threat of “extremism,” which apparently includes “anti-government and anti-authority ideologies.”\n\nTo question either “authority” or “government” is an extremist position, according to the US Justice Department and the DHS. There is no room for freedom of speech in the government’s extremist ideology. Without freedom of speech, US democracy is finished.\n\nSimilarly, in New Zealand, Prime Minister Jacinda Ardern (a World Economic Forum Young Global Leader) admitted her government’s intention to ignore people’s inalienable right to roam unless they submitted to vaccination. So too with the European Commission, whose EU Digital COVID Certificate limits freedom of movement only to citizens who have the right pharmaceutical products injected into them.\n\nThese vaccine “certificates” are the gateway to full digital ID for all compliant citizens. Speaking in June 2021, the President of the EU Commission, Ursula Von Der Leyen, said:\n\nIn other words, the EU citizen’s vaccine status, which will form a key part of digital identity per EU plans, will also be required for them to access goods and services. Without the appropriate authorisation, they will be excluded from society.\n\nRecently, some governments have appeared to backtrack on their vaccine passport (certificate) plans. This is simply a brief cessation in the face of mounting public protest.\n\nThe commitment to digital identity, controlling every aspect of our lives, is inherent to the UN’s Sustainable Development Goal 16.9. The policy trajectory towards digital identity is global, no matter who allegedly leads the IRBO.\n\nNone of these policies indicates, as Truss claimed, any underlying belief in “freedom and democracy.” Among the Five Eyes nations and across the EU, all we see is a commitment to authoritarian dictatorship.\n\nIn the UK, where Truss is a leading government figure, plans for a dictatorship are at an advanced stage. The UK state has exploited the pseudopandemic to progress and enact a slew of dictatorial legislation.\n\nThe Covert Human Intelligence Sources (Criminal Conduct) Act 2020 empowers the state to commit any crime it likes and removes all legal liability from its operatives; the Police, Crimes, Sentencing & Courts Bill effectively outlaws all public protest and, while currently stalled after the House of Lords rejected the Bill, some minor amendments will almost certainly see it passed into law; the Online Safety Bill, when enacted, will end freedom of speech online and the proposed changes to official secrets, counter-espionage; and counter-terrorism legislation will remove the journalist’s defence of acting in the public interest, effectively ending whistle-blowing and investigative journalism in the UK.\n\nAll these tyrannical changes are exemplified by the UK government’s proposed Human Rights Act reforms. Their press release demonstrates how their claim of respecting individual rights, freedoms and democracy is nothing more than propaganda designed to dupe an unsuspecting public.\n\nWhile they speak of diversity and a historical commitment to freedom, peppering their press release with fluffy sound-bites, their actions belie their intent. They state:\n\nWhile the UK state claims “human rights are universal” they clearly aren’t if they are “qualified rights” based upon whatever the government decides to be more important. Individuals pressing their rights in court has hampered the government’s programs. This is considered to be a “democratic deficit.” Therefore, the New Bill of Rights will protect the government’s power and authority over-and-above the freedoms of the people.\n\nThe UK Government will define “national security.” Protecting it, as they see fit, will override all individual rights. Freedom to roam, of speech and expression will not be tolerated by the UK state. Instead a commitment to the “public interest,” “safety” and protecting the population from some nebulous notion of “harm,” will replace freedom and democracy.\n\nOn both sides of the Atlantic, and in the Five Eyes global south, a new system is emerging which facilitates what Mussolini described as the Fascist State:\n\nIt is the US led alliance of Five Eyes nations and the European Union that claim themselves to be the protectors of the international rules-based order. With their commitment to a new form of global fascism, the idea that the IRBO keeps us safe is questionable. In truth, the current IRBO has never actually promoted either freedom or democracy.\n\nIt is customary for the IRBO’s alleged leaders to practice double standards. Illegal wars, prolonged terrorist campaigns against their own populations, support for foreign terrorist insurgencies, cruel economic sanctions and involvement in international narcotic smuggling operations typify the activities of the nation states that claim ownership of the IRBO.\n\nWhile the western hegemony insists that all follow their rules, they don’t hold themselves to the same. A few recent examples, among many, have witnessed the U.S. unilateral withdrawal from the Joint Comprehensive Plan of Action (JCPOA), often referred to as the Iran Nuclear Deal; NATO renege on assurances, given to the last Soviet President Mikhail Gorbachev, that it would not expand “one inch eastward”; and the imprisonment of journalists.\n\nThis is not to claim that the supposed opponents of the current IRBO, notably Russia, China and Iran, are above reproach themselves. However, it is untenable for the “leading nations” of the existing IRBO to commandeer any moral supremacy.\n\nPoliticians like Truss promote the IRBO as the cornerstone of international peace and security, but these are meaningless platitudes. There is nothing inherently peaceful or secure about it.\n\nThe current IRBO is portrayed as a project of western, formerly liberal, democratic states that has capitalised upon U.S. economic and military dominance. However, despite that being how mainstream media (MSM), academia and think-tanks present it, that is not what the international rules-based order is today.\n\nThe IRBO can more accurately be described as a vehicle for a worldwide stakeholder capitalist network to manipulate nation states in pursuit of its own predominantly private, corporate agenda. Indeed, we might argue that is all it has ever been.\n\nA truly global network of corporations, think-tanks, private foundations, intergovernmental organisations, NGOs and governments work in partnership to convert global policy agendas into policy and legislation at the national and local government level. This is the Global Public-Private Partnership (G3P) and its reach extends to every nation.\n\nWe may view the global political map as a patchwork of sovereign nations, existing in a state of anarchy (no one rules them), but the G3P does not. What the global stakeholder capitalist network (G3P) sees is an authoritarian, compartmentalised structure to be manipulated to reach their objective, with that objective being, to create a cohesive system of global governance under their rule.\n\nThroughout the pseudopandemic, the World Economic Forum (WEF) has partnered with government and intergovernmental organisations to promote its Great Reset policy agenda. The G3P is the embodiment of what the WEF calls the multistakeholder model of global governance.\n\nIn October 2019, shortly before the pseudopandemic began, the WEF published Global Technology Governance: A Multistakeholder Approach. Assuming the authority to demand that the world accepts the intrusion of its planned 4th Industrial Revolution, the G3P, represented by the WEF, bemoaned what they considered to be the lack of progress towards global governance.\n\nIn this multistakeholder system, elected governments are merely one among many stakeholders. Most of the leading partners in the G3P are private corporations, such as the Bank for International Settlements, or they represent private corporate interests, the World Business Council for Sustainable Development for example.\n\nOur democratic oversight only reaches as far as our national government’s influence as a G3P stakeholder allows. We can appreciate the extent of this democratic accountability if we consider the comments of Dominic Cummings, former chief advisor to UK Prime Minister. In testimony given to a parliamentary committee on May 2021 (go to 14:02:35), Cummings said:\n\nCummings was talking about the UK government’s public health policy response to an alleged global pandemic. These were decisions that would impact the health of every man, woman and child in the country.\n\nHis comments reveal that the UK government was simply following the orders issued by the network of “Bill Gates type people.” The UK state designed a crucial national policy at behest of the Bill and Melinda Gates Foundation (BMGF). They were acting under the instruction of a private, tax exempt foundation.\n\nThe BMGF are among the leading stakeholders within the G3P. Like the WEF, their partnerships with government and intergovernmental organisations are extensive.\n\nAs we now know, the alleged vaccine safety and efficacy claims made by the BMGF, and the politicians who implemented public health policy for them, weren’t even remotely accurate. We also know that this failure is immaterial to the BMGF because the “return on this is so high” it doesn’t matter.\n\nThe policy think-tanks lie at the heart of the G3P. They collaborate with other G3P stakeholder partners to devise the policy agendas that governments then enforce upon their populations.\n\nThink-tanks, such as the Royal Institute for Interantional Affairs (RIIA – Chatham House), are invariably formed by representatives from multinational corporations (including central banks), financial institutions, NGO’s, philanthropic foundations, private donors, intergovernmental organisations, academic institutions and governments, etc.\n\nFor example, Chatham House members include the United Nations, the Bill and Melinda Gates Foundation, the Open Society Foundation, The Bank of England, Astrazeneca, GlaxoSmithKline, Bloomberg, The Guardian, The City of London, The European Commission & Union, BAE systems, Goldman Sachs, De Beers, BlackRock, China International Capital Corporation, Huawei, Kings College London, the London School of Economics (LSE), Oxfam, the British Army and governments from around the world. The list goes on.\n\nTo imagine that these globalist organisations are effectively powerless and exist merely to help governments devise policy is extremely naive. A more accurate summation has been offered by a few academics. Prof. Hartwig Pautz wrote:\n\nHowever, we only need look at the comments of people like Dominic Cummings or Hillary Clinton to recognise that even Pautz’ observations fall short. As then US Secretary of State, Clinton said that the Council on Foreign Relations (CFR) role – as a US foreign policy think-tank – was to tell the US State Department “what we should be doing and how we should think about the future.”\n\nGovernments, including those of the US, Russia and China, are G3P stakeholders. In 2017, speaking at a Harvard seminar, the founder and executive chairman of the WEF, Klaus Schwab, said:\n\nThis was no idle boast. Political leaders such as Tony Blair, Jacinda Ardern, Emmanuel Macron, Alexander De Croo (Belgian PM), Sanna Marin (Finnish PM) and many more political heavyweights have been through the YGL programme. This is why, in an address to the Canadian nation in November 2020, in direct reference to the WEF’s so-called Great Reset, Canadian Prime Minister Justin Trudeau said:\n\nTrudeau is one among many WEF Young Global Leaders (YGL), and members of its predecessor program called the Global Leaders of Tomorrow, who have shaped the global policy response to the pseudopandemic. As a YGL graduate, his task was to convince the Canadian public to embrace the G3P’s Great Reset policy agenda.\n\nDespite Schwab’s claims, Russian President Vladimir Putin does not appear to have been among the WEF’s YGL protégés. Yet, speaking in 2019 to President Quesada of Costa Rica, Klaus Schwab repeated his statement about Putin:\n\nIn 1993, when the Global Leaders of Tomorrow program began, Putin was 41 and the upper age limit for entry into the program was supposedly 38. It seems unlikely that Putin was “officially” a WEF YGL trainee.\n\nFollowing 16 years of service in the Soviet KGB, Putin was building his reputation as a politician in 1993, acting as deputy to the Mayor of St Petersburg, Anatoly Sobchak. Sobchak subsequently co-authored the Constitution of the Russian Federation.\n\nPutin was instrumental in encouraging foreign investment into the city and it was during his time in St Petersburg that Putin seemingly developed a close relationship with Klaus Schwab. In his address to the WEF’s 2021 virtual Davos gathering, Putin said:\n\nIn terms of G3P partnerships, Russia’s is perhaps one of the closest to the WEF. The WEF’s annual Cyber-Polygon global cybersecurity training exercise is orchestrated by Bi.Zone, a subsidiary of Sberbank.\n\nBi.Zone is responsible for designing and running the Cyber Polygon scenarios and exercises. Sberbank is a majority state owned Russian bank and is among the founding members of the WEF Centre For Cybersecurity (CCS).\n\nOther CCS partners include leading US foreign Policy think-tank the Carnegie Endowment for International Peace (CEIP), Europol (representing EU governments), INTERPOL, the Organisation of American States (representing the governments of the North and South American subcontinents), and national cyber security centres from Israel, the UK, Korea, Saudi Arabia and Switzerland (home of the BIS).\n\nOf the many corporations involved in Cyber Polygon 2021, Russian companies formed the largest contingent from any single nation. In addition, the WEF partners with the St Petersburg International Economic Forum (SPIEF.)\n\nThe SPIEF International Foundation was formed in St Petersburg in 1998 under the direction of Herman Gref. He was serving as vice governor of the city at the time.\n\nIn 1993, Gref was also a close associate of Anotoly Sobchak in St Petersburg where Putin was Sobchak’s senior advisor. Gref is currently the CEO and Chairman of Sberbank.\n\nIn 2017, Schwab recognised that the SPIEF and Russia were global leaders on international regulation and stated:\n\nRussia and the SPIEF are part of the G3P network and are heavily involved in global cybersecurity and, in particular, the regulation of technology. It is clear that, through partners like the CFR, BMGF and the WEF, the Global Public-Private Partnership is pushing a global policy agenda supported by both sides of the East-West divide.\n\nWEF assets, like Trudeau and other compromised officials, are positioned to ensure policy distribution is as frictionless as possible. The Russian and, as we shall see, Chinese governments are equally active stakeholders in the G3P’s global governance efforts.\n\nIf we believed the western MSM, this would present a seemingly unfathomable conundrum. While these nation states are G3P partners, we are told that they are also undermining the IRBO. Something doesn’t add up.\n\nAccording to Reuters, European banks need to prepare for Russian cyber attacks. CBS claims the DHS are on full alert for the looming cyber war, while the UK media carried the same scary stories. Forbes reported that Russia had been waging a cyber war against the West for 20 years and the Guardian alleged that this was typical fare for the Russian Federation.\n\nAll of this seems extremely odd given that western global corporations such as IBM, Deutsche Bank and Santander were engaged in cyber polygon preparedness exercises that were largely run by a Russian state-owned bank. If any of the MSM’s claims are even remotely plausible, the industrial espionage risk alone would appear to have been off the charts.\n\nGovernments from across the western world participate in the WEF Cyber Security Centre which was founded, in part, by Sberbank. At the same time, they keep warning their populations about the danger of Russian cyber attacks.\n\nFrankly, these Russian cyber-threat stories are puerile. The western governments and corporations, who appear to follow G3P orders to the letter, are seemingly content to be guided by a Russian state bank’s cybersecurity assessment and recommendations.\n\nA far more credible rationale for these MSM stories and government fearmongering is that they are designed to prepare us, and provide justification, for the digital transformation of the financial sector. In their 2020 cyber threats report, the Carnegie Endowment for International Peace (CEIP) stated that the pseudopandemic had necessitated this change.\n\nIn a barely concealed reference to Russia and China, the CEIP asserted that cyber attacks from nation states were inevitable. They then predicted that the response to this supposedly unavoidable attack would be to fuse the activities of banks, the financial authorities and the national security apparatus of nation states.\n\nCentralising authority, especially over financial systems, is always the solution as far as the G3P are concerned. Primarily because they assume the right to exercise that authority.\n\nOn the major issues, governments don’t form policy and policy is instead curated by the G3P think-tanks like the CEIP. We should not labour under the illusion that the think-tanks simply offer suggestions. They have the financial, economic and political power to make decisions on the global stage and they have done so for generations.\n\nNo one votes for think-tanks. To this extent, so-called representative democracy is a charade. We, the people, have never had any say on the “big issues.” For those of us who live in western democracies, government grandstanding simply serves to convince us that we are somehow represented in the deliberations. It is essentially a confidence trick.\n\nThis is the context within which we can come to understand the International Rules Based Order. While it currently relies upon what appears to be the western hegemony and is transitioning towards a Eurasian led multipolar system, both are just convenient mechanisms through which the G3P wields power and authority.\n\nAs noted by many commentators, including the WEF, the IRBO is changing. As it does we all move ever closer to an IRBO based upon the Chinese model of technocracy.\n\nThe G3P think-tanks, perhaps most notably, but not exclusively, the Trilateral Commission, have been pursuing the dream of creating a global Technate for nearly a century. The often heard pseudopandemic mantra of “led by science” exemplifies technocracy.\n\nTechnocracy grew out of the efficiency movement during the US progressive era in the early 20th century. It capitalised upon the principles of scientific management suggested by Frederick Winslow Taylor and the economic ideas of social-economist like Thorstein Veblan, who famously coined the term “conspicuous consumption.”\n\nVeblan was among the founding members of a private research initiative in New York funded by John D. Rockefeller called the New School For Social Research. This soon led to the creation of the Technical Alliance.\n\nHoward Scott, the leader of the Technical Alliance, subsequently joined M. King Hubbert at Columbia University. In 1934, they published the Technocracy Inc. Study Course.\n\nThis was a blueprint for a North American Technate. It proposed a society led by science, engineering and academia rather than politics. Hubbert wrote:\n\nTechnocracy demands that the activity of every citizen be continually recorded and controlled. It requires constant surveillance of the population.\n\nThis enables the Technate’s total energy expenditure to be calculated in real time. The data is then collated and analysed in order for the central committee of technocrats to manage and distribute the Technate’s resources right down to the level of the individual.\n\nScott and Hubbert planned a new monetary system based upon energy consumption, with goods and services priced according to the energy cost of production. Citizens would be allocated the new currency in the form of “energy certificates.”\n\nIn the US of the 1930s, this was a technologically impossible task. Though popular for a decade or so, the people came to realise that the suggested Technate was something of an absurdity.\n\nDespite the seemingly preposterous system proposed by Scott and Hubbert, the Rockefellers in particular could see the potential to use technocracy to enhance their control of society. They continued to bankroll the technocracy movement and associated programs, for many years, regardless of waning public interest.\n\nIn 1970, Professor Zbigniew Brzezinski published Between Two Ages: America’s Role In The Technetronic Era. At the time, he was a professor of political science at Columbia University, where Scott had met Hubbert in 1932. He had already been an advisor to both the Kennedy and Johnson campaigns and would later become National Security Advisor to US President Jimmy Carter (1977 – 1981).\n\nThrough a paper thin veil of caution, Brzezinski wrote enthusiastically about how a global scientific elite could not only use all-pervasive propaganda, economic and political manipulation to determine the direction of society, but could also exploit technology and behavioural science to brainwash and alter populations’ behaviour. Describing the form of this society and the potential for authoritarian control, he wrote:\n\nWhile he didn’t use the word “technocracy,” Brzezinski nonetheless described a Technate. Realising that technology was fast approaching the point where technocracy would be feasible, he described how digital technology would dominate the “technotronic era” to transform society, culture, politics and the global balance of political power.\n\nIn 1973, Brzezinski joined David Rockefeller to form the Trilateral Commission. Their stated purpose could not have been clearer:\n\nIn 1973, the Trilateralists had already identified that US primacy would be dramatically transformed. This stemmed from Brzezinski’s realisation that global corporations in the technotronic era would surpass nation states in terms not only of their financial and economic power, but also in their ability to innovate and direct the activities of billions of citizens. In Between Two Ages he wrote:\n\nFully committed to the process of globalisation, the Trilateralists started to create the new IRBO. Rather than US economic and military power the new world order would be based upon a communitarian commitment to the efficient management of resources and, via that mechanism, social control.\n\nNation states would give way to a global network formed by the fusion of state and corporation. This network would manage populations and business activity through a new resource-based monetary system and economic central planning.\n\nIndividual citizens and businesses would be constantly monitored and their behaviour restricted and ordered. This would afford the G3P the global governance capability they sought.\n\nBrzezinski suggested how this future could be secured. Technocracy would enable the transformation:\n\nThe modernisation of China was seen as an opportunity to develop an advanced technocratic society which, while developing both economically and technologically, would remain a dictatorship. This presented the G3P with a perfect test bed for the construction of a Technate.\n\nTechnocracy provides centralised authority over a managed capitalist system. It allows business to prosper so long as it adheres to the diktats of the technocrats.\n\nThe new IRBO will not be based upon the primacy of nation states or their imposition of any agreed values or norms. Rather, it will be founded upon the multistakeholder system, where nominally pragmatic solutions to a declared crisis form the moral imperative. Multistakeholding means a fusion between state and corporation.\n\nThis transformation of the IRBO was emphasized by the WEF in their 2019 policy white paper Globalization 4.0. Shaping a New Global Architecture in the Age of the Fourth Industrial Revolution.\n\nTrust is a product of faith and we are being directed to believe in the new resilient and sustainable IRBO — one based, not upon the dominance of nation states who claim moral authority, but upon a globalist multistakeholder alliance between national governments and private interests who will keep us “safe.”\n\nThe WEF stresses the need for the people to have faith in the G3P’s globalist project. One of the key themes of the 2021 Davos meeting was rebuilding trust and for 2022 restoring trust. Referring to the alleged global trust crisis, Klaus Schwab said:\n\nTrust is key because decisions that impact us at the local level will be taken at the global level by a policy making body that is predominantly a project of unelected private corporations. We must put aside any notion of democratic accountability or oversight and accept that the G3P knows best.\n\nThis multistakeholder, globalist structure will use technocracy to conduct its policies. We will be afforded the illusion of democracy in the form of civil society. However, via technocracy, we will be robbed of all agency and political means.\n\nChina As The Engine For The New IRBO\n\nIn 1977 the Trilateral Commission wrote a paper tiled Paper No. 15 on East-West Relations (published in 1978) in which they noted:\n\nA thriving export market in China and widening the Sino-Soviet split was in the political and economic interests of western nation states. However, constructing a new superpower to rival the Soviet Union also meant building one capable of challenging the existing IRBO.\n\nAs a G3P think-tank, the Trilateral Commission are among those that maintain they are little more than talking shops for the most powerful individuals on Earth. As with all think-tanks, they portray themselves as fundamentally reactive rather than proactive. They claim that they offer suggested policy agendas, but that they have no authority to enforce adoption of those policies.\n\nYet, these recommended policy agendas often unfold precisely as “suggested” by the think-tanks. Multinational corporations (MNCs) the world over seemingly responded to the Trilateralists’ agenda by engaging in a concerted effort to “influence the natural process of change” in China and to empower it to acquire “a sphere of influence corresponding to its strength.”\n\nThe economic, industrial and technological revolution in China has been remarkable, but it didn’t happen by chance. China now stands as the world’s first Technate and the western, liberal democracies are earmarked for the same transformation.\n\nChinese state media reported that, between 1983 – 1991, foreign direct investment in China increased from $920M to 4.37Bn. By 2019, it had eclipsed $2.1Tn. In 1994, in terms of US overseas investment, China ranked 30th. By 2000, it was 11th, as MNCs quadrupled their FDI into China between 1994 and 2001.\n\nThe pseudopandemic saw an initial 42% slow-down in global FDI. Yet, investment in to China actually increased by 4%, as it overtook the US to become the world’s leading recipient of foreign direct investment. Given the huge slump during 2020, inevitably global FDI bounced back in 2021. FDI, excluding financial services, reportedly rose by an additional 20% (in dollar terms) to achieve an annual record high of $178.48Bn in China.\n\nIn 1979, the US granted China full diplomatic recognition; in 1982, the commitment was reaffirmed in the third joint communiqué; in 1984, Beijing was permitted to purchase US military hardware; in 1994, the Clinton Whitehouse intervened to scrap the cold war embargo on the export of “sensitive technology” to China (and Russia); the 2000 US – China Relations Act was signed by President Clinton (a member of the Trilateralist Commission), establishing further improvements to trade relations; and, in 2005, then Deputy Secretary of State Robert B. Zoellick, called on China to take its place as a “responsible stakeholder.” Then, in 2008, China became the world’s leading US creditor.\n\nThis is not to suggest that the relationship between the western hegemony and the rising superpower were all plain sailing. For example, news of NATO’s “accidental” 1999 bombing of the Chinese embassy in Belgrade wasn’t received well in China. There were also marked periods of apparent political enmity between the US, its western allies and China.\n\nIn 2001, while the mainstream media reported confrontations over downed spy planes and trenchant accusations from China of aiding and abetting its enemies, the Trilateralist (G3P) project remained on course. At the same time, the US supported China’s entry into the World Trade Organisation and soon thereafter the Bush administration established permanent normal trading relations (PNTR) with China.\n\nYet, a cursory look at the western mainstream media (MSM), and the persistent rhetoric of politicians like the UK Foreign Secretary, suggest we should be fearful and that China is a threat to the western order. How do we reconcile these allegations while, at the same time, the western order has been investing and transferring technology to bring about China’s transformation?\n\nDespite the surface hyperbole, occasional vitriolic exchanges and alleged military accidents, the policy trajectory, in the political, economic and even military sphere, was consistent. Just as the Trilateralist Commission “advised,” the western hegemonic order tilted towards enabling the rise of China as both a technocracy and a superpower.\n\nGeorge Soros is a convicted insider trader, hedge fund manager, currency speculator and investor. His tax exempt Open Society Foundation has funded political campaigns, activist movements and coups around the world for decades. Though he is ageing today, he was formerly a member of the Trilateral Commission.\n\nAs such, Soros was among the global political, financial and corporate “thought leaders” who encouraged the modernisation of China. In a 2009 interview with the Financial Times, he said:\n\nYears later, the 2016 – 2020 US Trump administration took what appeared to be an aggressive stance against China. Of particular alleged concern was the US bilateral trade deficit of up to $500Bn annually. A trade war ensued and tariffs were exchanged.\n\nSpeaking in Beijing in 2017, then President Trump said:\n\nThe Trump administration complained bitterly about so-called forced technology transfers (FTT) stipulated by China in exchange for access to their market. Speaking of the supposed trade war between the leaders of the current IRBO and China, the CFR think-tank were among those who criticised China’s apparent protectionism and suggested theft of intellectual property.\n\nThese allegations and the declared trade hostility appeared to be little more than a diversion designed for western public consumption. In truth, both public and private deals with China were consistently built upon FTT agreements.\n\nIn 2018, the Trump administration started to impose up to 25% tariffs on imports from China. The Chinese soon reciprocated. As the US’ largest single creditor, recently eclipsed by Japan, the US ran the risk of China dumping trillions of dollars worth of US treasuries – a nuclear option, in economic terms, which would also mean huge losses for China.\n\nWhile a small reduction in the US trade deficit with China was achieved in 2019, global trade tensions increased the US deficit to the rest of the world. At the start of the pseudopandemic, the overall US trade deficit had not changed. In 2020, it reached record highs. During the FDI slump in 2020, the only investment winners were China and India.\n\nIn addition to continuously approving technology transfers, the leading IRBO nations had significantly increased their research and development (R&D) partnerships with China over the same period. Irrespective of Trump’s media circus, a 2019 report by the World Bank, referencing western nations public-private R&D investments in China, noted:\n\nThe Chinese government openly stated its intention for China to become a manufacturing superpower. Degrading US influence and bolstering China’s had been hardwired into western foreign economic & industrial policy and MNC investment strategies for more than a generation. It is difficult to see how any current IRBO nation, or western corporation, has been “forced” to share technology or intellectual property rights against its will.\n\nAlthough the western MSM and politicians persistently alleged that China was acting against the IRBO, quite clearly that wasn’t true. Western states, and their corporate partners, were fully engaged in a process of modernising China and transforming the international order.\n\nIn response to China’s 2015 announcement of the “Made In China 2025” strategy, Klaus Schwab said that China would become “the leader in the fourth industrial revolution.” This is just as Soros and his fellow Trilateralists planned.\n\nThe WEF, not national governments, has been the leading proponent for the 4th industrial revolution (4IR). With China clearly set as the “engine” driving the global technological transformation, and Russia leading on regulation, it is apparent that, despite the sabre-rattling of politicians, western governments and corporations have been willing accomplices.\n\nTechnocracy is a system of dictatorial rule based upon the allocation of resources. In 1938, Technocrat Magazine described it as follows:\n\nRather like feudalism, resource distribution is controlled by a centralised authority, who mete out access to resources dependent upon the citizen’s behaviour. This is the preferred “social credit” method of population control in China. An increasing number of China’s citizens need a good social credit score in order to access resources and society.\n\nThe whole system is administered by central planners within a subordinate policy body to the State Council called the National Development and Reform Commission (NDRC). They oversee a data mining, collection and analysis operation on an immense scale.\n\nWithout any democratic oversight, technocracy in China stipulates that the people trust the edicts of the technocrats. They are required to believe, or at least publicly state, that decisions are taken in the interest of the general good. If they don’t comply the Technate can use its surveillance systems to identify offenders and punish them for their selfish behaviour.\n\nIn its 2014 document Planning A Social Credit System, the People’s Republic of China (PRC) spoke of their intention to “construct a social credit environment of honesty, self-discipline, trustworthiness, and mutual trust.” They announced:\n\nThis is the epitome of technocracy. It is a monoculture where all are subservient to the technocratic state.\n\nThere are two arms to the social credit system in China. Both individual citizens and corporations are given a rating based upon the aggregation and analysis of the data collected from their lives and business practices.\n\nApproximately 80% of China’s provinces have rolled out some form of the social credit system. While still in development, individual surveillance and control systems are most pervasive in the cities. People can either be placed on a “blacklist,” limiting their freedoms, or a “redlist” permitting them to engage in society in a manner deemed appropriate by the Technate. Punishments include denial of access to public transport, refused payments, public shaming or restricted employment opportunities.\n\nNationally, the focus has been on constructing the Corporate Social Credit System (CSCS). Millions of businesses in China are required to demonstrate their commitment to the general good, as defined by the Technate. As long as they do, they will be allowed to prosper. If they don’t obey, they won’t.\n\nFor numerous reasons, explored by Prof. Liu Yongmou in the Benefits of Technocracy in China, the Chinese political system lent itself well to the creation of the world’s first Technate:\n\nThe WEF, the Trilateral Commission and other G3P think-tanks have encouraged the development needed for the PRC State Council’s NDRC to construct the burgeoning Technate. Foreign investment and an infusion of technology, from the current leading nations of the existing IRBO, has brought China to a position where it will provide the economic, political and cultural impetus for a new world order.\n\nTechnocracy, as piloted in China, is now being rolled out globally. Individual sovereignty and freedoms, the claimed moral basis for the current IRBO, are being replaced by a commitment to efficiency and resource management in the interests of the “general good.” In the West, we know this as “sustainable development.”\n\nSuch a system is perfect for those who want to wield supreme autocratic power, which is precisely why the G3P have long wished to install technocracy globally. It is the reason why they have assisted the construction of a Technate in China. The new IRBO will be led by the technocrat and they will serve the Global Public-Private Partnership.\n\nTechnocracy: An Operating System for the New IRBO\n\nThe new IRBO has nothing to do with representative democratic principles. It is entirely estranged from concepts such as freedom of speech and expression, democratic accountability, freedom of the press, freedom to roam and eschews all inalienable rights.\n\nIt is based upon a fusion between the political state and global corporations. We have recently seen this put into devastating effect in the Five Eyes nation of Canada.\n\nOn 14th February 2022, in response to the ongoing nationwide Truckers Freedom Convoy protests, Canadian Deputy Prime Minister and Finance Minister Chrystia Freeland stated that the government had arbitrarily decided “to broaden the scope of Canada’s anti-money laundering and terrorist financing rules.”\n\nStarting with crowd-funding and payment platforms, including crypto-currency exchanges, these private corporations were required to report all “suspicious” transactions to the government.\n\nThis quickly progressed to freezing protestors banks accounts. Freeland said that the private corporations were “collaborating properly and effectively.”\n\nThis is precisely how China’s technocratic social credit model is designed to function. Those who question the authority of the G3P will be crushed. Chrystia Freeland is a World Economic Forum Board Trustee.\n\nAs previously mentioned, this government-corporate synthesis echoes the Fascist State described by Mussolini. In particular, the use of technocracy to manage the behaviour of both the individual and corporations embodies the principles he described:\n\nThe democratic tradition of sovereign individuals, exercising their rights and coming together to pursue their shared interests is what the UK government call the “democratic deficit.” Their intention, with their proposal for their new Bill of Rights, is to allow those who comply with their diktats some “elbow room” to live a relatively “normal” existence.\n\nHowever, by defining what is in the “broader public interest,” they will curtail the liberties which they deem to be useless or harmful. “[T]he individual cannot be the judge, but the State only.” For example, the explanatory notes for the imminent Online Safety Act, The UK government announced:\n\nThe current Bill defines whatever the government deems to be disinformation or misinformation as “content that is harmful to adults.” Freedom of speech and expression online will effectively be terminated by the forthcoming legislation. The UK state will not allow social media users to share any information without official approval. This is equivalent to the current situation in China.\n\nMuch like China’s CSCS, at the recent COP26 summit, the chairman of the International Financial Reporting Standards (IFRS) Foundation, Erkki Liikänen, announced the International Sustainability Standards Board (ISSB). This will oversee the accountancy standards for businesses across the world who will be required to submit their sustainability disclosure to meet Sustainable Development Goals (SDGs).\n\nThe ISSB standards require businesses to commit to SDGs, with investments rated using the WEF’s stakeholder capitalism metrics. These metrics will assign an environmental, social and governance (ESG) rating to prospective investments. Any business that wishes to raise capital will need a good ESG rating.\n\nYou might imagine that MNCs would be opposed to these additional regulations. However, as with the CSCS system in China, those who work in partnership with government will do very well in this arrangement. Speaking in 2019, the UN special envoy for climate action and finance Mark Carney said:\n\nThe G3P decrees “what society wants,” just as its government assets determine what is in “the broader public interest.” By fostering the working partnership between state and corporation, like all good technocrats, the G3P leaders can insure that those who are loyal to them and their agenda will prosper, while those who aren’t will fail.\n\nResponding to Liikänen’s announcement, the Chinese Ministry of Finance offered to host the ISSB. This centralised control over business and economy exemplifies the technocracy the G3P have cultivated in China. The Minister of Finance, Liu Kun, said:\n\nDeveloping one global governance authority and setting the policy agenda in every sphere of human endeavour, has been the goal of the G3P for generations. Technocracy will enable them to manage the global transition to that system and technocracy will be the instrument through which they enforce their rule.\n\nThe key element for technocracy to succeed is reform of the monetary system. In 1934, Scott and Hubbert suggested that “energy certificates” should replace the dollar. They were seeking a way to to use money both as a means of surveillance and as a means to control the behaviour of the citizenry.\n\nChina conducted operational trials of its version of Central Bank Digital Currency (digital yuan – e-RMB) in the city of Shenzhen in 2020. Since then, it claims to have conducted billions of dollars worth of transactions using the e-RMB. The People’s Bank of China has now issued its digital wallet (e-CNY) for both Android and iOS devices.\n\nChina and Russia are in the vanguard of the race to introduce Central Bank Digital Currency (CBDC) globally. Recently, the Bank of America said that a US CBDC was “inevitable” as the US Federal Reserve explored the possibility. The Bank of England and European Central Bank are looking to introduce the same and the Bank of Russia is some way ahead, having launched its CBDC pilot in June 2021.\n\nCBDC is a liability of the central banks (it is always their money, not the users) and it is programmable. This means transactions can be permitted or denied by the issuing central bank at the point of payment.\n\nIn a CBDC world, G3P partners, such as the Canadian government, won’t need to extend oppressive legislation to seize protestors bank accounts. They will simply disable their ability to buy anything. The BBC hinted at the kind of impact this would have upon society:\n\nThe BBC’s appraisal barely touched upon the degree of control CBDC affords G3P technocrats. Should CBDC become the only form of currency available to us, we won’t have any money of our own.\n\nAll money will be controlled by the G3P’s Central Banks. They will decide what we are allowed to purchase with their CBDCs.\n\nWhile technocracy was an impossible dream in the 1930s, today it is eminently achievable. Just as Brzezinski foresaw, the required technological capability now exists.\n\nWhen Klaus Schwab and George Soros said China would be the engine of the new IRBO and the leaders of the 4th Industrial Revolution, they didn’t mean that China would become the centre of a political hegemony, as the US has been. Rather, China is the exemplar of technocracy, providing an operational model for the new global system alongside the supposedly necessary economic growth.\n\nThis new IRBO is the world order designed by the G3P. It is a neofeudal, techno-fascist, global technocracy led by a worldwide, multistakeholder network of vested, private interests.\n\nThe governments we elect will enforce the G3P policy agenda. The MSM’s task, who are both partners within and propagandists for the G3P, is to convince us to buy into it.\n\nOurs is to ensure that we don’t fall for it.\n\nIain Davis is an independent investigative journalist, blogger and author from Portsmouth in the UK. His focus is upon widening readers awareness of evidence that is not commonly reported by the so-called mainstream media. Through his writing he hopes to encourage the questioning of authority and to stimulate public debate. A frequent contributorto the UK Column, Iain’s work has been featured by the Corbett Report, the OffGuardian, Lew-Rockwell, Zero Hedge and other independent news outlets. Read more of his articles on his blog: – https://in-this-together.com\n\nComment on this article at HealthImpactNews.com.\n\nUnderstand the Times We are Currently Living Through\n\nThe God of All Comfort\n\nYear 2023: Will America Fulfill Its Destiny? Jesus Christ is the Only “Transhuman” the World Has Ever Seen or Will Ever See\n\nAn Invitation to the Technologists to Join the Winning Side\n\nSynagogue of Satan: Why It’s Time to Leave the Corporate Christian Church\n\nHow to Determine if you are a Disciple of Jesus Christ or Not\n\nEpigenetics Exposes Darwinian Biology as a Religion – Your DNA Does NOT Determine Your Health!\n\nWhat Happens When a Holy and Righteous God Gets Angry? Lessons from History and the Prophet Jeremiah\n\nInsider Exposes Freemasonry as the World’s Oldest Secret Religion and the Luciferian Plans for The New World Order\n\nIdentifying the Luciferian Globalists Implementing the New World Order – Who are the “Jews”?\n\nLeaving a lucrative career as a nephrologist (kidney doctor), Dr. Suzanne Humphries is now free to actually help cure people.\n\nIn this autobiography she explains why good doctors are constrained within the current corrupt medical system from practicing real, ethical medicine.\n\nOne of the sane voices when it comes to examining the science behind modern-day vaccines, no pro-vaccine extremist doctors have ever dared to debate her in public.", "opengraph": {"locale": "en_US", "site_name": "Vaccine Impact -", "type": "article", "title": "The Technocrats New World Order Advances – Expect “Cyber Attacks” Soon - Vaccine Impact", "description": "As I wrote yesterday, the \"leaks\" to the media this past weekend that show the U.S. health agencies have been concealing data that prove the COVID-19 \"vaccines\" are deadly signify that a major move is about to happen as the next \"crisis\" is being planned to shift the public's attention away from the COVID-19 vaccine crimes against humanity. After weeks of both sides in the Ukrainian conflict blaming each other for escalating the situation needlessly, seemingly out of the blue Russian President Vladimir Putin appeared in public and signed documents that reportedly state that Russia is recognizing the national sovereignty of Donetsk and Luhansk, republics currently part of the Ukraine, but with historical ties to Russia. This appears to me to be the implementation of a script that has already been written that charts a course now that will move the world on to the next big crisis, with the end goal of uniting the world under a central, technological state. U.S. President Biden then was handed his script, which he read earlier today. For months now the U.S. corporate media has been preparing the public for future \"cyber attacks,\" which will now obviously be blamed on Russia. Newsweek just published an \"exclusive\" report on these coming cyber attacks this past Sunday: Exclusive: FBI Braces for Russian Cyber Attacks in US as Ukraine Tensions Rise. And last night (Monday, Feb. 21) Fox News did the same thing: Ukraine-Russia Crisis: Cyberattacks could affect U.S. As I have been warning for the past few weeks, it is imperative that you be prepared for disruptions to basic services like water, power, fuel, and frozen bank accounts. Ian Davis, an independent journalist out of the UK, has just published an excellent piece that will help you cut through the propaganda that the corporate media is publishing and drill down to just what the Globalists are planning in this next phase. It was published at Unlimited Hangout, and I am going to republish it here as well. It is one of the most thorough reports on the move to a technocratic centralized government that I have read so far, and well worth the time to read through and digest. Much of this policy is set by the World Economic Forum, led by Klaus Schwab, and the evidence is strong that world leaders such as Trudeau, Putin, Xi, and Biden are following the script that the World Economic Forum has laid out. And for those of you still hanging on to your faith in Trump, here is a clip put together by High Impact Flix (HIF), highlighting President Donald Trump's cozy relationship to Klaus Schwab and the WEF, where Trump was a featured speaker in 2018, and then again in January of 2020, just weeks before the COVID-19 scam was unleashed to the world. I know this will not sway the die-hard Trump cult members who will excuse him as either being \"ignorant\" and not smart enough to know the true motives of Klaus Schwab and the WEF, or that he is at least better than [fill in the blank - usually Hillary Clinton or Joe Biden]. But I share all of this, not to discourage people, but to make you wise and understand who your true enemies are. We are not without hope, but hope will soon vanish if we continue to cling to the false idea that people can vote their way out of this mess by simply choosing the correct politicians.", "url": "https://vaccineimpact.com/2022/the-technocrats-new-world-order-advances-expect-cyber-attacks-soon/", "article:published_time": "2022-02-23T01:09:01+00:00", "article:modified_time": "2022-02-23T06:21:12+00:00"}, "tags": ["cyber attack", "WEF"], "tweets": [], "movies": [], "links": ["https://healthimpactnews.com/2022/cdc-withholding-data-on-covid-19-vaccines-because-they-might-be-misinterpreted-as-the-vaccines-being-ineffective-and-the-figures-would-be-misrepresented-by-anti-vaccine-groups/", "https://www.zerohedge.com/political/watch-live-biden-addresses-russia-ukraine-escalation-significant-new-sanctions-expected", "https://www.newsweek.com/exclusive-fbi-warns-russia-may-launch-cyber-attacks-us-ukraine-tensions-rise-1681012", "https://www.fox5ny.com/news/ukraine-russia-crisis-cyberattacks-could-affect-u-s", "https://unlimitedhangout.com/2022/02/investigative-reports/technocracy-the-operating-system-for-the-new-international-rules-based-order-1/", "https://unlimitedhangout.com/2022/02/investigative-reports/technocracy-the-operating-system-for-the-new-international-rules-based-order-1/", "https://consortiumnews.com/2022/02/09/china-russia-declare-new-era-of-multipolarity/", "https://www.cfr.org/expert/stewart-m-patrick", "https://in-this-together.com/UKC/WOWATR.pdf", "https://static.rusi.org/201905_op_which_rules_why_there_is_no_single_rules_based_international_system_web.pdf", "http://en.kremlin.ru/supplement/5770", "https://commons.wikimedia.org/wiki/File:Vladimir_Putin_and_Xi_Jinping,_26_july_2018_(1).jpg", "https://archive.fo/mPZtj", "https://www.dhs.gov/ntas/advisory/national-terrorism-advisory-system-bulletin-february-07-2022", "https://www.newsweek.com/justice-department-creates-domestic-terrorism-unit-amid-elevated-extremist-threat-1668138", "https://archive.fo/VM3Lz", "https://ec.europa.eu/commission/presscorner/detail/en/qanda_21_2781", "https://www.rt.com/news/549779-israel-ending-vaccine-green-pass/", "https://www.reuters.com/world/middle-east/israelis-mount-their-own-covid-freedom-convoy-2022-02-14/", "https://sdgs.un.org/2030agenda", "https://archive.fo/eJJqS", "https://flickr.com/photos/66261959@N08/8427105682", "https://www.ukcolumn.org/article/the-uk-new-normal-dictatorship", "https://in-this-together.com/pseudopandemic/", "https://archive.fo/TTa5o", "https://archive.md/8j2qM", "https://archive.fo/HOAHC", "https://sjsu.edu/faculty/wooda/2B-HUM/Readings/The-Doctrine-of-Fascism.pdf", "https://in-this-together.com/beyond-gladio-a-new-strategy-of-tension/", "https://in-this-together.com/islamist-extremists-proxies-of-the-west-part-1/", "https://military-history.fandom.com/wiki/CIA_involvement_in_Contra_cocaine_trafficking", "https://www.sipri.org/commentary/expert-comment/2019/us-withdrawal-iran-deal-one-year", "https://www.lewrockwell.com/2018/01/bionic-mosquito/not-one-inch-eastward/", "https://in-this-together.com/who-are-the-new-world-order-a-brief-history/", "https://in-this-together.com/what-is-the-global-public-private-partnership/", "https://soundcloud.com/unlimited-hangout/the-global-public-private-partnership-with-iain-davis", "https://soundcloud.com/unlimited-hangout/the-global-public-private-partnership-with-iain-davis", "https://cepi.net/news_cepi/2-billion-required-to-develop-a-vaccine-against-the-covid-19-virus/", "https://archive.fo/LgjCZ", "https://web.archive.org/web/20210613062952/https://www3.weforum.org/docs/WEF_Global_Technology_Governance.pdf", "https://www.weforum.org/focus/fourth-industrial-revolution", "https://www.bis.org/", "https://www.weforum.org/organizations/world-business-council-for-sustainable-development-wbcsd", "https://www.parliamentlive.tv/Event/Index/d919fbc9-72ca-42de-9b44-c0bf53a7360b", "https://archive.fo/I4Vf4", "https://odysee.com/@InThisTogether:d/pure-medical-misinformation:b", "https://in-this-together.com/covid-jabs/", "https://www.chathamhouse.org/about-us/our-history", "https://archive.is/u1GUc", "https://oxfordre.com/politics/view/10.1093/acrefore/9780190228637.001.0001/acrefore-9780190228637-e-1420", "https://www.activistpost.com/2016/01/hillary-clinton-brags-about-getting-her-marching-orders-from-the-cfr.html", "https://www.bitchute.com/video/LkFt3sMXRe7f/", "https://thenewamerican.com/canadas-justin-trudeau-ties-covid-19-recovery-to-reset-and-un-agenda-2030/", "https://swprs.org/the-wef-and-the-pandemic/", "https://vimeo.com/ondemand/theforumvod/510154188", "https://www.notablebiographies.com/Pu-Ro/Putin-Vladimir.html", "https://www.rt.com/news/one-of-founding-fathers-of-russian-democracy-remembered-in-moscow/", "https://www.flickr.com/photos/worldeconomicforum/3488058401/in/photostream/", "https://cyberpolygon.com/about/", "https://web.archive.org/web/20200805070812/https://www.fintechfutures.com/2019/06/icc-2019-moscow-an-interview-with-dmitry-samartsev/", "https://en.wikipedia.org/wiki/Sberbank", "https://archive.is/3WVxP", "https://carnegieendowment.org/", "https://www.oas.org/en/member_states/default.asp", "https://archive.fo/mEhIW", "https://www3.weforum.org/docs/WEF_A_Partner_in_Shaping_History.pdf", "https://en.wikipedia.org/wiki/Herman_Gref", "https://www.reuters.com/markets/europe/european-us-regulators-tell-banks-prepare-russian-cyberattack-threat-2022-02-09/", "https://www.cbsnews.com/news/russian-cyberattack-high-alert-united-states/", "https://archive.fo/yECE2", "https://www.forbes.com/sites/jodywestby/2020/12/20/russia-has-carried-out-20-years-of-cyber-attacks-that-call-for-international-response/?sh=7b630ff16605", "https://web.archive.org/web/20220113104542/https://amp.theguardian.com/world/2020/dec/18/cyber-attack-brutal-reminder-russia-problem-facing-joe-biden", "https://unlimitedhangout.com/2021/04/investigative-reports/wef-warns-of-cyber-attack-leading-to-systemic-collapse-of-the-global-financial-system/", "https://www.thelastamericanvagabond.com/wp-content/uploads/2021/04/Maurer_Nelson_FinCyber_final1.pdf", "https://archive.fo/PFnRG", "https://www.foxnews.com/politics/white-house-cdc-science-covid-guidance", "https://technocracy.fandom.com/wiki/Technical_Alliance", "https://web.archive.org/web/20200716210736/https://www.technocracyinc.org/wp-content/uploads/2015/07/Study-Course.pdf", "https://www.nytimes.com/2017/05/26/us/zbigniew-brzezinski-dead-national-security-adviser-to-carter.html?smid=nytcore-iphone-share&smprod=nytcore-iphone", "http://solipsyzm.pl/between2ages.pdf", "https://web.archive.org/web/20190123065610/https://trilateral.org/page/3/about-trilateral", "http://www.trilateral.org/", "https://unlimitedhangout.com/2021/12/investigative-reports/the-new-normal-the-civil-society-deception/", "https://web.archive.org/web/20190406030104/https://www3.weforum.org/docs/WEF_Globalization_4.0_Call_for_Engagement.pdf", "https://www.weforum.org/press/2021/01/world-leaders-to-meet-during-davos-agenda-in-a-crucial-year-to-rebuild-trust-51d7fa48d1/", "https://www.weforum.org/videos/davos-agenda-2022-restoring-trust-in-global-trade-and-supply-chains-original", "https://time.com/6132383/klaus-schwab-davos-2022/", "https://unlimitedhangout.com/2021/12/investigative-reports/the-new-normal-the-civil-society-deception/", "https://web.archive.org/web/20130201010655/http://trilateral.org/download/doc/overview_east_west_relations.pdf", "https://www.thoughtco.com/the-sino-soviet-split-195455", "https://www.investopedia.com/terms/f/fdi.asp", "https://wayback.archive-it.org/5902/20150627201315/http://www.nsf.gov/statistics/infbrief/nsf04306/", "https://web.archive.org/web/20210126024850/https://www.bloomberg.com/news/articles/2021-01-25/china-overtook-u-s-in-foreign-direct-investment-un-agency-says", "https://unctad.org/news/global-foreign-direct-investment-rebounded-strongly-2021-recovery-highly-uneven", "https://archive.fo/M4CWp", "https://archive.fo/DvOHc", "https://archive.is/Qo503", "https://www.ncuscr.org/sites/default/files/migration/Zoellick_remarks_notes06_winter_spring.pdf", "https://creditwritedowns.com/2008/11/china-is-now-americas-largest-creditor.html", "https://archive.fo/xYr9F", "https://archive.fo/FDXS5", "https://archive.fo/sE3pG", "https://edition.cnn.com/2001/WORLD/asiapcf/east/04/05/china.WTO/", "https://archive.fo/GMrba", "https://web.archive.org/web/20200610023505/https://amp.theguardian.com/business/2002/dec/20/france.internationalnews", "https://www.strategic-culture.org/news/2016/08/30/soros-ran-us-foreign-policy-post-coup-ukraine/", "https://swprs.org/wp-content/uploads/2019/12/trilateral-commission-members-2005.pdf", "https://archive.fo/mSaKx", "https://trumpwhitehouse.archives.gov/briefings-statements/remarks-president-trump-business-event-president-xi-china-beijing-china/", "https://econofact.org/what-is-the-problem-of-forced-technology-transfer-in-china", "https://www.cfr.org/blog/why-does-everyone-hate-made-china-2025", "https://tradingeconomics.com/united-states/balance-of-trade", "https://www.uschina.org/reports/us-china-economic-relationship", "https://unctad.org/system/files/official-document/diaeiainf2021d1_en.pdf", "https://documents1.worldbank.org/curated/en/833871568732137448/pdf/Innovative-China-New-Drivers-of-Growth.pdf", "http://english.www.gov.cn/premier/news/2017/08/10/content_281475781726536.htm", "https://www.technocracy.news/quick-start/", "https://en.ndrc.gov.cn/", "http://www.chinadaily.com.cn/china/2015twosession/2015-03/05/content_19724706_8.htm", "https://archive.fo/Z0H0W", "https://thediplomat.com/2021/03/chinas-social-credit-system-speculation-vs-reality/", "https://archive.fo/RQPbP", "https://futurism.com/china-social-credit-system-barred-traveling-2018", "https://merics.org/en/report/chinas-social-credit-system-2021-fragmentation-towards-integration", "https://www.scmp.com/economy/china-economy/article/3027674/china-pushing-ahead-controversial-corporate-social-credit", "https://archive.fo/IVByV", "https://www.ukcolumn.org/article/the-not-so-great-carbon-reset-part-2", "https://www.theglobeandmail.com/business/article-financial-institutions-have-started-freezing-protesters-bank-accounts/", "https://archive.fo/0SUyh", "https://web.archive.org/web/20210719123607/https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/985031/Explanatory_Notes_Accessible.pdf", "https://sdgs.un.org/2030agenda", "https://www.ifrs.org/groups/international-sustainability-standards-board/", "https://www.weforum.org/stakeholdercapitalism/our-metrics", "https://archive.fo/gKiZU", "https://archive.md/IEYF0", "https://decrypt.co/44410/1-5-million-of-chinas-cbdc-will-be-distributed-in-shenzhen", "https://finance.yahoo.com/news/9-5-billion-spent-using-092051719.html", "https://www.reuters.com/markets/currencies/china-cbank-launches-digital-yuan-wallet-apps-android-ios-2022-01-04/?taid=61d40cb1b7327100014b999d&utm_campaign=trueAnthem:+Trending+Content&utm_medium=trueAnthem&utm_source=twitter", "https://blockbitdaily.com/2022/01/25/stablecoin-and-cbdc-adoption-is-inevitable-according-to-bank-of-america/", "https://www.federalreserve.gov/central-bank-digital-currency.htm", "https://www.politico.eu/article/digital-euro-bill-due-early-2023/", "https://cbdcinsider.com/2021/06/30/russia-launches-cbdc-trial-with-12-banks-explains-motivations/", "https://archive.md/ad3OZ", "https://unlimitedhangout.com/author/iain-davis/", "https://unlimitedhangout.com/2022/02/investigative-reports/technocracy-the-operating-system-for-the-new-international-rules-based-order-1/", "https://healthimpactnews.com/2022/the-technocrats-new-world-order-advances-expect-cyber-attacks-soon/", "https://created4health.org/the-god-of-all-comfort/", "https://created4health.org/the-god-of-all-comfort/", "https://created4health.org/year-2023-will-america-fulfill-its-destiny-jesus-christ-is-the-only-trans-human-the-world-has-ever-seen-or-will-ever-see/", "https://created4health.org/year-2023-will-america-fulfill-its-destiny-jesus-christ-is-the-only-trans-human-the-world-has-ever-seen-or-will-ever-see/", "https://created4health.org/an-invitation-to-the-technologists-to-join-the-winning-side/", "https://created4health.org/an-invitation-to-the-technologists-to-join-the-winning-side/", "https://created4health.org/synagogue-of-satan-why-its-time-to-leave-the-corporate-christian-church/", "https://created4health.org/synagogue-of-satan-why-its-time-to-leave-the-corporate-christian-church/", "https://created4health.org/how-to-determine-if-you-are-a-disciple-of-jesus-christ-or-not/", "https://created4health.org/how-to-determine-if-you-are-a-disciple-of-jesus-christ-or-not/", "https://healthimpactnews.com/2023/epigenetics-exposes-darwinian-biology-as-a-religion-your-dna-does-not-determine-your-health/", "https://healthimpactnews.com/2023/epigenetics-exposes-darwinian-biology-as-a-religion-your-dna-does-not-determine-your-health/", "https://created4health.org/what-happens-when-a-holy-and-righteous-god-gets-angry-lessons-from-history-and-the-prophet-jeremiah/", "https://created4health.org/what-happens-when-a-holy-and-righteous-god-gets-angry-lessons-from-history-and-the-prophet-jeremiah/", "https://healthimpactnews.com/2021/insider-exposes-freemasonry-as-the-worlds-oldest-secret-religion-and-the-luciferian-plans-for-the-new-world-order/", "https://healthimpactnews.com/2021/insider-exposes-freemasonry-as-the-worlds-oldest-secret-religion-and-the-luciferian-plans-for-the-new-world-order/", "https://healthimpactnews.com/2021/identifying-the-luciferian-globalists-implementing-the-new-world-order-who-are-the-jews/", "https://healthimpactnews.com/2021/identifying-the-luciferian-globalists-implementing-the-new-world-order-who-are-the-jews/", "https://created4health.org/fact-check-christianity-and-the-christian-religion-is-not-found-in-the-bible-the-person-jesus-christ-is/", "https://created4health.org/fact-check-christianity-and-the-christian-religion-is-not-found-in-the-bible-the-person-jesus-christ-is/", "https://created4health.org/the-seal-and-mark-of-god-is-far-more-important-than-the-mark-of-the-beast-are-you-prepared-for-whats-coming/", "https://created4health.org/the-seal-and-mark-of-god-is-far-more-important-than-the-mark-of-the-beast-are-you-prepared-for-whats-coming/", "https://created4health.org/the-satanic-roots-to-modern-medicine-the-mark-of-the-beast/", "https://created4health.org/the-satanic-roots-to-modern-medicine-the-mark-of-the-beast/", "https://created4health.org/medicine-idolatry-in-the-twenty-first-century/", "https://created4health.org/medicine-idolatry-in-the-twenty-first-century/", "https://created4health.org/make-reading-the-bible-a-new-year-resolution-it-could-change-your-life/", "https://healthimpactnews.com/2020/how-to-beat-internet-censorship-and-create-your-own-newsfeed/", "https://healthimpactnews.com/2020/how-to-beat-internet-censorship-and-create-your-own-newsfeed/", "https://t.me/healthimpact", "https://www.bitchute.com/channel/HlyeDvlqcVJm/", "https://odysee.com/@HealthImpactNews:1", "https://t.me/healthimpact", "https://www.bitchute.com/channel/HlyeDvlqcVJm/", "https://odysee.com/@HealthImpactNews:1", "https://www.torproject.org/", "https://www.torproject.org/", "http://a272fk5d36p7qbmdgcf5d4dwwmhncdkteqmnzbercp75hgycbmytb4ad.onion/", "http://mhr6ji2fyhcaeviqoz2yyx7vq5neq54yqdlkvxyg2j3yl2ktxizc36id.onion/", "http://ahdemogiwgycere5gc3r4lzyusa77ksrt6q7fcc2nall27gpnxkzdvid.onion/", "http://f7rkl2pb2uwyyrw3mgaxstwig3nhpl25fhjdvoultpn4j56n3vkbgkad.onion/", "http://mh7mycgri5w3vdm3jmuir6dhtecgu76njt2eehqhiwxrygiivq53i5ad.onion/", "https://healthytraditions.com/products/a-guide-to-healing-from-vaccine-injuries-ebook?_pos=6&_sid=59d560278&_ss=r", "https://healthytraditions.com/products/dr-andrew-moulden-every-vaccine-produces-harm-ebook?_pos=1&_sid=a02026eb0&_ss=r", "https://healthytraditions.com/healthytraditions/books/dangers-of-medicine-books/rising-from-the-dead.html", "https://healthytraditions.com/healthytraditions/books/dangers-of-medicine-books/the-vaccine-court.html", "https://healthytraditions.com/healthytraditions/books/dangers-of-medicine-books/the-vaccine-court.html", "https://healthytraditions.com/healthytraditions/books/dangers-of-medicine-books/the-vaccine-court.html", "https://healthimpactnews.com/revive/www/delivery/ck.php?n=af3e0a62&cb=INSERT_RANDOM_NUMBER_HERE"], "authors": [], "publish_date": "2022-02-23T01:09:01+00:00"}