{"result_id": "326017", "URL": "http://vaccineimpact.com/2015/vaccine-culture-war-myths/", "timestamp": "2023-04-25 17:48:59 CEST+0200", "meta": {"description": "\"Even if you and your children have willingly received every government recommended vaccine today, if non-medical exemptions are removed from U.S. vaccine laws, you will have no choice if you decide you don’t want to use every new liability-free vaccine that government recommends tomorrow. This Vaccine Culture War is about a lot more than vaccination. Because if the State can tag, track down and force you against your will to be injected with biologicals of known and unknown toxicity today, then there will be no limit on which other freedoms the State can take away in the name of the greater good tomorrow.\" - Barbara Loe Fisher Doctors who say vaccines are safe for everyone and do not cause injury and death are either uninformed, in denial or lying. Since the first vaccine for smallpox, doctors have known and it has been well documented that brain inflammation, permanent brain damage and death have always been among most serious complications of vaccination. Just like any other pharmaceutical product, vaccines carry a risk of injury or death. These risks can be greater for some people with genetic, biological and environmental risk factors that doctors do not understand or cannot predict.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "Vaccine Culture War Myths - Vaccine Impact", "cleaned_text": "View our five Vaccine Culture War Myths excerpted from NVIC’s President and Co-Founder Barbara Loe Fisher’s referenced commentary – The Vaccine Culture War in America: Are You Ready? After viewing these myths, register and encourage others to register on NVIC’s Advocacy Portal today and join with other concerned Americans to protect informed consent rights. This resource is free and will keep you informed on legislative actions underway in your state, provide guidance on what action to take, and connect you with your legislators.\n\nVACCINE CULTURE WAR MYTH 1: Most medical doctors say that vaccines do not cause injury or death, so it must be true.\n\nDoctors who say vaccines are safe for everyone and do not cause injury and death are either uninformed, in denial or lying. Since the first vaccine for smallpox, doctors have known and it has been well documented that brain inflammation, permanent brain damage and death have always been among most serious complications of vaccination. 1 2\n\nJust like any other pharmaceutical product, vaccines carry a risk of injury or death. These risks can be greater for some people with genetic, biological and environmental risk factors that doctors do not understand or cannot predict.3\n\nCongress, U.S. Supreme Court Say Vaccines Are “Unavoidably Unsafe”\n\nKnowing this, Congress in 1986 4 and the U.S. Supreme Court in 2011 5 declared vaccines to be “unavoidably unsafe” and shielded drug companies from all product liability. 6 If you or your child are injured or die after vaccination, you cannot hold the drug company that makes and profits from the vaccine or anyone who regulates, promotes, administers or mandates the vaccine accountable in a civil court of law in front of a jury of your peers.\n\nLiability for Seat Belt Manufacturers – NOT for Vaccine Manufacturers\n\nSeat belt manufacturers have product liability 7 but vaccine manufacturers do not. Doctors can be sued for malpractice except when they administer vaccinations that injure or kill a person.\n\nVaccines are the only product government mandates and completely indemnifies.\n\nThe federal government has paid $3 billion dollars in compensation to victims of vaccine injury and death under the National Childhood Vaccine Injury Act of 1986. 8\n\nVACCINE CULTURE WAR MYTH 2: People who question vaccine safety are ignorant and do not understand the science.\n\nJust the opposite is true. Most people who question vaccine safety are very intelligent and understand the difference between good science and bad science. 9 10 11\n\nStudies reveal that mothers and fathers with college or post-graduate degrees are the ones who most often question the safety of vaccines. 12 13 14 They are wondering whether government policy directing pediatricians to give children three times as many vaccinations as children got 30 years ago 15 is safe, effective and necessary.\n\nIf growing concerns among parents about vaccination was simply due to ignorance, two decades of reports published by the Institute of Medicine would not have found large knowledge gaps in vaccine safety science. 16 For example, there are fewer than 40 published studies evaluating the safety of the federally recommended child vaccine schedule for infants and children under age six. 17\n\nVACCINE CULTURE WAR MYTH NUMBER 3: People who do not vaccinate are selfish and don’t care about the public health.\n\nWhile we are all born equal with equal rights under the law, we are not born all the same. Each one of us is born with different genes and a unique microbiome influenced by epigenetics 18 that affects how we respond to diseases 19 20 and pharmaceutical products like vaccines. 21 22Many Americans no longer vaccinate today because the risks of vaccination turned out to be 100 percent for them, their children or other family members. They have good reason to believe that the genes they were born with make them more susceptible to vaccine harm. 23 24 25 26 27\n\nBut often these former vaccinators cannot find a doctor to write a medical exemption because almost no health condition qualifies for a medical exemption to vaccination anymore. 28 Unless you are dying of cancer and on chemotherapy, have had a recent organ transplant or have the most severe combined immune deficiency, most doctors will not grant you a medical vaccine exemption. 29\n\nNon-medical vaccine exemptions are the only way vaccine vulnerable families can protect their lives.\n\nSome Healthy Americans Choosing Different Path to Health\n\nSome Americans use fewer vaccines or remain unvaccinated because they have chosen a different path to health. They focus on boosting immune function with good nutrition, exercise, avoiding environmental toxins and using holistic health alternatives that do not rely on heavy use of pharmaceutical products. 30 31 32 33 They are contributing significantly to the public health because they and their children are very healthy.\n\nIt is not selfish to want to make informed choices about how to stay healthy. It is not selfish to protect yourself and your children from harm, especially if you believe your family is more susceptible to vaccine injury. If everyone protects their own health and the health of their children, the public health will be protected.\n\nVACCINE CULTURE WAR MYTH 4: Science trumps religious beliefs so religious exemptions to vaccination should be eliminated.\n\nThe attack on Americans with religious or spiritual beliefs is central to the political agenda driving this cultural war. 34 35 36 Fellow citizens, who do not believe there is a God, 37 38 39 40 are demanding that those who have faith in God be required to place the same faith in science and doctors. 41\n\nThere is a big difference between fallible human beings and God, but some doctors do not understand this difference.\n\nOne prominent pediatrician vaccine developer, 42 who insists that babies can safely be given 10,000 vaccines on the same day, 43 has publicly ridiculed religious beliefs 44 45 46 but now is hypocritically quoting holy scripture 47 and comparing Disneyland to the “Garden of Eden.” 48 Invoking the name of Jesus, he is trying to shame Christian parents refusing to obey his orders to give their children every government recommended vaccine, including the one he created 49 that has made him a very rich man. 50 51 52\n\nMothers Responsible for the Health of Their Children\n\nI remember many years ago when a public health doctor promoting the “No Shots, No School” campaign in America suggested I was “selfish” for declining to give my two youngest children pertussis vaccine even though my oldest son was DPT vaccine injured. Implicit was the suggestion that I had no right to protect my own children’s health if it conflicted with what doctors believe protects the public health.\n\nI looked him straight in the eyes and said “Doctor, whether or not I put my child’s life on the line for you and your vaccine is between me and my God and not between me and you.”\n\nAs mothers, we carry our babies inside us for nine months, we give birth, we love them more than we thought we could ever love anyone and we nurture them throughout childhood so they can grow up to be productive adult members of society. We are responsible for their health and we are the ones who care for them when they become sick and unable to care for themselves for any reason, and we are the ones who weep at their graves if they die before we do.\n\nDo Not Let Anyone Violate Your Religious, Conscientious Beliefs\n\nYou do not have to belong to an organized religion or state recognized church to hold sincere religious or spiritual beliefs about health and vaccination. 53 54 55 As a mother or father, you have the God given natural right to use the brain and gut instincts God gave you to consider the evidence, examine your conscience, pray for guidance and exercise the human right to informed consent to medical risk-taking on behalf of your minor child. Do not let a doctor, government employee or politician take that God given right away from you.\n\nIt is a violation of religious freedom to force vaccination when you hold religious or spiritual beliefs opposing use of one or more vaccines and it is a violation of the human spirit to force you to disobey the certain judgment of your conscience.\n\nVACCINE CULTURE WAR MYTH 5: It is ethical for government to sacrifice the few for the many.\n\nBased on hedonism 56 and a mathematical equation, this philosophy is called utilitarianism 57 58and comes from the word “utility.” 59 The utilitarian rationale was created as a guide for legislators making public policy by an 18th century British social reformer Jeremy Bentham, 60 61 whose mummified head is being preserved by the University College London, where a wax version is on public display. 62 In 1905, the U.S. Supreme Court used Bentham’s utilitarian rationale to rule in Jacobsen v. Massachusetts that state legislatures had the power to enact mandatory smallpox vaccination laws. 63\n\nAmerican eugenicists and social reformers embraced utilitarianism in the early 20th century. 64 65 They argued that government has the legal right to discriminate against a minority of citizens judged to be genetically defective or a threat to the health and welfare of society. In 1923, U.S. Supreme Court justice Oliver Wendall Holmes 66 gave the green light to the state of Virginia to forcibly sterilize a young women, Carrie Buck, because doctors judged her to be mentally retarded just like her daughter and mother.\n\nIt turns out Carrie Buck was not mentally retarded and neither was her daughter or mother. 68\n\nUtilitarianism Pseudo-Ethic In Its Most Extreme Form\n\nDoctors and public health officials in the Third Reich implemented utilitarianism in its most extreme form to justify conducting horrific scientific experiments on captive people. 69 70 The Nuremberg Tribunal justices presiding over The Doctors Trial after World War II declared utilitarianism to be a pseudo ethic. They issued the Nuremberg Code outlining the informed consent principle, 71 72 which has guided research on humans and the ethical practice of medicine ever since. 73 74 75\n\nThe Institute of Medicine has confirmed that some individuals have known and unknown genetic risk factors that make them more susceptible to vaccine injury and death. 76 This means forced vaccination laws that fail to include flexible medical and non-medical exemptions become a utilitarian, de facto selection of the genetically vulnerable for sacrifice. 77\n\nIs America really going to walk down that road? Are we going to punish citizens for the genes they were born with in the name of the public health?\n\nAre we going to slide down the slippery slope of utilitarianism and ignore the profound ethical and legal questions that remain: Who gets to decide what protects the public health? Which individuals should be sacrificed? And how many is too many?", "opengraph": {"locale": "en_US", "site_name": "Vaccine Impact -", "type": "article", "title": "Vaccine Culture War Myths - Vaccine Impact", "description": "\"Even if you and your children have willingly received every government recommended vaccine today, if non-medical exemptions are removed from U.S. vaccine laws, you will have no choice if you decide you don’t want to use every new liability-free vaccine that government recommends tomorrow. This Vaccine Culture War is about a lot more than vaccination. Because if the State can tag, track down and force you against your will to be injected with biologicals of known and unknown toxicity today, then there will be no limit on which other freedoms the State can take away in the name of the greater good tomorrow.\" - Barbara Loe Fisher Doctors who say vaccines are safe for everyone and do not cause injury and death are either uninformed, in denial or lying. Since the first vaccine for smallpox, doctors have known and it has been well documented that brain inflammation, permanent brain damage and death have always been among most serious complications of vaccination. Just like any other pharmaceutical product, vaccines carry a risk of injury or death. These risks can be greater for some people with genetic, biological and environmental risk factors that doctors do not understand or cannot predict.", "url": "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx", "article:published_time": "2015-04-06T14:37:35+00:00", "article:modified_time": "2015-04-06T18:08:47+00:00"}, "tags": ["Vaccine Culture War", "Utilitarianism", "NVIC", "eugenics"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/4wWFNoIT1Ek?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/4wWFNoIT1Ek?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe loading=\"lazy\" width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/RnaMVRQrdsM?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/RnaMVRQrdsM?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe loading=\"lazy\" width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/hTsT7Ia8Hpw?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/hTsT7Ia8Hpw?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe loading=\"lazy\" width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/ZaYVhuRjb0c?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/ZaYVhuRjb0c?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "669", "height": "376", "embed_code": "<iframe loading=\"lazy\" width=\"669\" height=\"376\" src=\"https://www.youtube.com/embed/K_KvXzuBxvY?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/K_KvXzuBxvY?feature=oembed"}], "links": ["http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx", "http://www.nvic.org/NVIC-Vaccine-News/March-2015/the-vaccine-culture-war-in-america-are-you-ready.aspx", "http://www.nvicadvocacy.org/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref1", "http://www.sciencedirect.com/science/article/pii/S0967586808001896", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref2", "http://www.nap.edu/openbook.php?record_id=2138&page=R1", "http://www.nap.edu/openbook.php?record_id=13164&page=82", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref4", "http://www.nvic.org/Vaccine-Laws/1986-Vaccine-Injury-Law.aspx", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref5", "http://www.scotusblog.com/case-files/cases/bruesewitz-v-wyeth/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref6", "http://www.enhancedonlinenews.com/portal/site/eon/permalink/?ndmViewId=news_view&newsId=20110223005592&newsLang=en&permalinkExtra=vaccination/immunization/national-vaccine-information-center", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref7", "http://www.csmonitor.com/USA/Justice/2011/0223/Supreme-Court-allows-lawsuits-against-automakers-over-seat-belt-design", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref8", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref9", "http://www.nvic.org/NVIC-Vaccine-News/May-2013/desperate-times-for-vaccine-risk-denialism.aspx", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref10", "http://www.nvic.org/NVIC-Vaccine-News/August-2014/DHHS-Funded-RAND-Corp--Study--An-Inside-Job.aspx", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref11", "http://www.sfgate.com/news/science/article/Anti-vaccine-mothers-discuss-their-thinking-amid-6095061.php", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref12", "http://www.hindawi.com/journals/apm/2012/932741/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref13", "http://www.nvic.org/NVIC-Vaccine-News/September-2012/Turning-Vaccine-Exemptions-Into-Class-Warfare.aspx", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref14", "http://healthimpactnews.com/2013/more-educated-parents-less-likely-to-vaccinate-and-feed-children-sugar-and-gmo-foods/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref15", "http://www.cdc.gov/vaccines/schedules/images/schedule1983s.jpg", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref16", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref17", "http://books.nap.edu/openbook.php?record_id=13563", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref18", "http://www.nvic.org/CMSTemplates/NVIC/pdf/Live-Virus-Vaccines-and-Vaccine-Shedding.pdf", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref19", "http://www.researchgate.net/publication/5253667_Genetic_susceptibility_and_resistance_to_influenza_infection_and_disease_in_humans_and_mice", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref20", "http://geneticliteracyproject.org/2014/10/31/susceptibility-to-ebola-has-clear-genetic-underpinnings/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref21", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref22", "http://www.nap.edu/openbook.php?record_id=13164&page=82", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref23", "http://www.nap.edu/openbook.php?record_id=5881&page=35", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref24", "http://www.medpagetoday.com/MeetingCoverage/ACAAI/16872", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref25", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2746083/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref26", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3248605/#%21po=12.5000", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref27", "http://www.reuters.com/article/2013/01/22/us-narcolepsy-vaccine-pandemrix-idUSBRE90L07H20130122", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref28", "http://jid.oxfordjournals.org/content/early/2012/07/10/infdis.jis436.full", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref29", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref30", "http://www.fitnesshealth101.com/fitness/general/key-components/well-being", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref31", "http://usatoday30.usatoday.com/news/health/2004-05-27-alternative-medicine_x.htm", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref32", "http://www.nbcnews.com/id/32219873/ns/health-alternative_medicine/t/billion-spent-yearly-alternative-medicine/#.VPx9SGaHtrg", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref33", "http://www.effortlesshealing.com/af", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref34", "http://content.time.com/time/magazine/article/0,9171,1555132-1,00.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref35", "http://www.nytimes.com/roomfordebate/2013/01/22/is-atheism-a-religion/atheism-should-end-religion-not-replace-it", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref36", "http://www.nyunews.com/2013/02/25/cicconet-8/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref37", "http://www.theguardian.com/society/2010/aug/26/doctors-religious-beliefs-terminally-ill", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref38", "http://www.catholic.com/blog/trent-horn/does-it-matter-that-many-scientists-are-atheists", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref39", "http://www.sciencedaily.com/releases/2013/06/130605144424.htm", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref40", "http://www.theblaze.com/stories/2013/04/23/famed-atheist-richard-dawkins-forcing-religion-on-kids-is-child-abuse/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref41", "http://www.nyunews.com/2013/02/25/cicconet-8/", "http://www.phillymag.com/articles/will-this-doctor-hurt-your-baby/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref43", "http://pediatrics.aappublications.org/content/109/1/124.full", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref44", "http://www.jewishexponent.com/headlines/2015/02/chop-doc-gives-inoculation-his-best-shot", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref45", "http://newhope360.com/supplements/dr-offit-short-sighted-belief-industry-science", "http://newhope360.com/supplements/dr-offit-short-sighted-belief-industry-science", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref46", "http://www.vaccinationcouncil.org/2012/08/26/paul-offit-threatens-religious-and-philosphical-vaccine-exemptions-a-respose-by-suzanne-humphries-md/", "http://www.jewishexponent.com/headlines/2015/02/chop-doc-gives-inoculation-his-best-shot", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref47", "http://www.nytimes.com/2015/02/10/opinion/what-would-jesus-do-about-measles.html?_r=0", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref48", "http://www.newser.com/article/818044b4917e475e90dbb2b5201ca6ee/as-long-as-there-have-been-vaccines-some-people-have-feared-and-hated-them-historians-say.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref49", "http://www.historyofvaccines.org/content/offit-3-developing-rotavirus-vaccine", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref50", "http://www.cbsnews.com/news/how-independent-are-vaccine-defenders/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref51", "http://www.ocregister.com/articles/correction-296910-dated-entitled.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref52", "https://www.opendemocracy.net/ourkingdom/mel-kelly/dr-paul-%E2%80%9Cfor-profit%E2%80%9D-offit-measles-and-bbc", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref53", "http://www.washingtonpost.com/wp-dyn/content/article/2008/06/06/AR2008060603791.html?sid=ST2008060900952", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref54", "http://www.leagle.com/decision/1987753672FSupp81_1736.xml/SHERR%20v.%20NORTHPORT-EAST%20NORTHPORT%20U.%20FREE%20SCH.%20D.", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref55", "http://caselaw.findlaw.com/wy-supreme-court/1276482.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref56", "http://plato.stanford.edu/entries/hedonism/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref57", "http://www.merriam-webster.com/dictionary/utilitarianism", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref58", "http://sites.wofford.edu/kaycd/utilitarianism/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref59", "http://www.merriam-webster.com/dictionary/utility", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref60", "http://utilitarianphilosophy.com/jeremybentham.eng.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref61", "http://www.jstor.org/discover/10.2307/2709597?sid=21105482914021&uid=2&uid=4&uid=3739936&uid=3739256", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref62", "http://www.ucl.ac.uk/museums/jeremy-bentham/about/bentham-head", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref63", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref64", "http://hnn.us/articles/1796.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref65", "http://www.tolerance.org/magazine/number-23-spring-2003/feature/american-gothic", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref66", "http://www.history.com/topics/oliver-wendell-holmes-jr", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref67", "https://www.law.cornell.edu/supremecourt/text/274/200", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref68", "http://buckvbell.com/index.html", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref69", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2352986/pdf/bmj00571-0053.pdf", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref70", "http://connection.ebscohost.com/c/articles/91654214/doctors-dilemma-utilitarian-medical-ethics-nazi-physician-karl-brandt", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref71", "http://www.amazon.com/Nazi-Doctors-Nuremberg-Code-Experimentation/dp/0195101065#reader_0195101065", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref72", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref73", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref74", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref75", "http://plato.stanford.edu/entries/informed-consent/", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref76", "http://www.nvic.org/NVIC-Video-Briefs/vaccine-culture-war-myths.aspx#_ednref77", "http://www.nvic.org/NVIC-Vaccine-News/November-2014/Vaccination--Defending-Your-Right-to-Know-and-Free.aspx", "https://healthimpactnews.com/revive/www/delivery/ck.php?n=af3e0a62&cb=INSERT_RANDOM_NUMBER_HERE"], "authors": [], "publish_date": "2015-04-06T14:37:35+00:00"}