{"result_id": "326002", "URL": "https://vaccineimpact.com/2015/there-are-271-new-vaccines-in-big-pharmas-pipeline/", "timestamp": "2023-04-25 17:48:47 CEST+0200", "meta": {"description": "President Ronald Reagan signed The National Childhood Vaccine Injury Act (NCVIA) of 1986, absolving drug companies from all medico-legal liability when children die, become chronically ill with vaccine-induced autoimmune disorders or are otherwise disabled from vaccine injuries. That law has led directly to an expected reckless, liability-free development of scores of new, over-priced, potential block-buster vaccines, now numbering over 250. The question that must be asked of Big Medicine’s practitioners: How will the CDC, the AMA, the AAFP and the American Academy of Pediatrics fit any more potentially neurotoxic vaccines into the current well-baby over-vaccination schedule? PhRMA (the Pharmaceutical Research and Manufacturers of America), the pharmaceutical industry’s trade association and powerful lobbying group, says that: \"today, more than 7,000 medicines are in development globally, all of which have the potential to help patients in the United States and around the world. According to another data source, there are 3,400 medicines in development today just in the United States, an increase of 40 percent since 2005.\" PhRMA also says that today: \"the 271 vaccines in development span a wide array of diseases, and employ exciting new scientific strategies and technologies. These potential vaccines – all in human clinical trials or under review by the Food and Drug Administration (FDA) – include 137 for infectious diseases, 99 for cancer, 15 for allergies and 10 for neurological disorders.\" Whenever the FDA signals that it is ready to grant marketing approval for a new vaccine or drug, the first step for the pharmaceutical company’s marketing department is to promote an “educational” advertising campaign designed to instill fear in parents (and their pediatricians) about the horrible illnesses (albeit previously unknown, benign or rare) that even us doctors hadn’t yet recognized as being significant up until recently. Most of us physicians have gone along with the fear-mongering that makes our practices busier while it also makes billions of dollars in profits for some unworthy CEO or Wall Street investment banker, hedge fund manager or mutual fund investor – all at the expense of America’s precious and vulnerable children who are at high risk of being sickened along the way.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/sites/5/2014/11/favicon1.ico", "canonical": "https://vaccineimpact.com/2015/there-are-271-new-vaccines-in-big-pharmas-pipeline/", "encoding": "utf-8"}, "image": null, "domain": "vaccineimpact.com", "title": "There are 271 New Vaccines in Big Pharma’s Pipeline - Vaccine Impact", "cleaned_text": "Roll Up Your Sleeves Folks, There are 271 New Vaccines in Big Pharma’s Pipeline\n\nInto Whose Bodies Will They be Injected?\n\n“No vaccine manufacturer shall be liable…for damages arising from a vaccine-related injury or death.” – President Ronald Wilson Reagan, as he signed The National Childhood Vaccine Injury Act (NCVIA) of 1986, absolving drug companies from all medico-legal liability when children die, become chronically ill with vaccine-induced autoimmune disorders or are otherwise disabled from vaccine injuries. That law has led directly to an expected reckless, liability-free development of scores of new, over-priced, potential block-buster vaccines, now numbering over 250. The question that must be asked of Big Medicine’s practitioners: How will the CDC, the AMA, the AAFP and the American Academy of Pediatrics fit any more potentially neurotoxic vaccines into the current well-baby over-vaccination schedule?\n\nPhRMA (the Pharmaceutical Research and Manufacturers of America), the pharmaceutical industry’s trade association and powerful lobbying group, says that:\n\nPhRMA also says that today:\n\nWhenever the FDA signals that it is ready to grant marketing approval for a new vaccine or drug, the first step for the pharmaceutical company’s marketing department is to promote an “educational” advertising campaign designed to instill fear in parents (and their pediatricians) about the horrible illnesses (albeit previously unknown, benign or rare) that even us doctors hadn’t yet recognized as being significant up until recently. Most of us physicians have gone along with the fear-mongering that makes our practices busier while it also makes billions of dollars in profits for some unworthy CEO or Wall Street investment banker, hedge fund manager or mutual fund investor – all at the expense of America’s precious and vulnerable children who are at high risk of being sickened along the way.\n\nThe TV commercials, medical journal articles and drug representatives will be trying to educate us about a new, unaffordable vaccine that will somehow be squeezed into an already crowded and potentially deadly group of shots that America’s already at-risk-of-vaccine-injuries infants will now be receiving at their next well-child (perhaps soon to become chronically ill) check-up.\n\nNew Laws Being Passed to Mandate ALL Vaccines, Including Future Vaccines\n\nRecognizing this, and so as not to overload the already over-loaded well-child inoculation schedule, perhaps he CDC (the Big Pharma-subsidized and vaccine cheerleader Centers for Disease Control and Prevention) will be adding shots to the in-hospital and irrational Hepatitis B shot that it recommends be given on day one – when vulnerable mothers are too exhausted and emotionally confused to give truly informed consent.\n\nMany state legislatures are, as we speak, considering (or have already passed laws) criminalizing the previously legal parental right of refusing vaccinations on the basis of religious or philosophical beliefs. That is happening right now in Wisconsin’s Republican-dominated legislature, Minnesota’s split GOP/DFL legislature, and California’s Democratic Party-dominated legislature – where it is already signed into law by Democrat Jerry Brown.\n\nThese poorly informed – and heavily bribed politicians – don’t realize that their legislative efforts will be blindly forcing unsuspecting patients to submit to every new blockbuster vaccine that successfully emerges from the pipeline. Talk about making decisions on the basis of partial information or propaganda from sociopathic corporate entities! Attention, Senators Al Franken, Amy Klobuchar and other assorted legislators. Are you listening to the real science or to the corrupted, pseudoscience of Big Pharma?\n\nBelow is a list of 146 new vaccines that were in the pipeline as of 2010. The list, PhRMA proudly tells us, is now up to 271 new vaccines as of 2013. For a full listing of these vaccine trials, go to: http://phrma.org/sites/default/files/pdf/infectiousdiseases2010%20%281%29.pdf\n\nFor parents whose infants’ brains and bodies are immunologically and developmentally immature, be aware that your children may be forced to suffer untested-for and therefore unacknowledged long term neurological, autoimmune and chronic illness adverse effects. Parents need to be aware that if their infant dies, is sickened or is made chronically ill by vaccine ingredients, they, as protective parents, will be forbidden to sue the guilty drug company (or the doctor that administered them) for appropriate damages.\n\nParents and grandparents of children need to be aware of the fact that many of these new vaccines will be containing contaminants (such as unfilterable viral particles, bacterial particles, monkey kidney cell fragments, human fetal cells, squalene (in anthrax and some experimental swine flu vaccines), peanut oil (a likely cause of the epidemic of peanut allergies), formaldehyde (and even foreign DNA fragments) as well as known neurotoxic additives such as formaldehyde and aluminum (and perhaps even mercury), all of which are known genetic toxins and known causes of (sometimes subtle and sometimes not-so-subtle – but always preventable) brain damage, vaccine-induced epilepsy, autoimmune disorders, the so-called, but erroneously labeled “shaken baby syndrome” (now increasingly understood to represent a vaccine-induced encephalitis), SIDS (sudden infant death syndrome), dementia, autism spectrum disorders, mitochondrial toxicity, damage to the brain’s microglial and astroglial cells (the brain’s immune system), etc.\n\nNOTE: Much of the information in this column is derived from easily accessible books and websites, including Make an Informed Vaccine Decision for the Health of Your Child by Mayer Eisenstein, MD, JD, MPH; The Sanctity of Human Blood: Vaccination is Not Immunization, by Tim O’Shea, DC; Screening Sandy Hook,, Causes and Consequences by Deanna Spingola (an online e-book); the writings and lectures of Russell Blaylock, MD; Immunologist J. Barthelow Classen, MD; Harold E Buttram, MD, Dr Sherri Tenpenny, Dr Suzanne Humphries, Dr Kenneth Stoller, Dr Andrew Wakefield, Dr Mark Geier, and Dr Joseph Mercola, and the following two articles: http://www.vaccines.net/vaccine-induced-immune-overload.pdf. http://www.globalresearch.ca/vaccine-induced-immune-overload-and-the-epidemic-of-chronic-autoimmune-childhood-disease/5431013.\n\nA List of 146 of the 271 Vaccines in Big Pharma’s Developmental Pipeline (as of 2010)\n\nsanofi pasteur prevention of Clostridium difficile\n\n ACE BioSciences prevention of traveler’s diarrhea caused by Campylobacter jejuni\n\n ACE BioSciences prevention of traveler’s diarrhea caused by Escherichia coli\n\n sanofi pasteur diphtheria, tetanus, pertussis Phase III DTP vaccine\n\n Aeras Global tuberculosis\n\n Novartis Vaccines prevention of influenza A infection (H5N1 subtype)\n\n Antigenics treatment of herpes simplex virus\n\n BioSante Pharmaceuticals anthrax Phase I/II vaccine\n\n Intercell USA anthrax\n\n KaloBios Pharmaceuticals Pseudomonas aeruginosa infections\n\n Aduro BioTech treatment of hepatitis C\n\n Emergent BioSolutions anthrax vaccine\n\n AlphaVax prevention of influenza virus infections in the elderly\n\n DynPort Vaccine botulism vaccine\n\n Inviragen Chikungunya virus vaccine\n\n Celldex Therapeutics cholera vaccine (live attenuated)\n\n ChronTech Pharma hepatitis C (DNA vaccine)\n\n Virionics prevention and treatment of hepatitis C\n\n Vical prevention of cytomegalovirus (DNA vaccine)\n\n AlphaVax prevention of cytomegalovirus infections\n\n Hawaii Biotech prevention of dengue fever\n\n GlaxoSmithKline prevention of dengue fever (tetravalent)\n\n Acambis mild to severe dengue fever\n\n sanofi pasteur DTP-Hep B\n\n sanofi pasteur diphtheria, tetanus, pertussis, polio, hepatitis B, polio, Hib\n\n Dynavax treatment of hepatitis B\n\n Crucell prevention of Ebola virus infections\n\n Vical prevention of Ebola virus infections\n\n GenPhar Ebola virus vaccine\n\n GlaxoSmithKline prevention of infectious mononucleosis (Epstein-Barr virus)\n\n BioSolutions Escherichia coli infections\n\n Celldex Therapeutics prevention of cholera, Escherichia coli infections\n\n Protein Sciences prevention of influenza virus infections in adults and children\n\n sanofi pasteur influenza virus infections (new mass production method)\n\n sanofi pasteur prevention of influenza virus (intradermal micro-injection)\n\n Protein Sciences influenza virus infections\n\n GlaxoSmithKline rotavirus infections in infants\n\n GlaxoSmithKline prevention of cytomegalovirus (recombinant vaccine)\n\n GlaxoSmithKline influenza virus (trivalent, thimerosal-free) for children ages 3-17\n\n GlaxoSmithKline prevention of influenza virus\n\n GlaxoSmithKline prevention of Streptococcus pneumoniae\n\n GlaxoSmithKline prevention of diphtheria, tetanus, pertussis, Haemophilus infections, hepatitis B, meningococcal group C infections, poliomyelitis (infants)\n\n GlaxoSmithKline prevention of Haemophilus and pneumococcal infections\n\n GlaxoSmithKline prevention of Haemophilus and pneumococcal infections\n\n GlaxoSmithKline prevention of influenza virus infection in children\n\n GlaxoSmithKline prevention of influenza A virus (H1N1 subtype) for children and infants\n\n GlaxoSmithKline staphylococcal infections\n\n MedImmune influenza A virus (H5N1 subtype) intranasal\n\n Novavax prevention of influenza A virus infection\n\n Hawaii Biotech prevention of West Nile virus infection\n\n Novartis Vaccines helicobacter pylori\n\n Pfizer hepatitis B (DNA)\n\n Emergent BioSolutions hepatitis B\n\n GenPhar hepatitis B\n\n Novartis Vaccines treatment of hepatitis C\n\n GlaxoSmithKline hepatitis E (recombinant)\n\n Dynavax prevention of hepatitis B\n\n Pfizer treatment of herpes simplex virus infections (DNA vaccine)\n\n AuRx prevention and treatment of herpes simplex virus infections\n\n sanofi pasteur diphtheria, tetanus, pertussis, hepatitis B, polio, Hib\n\n Intercell prevention of influenza virus seasonal influenza\n\n Novartis Vaccines prevention of herpes simplex virus infections\n\n Acambis prevention of encephalitis virus\n\n Bavarian Nordic smallpox vaccine\n\n sanofi pasteur influenza A virus (H1N1 subtype) in adolescents, children and infants\n\n CSL Behring prevention of influenza A virus (H1N1 subtype) for the elderly\n\n Baxter Healthcare prevention of influenza A virus (H1N1 subtype)\n\n Vical prevention of influenza A virus (DNA – H1N1 subtype)\n\n Baxter Healthcare prevention of influenza A virus (H5N1 subtype)\n\n DynPort Vaccine influenza virus\n\n Antigen Express influenza virus infections H5N1 vaccine\n\n Novavax prevention of influenza virus (particle vaccine)\n\n Dynavax prevention of influenza virus infections\n\n Vaxin influenza virus infections (intranasal)\n\n Abbott Laboratories prevention of influenza virus (cell culture-derived)\n\n Intercell prevention of Japanese encephalitis in children\n\n Novartis Vaccines malaria vaccine (U.S. Naval Medical Research Center)\n\n Vical malaria vaccine\n\n BioSante Pharmaceuticals prevention of malaria (U.S. Naval Medical Research Center)\n\n GenVec malaria vaccine (U.S. Naval Medical Research Center)\n\n Crucell malaria vaccine\n\n Sanaria malaria vaccine\n\n GenPhar Marburg virus (DNA vaccine)\n\n MedImmune parainfluenza virus infections in children and infants\n\n MedImmune prevention of respiratory syncytial virus infections in infants\n\n MedImmune prevention of parainfluenza virus infections in children and infants\n\n MedImmune prevention of influenza virus (quadrivalent) for adolescents and children\n\n sanofi pasteur Neisseria meningitidis A, C in toddlers 9 months-12 months\n\n GlaxoSmithKline prevention of Neisseria meningitidis groups C and Y, Haemophilus influenzae type B, and tetanus toxoid\n\n sanofi pasteur meningitis in infants\n\n Novartis Vaccines meningococcal group B infections vaccine group B\n\n Novartis Vaccines meningococcal group A, C infections in children\n\n Novartis Vaccines meningococcal group A, C infections in infants\n\n GlaxoSmithKline prevention of malaria (recombinant vaccine)\n\n NanoBio prevention of influenza virus (intranasal)\n\n GlaxoSmithKline prevention of influenza virus inactivated split-trivalent vaccine\n\n GlaxoSmithKline prevention of Neisseria meningitidis groups A, C in children\n\n LigoCyte Pharmaceuticals norovirus infections (intranasal)\n\n Novartis Vaccines prevention of influenza virus\n\n Protein Sciences prevention of influenza A pandemic (H5N1 subtype)\n\n Meridian Biosciences parvovirus infections\n\n Crucell prevention of influenza virus infections\n\n Pfizer meningococcal group B infections (meningococcal “plague” vaccine)\n\n DynPort Vaccine Yersinia infections (injectable)\n\n Baxter Healthcare prevention of seasonal influenza virus\n\n GlaxoSmithKline prevention of influenza A virus (“pre-pandemic”)\n\n Pfizer prevention of pneumococcal infection in the elderly (Prevnar 13 Adult™)\n\n sanofi pasteur rabies vaccine\n\n BioSante Pharmaceuticals ricin poisoning (“biodefense” vaccine)\n\n Soligenix ricin poisoning\n\n sanofi pasteur prevention of rotavirus infections\n\n Bharat Biotech prevention of rotavirus infections\n\n Emergent BioSolutions anthrax (Fast Track) “protective antigen” vaccine\n\n Inhibitex staphylococcal infections\n\n Vical prevention of severe acute respiratory syndrome (SARS) coronavirus infections\n\n Emergent BioSolutions shigella infections\n\n GlaxoSmithKline prevention of herpes simplex virus infections\n\n PharmAthene anthrax (“protective antigen” – rPA)\n\n BioSante Pharmaceuticals staphylococcal infections (“biodefense” vaccine)\n\n Nabi Biopharmaceutical prevention of staphylococcal aureus infections\n\n GlaxoSmithKline prevention of staphylococcal aureus infections\n\n Nabi Biopharmaceutical prevention of streptococcal B infections\n\n Emergent BioSolutions prevention of streptococcal infections\n\n Novartis Vaccines prevention of streptococcal infections\n\n sanofi pasteur prevention of meningitis and pneumonia (tetravalent)\n\n Inviragen treatment of dengue fever\n\n Intercell USA prevention of traveler’s diarrhea due to E. coli (“patch” technology)\n\n GlaxoSmithKline tuberculosis\n\n Aerus Global TB prevention of tuberculosis in young children\n\n GlaxoSmithKline prevention of tuberculosis in adults\n\n sanofi pasteur prevention of tuberculosis\n\n DynPort Vaccine tularemia\n\n Emergent BioSolutions prevention of typhoid (live typhoid organisms – oral vaccine)\n\n Novartis Vaccines prevention of typhoid fever\n\n Celldex Therapeutics typhoid fever\n\n Merck prevention of herpes zoster (shingles)\n\n Merck hepatitis B in infants\n\n Merck human papillomavirus infections\n\n Merck staphylococcal infections\n\n GlaxoSmithKline prevention of varicella zoster virus\n\n VaxInnate prevention of influenza A virus\n\n VaxInnate influenza A virus infections in elderly patients\n\n VaxInnate prevention of influenza A virus (H1N1 subtype)\n\n Inovio Pharmaceuticals human papillomavirus infections\n\n Inovio Pharmaceuticals prevention of influenza A virus (H5N1 subtype)\n\n Xcellerex prevention of yellow fever\n\nDr. Kohls is a retired physician who practiced holistic, non-drug, mental health care for the last decade of his family practice career. He now writes a weekly column for the Reader Weekly, an alternative newsweekly published in Duluth, Minnesota, USA. Many of Dr. Kohls’ columns are archived at http://duluthreader.com/articles/categories/200_Duty_to_Warn.", "opengraph": {"locale": "en_US", "site_name": "Vaccine Impact -", "type": "article", "title": "There are 271 New Vaccines in Big Pharma’s Pipeline - Vaccine Impact", "description": "President Ronald Reagan signed The National Childhood Vaccine Injury Act (NCVIA) of 1986, absolving drug companies from all medico-legal liability when children die, become chronically ill with vaccine-induced autoimmune disorders or are otherwise disabled from vaccine injuries. That law has led directly to an expected reckless, liability-free development of scores of new, over-priced, potential block-buster vaccines, now numbering over 250. The question that must be asked of Big Medicine’s practitioners: How will the CDC, the AMA, the AAFP and the American Academy of Pediatrics fit any more potentially neurotoxic vaccines into the current well-baby over-vaccination schedule? PhRMA (the Pharmaceutical Research and Manufacturers of America), the pharmaceutical industry’s trade association and powerful lobbying group, says that: \"today, more than 7,000 medicines are in development globally, all of which have the potential to help patients in the United States and around the world. According to another data source, there are 3,400 medicines in development today just in the United States, an increase of 40 percent since 2005.\" PhRMA also says that today: \"the 271 vaccines in development span a wide array of diseases, and employ exciting new scientific strategies and technologies. These potential vaccines – all in human clinical trials or under review by the Food and Drug Administration (FDA) – include 137 for infectious diseases, 99 for cancer, 15 for allergies and 10 for neurological disorders.\" Whenever the FDA signals that it is ready to grant marketing approval for a new vaccine or drug, the first step for the pharmaceutical company’s marketing department is to promote an “educational” advertising campaign designed to instill fear in parents (and their pediatricians) about the horrible illnesses (albeit previously unknown, benign or rare) that even us doctors hadn’t yet recognized as being significant up until recently. Most of us physicians have gone along with the fear-mongering that makes our practices busier while it also makes billions of dollars in profits for some unworthy CEO or Wall Street investment banker, hedge fund manager or mutual fund investor – all at the expense of America’s precious and vulnerable children who are at high risk of being sickened along the way.", "url": "https://vaccineimpact.com/2015/there-are-271-new-vaccines-in-big-pharmas-pipeline/", "article:published_time": "2015-08-27T17:02:00+00:00", "article:modified_time": "2015-08-27T19:22:48+00:00"}, "tags": ["Vaccines", "mandatory vaccines"], "tweets": [], "movies": [], "links": ["http://phrma.org/pipeline#sthash.TnxVihsT.dpuf", "http://phrma.org/press-release-medicines-in-development-vaccines#sthash.rI4cQ6Tg.dpuf", "Below is a list of 146 new vaccines that were in the pipeline as of 2010. The list, PhRMA proudly tells us, is now up to 271 new vaccines as of 2013. For a full listing of these vaccine trials, go to: http://phrma.org/sites/default/files/pdf/infectiousdiseases2010%20%281%29.pdf", "https://healthimpactnews.com/revive/www/delivery/ck.php?n=af3e0a62&cb=INSERT_RANDOM_NUMBER_HERE"], "authors": [], "publish_date": "2015-08-27T17:02:00+00:00"}