{"result_id": "327011", "URL": "https://vaccines.news/2022-04-15-german-parliament-rejects-proposed-covid-vaccine-mandate.html", "timestamp": "2023-04-25 17:49:32 CEST+0200", "meta": {"description": "The Bundestag – Germany’s unicameral federal parliament – voted to reject a proposal to make Wuhan coronavirus (COVID-19) vaccines mandatory. It followed four months of debate between competing members of parliament (MPs) and numerous revisions to the original bill. The COVID-19 vaccine mandate originally encompassed all Germans aged 18 and up. This was subsequently revised to include […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,big government,Bundestag,covid-19,freedom,Germany,health freedom,human rights,Liberty,living free,medical fascism,Medical Tyranny,Olaf Scholz,pandemic,politics,unconstitutional,vaccine,vaccine mandate,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-04-15-german-parliament-rejects-proposed-covid-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "German parliament REJECTS proposed COVID vaccine mandate after months of debate", "cleaned_text": "The Bundestag – Germany’s unicameral federal parliament – voted to reject a proposal to make Wuhan coronavirus (COVID-19) vaccines mandatory. It followed four months of debate between competing members of parliament (MPs) and numerous revisions to the original bill.\n\nThe COVID-19 vaccine mandate originally encompassed all Germans aged 18 and up. This was subsequently revised to include only Germans aged 50 and older, similar to Italy. The vaccine mandate’s third and latest revision limited this to individuals 60 years old and up.\n\nHowever, the latest version of the vaccine mandate did not gain ground in the Bundestag and was rejected in a 378-296 vote. The opposition alliance between the Christian Democratic Union of Germany (CDU) and the Christian Socialist Union of Bavaria (CSU) also submitted a proposal for a vaccine registry, but this was also shot down. (Related: German legislators vote against bill that would have mandated COVID-19 vaccines for people over 60.)\n\nThe Bundestag’s rejection of the COVID-19 vaccine mandate also exposed a rift between the ruling coalition government and the opposition faction. The CDU/CSU alliance was eager to deny the ruling government of Chancellor Olaf Scholz a political victory, which it did through the vaccine mandate backed by the chancellor.\n\nAccording to state broadcaster DW, Scholz opted to allow MPs to propose and vote on vaccine measures instead of letting his cabinet bring its own proposal forward. Scholz’s cabinet is made up of MPs from his Social Democratic Party of Germany (SDP), the Free Democratic Party (FDP) and the Green Party.\n\nThe German chancellor’s choice to grant his coalition colleagues leeway to vote allowed them to vote their conscience. Several senior FDP members joined the CDU/CSU alliance in voting against the COVID-19 vaccine mandate, which led to its rejection.\n\nMPs pointed fingers at each other following the defeat of the vaccine mandate – a major blow to Scholz. SPD and Greens members blamed the FDP for not committing to the goals of the coalition. They also blamed the CDU for not allowing its members to vote their conscience, as the alliance voted along party lines.\n\nVaccine mandate not necessary with dwindling cases, MPs argue\n\nThe rejection of the COVID-19 vaccine mandate comes as about 76 percent of Germans have been fully vaccinated with two doses. Roughly 59 percent of Germans have been injected with booster doses.\n\nMP Tino Sorge of the CDU argued that compulsory vaccination was not necessary, given the fact that COVID-19 cases were dwindling across Germany. He also cited the current situation that did not show an overwhelmed health care system or an emergency situation in the intensive care units of German hospitals. Sorge added that such a mandate would not be helpful if a new, vaccine-resistant variant circulates in the fall.\n\nBundestag Vice President Wolfgang Kubicki of the FDP agreed with Sorge’s point regarding the possible emergence of a vaccine-resistant SARS-CoV-2 strain, adding that vaccines “would not help us reach herd immunity.” The senior FDP member also mentioned that forcing adults to get the COVID-19 vaccine was unconstitutional. “It is not the job of this house to protect adults against their own will,” said Kubicki.\n\nMeanwhile, MP Alice Weidel denounced the vaccine mandate entirely. The leader of the Alternative for Germany (AfD) party faction in the Bundestag remarked that the proposal was “not just radically hostile to the constitution, but a totalitarian measure. She explained that requiring Germans aged 60 and older to get injected with the COVID-19 vaccine served as a measure to give Berlin more power over citizens’ freedom.\n\nHealth Minister Karl Lauterbach of the SPD ultimately expressed concern over the vaccine mandate’s rejection, but urged his fellow MPs to move on from the matter. “It is a very important decision, because now the fight against [COVID-19] in autumn [has] become much more difficult. [But] laying political blame does not help. We move on,” tweeted Lauterbach.\n\nHealthFreedom.news has more stories about Germany and other countries rejecting vaccine mandates.\n\nWatch MP Emilia Fester of the Greens party below slamming Weidel’s AfD faction for refusing to get vaccinated.\n\nThis video is from the WAKE UP channel on Brighteon.com.\n\nA massive COVID wave in Germany and Central Europe despite high vaccination.\n\nGermany’s COVID vaccine mandate could be delayed due to “bureaucratic hurdles.”\n\nEver since introducing vaccine passports, covid cases in Germany have gone parabolic.", "opengraph": {"title": "German parliament REJECTS proposed COVID vaccine mandate after months of debate", "type": "article", "url": "https://www.vaccines.news/2022-04-15-german-parliament-rejects-proposed-covid-vaccine-mandate.html", "site_name": "Vaccines News", "description": "The Bundestag – Germany’s unicameral federal parliament – voted to reject a proposal to make Wuhan coronavirus (COVID-19) vaccines mandatory. It followed four months of debate between competing members of parliament (MPs) and numerous revisions to the original bill. The COVID-19 vaccine mandate originally encompassed all Germans aged 18 and up. This was subsequently revised to include […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/04/3-will-germany-be-next-legalize-flag.jpg"}, "tags": ["pandemic", "big government", "covid-19", "human rights", "Liberty", "Bundestag", "living free", "medical fascism", "Olaf Scholz", "unconstitutional", "politics", "vaccine", "vaccine mandate", "Medical Tyranny", "vaccine wars", "freedom", "health freedom", "Germany"], "tweets": [], "movies": [], "links": ["https://www.eugyppius.com/p/vaccine-mandate-decisively-defeated", "https://naturalnews.com/2022-04-08-german-legislators-junk-vaccine-mandate-for-seniors.html", "https://www.dw.com/en/german-lawmakers-reject-vaccine-mandate-for-people-over-60/a-61387119", "//vaccinewars.com", "https://healthfreedom.news/", "https://www.brighteon.com/4cc01a4d-62b2-4412-abc9-7aa88edc7dfc", "https://www.brighteon.com/channels/wiktor", "https://infections.news/2021-12-07-desperate-germany-announces-national-lockdown-for-unvaccinated.html", "https://outbreak.news/2021-12-12-massive-covid-wave-in-germany-and-central-europe.html", "https://vaccines.news/2022-01-17-germany-vaccine-mandate-delayed-by-bureaucratic-hurdles.html", "https://pandemic.news/2021-11-09-highly-vaccinated-germany-post-vaccine-covid-outbreak.html", "https://vaccinewars.com/2021-12-13-vaccine-passports-covid-cases-germany-parabolic.html", "https://www.eugyppius.com/p/vaccine-mandate-decisively-defeated", "https://www.dw.com/en/german-lawmakers-reject-vaccine-mandate-for-people-over-60/a-61387119", "https://www.brighteon.tv", "https://www.brighteon.com/794d95fd-c02c-4aa4-b699-b84315b5a7c9", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-04-15-german-parliament-rejects-proposed-covid-vaccine-mandate.html&linkname=German%20parliament%20REJECTS%20proposed%20COVID%20vaccine%20mandate%20after%20months%20of%20debate", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}