{"result_id": "327027", "URL": "https://vaccines.news/2023-03-28-covid-vaccines-cause-severe-myocarditis-chinese-cardiologist.html", "timestamp": "2023-04-25 17:49:43 CEST+0200", "meta": {"description": "Dr. Wang Daowen, a respected Chinese cardiologist, has publicly acknowledged that the Wuhan coronavirus (COVID-19) vaccines can cause severe myocarditis. Wang Daowen is the director of the Internal Medicine Department at Tongji Hospital in Wuhan and a professor at Tongji Medical College, Huazhong University of Science and Technology. Wang’s areas of expertise include cardiomyopathy and myocarditis. Additionally, he […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,biological weapon,children's health,China,COVID,Dangerous Medicine,heart disease,heart health,heart inflammation,myocarditis,pandemic,pharmaceutical fraud,research,spike protein,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2023-03-28-covid-vaccines-cause-severe-myocarditis-chinese-cardiologist.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "COVID-19 vaccines can cause SEVERE MYOCARDITIS, warns Chinese cardiologist", "cleaned_text": "Dr. Wang Daowen, a respected Chinese cardiologist, has publicly acknowledged that the Wuhan coronavirus (COVID-19) vaccines can cause severe myocarditis.\n\nWang Daowen is the director of the Internal Medicine Department at Tongji Hospital in Wuhan and a professor at Tongji Medical College, Huazhong University of Science and Technology. Wang’s areas of expertise include cardiomyopathy and myocarditis. Additionally, he is involved in politics and acts as a delegate to China’s rubber-stamp legislature.\n\nWang talked about his concerns regarding COVID-19 vaccines and myocarditis risk at an annual event called the “Two sessions.”\n\nThese refer to meetings held by both the National People’s Congress (NPC) and the Chinese People’s Political Consultative Conference (CPPCC). (Related: Kids who develop vaccine-induced myocarditis will be dead in 5 YEARS: Canadian doctor.)\n\nDuring the meeting, Wang encouraged China’s National Health Commission to set aside resources to help address the issue of rising fulminant myocarditis cases. He added that they could potentially be linked to the coronavirus vaccine.\n\nMyocarditis is the inflammation of the heart muscle. The condition can reduce the heart’s ability to pump blood and result in cardiac shock, arrhythmia, multi-organ system failure or death.\n\nAccording to the Centers for Disease Control and Prevention (CDC), myocarditis is more common in male patients, especially those who are adolescents or young adults; following vaccination with an mRNA vaccine, such as the Pfizer-BioNTech and Moderna COVID-19 vaccines; after receiving the second dose of an mRNA vaccine; and within a week of getting vaccinated.\n\nA 2021 cohort study estimated that, overall, myocarditis affects 1.7 per 100,000 people within 28 days of receiving an mRNA-based COVID-19 vaccine.\n\nThe way that COVID-19 itself causes myocarditis is unknown. However, doctors and scientists have some theories, which include one or a combination of the following:\n• COVID-19 could be directly infecting the heart muscle, which contains receptors for the virus.\n• The activity of the immune system as it tries to respond to COVID-19 could be causing myocarditis.\n• Hypoxia, or a reduction in the oxygen levels in your body’s organs and tissues, could also be linked to myocarditis.\n\nVaccinated people are also at risk of developing fulminant myocarditis, an acute form of myocarditis that requires hemodynamic support for the patient’s recovery.\n\nWang explained that fulminant myocarditis is a life-threatening condition characterized by “a rapidly progressive course, with fatigue, circulatory failure, hypotensive shock, or even sudden death.”\n\nHe added that many doctors are not familiar with the condition, sometimes even mistaking it for a cold and missing the window for early treatment. Wang said the mortality rate associated with fulminant myocarditis is over 50 percent.\n\n“Whether it is a protein vaccine, inactivated vaccine or mRNA vaccine, there is the possibility of causing fulminant myocarditis,” Wang noted. He theorized that all COVID-19 vaccines could be linked to fulminant myocarditis.\n\nWang’s report sparked fear and frustration among Chinese citizens. For example, one citizen reported chest pains since getting vaccinated but received no help from healthcare providers in the country. According to the affected citizen, it has been two years since the vaccination. He reported chest discomfort, but the hospital he went to was unable to give a clear answer.\n\nAnother Chinese citizen condemned the government for continuing to force the COVID-19 vaccine on children, calling government officials “shameless.”\n\nVisit VaccineInjuryNews.com for more reports on the adverse effects linked to COVID-19 vaccines.\n\nWatch the video below for a report on how COVID-19 vaccines are linked to skyrocketing myocarditis cases.\n\nThis video is from the TNTVNEWS channel on Brighteon.com.\n\nStudy finds possible link between Pfizer’s COVID-19 vaccine and myocarditis in children.\n\nCDC admits myocarditis being linked to COVID-19 vaccines is TRUE, not misinformation.", "opengraph": {"title": "COVID-19 vaccines can cause SEVERE MYOCARDITIS, warns Chinese cardiologist", "type": "article", "url": "https://www.vaccines.news/2023-03-28-covid-vaccines-cause-severe-myocarditis-chinese-cardiologist.html", "site_name": "Vaccines News", "description": "Dr. Wang Daowen, a respected Chinese cardiologist, has publicly acknowledged that the Wuhan coronavirus (COVID-19) vaccines can cause severe myocarditis. Wang Daowen is the director of the Internal Medicine Department at Tongji Hospital in Wuhan and a professor at Tongji Medical College, Huazhong University of Science and Technology. Wang’s areas of expertise include cardiomyopathy and myocarditis. Additionally, he […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2023/03/Disease-Heart-Man-3D-Anatomical-Anatomy-Artery.jpg"}, "tags": ["pandemic", "heart health", "Big Pharma", "research", "COVID", "myocarditis", "vaccine injury", "China", "heart inflammation", "spike protein", "heart disease", "vaccines", "vaccine damage", "children's health", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://100percentfedup.com/stunner-chinese-expert-cardiologist-covid-vaccines-can-cause-life-threatening-myocarditis/", "https://english.hust.edu.cn/", "https://www.naturalpedia.com/myocarditis-causes-side-effects-and-treatments-at-naturalpedia-com.html", "https://naturalnews.com/2022-10-26-kids-vaccine-induced-myocarditis-dead-5-years.html", "https://www.healthline.com/health/heart-disease/myocarditis#covid-19", "https://www.naturalpedia.com/common-cold-causes-side-effects-and-treatments-at-naturalpedia-com.html", "//VaccineInjuryNews.com", "https://www.brighteon.com/00865ee6-c5ea-4789-a5e6-2cf471124ff7", "https://www.brighteon.com/channels/tntvnews", "https://naturalnews.com/2022-11-10-study-pfizer-covid-vaccine-myocarditis-in-children.html", "https://naturalnews.com/2022-09-28-fired-nurse-attests-vaccine-induced-myocarditis-kids.html", "https://naturalnews.com/2022-09-20-cdc-admits-myocarditis-linked-covid-vaccines-true.html", "https://100percentfedup.com/stunner-chinese-expert-cardiologist-covid-vaccines-can-cause-life-threatening-myocarditis/", "https://www.healthline.com/health/heart-disease/myocarditis#covid-19", "https://www.brighteon.com/00865ee6-c5ea-4789-a5e6-2cf471124ff7", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2023-03-28-covid-vaccines-cause-severe-myocarditis-chinese-cardiologist.html&linkname=COVID-19%20vaccines%20can%20cause%20SEVERE%20MYOCARDITIS%2C%20warns%20Chinese%20cardiologist", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}