{"result_id": "327035", "URL": "https://vaccines.news/2022-11-16-vaccine-fearmongering-nbc-pushing-rsv-propaganda.html", "timestamp": "2023-04-25 17:49:49 CEST+0200", "meta": {"description": "NBC news is pushing Nazi-style propaganda about unvaccinated kids being like lepers that parents would want to have their kids avoid entirely this holiday season. Making it sound as simple as washing your hands or staying home if you feel sick, the all-things-pandemic “expert” TV doctor says keep your babies and kids away from the […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,children's health,Dangerous Medicine,disinfo,infections,insanity,lies,mainstream media,NBC,news cartels,outbreak,pharmaceutical fraud,propaganda,rsv,unvaccinated,vaccinated,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-11-16-vaccine-fearmongering-nbc-pushing-rsv-propaganda.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "VACCINE FEARMONGERING: NBC pushing RSV propaganda to drive division between the vaccinated and the unvaccinated", "cleaned_text": "VACCINE FEARMONGERING: NBC pushing RSV propaganda to drive division between the vaccinated and the unvaccinated\n\nNBC news is pushing Nazi-style propaganda about unvaccinated kids being like lepers that parents would want to have their kids avoid entirely this holiday season. Making it sound as simple as washing your hands or staying home if you feel sick, the all-things-pandemic “expert” TV doctor says keep your babies and kids away from the unvaccinated kids, or suffer the consequences of RSV – respiratory syncytial virus. Another pesky infant respiratory virus scare is now underway across fake news media, and now dire warnings about the most COMMON cause of all respiratory illnesses in babies becomes the pandemic mantra of the cold, dark winter ahead.\n\nFake news NBC is lumping every common cold and virus in with getting children injected with billions of toxic spike prions, while convincing and coercing parents to be very afraid of all children who are not vaccinated. Don’t let your babies have any physical contact with an unvaccinated child, they’re saying, treating the unvaccinated like the Nazis treated Jews during the Holocaust, as infectious rats and roaches that were subhuman.\n\nHuge propaganda-filled, non-science backed “vaccine” and mask-wearing push coming from fake news, again\n\nNBC’s medical correspondent, a self-proclaimed Covid variant expert, posted a graphic on the fake news TV screen telling families to keep their children away from unvaccinated kids. The news anchors set up his scripted message by asking him, “Frankly, why does RSV (respiratory syncytial virus) hit kids so hard, and then it seems like it almost doesn’t affect others?”\n\nThe doctor-made-for-pandemic-TV responds with his advice about “factors involved” in getting sick, like being premature as a baby, or breathing in second-hand cigarette smoke. That’s what he says puts every other baby or child in the whole country at high risk of lung infections? This has absolutely NO relevance to or basis for telling parents to have their Covid-vaccinated children veer clear of unvaccinated children. If vaccines work, why would this be a concern at all anyway? Why are people who get the vaccines and wear the masks worried? Isn’t that their “safe and effective” protection?\n\n“The honest answer is, we don’t exactly know why that is. We know there are a couple of factors involved, number one, the younger they are, or premature, they’re going to have some lung issues as well. It’s a small airway disease, so if they have airway problems, that can cause an issue. If there’s smoking in the house, so if they’re exposed to secondhand smoke… that can also lead to more complications and risk of issues.” And just like that, here come the tips for the scamdemic-paranoid, fake-news-believing populace of “vaccinated” sheeple:\n\nNBC guest “expert” compared health risk of being unvaccinated to that of breathing in second-hand smoke\n\n“All babies need to be protected,” the TV doctor tells us, and yes, the earth is not flat and the sun is a star. But science. Talk shows love featuring doctors spewing advice on the pandemic, but where’s the science? Where is the research to back up this ‘common sense’ sounding advice, that links one issue to another, without citing any scientific research, clinical trials, or even statistics? We know smoking causes lung cancer, among other issues, and that second-hand smoke is just as dangerous as what the smoker is inhaling, but how does this relate to jabbed-up kids avoiding kids who don’t get the clot shots?\n\nAgain, it’s the old simple-as-1-2-3 philosophy that says if the earth is round and grass is green, then all vaccines must be safe and effective. Because fake news thinks most Americans are so dumb and brainwashed that mentioning cigarette smoke and non-vaccination in the same sentence will get 270 million Americans nodding their head in submission. These deadly Covid jabs are a slow-walk into the gas chambers, and the propaganda pushing them is relentless.\n\nBookmark Vaccines.news to your favorite independent websites for updates on experimental gene therapy injections the CDC and fake news claim are “safe and effective” when they’re really dangerous and health-damaging.", "opengraph": {"title": "VACCINE FEARMONGERING: NBC pushing RSV propaganda to drive division between the vaccinated and the unvaccinated", "type": "article", "url": "https://www.vaccines.news/2022-11-16-vaccine-fearmongering-nbc-pushing-rsv-propaganda.html", "site_name": "Vaccines News", "description": "NBC news is pushing Nazi-style propaganda about unvaccinated kids being like lepers that parents would want to have their kids avoid entirely this holiday season. Making it sound as simple as washing your hands or staying home if you feel sick, the all-things-pandemic “expert” TV doctor says keep your babies and kids away from the […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/11/sick-kids.jpg"}, "tags": ["unvaccinated", "vaccine wars", "vaccinated", "lies", "Big Pharma", "rsv", "mainstream media", "outbreak", "NBC", "infections", "disinfo", "children's health", "insanity", "news cartels", "propaganda", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://www.naturalnews.com/2022-09-30-which-kills-more-humans-opioids-guns-vaccines.html", "//infections.news", "https://thepostmillennial.com/nbc-news-tells-parents-to-vaccinate-their-kids-and-shun-the-unvaccinated-over-the-holidays", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://thepostmillennial.com/nbc-news-tells-parents-to-vaccinate-their-kids-and-shun-the-unvaccinated-over-the-holidays", "https://www.naturalnews.com/2022-09-29-hundreds-thousands-fully-vaccinated-dying-weekly-pfizergate.html", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-11-16-vaccine-fearmongering-nbc-pushing-rsv-propaganda.html&linkname=VACCINE%20FEARMONGERING%3A%20NBC%20pushing%20RSV%20propaganda%20to%20drive%20division%20between%20the%20vaccinated%20and%20the%20unvaccinated", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}