{"result_id": "327040", "URL": "https://vaccines.news/2022-05-31-astrazeneca-vaccine-increases-risk-of-guillain-barre.html", "timestamp": "2023-04-25 17:49:53 CEST+0200", "meta": {"description": "The Trojan horse delivery system utilized in AstraZeneca’s Wuhan coronavirus (Covid-19) “vaccine” appears to be responsible for an increase in rates of Guillain-Barré syndrome (GBS) and other neurological problems, new research has revealed. Scientists from University College London (London’s Global University) says cases of GBS in the first two to four weeks following injection with […]", "lang": "en", "keywords": "adenovirus-vector,AstraZeneca,badhealth,badmedicine,badscience,Big Pharma,biological weapon,biotech,COVID,Dangerous Medicine,GBS,Gullain-Barre Syndrome,immune system,Janssen,neurological damage,pharmaceutical fraud,Plandemic,research,spike protein,vaccine damage,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-05-31-astrazeneca-vaccine-increases-risk-of-guillain-barre.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "Covid “vaccine” from AstraZeneca found to increase risk of Guillain-Barré and other neurological conditions", "cleaned_text": "Covid “vaccine” from AstraZeneca found to increase risk of Guillain-Barré and other neurological conditions\n\nThe Trojan horse delivery system utilized in AstraZeneca’s Wuhan coronavirus (Covid-19) “vaccine” appears to be responsible for an increase in rates of Guillain-Barré syndrome (GBS) and other neurological problems, new research has revealed.\n\nScientists from University College London (London’s Global University) says cases of GBS in the first two to four weeks following injection with the AstraZeneca shot are on the rise, a phenomenon that is not necessarily being seen with the jabs from Pfizer and Moderna.\n\nWhile Pfizer and Moderna’s shots are made with messenger RNA (mRNA) technology, the AstraZeneca shot uses a more “traditional” viral vector formula containing a weekend chimpanzee virus, the job of which is to deliver the Fauci Flu spike protein into the body.\n\nExperts now believe that this chimp component is responsible for causing GBS, a relatively rare condition demarcated by muscle numbness and pain, as well as difficulty swallowing and sometimes even breathing. (Related: The Italian government tried to prosecute AstraZeneca over the harm caused by its covid injections.)\n\nThe gastroenteritis bug Campylobacter is a common cause of GBS as it has a surface coating that looks slightly human, causing the body to attack its own nerves instead of invading germs.\n\nAdenovirus is different in that it usually triggers the common cold. However, scientists now believe that it might mimic human cells in a similar way to Campylobacter, resulting in the same autoimmune response by the body against its own nervous system.\n\n“At the moment, we don’t know why a vaccine may cause these very small rises in GBS,” said Prof. Michael Lunn, the study’s lead author from the UCL Queen Square Institute of Neurology.\n\n“It may be that a non-specific immune activation in susceptible individuals occurs, but if that were the case similar risks might apply to all vaccine types. It is therefore logical to suggest that the simian adenovirus vector, often used to develop vaccines, including AstraZeneca’s, may account for the increased risk.”\n\nGBS is associated with many other vaccines as well, which makes sense seeing as how adenovirus-based vaccines are commonly administered for diseases such as tuberculosis, HIV and malaria.\n\nEvery year in the United Kingdom alone, about 1,500 people develop GBS, and 30 to 40 percent of all cases are classified as having no known cause. Researchers are finally starting to admit that perhaps the cause is adenovirus injections.\n\nBack in 1976 during the first manufactured swine flu scare, mass vaccination was rolled out as the “cure” and not long after, many recipients began developing GBS. Ever since then, GBS has been popping up in association with other vaccines.\n\nIt appears as though the Johnson & Johnson (Janssen) jab is also linked to GBS. It turns out that both the Janssen and AstraZeneca jab are made using the same adenovirus technology.\n\n“We know that Pfizer and Moderna don’t cause BDS but Johnson & Johnson and AstraZeneca do and the only commonality link is an adenovirus vector,” Prof. Lunn added.\n\n“Johnson & Johnson is not the same one because they use a human adenovirus but it’s similar and the implications are broad because adenoviruses are used in quite a lot of vaccines and genetic therapies. The benefits from these vaccines and drugs are huge and the risk is tiny and there aren’t that many viral vectors you can use, but it’s good that the public are aware of the risks.”\n\n“And theoretically, if we know what virus is causing GBS, we can turn it off and we might be able to prevent disease progression.”\n\nThe latest news about covid “vaccines” can be found at ChemicalViolence.com.", "opengraph": {"title": "Covid “vaccine” from AstraZeneca found to increase risk of Guillain-Barré and other neurological conditions", "type": "article", "url": "https://www.vaccines.news/2022-05-31-astrazeneca-vaccine-increases-risk-of-guillain-barre.html", "site_name": "Vaccines News", "description": "The Trojan horse delivery system utilized in AstraZeneca’s Wuhan coronavirus (Covid-19) “vaccine” appears to be responsible for an increase in rates of Guillain-Barré syndrome (GBS) and other neurological problems, new research has revealed. Scientists from University College London (London’s Global University) says cases of GBS in the first two to four weeks following injection with […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/05/Coronavirus-Covid-19-AstraZeneca-Vacccine-Syringe-Vial.jpg"}, "tags": ["adenovirus-vector", "Janssen", "vaccine damage", "Big Pharma", "Gullain-Barre Syndrome", "AstraZeneca", "COVID", "research", "vaccine injury", "vaccines", "spike protein", "biotech", "immune system", "neurological damage", "Plandemic", "GBS", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://12ft.io/proxy?q=https%3A%2F%2Fwww.telegraph.co.uk%2Fnews%2F2022%2F05%2F28%2Fastrazeneca-vaccine-may-increase-risk-serious-neurological-condition%2F", "https://www.ucl.ac.uk/", "https://naturalnews.com/2021-03-16-italy-poised-prosecute-astrazeneca-deadly-coronavirus-vaccines.html", "//chemicalviolence.com", "https://12ft.io/proxy?q=https%3A%2F%2Fwww.telegraph.co.uk%2Fnews%2F2022%2F05%2F28%2Fastrazeneca-vaccine-may-increase-risk-serious-neurological-condition%2F", "https://naturalnews.com/2021-03-16-italy-poised-prosecute-astrazeneca-deadly-coronavirus-vaccines.html", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-05-31-astrazeneca-vaccine-increases-risk-of-guillain-barre.html&linkname=Covid%20%E2%80%9Cvaccine%E2%80%9D%20from%20AstraZeneca%20found%20to%20increase%20risk%20of%20Guillain-Barr%C3%A9%20and%20other%20neurological%20conditions", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}