{"result_id": "327008", "URL": "https://www.vaccines.news/2022-05-12-survey-finds-germans-suffered-severe-vaccine-injuries.html", "timestamp": "2023-04-25 17:49:28 CEST+0200", "meta": {"description": "A survey involving nearly 40,000 Germans at one of the biggest hospitals in Europe has found a high rate of severe side effects from COVID-19 vaccines that are lasting months or even longer. Among the findings of the study was a rate of 8 serious side effects per 1,000 vaccinated people, which is 40 times […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,biological weapon,covid-19,Dangerous Medicine,Germany,pharmaceutical fraud,research,spike protein,vaccine damage,Vaccine deaths,vaccine injury,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.vaccines.news/2022-05-12-survey-finds-germans-suffered-severe-vaccine-injuries.html", "encoding": "UTF-8"}, "image": null, "domain": "www.vaccines.news", "title": "Extensive survey finds half a million Germans experienced severe COVID-19 vaccine injuries", "cleaned_text": "A survey involving nearly 40,000 Germans at one of the biggest hospitals in Europe has found a high rate of severe side effects from COVID-19 vaccines that are lasting months or even longer.\n\nAmong the findings of the study was a rate of 8 serious side effects per 1,000 vaccinated people, which is 40 times the 0.2 estimated by German vaccine watchdog the Paul Ehrlich Institute.\n\nThe lead researcher of the study, Dr. Harald Matthes, estimates that around half a million Germans have experienced serious side effects after getting the jabs based on these stats. While 80 percent of those with severe reactions have recovered within three to six months, 20 percent continue to experience symptoms.\n\nIn other words, 100,000 Germans are currently dealing with long-term serious side effects from COVID-19 vaccines. This finding prompted Matthes to call on the government to take those claiming they have been injured by vaccines more seriously and offer them dedicated outpatient care.\n\nAccording to the researcher, most Germans have not been able to get much help in the country’s current medical climate, where discussing vaccine injury is strongly discouraged and doctors are largely unaware of how to help those who are suffering from these effects. He believes that allowing doctors to talk about vaccine injuries openly will help them develop better treatments without having to worry about being ostracized as “anti-vaxxers.”\n\nA good starting point, Matthes believes, is exploring the strong similarity between many of the symptoms of vaccine injury and what many refer to as long COVID as he thinks that the treatments that are currently being used for long COVID could help address vaccine injuries.\n\nIn fact, Germany has already set up outpatient clinics that are devoted to helping people with symptoms of long COVID. Although the vaccine injured could theoretically seek help from these clinics, there are simply too many of them for it to be feasible. At the University Hospital in Marburg’s special outpatient clinic, researchers were hoping to study long COVID among patients. Instead, they have had their plates full caring for patients who are experiencing severe side effects from their vaccines. Matthes says they are getting hundreds of emails every day at the clinic and have a waiting list of around 800 patients.\n\nVaccine injury is real, but many patients are unable to get help because their doctors fear being ostracized\n\nThe ramifications of this are significant. Writing for The Defender, Dr. Josh Guetzkow likens it to what might happen if Harvard Medical School researchers were to announce that vaccine injury is real, the CDC has been underreporting serious adverse events by a factor of 40, and those with vaccine injuries need to be taken seriously – and that doctors should be allowed to openly voice their opinions without worrying about retribution so they can help these people. Of course, the chances of that ever happening seem quite low at the moment.\n\nInterestingly, the underreporting factor of 40 times that was identified in the German study is the same underreporting factor that analysts like Steve Kirsch and others have used when extrapolating data based on reports in the U.S. Vaccine Adverse Event Reporting System. In mid-December, Kirsch estimated the number of excess deaths that can be attributed to the vaccine at 388,000 – or nearly 400,000 presumably otherwise relatively healthy Americans who may have died from something that they were led to believe would save them.\n\nUnfortunately, these numbers are only likely to go up with time as these effects take full force in more people and their connections to the jabs become more obvious.", "opengraph": {"title": "Extensive survey finds half a million Germans experienced severe COVID-19 vaccine injuries", "type": "article", "url": "https://www.vaccines.news/2022-05-12-survey-finds-germans-suffered-severe-vaccine-injuries.html", "site_name": "Vaccines News", "description": "A survey involving nearly 40,000 Germans at one of the biggest hospitals in Europe has found a high rate of severe side effects from COVID-19 vaccines that are lasting months or even longer. Among the findings of the study was a rate of 8 serious side effects per 1,000 vaccinated people, which is 40 times […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/05/Lab-Tech-Vaccine-Vials-Covid-19.jpg"}, "tags": ["covid-19", "Big Pharma", "Vaccine deaths", "research", "vaccine injury", "vaccines", "spike protein", "Germany", "vaccine damage", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/germans-severely-injured-covid-", "https://stevekirsch.substack.com/p/latest-vaers-estimate-388000-americans?s=r", "https://vaccineinjurynews.com/", "https://childrenshealthdefense.org/defender/germans-severely-injured-covid-", "https://stevekirsch.substack.com/p/latest-vaers-estimate-388000-americans?s=r", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-05-12-survey-finds-germans-suffered-severe-vaccine-injuries.html&linkname=Extensive%20survey%20finds%20half%20a%20million%20Germans%20experienced%20severe%20COVID-19%20vaccine%20injuries", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}