{"result_id": "327041", "URL": "https://vaccines.news/2022-12-09-uganda-receives-doses-experimental-ebola-vaccine-trial.html", "timestamp": "2023-04-25 17:49:54 CEST+0200", "meta": {"description": "The East African nation of Uganda has received a shipment of 1,200 Ebola vaccine candidates to be used in human trials in the country. The World Health Organization (WHO) previously pledged to provide Uganda with three vaccine candidates to be used in human trials – one created jointly by the University of Oxford in the United Kingdom […]", "lang": "en", "keywords": "Africa,badhealth,badmedicine,big government,ebola vaccine,Ebola virus,infections,outbreak,Sudan strain,Uganda,vaccines,World Health Organization", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-12-09-uganda-receives-doses-experimental-ebola-vaccine-trial.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "Uganda receives 1,200 doses of experimental Ebola vaccine", "cleaned_text": "The East African nation of Uganda has received a shipment of 1,200 Ebola vaccine candidates to be used in human trials in the country.\n\nThe World Health Organization (WHO) previously pledged to provide Uganda with three vaccine candidates to be used in human trials – one created jointly by the University of Oxford in the United Kingdom and the Serum Institute of India, another by the Washington, D.C. non-profit the Sabin Vaccine Institute and a third by New Jersey-based Big Pharma Merck & Co. (Related: Uganda reports 14 new cases of UNTREATABLE Ebola strain infection.)\n\nUgandan Minister of Health Jane Ruth Aceng received the first batch of vaccine doses in a ceremony featuring representatives from both the Ugandan government and the WHO on Thursday, Dec. 8, in the small city of Entebbe, about 28 miles south of the capital Kampala.\n\n“Today, we are happy that we have the first batch,” she said, talking about the 1,200 doses from the Sabin Vaccine Institute. “We shall be receiving other doses from Merck and from Oxford.”\n\nThe vaccines will be used in a “ring vaccination trial.” This means that close contacts of confirmed Ebola patients and the contacts of close contacts will be vaccinated along with the country’s healthcare and other frontline workers.\n\nWHO Regional Director for Africa Dr. Marshidiso Moeti hailed the vaccine trial as “a promising step towards possible protection against the virus.”\n\nThe Ebola outbreak in Uganda began on Sept. 20 and has infected around 142 people in the country of nearly 46 million. Of these, 86 people recovered from the Ebola virus’s symptoms, including hemorrhagic fever, vomiting, diarrhea, muscle pain and internal and external bleeding.\n\nFurthermore, the Ugandan government has noted that the country has not had an active Ebola case in nine days, with the last Ebola patient being discharged from the hospital on Dec. 2 after dealing with a bout of hemorrhagic fever.\n\nAccording to WHO criteria, an outbreak of the Ebola virus ends when there are no new cases for 42 consecutive days, which is twice the incubation period of Ebola.\n\n“We are nine days today on the countdown,” said Aceng. “So, it does not mean we will not get another [Ebola] case. Uganda is a country that always wants to be prepared and ready whenever any outbreak occurs.”\n\nIf no new infections are registered, the Ugandan government expects to declare the country free of the virus by Jan. 10. But regardless of whether or not there are new Ebola cases, the vaccine trial will continue.\n\n“Even if there are no cases, and no contacts and no suspects, the Ministry of Health will still request the scientists to continue with the study,” she added. “Uganda so far has had seven Ebola outbreaks. We may yet again get another Ebola outbreak.”\n\nBoth the WHO and the Ugandan government are interested in the vaccine trial because there are currently no licensed vaccines for the Sudan strain of the Ebola virus that caused the country’s latest outbreak. The trial is being used to determine whether any or all of the three vaccine candidates are effective in combating the Sudan strain.\n\nVaccines already exist for the more common Zaire strain of the Ebola virus, which spread during recent outbreaks in the neighboring Democratic Republic of the Congo.\n\nLearn more about disease outbreaks at Outbreak.news.\n\nWatch this clip from InfoWars featuring Harrison Smith discussing how the Ebola outbreak in Uganda made globalists “rub hands and drool” at the opportunity to exert more control over the world.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nUganda declares three-week lockdown in two districts amid new Ebola outbreak.\n\nEndless fear merry-go-round: WHO says Ebola risk is now “very high.”\n\nCDC and FDA “tag-teaming” Ebola bioweapons psy-op to push dangerous vaccines as part of an Ebola outbreak mass theater operation.\n\nHuh? Ebola vaccine not being tested against Ebola.", "opengraph": {"title": "Uganda receives 1,200 doses of experimental Ebola vaccine", "type": "article", "url": "https://www.vaccines.news/2022-12-09-uganda-receives-doses-experimental-ebola-vaccine-trial.html", "site_name": "Vaccines News", "description": "The East African nation of Uganda has received a shipment of 1,200 Ebola vaccine candidates to be used in human trials in the country. The World Health Organization (WHO) previously pledged to provide Uganda with three vaccine candidates to be used in human trials – one created jointly by the University of Oxford in the United Kingdom […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/12/Vaccine-Africa-Ebola-Man-African-Black-People.jpg"}, "tags": ["Uganda", "big government", "outbreak", "Africa", "Sudan strain", "World Health Organization", "ebola vaccine", "infections", "vaccines", "Ebola virus"], "tweets": [], "movies": [], "links": ["https://www.africanews.com/2022/12/08/uganda-receives-first-batch-of-ebola-trial-/", "https://www.reuters.com/world/africa/ebola-vaccine-candidates-arrive-uganda-trials-2022-12-08/", "https://www.ox.ac.uk/", "https://naturalnews.com/2022-10-27-uganda-reports-new-cases-untreatable-ebola-infection.html", "https://medicalxpress.com/news/2022-12-ebola-trial-vaccines-uganda.html", "https://www.bloomberg.com/news/articles/2022-12-08/first-ebola-vaccines-arrive-in-uganda-for-trials-on-sudan-strain?sref=jB82HHlm", "https://infections.news/", "https://vaccines.news/", "https://outbreak.news/", "https://www.brighteon.com/16c7971d-bd1d-42e1-b70e-c4a48141736e", "https://www.brighteon.com/channels/infowarsnetwork", "https://www.brighteon.com/channels/infowarsnetwork", "https://outbreak.news/2022-10-19-uganda-declares-lockdown-two-districts-ebola-oubreak.html", "https://pandemic.news/2021-03-10-who-says-ebola-risk-now-very-high.html", "https://vaccines.news/2020-01-01-cdc-fda-ebola-bioweapons-psyop-dangerous-vaccines-outbreak-mass-theater.html", "https://naturalnews.com/047253_Ebola_vaccine_clinical_trials_outbreak.html", "https://www.africanews.com/2022/12/08/uganda-receives-first-batch-of-ebola-trial-/", "https://www.reuters.com/world/africa/ebola-vaccine-candidates-arrive-uganda-trials-2022-12-08/", "https://medicalxpress.com/news/2022-12-ebola-trial-vaccines-uganda.html", "https://www.bloomberg.com/news/articles/2022-12-08/first-ebola-vaccines-arrive-in-uganda-for-trials-on-sudan-strain?sref=jB82HHlm", "https://www.brighteon.com/16c7971d-bd1d-42e1-b70e-c4a48141736e", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-12-09-uganda-receives-doses-experimental-ebola-vaccine-trial.html&linkname=Uganda%20receives%201%2C200%20doses%20of%20experimental%20Ebola%20vaccine", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}