{"result_id": "327029", "URL": "https://vaccines.news/2022-12-06-uwo-ends-vaccine-mandate-after-student-deaths.html", "timestamp": "2023-04-25 17:49:45 CEST+0200", "meta": {"description": "The University of Western Ontario (UWO) has abruptly ended its Wuhan coronavirus (COVID-19) vaccine mandate after two students died “suddenly and unexpectedly.” According to The COVID Blog, UWO first implemented a COVID-19 vaccine mandate for students living on campus in May 2021. It was later extended to all students and staff members in August 2021. […]", "lang": "en", "keywords": "badhealth,badmedicine,Canada,covid-19,deception,faked,Journalism,lies,mainstream media,medical martial law,Medical Tyranny,Megha Thakur,pandemic,Spencer Cornelis,University of Western Ontario,vaccine,vaccine damage,Vaccine deaths,vaccine mandate,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-12-06-uwo-ends-vaccine-mandate-after-student-deaths.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "University of Western Ontario ends COVID vaccine mandate after students die “suddenly and unexpectedly”", "cleaned_text": "University of Western Ontario ends COVID vaccine mandate after students die “suddenly and unexpectedly”\n\nThe University of Western Ontario (UWO) has abruptly ended its Wuhan coronavirus (COVID-19) vaccine mandate after two students died “suddenly and unexpectedly.”\n\nAccording to The COVID Blog, UWO first implemented a COVID-19 vaccine mandate for students living on campus in May 2021. It was later extended to all students and staff members in August 2021. The university took things to the next level for the fall 2022 semester when it announced a COVID-19 booster mandate two weeks before the start of classes and after students had already paid their tuition and other miscellaneous fees.\n\nThe Globe and Mail reported that UWO was the only Canadian university that had a campus-wide booster mandate in place. In response, hundreds of students protested against the booster mandate in late August. (Related: 11 Professors demand University of California end COVID vaccine mandates.)\n\nFive students sued UWO at the Ontario Superior Court in late September to block the booster mandate. Judge Kelly Tranquilli, however, ruled in favor of the university and dismissed the lawsuit on Sept. 24. Her decision stated that UWO is “expressly and broadly empowered to … do such things as it considers to be for the good of the university and consistent with the public interest,” and that the university storing students’ medical records was perfectly legal.\n\nThe university extended the deadline for students to get boosted from Oct. 1, 2022 to Jan. 9, 2023.\n\nHowever, management and organizational studies major Spencer Cornelis “passed away unexpectedly” on Oct. 18. Later, computer science major and social media influencer Megha Thakur “suddenly and unexpectedly” died on Nov. 24.\n\nThis eventually led to UWO backtracking on its vaccine mandate, per a Nov. 29 announcement on the university’s website.\n\n“[UWO] has committed to regularly reviewing our vaccination policy. Based on the latest consultation with our medical experts and local public health, we are revoking our vaccination policy and will no longer require students, employees and visitors to be vaccinated to come to campus.”\n\nMSM and other outlets trying to hide real reason behind Thakur’s death\n\nSeveral mainstream media (MSM) and online news outlets have tried to hide the real reason behind the 21-year-old Thakur’s death, reporting that she died due to a car accident instead of the vaccine.\n\nOne report published by the GeniusCelebs.com website even included a picture of a car crash. But according to The COVID Blog, the picture used in the GeniusCelebs.com report was actually from a CTV News article published in April 2021.\n\nAnother report from Tipblogg.com also reported Thakur’s death as the result of a car crash. It also added a picture of the alleged crash, but the picture used was actually from an August 2021 car crash at Halifax, the capital of Canada’s Nova Scotia province.\n\nDespite these revelations, other reputable MSM outlets like the Manchester Evening News, The Daily Record, and Wales Online doubled down on the “car collision” narrative. Incidentally, all these outlets based in the United Kingdom cited “reports in Canada” as their source for the story.\n\nA July 16 Instagram video by Thakur herself, which has since been deleted, also brought up the possibility of cardiac issues stemming from the COVID-19 vaccine.\n\n“I have really bad anxiety, which turned into stress … [and then] into a heart attack – so I’ve been dealing with that,” she said.\n\nThe COVID Blog commented on the development: “This ‘car accident’ nonsense is the most blatant example of coordinated media propaganda to date. Thakur was already injured in the worst way by the injections last summer. She had a heart attack, likely from post-injection myocarditis. It was only a matter of time thereafter.”\n\nVaccineDeaths.com has more stories about students dying from COVID-19 injections.\n\nWatch professor Julie Ponesse, who was fired by UWO for refusing to get injected, denounce vaccine mandates below.\n\nThis video is from the Watchmen Incorporated channel on Brighteon.com.\n\nCanadian professor fired for refusing to get injected with covid vaccine.\n\nTop Canadian university fires 49 staff members for not getting the COVID-19 vaccine.\n\nCanadian university forcing online students to report their vaccination status or be PUNISHED.\n\nProfessors in Canadian university seek probe on possible CONFLICT OF INTEREST behind its president’s push for COVID vaccines.", "opengraph": {"title": "University of Western Ontario ends COVID vaccine mandate after students die “suddenly and unexpectedly”", "type": "article", "url": "https://www.vaccines.news/2022-12-06-uwo-ends-vaccine-mandate-after-student-deaths.html", "site_name": "Vaccines News", "description": "The University of Western Ontario (UWO) has abruptly ended its Wuhan coronavirus (COVID-19) vaccine mandate after two students died “suddenly and unexpectedly.” According to The COVID Blog, UWO first implemented a COVID-19 vaccine mandate for students living on campus in May 2021. It was later extended to all students and staff members in August 2021. […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/12/Flu-Shot-Vaccine-Syringe-Adult-Inject.jpg"}, "tags": ["pandemic", "covid-19", "Megha Thakur", "faked", "University of Western Ontario", "Vaccine deaths", "mainstream media", "Journalism", "vaccine", "deception", "Canada", "vaccine mandate", "Medical Tyranny", "lies", "Wuhan coronavirus", "medical martial law", "Spencer Cornelis", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.uwo.ca/", "https://thecovidblog.com/2022/12/02/megha-thakur-canadian-university-ends-vaccine-mandate-after-two-students-including-tiktok-star-die-unexpectedly-car-accident-cause-of-death-is-a-lie/", "https://naturalnews.com/2022-11-29-profs-demand-university-of-california-end-vaccine-mandates.html", "https://www.uwo.ca/coronavirus/updates/nov29-2022.html", "https://vaccinedeaths.com/", "https://www.brighteon.com/c6e7c348-14b4-4c24-ac64-31ce14d73a12", "https://www.brighteon.com/channels/watchmenincorporated", "https://medicalfascism.news/2021-09-14-canadian-professor-fired-for-refusing-coronavirus-vaccine.html", "https://medicaltyranny.com/2022-04-05-canadian-university-fires-49-unvaccinated-staff-members.html", "https://vaccines.news/2021-10-07-canada-university-vaccine-mandate-on-online-students.html", "https://campusinsanity.com/2022-05-09-professors-seek-probe-university-president-push-vaccines.html", "https://thecovidblog.com/2022/12/02/megha-thakur-canadian-university-ends-vaccine-mandate-after-two-students-including-tiktok-star-die-unexpectedly-car-accident-cause-of-death-is-a-lie/", "https://www.uwo.ca/coronavirus/updates/nov29-2022.html", "https://www.brighteon.com/c6e7c348-14b4-4c24-ac64-31ce14d73a12", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-12-06-uwo-ends-vaccine-mandate-after-student-deaths.html&linkname=University%20of%20Western%20Ontario%20ends%20COVID%20vaccine%20mandate%20after%20students%20die%20%E2%80%9Csuddenly%20and%20unexpectedly%E2%80%9D", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html", "https://www.brighteon.tv"], "authors": [], "publish_date": null}