{"result_id": "327006", "URL": "https://vaccines.news/2023-02-21-welt-many-inconsistencies-pfizer-covid-vaccine-study.html", "timestamp": "2023-04-25 17:49:27 CEST+0200", "meta": {"description": "WELT, one of the most popular news outlets in Germany, ran an exposé this week called “The many inconsistencies in the Pfizer approval study” that blows the lid on all the “incorrect documentation” and “many inconsistencies” in the documents that Pfizer and BioNTech submitted to governments to approve their messenger RNA (mRNA) Wuhan coronavirus (Covid-19) […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,Big Pharma,biological weapon,chemical violence,COVID,Dangerous Medicine,Germany,inconsistencies,mRNA,pandemic,Pfizer,pharma fraud,research,rigged,science deception,science fraud,spike protein,vaccine,vaccine damage,vaccine injury,WELT", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2023-02-21-welt-many-inconsistencies-pfizer-covid-vaccine-study.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "Major German news outlet WELT reports on “many inconsistencies” in Pfizer covid “vaccine” approval study", "cleaned_text": "WELT, one of the most popular news outlets in Germany, ran an exposé this week called “The many inconsistencies in the Pfizer approval study” that blows the lid on all the “incorrect documentation” and “many inconsistencies” in the documents that Pfizer and BioNTech submitted to governments to approve their messenger RNA (mRNA) Wuhan coronavirus (Covid-19) “vaccines.”\n\nThere are “increasing doubts,” the article explains, about the data that was used in Pfizer’s phase 3 trials. And all the while, Pfizer is dodging these allegations and refusing to review its findings, even as people all around the world fall ill and die as a result of being injected.\n\nPfizer also conveniently failed to include the negative results of some trial participants in the submissions it made to government regulators. One such case involves a 36-year-old lawyer from Buenos Aires who after getting jabbed suffered a series of horrific side effects.\n\nIn addition to a painful and swelled arm, Augusto Roux developed nausea, difficulty swallowing, and a constant feeling of being hungover. His sense of smell also changed, as did the color of his stools – they turned white – and the color of his urine – it turned dark and later black.\n\nAll of this happened within two days of getting injected, prompting Roux to contact his test doctors for help. They noted that Roux suffered “Undesirable effect of toxicity level 1” in his notes.\n\nThree weeks later, Roux received his second Pfizer dose, after which he developed shortness of breath, burning chest pain, nausea, and fever. His urine “turned like black cola” and he passed out, having to be rushed to Alemán Hospital where he tested “negative” for covid.\n\nIn his discharge notes, Roux was given an “Adverse reaction to the coronavirus vaccine (high probability),” as well as computer tomograph imagery showing that he had developed pericardial effusion, or fluid buildup in the heart.\n\nOver the next several months, Roux lost more than 30 pounds, developed liver problems, and his heart started beating irregularly. An American doctor named Gemma Torrell who had access to Roux’s medical records and questioned him determined that he likely suffered pericarditis, or inflammation of the heart, as a result of the jabs.\n\n“All of this fits exactly with a clinical picture that the Paul Ehrlich Institute also has in its list of ‘rare side effects’ for mRNA vaccines,” reads an English translation of the WELD article.\n\nRoux’s case took a strange turn when he became the attorney for Fernando Polack, the study director in Buenos Aires and lead author of the Pfizer’s global phase 3 pivotal study. Through this, Roux gained access to his own file, which shocked him.\n\nOne would think that Roux’s horrible side effects would have been listed in Pfizer’s pivotal study papers, but this did not happen. Instead, Pfizer labeled Roux’s side effects as being “mental” in nature and having nothing to do with its mRNA injections.\n\n“His medical history is not mentioned in the approval study from December 2020, and his case does not appear in later evaluations either,” WELD reported.\n\n“In a summary of all study data for the U.S. Food and Drug Administration as of\n\n August 11, 2021, only one case of pericarditis was recorded among the vaccinated\n\n subjects. A man older than 55 is affected, it says. Augusto Roux is not mentioned.\n\n Was he registered as a Covid case and therefore as an unvaccinated person?”\n\nThe latest news about covid injections can be found at Vaccines.news.", "opengraph": {"title": "Major German news outlet WELT reports on “many inconsistencies” in Pfizer covid “vaccine” approval study", "type": "article", "url": "https://www.vaccines.news/2023-02-21-welt-many-inconsistencies-pfizer-covid-vaccine-study.html", "site_name": "Vaccines News", "description": "WELT, one of the most popular news outlets in Germany, ran an exposé this week called “The many inconsistencies in the Pfizer approval study” that blows the lid on all the “incorrect documentation” and “many inconsistencies” in the documents that Pfizer and BioNTech submitted to governments to approve their messenger RNA (mRNA) Wuhan coronavirus (Covid-19) […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2023/02/Coronavirus-Covid-19-Pfizer-Vaccine-Syringe-Vial.jpg"}, "tags": ["pandemic", "Big Pharma", "pharma fraud", "COVID", "Pfizer", "biological weapon", "science deception", "vaccine", "WELT", "spike protein", "chemical violence", "Germany", "science fraud", "research", "inconsistencies", "rigged", "vaccine injury", "mRNA", "vaccine damage"], "tweets": [], "movies": [], "links": ["//igor.chudov.com/tmp/Die-Welt.pdf", "https://naturalnews.com/2022-05-10-lipid-nanoparticles-covid-jabs-stick-bodily-organs.html", "//Vaccines.news", "//igor.chudov.com/tmp/Die-Welt.pdf", "https://naturalnews.com/2022-05-10-lipid-nanoparticles-covid-jabs-stick-bodily-organs.html", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2023-02-21-welt-many-inconsistencies-pfizer-covid-vaccine-study.html&linkname=Major%20German%20news%20outlet%20WELT%20reports%20on%20%E2%80%9Cmany%20inconsistencies%E2%80%9D%20in%20Pfizer%20covid%20%E2%80%9Cvaccine%E2%80%9D%20approval%20study", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}