{"result_id": "327028", "URL": "https://vaccines.news/2022-12-18-british-parliamentarian-immediate-suspension-mrna-covid-vaccines.html", "timestamp": "2023-04-25 17:49:44 CEST+0200", "meta": {"description": "British Member of Parliament Andrew Bridgen has called for an “immediate and complete suspension” of the mRNA Wuhan coronavirus (COVID-19) vaccines, alleging that a senior health official is covering up a report showing how these vaccines increase inflammation of the heart arteries. Bridgen, a member of the Conservative Party and a member of parliament since 2010, […]", "lang": "en", "keywords": "Andrew Bridgen,badhealth,badmedicine,badscience,cardiac health,children's health,covid-19,covid-19 vaccines,heart health,mRNA,mRNA vaccines,pandemic,vaccine damage,Vaccine dangers,Vaccine deaths,Vaccine injuries,vaccine injury,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-12-18-british-parliamentarian-immediate-suspension-mrna-covid-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "British MP calls for immediate and complete suspension of mRNA COVID-19 vaccines due to adverse effects", "cleaned_text": "British MP calls for immediate and complete suspension of mRNA COVID-19 vaccines due to adverse effects\n\nBritish Member of Parliament Andrew Bridgen has called for an “immediate and complete suspension” of the mRNA Wuhan coronavirus (COVID-19) vaccines, alleging that a senior health official is covering up a report showing how these vaccines increase inflammation of the heart arteries.\n\nBridgen, a member of the Conservative Party and a member of parliament since 2010, made a plea for the House of Commons, the United Kingdom’s parliament, to pass a measure to stop giving small children mRNA COVID-19 vaccines during a debate focused on the potential harms associated with these vaccines. (Related: Tragedies lead doctors like Aseem Malhotra to question mandatory COVID-19 vaccinations.)\n\nThe conservative government of the U.K. recently approved giving children from six months old to four years old a low dose of Pfizer’s mRNA vaccine. Bridgen called on Prime Minister Rishi Sunak to overturn this decision, claiming that the mRNA vaccines are dangerous not just for children but also for pregnant and breastfeeding women.\n\nBridgen called the mRNA vaccines “not safe, not effective and not necessary,” pointing out that the British government has received “almost half a million reports of adverse effects from the public” since the Pfizer vaccines were first distributed in the United Kingdom.\n\nThe MP also questioned how effective the mRNA vaccines truly are, noting that real-world data during the post-vaccine omicron variant wave shows that “we would need to vaccinate 7,300 people over the age of 80 to prevent one death.”\n\nAccording to Bridgen, a leading member of the British Heart Foundation deliberately suppressed a report providing strong evidence that the mRNA COVID-19 vaccines can cause heart damage.\n\n“It has also been brought to my attention by a whistleblower from a very reliable source that one of these institutions is covering up clear data that reveals that the mRNA vaccine increases inflammation of the heart arteries,” he said. “They are covering this up in fear that they may lose funding from the pharmaceutical industry.”\n\nWithout providing a specific name, Bridgen claimed that this person has a “prominent leadership role” in the heart foundation and is “the leader” of a cardiology research department. Furthermore, he noted that this person forced his research team to sign non-disclosure agreements “to ensure that this important data never sees the light of day.”\n\n“This man is an absolute disgrace,” said Bridgen. “Systemic failure in an over-medicated population also contributes to huge waste of British taxpayers’ money.”\n\nIn response to Bridgen’s statement, many have called for him to apologize. Shadow Health Minister Andrew Gwynne of the Labor Party said Bridgen is spreading “anti-vaccine misinformation,” and that he should not be allowed to use his platform as an elected official “to spread these kinds of baseless conspiracy theories.”\n\n“Vaccine hesitancy costs lives. COVID vaccines are safe and effective and politicians should be doing everything they can to encourage uptake,” he said. “Mr. Bridgen needs to apologize and correct the record, and Rishi Sunak should get a grip on the conspiracy theorists in the Conservative Party.”\n\nLearn more about the mRNA COVID-19 vaccines at Vaccines.news.\n\nWatch Bridgen’s full statement calling for the suspension of mRNA COVID-19 vaccines in the House of Commons.\n\nThis video is from the channel The Big Logic on Brighteon.com.\n\nDr. Peter McCullough: Myocarditis is often the underlying cause when people die in their sleep.\n\nCLOWN SCIENCE: Pfizer and Moderna to self-investigate their own COVID jabs for heart risks.\n\nPfizer trial data reveal that vaccination people are 400% more likely to die from fatal cardiac arrest.\n\nStudy finds 84% increase in incidence of cardiac-related DEATH among men under 40 following mRNA vaccination.", "opengraph": {"title": "British MP calls for immediate and complete suspension of mRNA COVID-19 vaccines due to adverse effects", "type": "article", "url": "https://www.vaccines.news/2022-12-18-british-parliamentarian-immediate-suspension-mrna-covid-vaccines.html", "site_name": "Vaccines News", "description": "British Member of Parliament Andrew Bridgen has called for an “immediate and complete suspension” of the mRNA Wuhan coronavirus (COVID-19) vaccines, alleging that a senior health official is covering up a report showing how these vaccines increase inflammation of the heart arteries. Bridgen, a member of the Conservative Party and a member of parliament since 2010, […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/12/coronavirus-united-kingdom-UK-flag.jpg"}, "tags": ["pandemic", "covid-19", "vaccine wars", "heart health", "Vaccine dangers", "Vaccine deaths", "mRNA vaccines", "vaccine injury", "vaccines", "Vaccine injuries", "children's health", "covid-19 vaccines", "cardiac health", "Andrew Bridgen", "mRNA", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/859ddd60-e1f2-4bdb-b15b-7435de54a262", "https://www.express.co.uk/news/politics/1709123/tory-mp-covid-vaccine-inflaming-heart-arteries-commons-debate-update", "https://www.leicestermercury.co.uk/news/leicestershire-mp-calls-government-halt-7930913", "https://www.naturalnews.com/2022-12-08-tragedies-make-doctors-question-mandatory-covid-vaccinations.html", "https://vaccines.news/", "https://www.brighteon.com/859ddd60-e1f2-4bdb-b15b-7435de54a262", "https://www.brighteon.com/channels/thebiglogic", "https://www.brighteon.com/channels/thebiglogic", "https://vaccines.news/2022-12-08-autopsies-covid19-vaccine-causes-sudden-adult-death-syndrome.html", "https://vaccinedeaths.com/2022-11-29-myocarditis-underlying-cause-people-die-in-sleep.html", "https://www.vaccines.news/2022-11-16-pfizer-moderna-self-investigate-covid-jabs-myocarditis.html", "https://www.naturalnews.com/2022-10-25-pfizer-vaccinated-more-likely-to-die-cardiac-arrest.html", "https://naturalnews.com/2022-10-13-men-cardiac-related-death-after-mrna-vaccination.html", "https://www.brighteon.com/859ddd60-e1f2-4bdb-b15b-7435de54a262", "https://www.express.co.uk/news/politics/1709123/tory-mp-covid-vaccine-inflaming-heart-arteries-commons-debate-update", "https://www.leicestermercury.co.uk/news/leicestershire-mp-calls-government-halt-7930913", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-12-18-british-parliamentarian-immediate-suspension-mrna-covid-vaccines.html&linkname=British%20MP%20calls%20for%20immediate%20and%20complete%20suspension%20of%20mRNA%20COVID-19%20vaccines%20due%20to%20adverse%20effects", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}