{"result_id": "327024", "URL": "https://vaccines.news/2022-05-25-covid-vaccine-negative-effects-coverups-emerging.html", "timestamp": "2023-04-25 17:49:41 CEST+0200", "meta": {"description": "Although the mainstream media and Big Pharma have been working hard to keep medical professionals and injured patients from talking about the negative effects of Covid vaccines, we are starting to hear more and more about these cases as their numbers grow too big to ignore. As many feared when these jabs were rushed to […]", "lang": "en", "keywords": "badcancer,badhealth,badmedicine,Big Pharma,biological weapon,cancer causes,cancer criminals,conspiracy,covid-19,Dangerous Medicine,deception,Infertility,miscarriage,pandemic,Pfizer,pharmaceutical fraud,spike protein,vaccine damage,vaccine injury,vaccines,women's health", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2022-05-25-covid-vaccine-negative-effects-coverups-emerging.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "More Covid vaccine negative effects and coverups are emerging", "cleaned_text": "More Covid vaccine negative effects and coverups are emerging\n\nAlthough the mainstream media and Big Pharma have been working hard to keep medical professionals and injured patients from talking about the negative effects of Covid vaccines, we are starting to hear more and more about these cases as their numbers grow too big to ignore.\n\nAs many feared when these jabs were rushed to the market largely untested, it is only as time passes that some of the effects become more obvious. One example is the case of a 12-year-old girl who participated in Pfizer’s pre-release safety study. In a presentation of families who have been injured by Covid vaccines by Senator Ron Johnson, Maddie de Garay’s mother said she is now confined to a wheelchair as a result of getting the jab. In addition to suffering from permanent brain damage and requiring tube feeding, she has been experiencing recurrent seizures.\n\nTo add insult to injury, on Maddie’s safety evaluation that was submitted to the FDA, the only side effect that Pfizer listed was a stomach ache. The senator’s presentation included several other people who had similar stories.\n\nA Japanese Freedom of Information Act lawsuit forcing Pfizer to release its biodistribution study exposed another lie. The report, which Pfizer clearly wanted to keep quiet, showed that the company’s claims that the vaccine’s contents remained at the site of the injection were false and that their own study indicated they spread quickly throughout the body via the bloodstream.\n\nVaccine makers’ own studies show they collect in many of the body’s organs\n\nMoreover, the study showed that potentially deadly nanolipid carriers collect within several organs in very high concentrations, particularly male and female reproductive organs, as well as the heart, liver, brain, spleen and bone marrow.\n\nOne doctor who has been brave enough to talk about vaccine effects is Idaho pathologist Dr. Ryan Cole, who has noted a dramatic spike in very aggressive cancers among people who have received the vaccine that was not reported by the mainstream media. Some of the types of cancer he has seen include uterine cancer and highly invasive melanomas among younger people. In addition, there have been reports of previously controlled cancers being activated again in vaccinated patients.\n\nAnother concern is the high concentration of spike proteins in the ovaries found in the biodistribution study. This means the vaccine could potentially alter young women’s menstruation, compromise their fertility and even raise their risk of ovarian cancer. Another concern raised by an expert in maternal-fetal medicine, Dr. James Thorpe, was a 50-fold higher incidence of miscarriage linked to Covid-19 vaccines given during pregnancy than with all other vaccines combined. Nevertheless, the American College of Obstetrics and Gynecology, which just so happens to receive significant funding from Pfizer, endorsed the safety of the jabs for women in all stages of pregnancy and breastfeeding.\n\nThe fact that the vaccines’ materials collect in bone marrow is even more bad news, putting everyone at risk of leukemia and lymphoma – a particularly upsetting prospect now that the vaccines are being given to kids as young as 5 and potentially even younger moving forward.\n\nOf course, there haven’t been any long-term studies looking into the link between these vaccines and cancer, and cancer patients are still being pushed to get jabbed. In fact, there haven’t been studies yet into the vaccine and a long list of many common and potentially fatal medical conditions, such as heart disease, diabetes, neurodegenerative diseases and autoimmune disorders.\n\nHowever, we do know from past experience with flu vaccines that safety studies carried out by doctors and researchers tied to pharmaceutical firms were designed to cover up negative effects and reach positive conclusions. Unfortunately, the system has long been corrupt, and humans everywhere are paying the price with their health – and, in increasing numbers, with their lives.", "opengraph": {"title": "More Covid vaccine negative effects and coverups are emerging", "type": "article", "url": "https://www.vaccines.news/2022-05-25-covid-vaccine-negative-effects-coverups-emerging.html", "site_name": "Vaccines News", "description": "Although the mainstream media and Big Pharma have been working hard to keep medical professionals and injured patients from talking about the negative effects of Covid vaccines, we are starting to hear more and more about these cases as their numbers grow too big to ignore. As many feared when these jabs were rushed to […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/05/Coronavirus-Covid-19-Booster-Vaccine-Vials.jpg"}, "tags": ["pandemic", "conspiracy", "covid-19", "women's health", "Big Pharma", "Infertility", "cancer criminals", "deception", "vaccine injury", "miscarriage", "vaccines", "Pfizer", "spike protein", "vaccine damage", "biological weapon", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/05/22/dangers-of-the-vaccines-are-increasingly-revealed/", "https://www.ronjohnson.senate.gov/2021/10/media-advisory-sen-johnson-holds-expert-panel-on-federal-vaccine-mandates-and-vaccine-injuries", "https://vaccineinjurynews.com/", "https://expose-news.com/2022/05/22/dangers-of-the-vaccines-are-increasingly-revealed/", "https://www.ronjohnson.senate.gov/2021/10/media-advisory-sen-johnson-holds-expert-panel-on-federal-vaccine-mandates-and-vaccine-injuries", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-05-25-covid-vaccine-negative-effects-coverups-emerging.html&linkname=More%20Covid%20vaccine%20negative%20effects%20and%20coverups%20are%20emerging", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}