{"result_id": "327018", "URL": "https://www.vaccines.news/2022-11-30-woman-injured-pfizer-vaccine-damaged-for-life.html", "timestamp": "2023-04-25 17:49:37 CEST+0200", "meta": {"description": "A woman who suffered vaccine injuries from Pfizer’s mRNA Wuhan coronavirus (COVID-19) vaccine says she feels “damaged for life.” Mail carrier Sandra Ortiz, 54, shared this sentiment to the Defender. The Arlington, Texas resident said her vaccine damage woes began on May 26, 2021 when she was injected with her first and only dose of the […]", "lang": "en", "keywords": "badhealth,badmedicine,Big Pharma,Cienna Knowles,covid-19,Dangerous Medicine,Genevieve Manon Florence Chennour,harmful medicine,mRNA vaccine,pandemic,Pfizer,Sandra Ortiz,vaccine,vaccine damage,vaccine injury,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.vaccines.news/2022-11-30-woman-injured-pfizer-vaccine-damaged-for-life.html", "encoding": "UTF-8"}, "image": null, "domain": "www.vaccines.news", "title": "Woman injured by Pfizer COVID-19 shot feels “damaged for life”", "cleaned_text": "A woman who suffered vaccine injuries from Pfizer’s mRNA Wuhan coronavirus (COVID-19) vaccine says she feels “damaged for life.”\n\nMail carrier Sandra Ortiz, 54, shared this sentiment to the Defender. The Arlington, Texas resident said her vaccine damage woes began on May 26, 2021 when she was injected with her first and only dose of the Pfizer COVID-19 vaccine at a pharmacy.\n\n“I felt waves of heat in my body and felt as I was going to faint … [but] I did not,” she recounted. “I immediately felt like my life was in danger. Something was really wrong with me.”\n\nAccording to Ortiz, the pharmacist who injected her with the shot simply called the ambulance while she was lying on the floor.\n\nLater, the mail carrier experienced a plethora of post-vaccination symptoms including “blood pressure spikes, elevated heartbeats, dizziness, nausea, heat on chest and pain, hot feet and cold hands, weird head pressure, shortness of breath, neck pain, back pain, extreme fatigue, a numb left hand, mild numbness on left side of face with random twitching, confusions, heart palpitations, eye blurriness, jaw tightness and gum pain.”\n\nThese led to several visits to the emergency room and medical leaves at work, which put Ortiz’s career in a precarious situation.\n\nWhile the 54-year-old is thankful for overcoming many of the more serious post-injection symptoms, she nevertheless feels “damaged.”\n\n“Sometimes I feel that I am damaged for life, but as long as I can work, I am OK. My biggest fear was that I was going to stay disabled and didn’t know how I was going to pay my bills,” Ortiz commented.\n\nYoung female athletes “damaged for life” and “barely functional” after taking Pfizer shots\n\nOrtiz is not alone in her predicament. Two female athletes also suffered serious vaccine injuries after getting injected with the Pfizer mRNA vaccine.\n\nBritish actress and athlete Genevieve Manon Florence Chennour was forced to get the vaccine in the summer of 2021 as the film industry mandated it as a condition of employment. From being a healthy 24-year-old, Chennour became unable to function or even care for herself. The actress and athlete “immediately regretted” the vaccination, recounting the symptoms – head and chest pain, increased temperature and heart rate, burning sensations, brain fog and shaking – she experienced after her first dose.\n\nWhile she later recovered with the help of a private doctor, Chennour landed a huge film role that required her to be double-vaccinated. “They couldn’t confirm me if I wasn’t double-jabbed. Not only did I lose my health, but I lost my job because of the vaccine,” she lamented.\n\nAustralian equestrienne Cienna Knowles suffered harrowing vaccine injuries after getting injected with the mRNA COVID-19 shot. While the 19-year-old “never wanted” to get injected due to fears of adverse reactions, she was ultimately forced to get the vaccine to continue her career.\n\nThe equestrienne from New South Wales felt seriously ill on Oct. 21 after her second vaccine dose. She woke up with a fever, blurred vision, a bad headache and sore legs and joints. Scans later revealed that she developed blood clots in different parts of the body. (Related: Teenage girl develops worsening neurological symptoms moments after getting Pfizer vaccine.)\n\n“Crazy how quickly I went from a super healthy 19-year-old kid who’s never had any form of health issues ever – working a full-time job, training and riding horses every day – to having it all taken away from me after my second Pfizer vaccination,” Knowles wrote in a Facebook post.\n\n“I wish I had never gotten it and I could have my healthy body back,” she lamented.\n\nHead over to VaccineInjuryNews.com for more stories about people injured by the Pfizer mRNA COVID-19 vaccine.\n\nWatch this video about how one dose of the Pfizer COVID-19 vaccine destroyed the life of a young woman.\n\nThis video is from the Puretrauma357 channel on Brighteon.com.\n\nFormer Pfizer employee flags FDA study, warns that Pfizer vaccine increases COVID by over 300%.\n\nStillbirths are skyrocketing in the post-covid vaccination era, leaked hospital emails reveal.\n\nPennsylvania woman left paralyzed after getting injected with Pfizer vaccine.", "opengraph": {"title": "Woman injured by Pfizer COVID-19 shot feels “damaged for life”", "type": "article", "url": "https://www.vaccines.news/2022-11-30-woman-injured-pfizer-vaccine-damaged-for-life.html", "site_name": "Vaccines News", "description": "A woman who suffered vaccine injuries from Pfizer’s mRNA Wuhan coronavirus (COVID-19) vaccine says she feels “damaged for life.” Mail carrier Sandra Ortiz, 54, shared this sentiment to the Defender. The Arlington, Texas resident said her vaccine damage woes began on May 26, 2021 when she was injected with her first and only dose of the […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/11/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["pandemic", "covid-19", "Sandra Ortiz", "Big Pharma", "harmful medicine", "vaccine", "Cienna Knowles", "vaccine injury", "Pfizer", "Wuhan coronavirus", "mRNA vaccine", "Genevieve Manon Florence Chennour", "vaccine damage"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/sandra-ortiz-pfizer-covid-vaccine-injury/", "//pharmaceuticalfraud.com", "https://rairfoundation.com/olympic-athlete-genevieve-florence-24-barely-functional-after-pfizer-vaccine-i-wanted-to-end-my-life-video/", "https://www.news.com.au/lifestyle/health/health-problems/teen-equestrian-star-cienna-knowles-hospitalised-with-blood-clots-after-pfizer-vaccine/news-story/286e7cd42e896b091e4b257322296a05", "https://naturalnews.com/2021-09-19-girl-neurological-symptoms-pfizer-covid-vaccine.html", "//vaccineinjurynews.com/", "https://www.brighteon.com/e8a92ed7-5907-40f7-8b3a-405cbcdcadd2", "https://www.brighteon.com/channels/puretrauma357", "https://naturalnews.com/2021-10-01-former-employee-warns-pfizer-vaccine-increases-covid.html", "https://naturalnews.com/2021-08-31-nz-woman-dies-after-getting-pfizer-vaccine.html", "https://newstarget.com/2022-11-04-stillbirths-increasing-post-covid-vaccination-era.html", "https://naturalnews.com/2021-05-02-woman-paralyzed-after-pfizer-injection.html", "https://childrenshealthdefense.org/defender/sandra-ortiz-pfizer-covid-vaccine-injury/", "https://rairfoundation.com/olympic-athlete-genevieve-florence-24-barely-functional-after-pfizer-vaccine-i-wanted-to-end-my-life-video/", "https://www.news.com.au/lifestyle/health/health-problems/teen-equestrian-star-cienna-knowles-hospitalised-with-blood-clots-after-pfizer-vaccine/news-story/286e7cd42e896b091e4b257322296a05", "https://www.brighteon.com/e8a92ed7-5907-40f7-8b3a-405cbcdcadd2", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-11-30-woman-injured-pfizer-vaccine-damaged-for-life.html&linkname=Woman%20injured%20by%20Pfizer%20COVID-19%20shot%20feels%20%E2%80%9Cdamaged%20for%20life%E2%80%9D", "https://www.addtoany.com/share", "https://www.brighteon.tv", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}