{"result_id": "327032", "URL": "https://vaccines.news/2023-02-16-pfizer-rigged-vaccine-trial-conflict-of-interest.html", "timestamp": "2023-04-25 17:49:46 CEST+0200", "meta": {"description": "Pfizer’s rigged 2020 trial of its Wuhan coronavirus (COVID-19) vaccine was riddled with conflicts of interest, according to the Canadian COVID Care Alliance (CCCA). The CCCA presented its analysis in a December 2021 presentation reposted by mRNA vaccine technology inventor Dr. Robert Malone. According to investigative journalist Kanekoa The Great, Malone reposting the presentation led […]", "lang": "en", "keywords": "badhealth,badmedicine,biased,Big Pharma,BioNTech,Clinical trials,conflicts of interest,covid-19,Dangerous Medicine,deception,Eric Rubin,Ozlem Tureci,pandemic,Pfizer,pharmaceutical fraud,rigged,science deception,science fraud,subjectivity,Ugur Sahin,vaccine,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2023-02-16-pfizer-rigged-vaccine-trial-conflict-of-interest.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "NEVER FORGET: Pfizer’s rigged 2020 COVID-19 vaccine trials… riddled with conflicts of interest", "cleaned_text": "NEVER FORGET: Pfizer’s rigged 2020 COVID-19 vaccine trials… riddled with conflicts of interest\n\nPfizer’s rigged 2020 trial of its Wuhan coronavirus (COVID-19) vaccine was riddled with conflicts of interest, according to the Canadian COVID Care Alliance (CCCA).\n\nThe CCCA presented its analysis in a December 2021 presentation reposted by mRNA vaccine technology inventor Dr. Robert Malone. According to investigative journalist Kanekoa The Great, Malone reposting the presentation led him to be permanently banned from Twitter.\n\nFirst, the group pointed out how Pfizer had inadequate control groups in the trial. The said trial deliberately excluded those with natural immunity, which led Kanekoa to remark: “It is very telling that Pfizer did not want to compare the safety and efficacy of [its COVID-19] vaccines to natural immunity.”\n\nThe group remarked that Pfizer only observed two groups – those unexposed and injected with the vaccine and those unexposed and unvaccinated. Two control groups should have been included – those exposed and vaccinated, and those exposed and un-injected – so that the vaccine could have been compared to natural immunity.\n\nMoreover, Kanekoa mentioned that Pfizer “introduced a high level of subjectivity by leaving it up to the discretion of the investigators whether to test participants for COVID-19 or not.” The investigative journalist cited the CCCA’s presentation stating that the New York-based drug giant told investigators to test only those with a COVID-19 symptoms. The study investigators were then allowed to use their discretion to decide what those symptoms were.\n\n“This means that asymptomatic infection would be missed and a high level of subjectivity was introduced to the study. An investigator had the ability to sway the results. The lack of objective, systematic testing makes results unreliable.” (Related: Pfizer appears to have committed fraud, and if it can be proven in court then the company will be liable for ALL injuries and deaths caused by its covid vaccines.)\n\nAside from the rigged method of testing, the Pfizer clinical trial studies – which were used as a basis for granting the injections an emergency use approval (EUA) – were filled with conflicts of interest.\n\nThe CCCA mentioned that Dr. Eric Rubin serves as the editor-in-chief of the New England Journal of Medicine (NEJM), the journal that published Pfizer’s trial reports. Rubin is also a member of the U.S. Food and Drug Administration‘s Vaccines and Related Biologic Products Advisory Committee. He voted in favor of approving the injections for children aged between five and 11 years old.\n\n“We’re never going to learn about how safe this vaccine is unless we start giving it. That’s just the way it goes,” he said. “I do think we should vote to approve it.”\n\nRubin was not the only individual involved that had a conflict of interest. The CCCA pointed out that two executives of the German company BioNTech – Pfizer’s partner in developing its mRNA COVID-19 vaccine – were the authors of the study that looked at the vaccine six months after injection. BioNTech CEO Dr. Ugur Sahin and BioNTech Chief Medical Officer Dr. Ozlem Tureci, who are married to each other, saw their stock value increase by $9 billion due to the COVID-19 vaccines.\n\nAside from Sahin and Tureci, the other researchers involved in the study were ” either employed by Pfizer, own stock in Pfizer, have gotten grants from Pfizer, have been hired as consultants by Pfizer, or have run clinical trials for Pfizer.” Only five authors did not have conflicts of interest, and none of them were named as main authors.\n\n“Pfizer is making more than $33.5 billion from their COVID-19 vaccines in 2021 alone. Their agenda is their shareholders, and their bottom line is not public health,” Kanekoa said.\n\n“Over the years, Pfizer has been found to have engaged in many criminal activities. They have paid billions in fines and settlements for their repeated criminal actions over the last few decades.”\n\nWatch this clip of whistleblower Brook Jackson, who exposed data integrity issues in Pfizer’s COVID-19 vaccine trial.\n\nThis video is from the Suzie Etc- Search for Truth channel on Brighteon.com.\n\nFASCISM IN ACTION: Multiple FDA committee members who green-lighted Pfizer “vaccines” for children have financial ties to Pfizer.\n\nConflict of interest: PR firm representing Moderna and Pfizer is also working with the CDC to push vaccine propaganda.\n\nConflict of interest: Two Pfizer directors have links to mainstream media, Big Tech.", "opengraph": {"title": "NEVER FORGET: Pfizer’s rigged 2020 COVID-19 vaccine trials… riddled with conflicts of interest", "type": "article", "url": "https://www.vaccines.news/2023-02-16-pfizer-rigged-vaccine-trial-conflict-of-interest.html", "site_name": "Vaccines News", "description": "Pfizer’s rigged 2020 trial of its Wuhan coronavirus (COVID-19) vaccine was riddled with conflicts of interest, according to the Canadian COVID Care Alliance (CCCA). The CCCA presented its analysis in a December 2021 presentation reposted by mRNA vaccine technology inventor Dr. Robert Malone. According to investigative journalist Kanekoa The Great, Malone reposting the presentation led […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2023/02/Covid-19-Coronavirus-Pfizer-Vaccine-Vials.jpg"}, "tags": ["pandemic", "Big Pharma", "deception", "Pfizer", "biased", "covid-19", "Eric Rubin", "science deception", "subjectivity", "vaccine", "Wuhan coronavirus", "science fraud", "BioNTech", "Ugur Sahin", "rigged", "Ozlem Tureci", "Clinical trials", "conflicts of interest", "pharmaceutical fraud"], "tweets": [], "movies": [], "links": ["https://kanekoa.substack.com/p/the-powerful-pfizer-presentation", "https://www.naturalnews.com/2022-05-13-pfizer-fraud-liable-injuries-deaths-covid-vaccines.html", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "//bigpharmanews.com", "https://www.brighteon.com/a433c61d-2553-44bd-9e01-dc040e9a98e6", "https://www.brighteon.com/channels/suzieetc", "https://fda.news/2021-11-01-fascism-fda-committee-members-financial-ties-pfizer.html", "https://bigpharmanews.com/2022-10-18-pr-moderna-pfizer-cdc-vaccine-communications.html", "https://biased.news/2021-12-08-pfizer-directors-have-links-to-mainstream-media.html", "https://kanekoa.substack.com/p/the-powerful-pfizer-presentation", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "https://www.brighteon.com/a433c61d-2553-44bd-9e01-dc040e9a98e6", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2023-02-16-pfizer-rigged-vaccine-trial-conflict-of-interest.html&linkname=NEVER%20FORGET%3A%20Pfizer%E2%80%99s%20rigged%202020%20COVID-19%20vaccine%20trials%E2%80%A6%20riddled%20with%20conflicts%20of%20interest", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}