{"result_id": "327022", "URL": "https://www.vaccines.news/2022-08-09-costa-rican-president-scraps-covid-vaccine-mandate.html", "timestamp": "2023-04-25 17:49:40 CEST+0200", "meta": {"description": "The president of the Central American nation of Costa Rica scrapped the country’s Wuhan coronavirus (COVID-19) vaccine mandate, noting that forcing the shot on Costa Ricans was “against the law.” “As of today, the vaccines are not mandatory – and therefore, any action taken against anyone who does not want to be vaccinated is an action that […]", "lang": "en", "keywords": "awakening,badhealth,badmedicine,big government,Costa Rica,covid-19,freedom,health freedom,Jocelyn Chacon Madrigal,Liberty,medical fascism,medical martial law,Medical Tyranny,pandemic,progress,Rodrigo Chaves Robles,vaccine,vaccine mandates,vaccine wars", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.vaccines.news/2022-08-09-costa-rican-president-scraps-covid-vaccine-mandate.html", "encoding": "UTF-8"}, "image": null, "domain": "www.vaccines.news", "title": "Costa Rican president scraps COVID vaccine mandate, says forcing the clot shot on people “against the law”", "cleaned_text": "Costa Rican president scraps COVID vaccine mandate, says forcing the clot shot on people “against the law”\n\nThe president of the Central American nation of Costa Rica scrapped the country’s Wuhan coronavirus (COVID-19) vaccine mandate, noting that forcing the shot on Costa Ricans was “against the law.”\n\n“As of today, the vaccines are not mandatory – and therefore, any action taken against anyone who does not want to be vaccinated is an action that is against the law,” said newly elected Costa Rican President Rodrigo Chaves Robles during an Aug. 3 press conference.\n\nChaves is vaccinated against COVID-19, but has maintained his position that “people have freedom of choice.”\n\n“As I said during my campaign: Costa Rica’s people are not cattle that you beat with a piece of wood and force to get vaccinated,” said the president, who was elected in April. (Related: Vaccine mandate in Ecuador province defeated by health freedom organization.)\n\nAccording to the newly elected leader, the country’s vaccine mandate put in place before he assumed power was “contrary to international standards.” To back up his claim, he cited an April 2021 statement from the World Health Organization (WHO) that denounced vaccine mandates.\n\nThe April 13 WHO statement said compulsory vaccination policies “interfere with freedom and individual autonomy” and called for policymakers to “balance the well-being of the community with individual liberties.”\n\n“‘Mandatory vaccination’ policies limit individual choice in non-trivial ways by making vaccination a condition of, for example, attending school or working in particular industries or settings like health care.”\n\nFormer Costa Rican President Carlos Alvarado Quesada announced nationwide vaccine mandates back in 2021, first with public-sector employees having an Oct. 15 deadline to get vaccinated. The mandate was subsequently expanded, with proof of vaccination becoming mandatory to join certain activities and enter many establishments in the country beginning Dec. 1.\n\n“We have to give time for the people who remain to get their two vaccines,” he said. “As of Dec. 1, there will be no excuse.”\n\nAlvarado later touted this achievement during his final speech in May 2022. He claimed that Costa Rica was among “a select group of countries in the world that has more than 85 percent of its population vaccinated with at least one dose.”\n\nChaves: Vaccine mandates in Costa Rica “invalid” as policymakers’ terms already expired\n\nChaves further slammed his predecessor’s COVID-19 vaccines as violation of Costa Rican law.\n\nHe pointed out that the members of the Central American nation’s National Vaccination and Epidemiology Commission (CNVE) were functioning under expired terms. When Chaves and his new administration took office, they realized that the commissioners’ terms “officially ended in 2020.” This, he added, officially rendered all of their actions after their term expired – including mandating the COVID-19 vaccine – invalid.\n\n“When told this, [the CNVE members] all got quiet. They said nobody had told them their terms had ended, and nobody questioned this until the minister here investigated,” the president continued, pointing to Health Minister Jocelyn Chacon Madrigal.\n\nAccording to Chaves, he asked Chacon to suspend the vaccine mandates “given the illegal actions taken by the CNVE.” He clarified, however, that the country kept doses of the COVID-19 vaccine “available for those who, in the exercise of their liberty, desire to be vaccinated.”\n\nChacon, who was also present during Chaves’ Aug. 3 press conference, shot down accusations that the new administration is “anti-vaccination.” She added that members of new cabinet were “up to date” with their vaccination.\n\n“There are countries which do not mandate, and have higher rates of vaccination. Why? Because people do not want to be ordered. They prefer to have things explained,” remarked Chacon.\n\nWatch InfoWars founder Alex Jones explain why U.S. President Joe Biden’s COVID-19 vaccine mandate is illegal.\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nNYC ends vaccine mandate for retail customers – but not for employees.\n\nHochul drops covid vaccine mandate for MTA after workers quit in protest.\n\nOut of the blue, Washington, D.C., suddenly drops covid “vaccine” mandate.", "opengraph": {"title": "Costa Rican president scraps COVID vaccine mandate, says forcing the clot shot on people “against the law”", "type": "article", "url": "https://www.vaccines.news/2022-08-09-costa-rican-president-scraps-covid-vaccine-mandate.html", "site_name": "Vaccines News", "description": "The president of the Central American nation of Costa Rica scrapped the country’s Wuhan coronavirus (COVID-19) vaccine mandate, noting that forcing the shot on Costa Ricans was “against the law.” “As of today, the vaccines are not mandatory – and therefore, any action taken against anyone who does not want to be vaccinated is an action that […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2022/08/Covid-19-Coronavirus-Vaccine-Bulk-Vials.jpg"}, "tags": ["pandemic", "big government", "Costa Rica", "covid-19", "Liberty", "medical fascism", "vaccine wars", "vaccine", "Rodrigo Chaves Robles", "progress", "vaccine mandates", "Medical Tyranny", "awakening", "freedom", "health freedom", "medical martial law", "Jocelyn Chacon Madrigal"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/our-people-are-not-cattle-president-of-costa-rica-abolishes-covid-vaccine-mandate/", "https://naturalnews.com/2021-08-28-vaccine-mandate-ecuador-defeated-health-freedom-organization.html", "https://apps.who.int/iris/bitstream/handle/10665/340841/WHO-2019-nCoV-Policy-brief-Mandatory-vaccination-2021.1-eng.pdf", "https://ticotimes.net/2021/10/13/costa-ricas-coronavirus-measures-vaccine-mandates-for-october-2021-updated", "https://healthfreedom.news", "https://www.brighteon.com/07c13854-f13e-4945-b670-6c20731d3ec8", "https://www.brighteon.com/channels/infowarsnetwork", "https://healthfreedom.news/2022-06-27-austrian-government-drops-covid-vaccine-mandate.html", "https://healthfreedom.news/2022-06-27-austrian-government-drops-covid-vaccine-mandate.html", "https://vaccines.news/2022-03-02-nyc-ends-indoor-vaccine-mandate-for-customers.html", "https://healthfreedom.news/2022-01-03-hochul-drops-covid-vaccine-mandate-mta-protest.html", "https://pandemic.news/2022-02-14-washington-dc-suddenly-drops-covid-vaccine-mandate.html", "https://www.lifesitenews.com/news/our-people-are-not-cattle-president-of-costa-rica-abolishes-covid-vaccine-mandate/", "https://apps.who.int/iris/bitstream/handle/10665/340841/WHO-2019-nCoV-Policy-brief-Mandatory-vaccination-2021.1-eng.pdf", "https://ticotimes.net/2021/10/13/costa-ricas-coronavirus-measures-vaccine-mandates-for-october-2021-updated", "https://www.brighteon.com/07c13854-f13e-4945-b670-6c20731d3ec8", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2022-08-09-costa-rican-president-scraps-covid-vaccine-mandate.html&linkname=Costa%20Rican%20president%20scraps%20COVID%20vaccine%20mandate%2C%20says%20forcing%20the%20clot%20shot%20on%20people%20%E2%80%9Cagainst%20the%20law%E2%80%9D", "https://www.addtoany.com/share", "https://www.brighteon.tv", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}