{"result_id": "327017", "URL": "https://vaccines.news/2023-02-17-paul-offit-now-says-covid-boosters-unneeded.html", "timestamp": "2023-04-25 17:49:36 CEST+0200", "meta": {"description": "Pro-vax fanatic Dr. Paul “CHOP” Offit, inventor of one of the world’s most deadly vaccines, the RotaTeq Rotavirus jab, is now anti-vax, according to the dictionary definition of the term. One of the top leaders of the every-vaccine-is-safe-and-effective cult, Offit is now opposed to Wuhan flu “booster” shots, recognizing how ineffective they are at fighting […]", "lang": "en", "keywords": "antiscience,antivaccine,antivax,badhealth,badmedicine,badscience,Big Pharma,boosters,CHOP,Dangerous Medicine,deadly vaccines,Dr. Paul Offit,FDA,Paul Offit,pharma fraud,rotairus,rotateq,spike proteins,toxic boosters,vaccine death,vaccine injury,vaccine pimp", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://vaccines.news/2023-02-17-paul-offit-now-says-covid-boosters-unneeded.html", "encoding": "UTF-8"}, "image": null, "domain": "vaccines.news", "title": "Vaccine pusher Paul Offit now says boosters are no longer needed, so will he be labeled “anti-vax” and “anti-science?”", "cleaned_text": "Vaccine pusher Paul Offit now says boosters are no longer needed, so will he be labeled “anti-vax” and “anti-science?”\n\nPro-vax fanatic Dr. Paul “CHOP” Offit, inventor of one of the world’s most deadly vaccines, the RotaTeq Rotavirus jab, is now anti-vax, according to the dictionary definition of the term. One of the top leaders of the every-vaccine-is-safe-and-effective cult, Offit is now opposed to Wuhan flu “booster” shots, recognizing how ineffective they are at fighting off the new mutant variants of the lab-made “gain of function” Fauci flu. What a turn of events this has turned out to be, thanks to the highly ineffective Covid booster stabs. This is the same shill and vaccine orator who once said he could get 10,000 vaccines at once and be just fine.\n\nDr. Paul “CHOP” Offit (nickname comes from his employment at Children’s Hospital of Philadelphia), who created the intestine-twisting RotaTeq rotavirus vaccine, that contains two deadly strains of a pig virus called circovirus, suddenly doesn’t support a gene therapy injection that causes auto-immune disorders, vascular clots, myocarditis, and pericarditis. How ironic. Maybe he’s angry he didn’t think of it himself, and that he didn’t patent it himself, so he’s not making a fortune from its sales.\n\n“Every Child by Two” vaccine proponent Paul Offit is now anti-vax and anti-science because he’s not promoting Covid boosters\n\nMainstream media and the vaccine industrial complex (VIC) are always pinning labels on anyone opposed to getting jabbed with known neurotoxins, mercury, spike proteins, and the like, so now it’s only appropriate to pin those same labels on one of their own, mister Paul Offit himself.\n\nIn 2008, Offit received hundreds of thousands of dollars in funding from Big Pharma for pushing the program “Every Child by Two,” which meant every infant needed to get at least 30 or more toxic jabs before reaching two years of age in order to survive all the world’s infectious diseases, it was deemed. Offit advised the CDC at the time on immunization practices, and now he advises the FDA on the same. Go figure.\n\nNow, for some strange reason (other than the fact that boosters are like death sentences for children, infants, and babies in the womb), Offit has turned “anti-vax” and “anti-science” regarding the Covid booster stabs.\n\nEven though Dr. Paul Offit once claimed a baby can get 10,000 vaccines at once and be just fine, now he’s opposed to the Covid boosters\n\nWhat gives? If you know Paul Offit’s history of promoting every single deadly jab in the world as “safe and effective,” you may be shaking your head right now as to why he is bucking the jab system and saying the Fauci Flu jabs are useless. This pro-vax freak is a multi-millionaire from crafting, marketing, promoting, and selling deadly vaccines his whole professional career, and now he’s speaking out against spike protein syndrome, saying it’s not good for children’s health?\n\nOffit writes, “On June 28, 2022, researchers from Pfizer–BioNTech and Moderna presented data on their bivalent vaccines to the FDA’s Vaccines and Related Biological Products Advisory Committee (of which I am a member),” … “The results were underwhelming.” He’s calls them “clinically insignificant.”\n\nScientific evidence now reveals that every subsequent booster someone gets renders their immune system WORSE OFF than it was previously. This is similar to people who have full-blown AIDS, so this is basically vaccine-induced AIDS. Wouldn’t that help Offit make more money at CHOP, treating children for all kinds of vaccine-induced trauma, like he does after they get the rotavirus jabs and suffer from twisted intestines and chronic diarrhea?\n\nOffit says the Covid boosters do not work as claimed. In fact, regulators have already determined that based on data, there is “no significant difference in neutralization of any SARS-CoV-2 variant” between the boosted and the non-boosted. Oops.\n\nOffit is still in love with the original mRNA stabs, though, so don’t be fooled by his latest head fake. For most Americans, the damage is done, and according to mRNA “technology,” spike protein syndrome will continue indefinitely, as people’s cells are now instructed to continue making the deadly prions and spreading them throughout the vascular system and vital organs, causing turbo cancer, vascular clots, heart problems, and SADS.\n\nBookmark Vaccines.news to your favorite independent websites for updates on experimental gene therapy injections the CDC and fake news claim are “safe and effective” when they’re really dangerous and health-damaging.", "opengraph": {"title": "Vaccine pusher Paul Offit now says boosters are no longer needed, so will he be labeled “anti-vax” and “anti-science?”", "type": "article", "url": "https://www.vaccines.news/2023-02-17-paul-offit-now-says-covid-boosters-unneeded.html", "site_name": "Vaccines News", "description": "Pro-vax fanatic Dr. Paul “CHOP” Offit, inventor of one of the world’s most deadly vaccines, the RotaTeq Rotavirus jab, is now anti-vax, according to the dictionary definition of the term. One of the top leaders of the every-vaccine-is-safe-and-effective cult, Offit is now opposed to Wuhan flu “booster” shots, recognizing how ineffective they are at fighting […]", "image": "https://www.vaccines.news/wp-content/uploads/sites/42/2023/02/Paul-Offit-1.jpg"}, "tags": ["antivax", "Dr. Paul Offit", "Big Pharma", "pharma fraud", "rotairus", "CHOP", "deadly vaccines", "FDA", "spike proteins", "vaccine pimp", "vaccine injury", "rotateq", "antiscience", "Paul Offit", "vaccine death", "antivaccine", "boosters", "toxic boosters"], "tweets": [], "movies": [], "links": ["//www.truthwiki.org/paul-offit/", "https://www.naturalnews.com/2023-01-26-paul-offit-letter-nejm-end-covid-boosters.html", "https://naturalnews.com/2022-11-15-t-cell-lymphoma-progress-rapidly-mrna-booster-shot.html", "https://www.naturalnews.com/2022-01-29-rubbery-blood-clots-in-bodies-of-vaccinated.html", "https://www.naturalnews.com/2022-11-16-dr-tenpenny-warns-death-tsunami-covid-vaccines.html", "https://www.vaccines.news/2021-12-04-top-8-most-common-serious-adverse-reactions-covid-vaccines.html", "https://www.pandemic.news/2021-03-04-who-insider-exposes-gavi-gates-perpetrating-plandemic.html", "https://www.naturalnews.com/2023-01-26-paul-offit-letter-nejm-end-covid-boosters.html", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "//www.truthwiki.org/paul-offit/", "//www.addtoany.com/add_to/google_plus?linkurl=https://www.vaccines.news/2023-02-17-paul-offit-now-says-covid-boosters-unneeded.html&linkname=Vaccine%20pusher%20Paul%20Offit%20now%20says%20boosters%20are%20no%20longer%20needed%2C%20so%20will%20he%20be%20labeled%20%E2%80%9Canti-vax%E2%80%9D%20and%20%E2%80%9Canti-science%3F%E2%80%9D", "https://www.addtoany.com/share", "https://www.brighteon.tv", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}