{"result_id": "328017", "URL": "http://vaccinepapers.org/about/", "timestamp": "2023-04-25 17:50:21 CEST+0200", "meta": {"description": "Science shows that vaccines cause brain damage. VaccinePapers.org uses peer-reviewed science to report the truth about vaccine dangers.", "lang": "en", "keywords": "", "favicon": "http://vaccinepapers.org/wp-content/uploads/vp-favicon-60.png", "canonical": "https://vaccinepapers.org/about/", "encoding": "utf-8"}, "image": null, "domain": "vaccinepapers.org", "title": "Objective, science-based analysis of vaccine dangers", "cleaned_text": "Vaccine Papers Is Anonymous\n\n This blog is anonymous for these reasons:\n\n 1) To avoid nasty “ad hominem” personal attacks and internet harassment.\n\n 2) To focus attention where it belongs: the science. Our goal is to encourage people to look at the scientific evidence for themselves, and anonymity furthers that goal.\n\n 3) “Argument by authority” is not respected here. What matters is the science, and nothing else.\n\nThe Emerging Scientific Story of Vaccine Injury\n\n In recent years, powerful scientific evidence has emerged indicating that vaccines cause brain injury such as autism, epilepsy, schizophrenia, depression, attention-deficit disorder and other mental illnesses. This scientific evidence has been largely ignored by the media, and by medical institutions that are supposedly guided by science.\n\nVaccinepapers.org provides detailed, science-based and objective information about the dangers of vaccines. We are most concerned about aluminum adjuvant toxicity and immune activation-mediated brain injury. Vaccinepapers.org is the first to make this hugely important scientific research accessible to the public.\n\nAluminum Adjuvant Toxicity\n\n It is now known that aluminum adjuvants are not safely eliminated from the body, as assumed by vaccine advocates. Rather, they are taken up by immune system cells (macrophages) and transported around the body, including into the brain. Aluminum adjuvant can cause brain injury and autoimmune diseases.\n\nImmune Activation Brain Injury\n\n Human brain development is controlled by immune-system signals (i.e. “cytokines”). Activation of the immune system during brain development causes disruptions in these signals, resulting in permanent brain injury. The injury manifests as autism, schizophrenia and other mental illnesses. Adverse vaccine reactions are proven to stimulate a cytokine (interleukin-6) proven to cause autism. There is a large amount of research on this, by many laboratories around the world, but the connection to vaccines is being overlooked.\n\n \n\n Aluminum and Immune Activation\n\n Aluminum and immune activation are connected, because aluminum triggers immune activation, and interleukin-6 specifically. Aluminum stimulates IL-6 in the brain. Aluminum also stimulates Th2 activation, a type of immune activation shown to impair brain development in animal studies. So the issues of aluminum adjuvant toxicity and immune activation are connected.\n\nOur perspective:\n\n Like any other medical treatment, vaccination must be justified in view of an objective risk/benefit analysis. All risks and benefits must be considered. Any rational medical treatment must do more good than harm. This is universally accepted.\n\nThe problem with vaccines is that risks have been underestimated, and the benefits overestimated. In particular, the risk of brain injury from vaccines is much higher than commonly believed. Brain injury can be devastating to the life of a child, and the child’s family. The personal and financial costs of vaccine injury are often enormous. Therefore, even a small risk of brain injury must be considered seriously. And the science strongly suggests that the risk is not small.\n\nVaccinepapers.org is not ideologically opposed to all vaccines, but we are unaware of any specific vaccine that has an acceptable level of proven safety, especially for infants, and especially if it contains aluminum adjuvant. However, some vaccines may be worth the risk for some people in some situations. The risk of a vaccine depends greatly on the adjuvant (type and amount), the type and magnitude of immune activation it stimulates, the presence of other substances (e.g. antigens with allergenic potential), and the susceptibilities and health history of the recipient. There is not nearly enough science available to accurately estimate these contributors to risk.\n\nHowever, we do not make recommendations regarding specific vaccines. We urge careful consideration of the risk of serious and permanent harm, including disabling brain injury, long-term immune disorders and death. Determining which vaccines, if any, are worth the risk is a decision left to the reader.\n\nUs and Them \n\n We denounce the personal attacks, insults and harassment pursued by some in the vaccine debate (on all sides). We do not do this. We ask critics of Vaccinepapers to be respectful and not engage in this behavior.\n\nWe assume that both sides in this debate share the same goal: a medical system that maximizes health. We do not demonize people of the opposition as monsters intending to harm (however, pharmaceutical companies appear to have deeply disturbing motivations, since they profit greatly from chronic illnesses).\n\nThe vaccine debate has been in the gutter for far too long. There are important issues raised by recent scientific findings that deserve consideration. Society will benefit the most from a rational, polite debate about them. We seek to positively contribute to this debate.\n\n\n\n Why should I not trust the advice given by the majority of health care professionals in the world when it comes to something as important as preventing highly contagious and possibly deadly diseases?\n\n Two reasons:\n\n1) Because medical science is the most corrupt of the sciences. It is extremely corrupt. Big pharma companies pay to have fake scientific papers written and published. Big pharma funds the medical science journals with advertising and reprint fees. Big pharma influences research and curriculum at medical schools. Big pharma pays for speaking fees and accommodations at medical-scientific conferences. Big pharma funds most medical research. So, the people selling the treatments are the ones that have the most influence over the direction of medicine: what ideas are acceptable and supported, and what ideas are neglected and discarded. And anything that doesn’t make them money (i.e. that’s non-patentable) is neglected, or denounced.\n\n2) Medicine has a blind spot when it comes to iatrogenic (doctor-caused) diseases and damage. It’s psychologically distressing for doctors to be confronted with evidence that they have caused great harm to patients. Its difficult for orthodox medicine to objectively consider the science because they face the blame for the epidemic of vaccine injury. This creates a powerful incentive to believe vaccines are safe. Accordingly, orthodox medicine engages in motivated reasoning on the subject of vaccine injury. Combine corruption with the motivated reasoning, and the result is a medical system that makes incredibly bad decisions and harms millions of people.\n\nAn example of the hostility doctors display in response to discoveries of doctor-caused diseases is the story of Dr. Semmelweis. In the 1840s, he discovered that doctors were causing deadly infections in women by delivering babies with dirty hands. Doctors would go back and forth between the morgue and the delivery room without washing. Semmelweis proved that it was the unclean doctors causing the deaths, which they did not appreciate. Semmelweis’s discovery blamed his colleagues for killing people. Instead of being praised and rewarded for his important discovery, Semmelweis was ridiculed, viciously attacked and hounded out of medicine. And all Semmelweis was trying to do was convince other doctors to wash their hands! It took about 20 years until Semmelweis’s recommendations were in widespread use.\n\nAre you saying that doctors and medical professionals don’t look at the science? If so, why?\n\n Correct. They don’t. Doctors and public health people spend little time reading the literature for themselves. They foolishly trust the CDC and industry-funded trade groups to interpret the science and make recommendations for them, which they follow. The vaccine industry writes the vaccine recommendations. Doctors and most medical professionals are not independent thinkers. They don’t have the time or interest. Most simply follow the conventional recommendations and don’t question them. But what if the conventional recommendations are wrong? Medical consensus has been wrong many times in the past.\n\nWhy should I trust you? You guys are just doing this for the money!\n\n Vaccinepapers.org makes no money, and never will. Vaccinepapers.org is strictly non-commercial. We have no advertising. We do not sell or recommend any products. We do not have affiliate agreements or any commercial relationship with any business or website. We do not link to any commercial websites (we only link to a few scientific journals). We do not receive any financial or other support from any anti-vaccine organizations, or anyone.\n\nThe vaccinepapers.org project is motivated purely by concern about widespread health damage from the overuse of vaccines. The media and medical establishment are blatantly lying about what science is discovering about the dangers of vaccines. Our goal is to explain the science and make it accessible, so people can see for themselves how the media, pharmaceutical industry and medical establishment are deceiving the public.\n\nWhy don’t you publish a peer-reviewed paper on your theory that vaccines cause autism via immune activation?\n\n Because it would be ignored. As the content here demonstrates, there are lots of important scientific papers that disappear in the science journals. Whats needed today is an explanation of the science for intelligent non-specialists, showing how the scientific results fit together to tell a story. We reach a much larger audience this way. Also, a blog allows instant updating as the science progresses. And a blog can include a diversity of topics and connect them in ways impossible to do in a scientific paper.\n\nWho are you guys? Why don’t you say who you are? How can we trust you if we don’t know who you are?\n\n Because it really doesn’t matter, unless you are in the habit of judging ideas by where they come from, instead of by the scientific evidence.\n\n\n\nVaccine advocates are addicted to the lazy, intellectually vapid practice of “argument by authority”. For them, all that’s required to answer the questions of vaccine dangers is to assert the CDC, WHO, and AAP as “authorities” and parrot what they say. It’s so easy! No need to look at the science, or think for yourself, according to vaccine advocates. This is absolutely foolish.\n\nScientific ideas and opinions must be judged by the evidence, not according to whether the source is perceived as an “authority”. All that really matters is the science and the evidence. To determine if VP is trustworthy, all you have to do is consider the opinions on these pages in view of what the science says. Then do the same for the CDC, WHO, AAP and other so-called “authorities”.\n\nSo don’t take our word for the claims made here. Read the scientific evidence for yourself.\n\nTwo of the most accomplished scientists of the 20th century advocate this approach. Feynman and Einstein suggest that elevating authority over evidence is hostile to science:\n\n“Science is the belief in the ignorance of experts.” –Richard Feynman\n\n“Unthinking respect for authority is the greatest enemy of truth.”–Albert Einstein\n\nAdditionally, we remain anonymous to avoid nasty “ad hominem” personal attacks and internet harassment. Unfortunately, such tactics are commonplace in the vaccine debate. There are considerable personal and professional risks in being associated with vaccine criticism. By remaining anonymous, attention is focused on where it belongs: the science. Our goal is to encourage people to look at the scientific evidence for themselves, and remaining anonymous furthers that goal.\n\nWe intend to go public in the not-distant future.\n\nWe invite vaccine defenders to find flaws in our arguments and write about them, here or anywhere. Have a go at it, Orac, Skeptical Raptor, Steve Novella and Science Based Medicine!", "opengraph": {"locale": "en_US", "type": "article", "title": "Objective, science-based analysis of vaccine dangers", "description": "Science shows that vaccines cause brain damage. VaccinePapers.org uses peer-reviewed science to report the truth about vaccine dangers.", "url": "https://vaccinepapers.org/about/", "site_name": "vaccinepapers.org", "article:modified_time": "2017-01-12T10:19:09+00:00", "image": "https://vaccinepapers.org/wp-content/uploads/Immune-lesions.jpg", "image:width": "332", "image:height": "352", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/pinterest?linkurl=http%3A%2F%2Fvaccinepapers.org%2Fabout%2F&linkname=About", "https://www.addtoany.com/add_to/reddit?linkurl=http%3A%2F%2Fvaccinepapers.org%2Fabout%2F&linkname=About", "https://www.addtoany.com/share", "http://vaccinepapers.org/aluminum/", "http://nordic.cochrane.org/nordic-cochrane-centre-copenhagen"], "authors": [], "publish_date": null}