{"result_id": "329011", "URL": "https://vrevealed.com/about", "timestamp": "2023-04-25 17:51:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.cdn1.vrevealed.com/assets/images/favicons/favicon.ico", "canonical": "https://vrevealed.com/about", "encoding": "utf-8"}, "image": null, "domain": "vrevealed.com", "title": "Vaccinnes Revealed | About", "cleaned_text": "What's the vision behind vaccines revealed you ask?\n\nThere is no individual right superior to having domain over what substances may enter one’s body and no greater parental right than to determine what substances are introduced into the bodies of their children.\n\nPremise 1: When it comes to vaccine risk, the only debate is the degree of risk that vaccines pose.\n\nPremise 2: When it comes to vaccine risk, the only debate is the degree of risk that vaccines pose.\n\nConclusion Therefore, without government compulsion or intervention, parents should have the right to choose what, if any vaccines their children should receive and individuals should have the right to determine if they wish to be vaccinated.\n\nThere is an urgent cultural problem where there exists extreme conflict, contention and confusion regarding one of the most significant and controversial health debates of our day, forced vaccination. This has resulted in an unacceptable situation where government regulators have violated the rights of parents in deciding whether or not they want to inject vaccine substances into their children.\n\nFurther, the rights of health care professionals to speak freely regarding their views of vaccines have been trampled on with the threat of ridicule, censure and de-licensure. Additionally, workers are being forced by their employers to subject themselves to vaccines and the media has attacked anyone who questions today’s compulsory use of vaccines.\n\nVaccines Revealed exists to be a beacon of light that shines uninhibited truth on this critical subject. By aggregating the world’s leading experts on vaccines into a global forum where unbiased knowledge can be freely shared, we endeavor to be a resource for millions of enlightened parents and concerned people worldwide who wish to evaluate this topic and form an independent opinion from which they can act in their own interest.\n\nDr. Patrick Gentempo is the founder and CEO of Action Potential Holdings, Inc. He is a well-known and respected star in the world of health, wellness and business. While practicing as a chiropractor, he co-developed innovative diagnostic technologies, received multiple patents and built a considerable international business which he led as CEO for over 20 years. Academically, Dr. Gentempo is on the post-graduate faculty of multiple chiropractic institutions and has been published numerous times in peer-reviewed and popular journals. Dr. Gentempo successfully exited his diagnostic technology business in 2011 to form Action Potential Holdings, Inc. He recently presented one of this signature lectures, “Unleashing the Power of Philosophy in Business” for Entrepreneur Organization (EO) and for the Freedom Fest convention in Las Vegas. Some of his unique business views have been published by Forbes. Jeff Hays is a filmmaker and a serial entrepreneur. He began making films back in the late nineties. He is most known for Fahrenhype 9/11 (2004), a response to Michael Moore’s Fahrenheit 9/11, and On Native Soil (2006), a documentary focusing on the passionate demand of the surviving family members of 9/11 victims, for an official investigation into the 9/11 attacks. This documentary, which was narrated by Kevin Costner and Hillary Swank was short-listed for an Academy Award. Hays’ most recent health documentary projects, were “Bought”, “Doctored” and“Undoctored”. Hays explains, “In recent years my eyes have been opened to alternative healthcare options. The immediate increase in health I experienced personally after starting down this road is something I’ve just got to share with people.” Hays was commissioned by Patrick Byrne, of Overstock.com to produce a film about the 2016 elections and candidates. This film, “Rigged 2016” was released in November 2016 A pet project is mycrowdfunding.com, where Hays teaches filmmakers and entrepreneurs how to create successful donor crowdfunding projects based on his 7-figure success in crowdfunding. Hays lives in the mountains of Utah with his dog Abby and works from his office in NY. He’s the father of 9, and grandfather of 12, with new one’s arriving annually…", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}