{"result_id": "329024", "URL": "https://vrevealed.com/covid/flash-sale/", "timestamp": "2023-04-25 17:51:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.cdn1.vrevealed.com/assets/images/covid/favicon.png", "canonical": "https://vrevealed.com/covid/flash-sale/", "encoding": "utf-8"}, "image": null, "domain": "vrevealed.com", "title": "Vaccines Revealed COVID Edition | Order", "cleaned_text": "Thank you for your incredible support of Vaccines Revealed COVID Edition.\n\nYou are making a difference out there, but sometimes it’s hard to explain to someone else everything that you know.\n\nThat’s why we created this flash drive.\n\nAnd, this FLASH DRIVE flash sale really is a PLUS!\n\nWhat makes this truly special is we are including THE ENTIRE Vaccines Revealed COVID Edition Series on the jump drive.\n\n*PLUS* The Essential Guide To COVID.\n\n*PLUS* 2 Bonus Episodes.\n\nAnd, these flash drives are available to you at Never Before Seen pricing.\n\nThis information is censored and not allowed on YouTube, Google, Facebook, Instagram, and some email delivery providers.\n\nThis is the only way to get this crucial information to your family, friends and neighbors.\n\nThis whole docuseries is available to you as a member on a special flash drive at huge discounts because we need to work together to get this into people’s hands.\n\nWhether you want the entire series for yourself, or, you're ready to get the information in the hands of family and loved ones... we know you are anxious to get all of the episodes for the best price possible.\n\nSo, with that in mind, we present the VRCE Flash Drive: a tiny, convenient package that’s loaded with everything you need.\n\nNever before released, not available with any other offer.\n\nJust stick in any USB port, (*including a SMART TV) click on a video, and watch—it’s that easy!\n\nBut Only for a limited time.... so hurry! We don't want you to miss out!", "opengraph": {"image": "https://vrevealed.com/assets/images/covid/vaccine.png", "title": "Vaccines Revealed COVID Edition | Order", "description": "Big Pharma REALLY doesn't want this to get out. They are going to Extreme Measures to keep this cover-up going and continue their life-threatening disinformation campaign.", "url": "https://vrevealed.comhttps://assets.cdn1.vrevealed.com/assets/covid/"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}