{"result_id": "329002", "URL": "https://vrevealed.com/c19/ebook/dr-speaks-out", "timestamp": "2023-04-25 17:51:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://assets.cdn1.vrevealed.com/assets/c19/images/cov-icon.png", "canonical": "https://vrevealed.com/c19/ebook/dr-speaks-out", "encoding": "utf-8"}, "image": null, "domain": "vrevealed.com", "title": "Covid Revealed - Dr Malone Speaks Out", "cleaned_text": "He invented the technology behind the COVID vaccine… so why did no one listen when he raised the alarm? Meet Dr. Robert Malone and get the truth behind mRNA vaccines straight from one of their creators. You’ll be shocked by what he has to say… Get the facts, straight from the source in this exclusive ebook!\n\nIn short… You’re being lied to. We pull back the curtains, and you get a front-row seat. Full transparency. That’s the only path forward as we expose the entire world to credible experts whose voices must be heard. There is much, much more to the COVID story than the mainstream media is allowing you to see. What is the real risk to you and your family? Can ‘they’ really assert that vaccines are “very safe”? Are all these shutdowns, mandates, and radical actions worth it? Is there a safer alternative than the vaccine? Is the vaccine controversy really over? Who’s controlling the WHO and the CDC? SIMPLY CLAIM YOUR SEAT TO WATCH THE ENTIRE SERIES - FOR FREE\n\n“stay home, stay safe”... for two weeks. Then we’ll return to normal. That was over two years ago. What changed? MORE mandates and restrictions. What has not been exposed is the unblemished truth. Instead, there’s greater censorship and suppression than any issue in history. Narratives have changed so fast you have chronic whiplash. Flip-flopping from one stance to another has been commonplace. Big Tech is now a puppet master. Mainstream media has driven their narrative exclusively. Anyone falling out of line is being canceled, fired, de-platformed, sued, harassed, and even had their lives threatened. You’ll no longer find them on Google, YouTube, Facebook, Instagram, or Twitter. It’s a new reality for doctors and even highly published medical experts. But they risk everything to share the critical truth with you.\n\n“Our FDA ... wrote a letter to not use hydroxychloroquine. We’ve been using it for 65 years. It wasn’t toxic last year!” Did you know the MMR vaccine vastly increased the rate of Autism? And no network would cover the story? “These products are both vaccine and gene therapy, and need tests done for both. That didn’t happen.” “I think it’s about two things: I think it’s about money and I think it’s about control. For example, Pfizer is projected to make 33 Billion Dollars this year off of their covid vaccine.” I’m seeing things I can’t believe are happening out there. The freedoms that I feel are being taken away from my family, my kids and my grandkids and everybody else. “Saying, ‘you should follow the science’ is ANTI-SCIENCE.” “I’m not anti-vax. I’m anti-THIS-vax. Do we know everything we need to know? NO. Results coming out of [the] UK should be a signpost to our profession.” “I need a cure that’s cheap, that’s accessible, that doesn’t need a doctor, that is available all over the planet. Truly, the only thing that meets all that criteria is Hydrogen Peroxide Nebulization.” “With covid, they are narcissistically abusing, manipulating, gaslighting, denying and trying to frame anyone who questions them as the villain. It’s the exact same playbook that I'd seen, growing up with my abusive father.” “They said, if you died with covid, you died from it. They did that to justify all these people walking around with [fake] positive PCR tests.” Just how many viruses are in your body, as you breathe? 1,000,000,000,000,000. The virome is simply the genetic database of life on earth.” “USA is 4.5% of world population, had more covid deaths than the rest of the world, combined.” “The elephant in the room: 411 deaths per million doses. That’s 150,000 deaths from Pfizer shots.” “I’m only going to see that which I choose to measure. Funny thing is, we picked a measurement device in this instance that was not specific to a pathogen.” “I predicted the day would come when we would not be allowed to function in society without having every recommended vaccine.” “The science was suppressed, specifically the relationship between the MMR timing and Autism in African-American males... They were destroying federal records at the same time.” “There are no treatments available.’ That was a catastrophic lie. For all of those players at CDC and NIH, they mislead the American People… 660,000 people, 85-90% of Americans who died could have been saved.” “When you go to the hospital for Covid: If you had an infection on your finger.. the new protocol was to chop off the arm... just watch you bleed out and then hope you can save yourself... and then blame the infection for killing you... That's what’s going on.” “The crux here is deception and manipulation to drive everyone to take the vaccine. If they can convince everyone to take the vaccine, there IS NO control group.” “'I wear my mask to show that I care.’ But, it doesn’t do anything. Alyssa Milano took a picture of herself saying she had her mask on. It was a knit mask that wouldn’t hold in pieces of food!” “Most of what we’re seeing is a great mask psy-op. Just look at what masks are doing to our children. Now, child psychological development is being damaged.” “If it’s not 90% relative risk reduction, it’s not good enough. Masks are only 5-15%, assuming a perfect fit and perfect seal.” “He controls the whole medical establishment, financially. Not just through political power but financial power. Fauci is the key person in this whole evil story of how we have mismanaged this pandemic.” “When your doctor says ‘it’s your age,’ he means he has no idea what’s wrong with you.” “Imagine a woman with breast cancer. Stage 1. Early. We tell her to go home. If it gets real bad and spreads, come back. That’s kind of the equivalent of what we’re doing with Covid19.” “I have daughters. I have tons of friends that have children. Now, they’re targeting children with something that has no evidence of working. They’re coming after our kids.” “The vaccines actually impair the human immune system … [to where] you cannot make interferon. So, no innate human response. You have to have that innate system for the antibody system to work.” “When you’re playing the Vikings at their home, and you’re behind and you give up a couple sacks, and you have to answer THOSE questions after, this is easy, compared to that!” “China and Russia. They’re not vaccinating their troops. It seems [our government] is willing to go through a 30-60% reduction of our military over this vaccine.” “Not working out, not exercising, not doing fundamental nutritional issues, doing the basics today, you have to pay the price tomorrow.”\n\nWAS IT ALL WORTH IT? The slide in education for school-aged children is devastating. The explosion in mental health issues is historic. The loss of jobs, businesses, savings, and wealth was greater than the Great Depression. TRILLIONS were spent to prop it all up. Was it all worth the dramatic and extreme actions? Hindsight gives us some clues, and it’s not pretty. Watch and learn the truth. The buried research. The secret agendas. The incomprehensible profits. The real loss of life and health. The most thorough group of medical experts, scientists, researchers, and advocates have been gathered in one place for one purpose: To Tell The Unfettered Truth. And we hope it spreads like wildfire. Will you join us?\n\nWith ever exploding censorship, COVID REVEALED exists to daringly bring to light the known facts and needed debate concerning COVID-19 as well as the policies and edicts that surround it. Agendas are being driven, it is no secret. We are taking a stand on transparency as we bring to light, to the entire world, interviews that help force a greater conversation for a practical and scientific way forward.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#upFrm", "#upFrm", "#upFrm"], "authors": [], "publish_date": null}