{"result_id": "330033", "URL": "https://vaccinesafety.info/2021/08/30/fact-check-no-links-found-between-vaccination-and-deaths-europe-news-and-current-affairs-from-around-the-continent-dw-15-03-2021/", "timestamp": "2023-04-25 17:51:44 CEST+0200", "meta": {"description": "With COVID-19 vaccine distribution underway around the world, all eyes are on the people who have already received their jabs.", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2021/08/30/fact-check-no-links-found-between-vaccination-and-deaths-europe-news-and-current-affairs-from-around-the-continent-dw-15-03-2021/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Fact check: No links found between vaccination and deaths | Europe | News and current affairs from around the continent | DW | 15.03.2021", "cleaned_text": "With COVID-19 vaccine distribution underway around the world, all eyes are on the people who have already received their jabs.\n\nFor people who don’t read past the headlines, a concerning narrative has appeared: “15 Deaths After Coronavirus Vaccination,” “Deaths at Care Home After Coronavirus Vaccine,” “Volunteer in Vaccine Trial Dies After COVID-19 Vaccine.”\n\nIn each case, there has been more to the story than meets the eye. DW reviewed reports from Italy, Austria, South Korea, Germany, Spain, the United States, Norway, Belgium and Peru, finding that in most cases health authorities have not found causal links between the vaccination and deaths.\n\nWhen this article was last updated on March 15, nearly 360 million vaccinations had been administered in more than 120 countries, according to Bloomberg’s global vaccine tracker. That’s about 9.25 million doses per day. Were any deaths reported in connection with the immunization drive? DW investigates.\n\nThe north Italian region of Piedmont, around Turin, has ordered the immediate suspension of a batch of the AstraZeneca vaccine during a probe into the death of a teacher a day after receiving his shot.\n\nThe news comes a few days after Italy had suspended another batch of the AstraZeneca vaccine for an investigation into the suspicious deaths of two men in Sicily following their jabs.\n\nThe regional government said in an online statement that the decision was precautionary, and officials are awaiting the results of an investigation into a connection between the deaths and the vaccinations.\n\nLuigi Genesio Icardi, head of regional health services, said: “It is an act of extreme prudence, while we verify whether there is a connection. There have been no critical issues with the administration of vaccines to date.”\n\nNews of a 49-year-old nurse dying from a bleeding disorder after receiving a coronavirus vaccination made headlines in Austria. Another woman reportedly died from a pulmonary embolism after receiving her jab. Austria’s Office for Safety in Health Care (BASG) ordered the remaining doses of the AstraZeneca batch in question to be discarded — even though officials found “no causal link between the vaccination” and the deaths.\n\nThe European Medicines Agency’s (EMA) Pharmacovigilance Risk Assessment Committee (PRAC) also states it sees “no indication that vaccination has caused these conditions, which are not listed as side effects with this vaccine.” PRAC further states that “information available so far indicates that the number of thromboembolic events in vaccinated people is no higher than that seen in the general population.”\n\nAs of March 10, 2021, 30 cases of thromboembolic events have been recorded among the 5 million people vaccinated with the AstraZeneca COVID-19 vaccine in the European Economic Area. PRAC says it will “continue its assessment of any potential issue with the batch as well as its review of thromboembolic events and related conditions.”\n\nSeveral days after the launch of South Korea’s immunization drive, the Korea Disease Control and Prevention Agency (KDCA) reported that two individuals had died after receiving coronavirus vaccinations. The South Korean agency subsequently launched an investigation.\n\nThe latest reports from March 12 indicate a total of 15 individuals died after receiving vaccinations. Said individuals were given the AstraZeneca vaccine, which is administered only to people under 65 in South Korea. Almost all of the deceased had preexisting medical conditions.\n\nThe eight deaths reported until March 6 have been examined by the KDCA. The agency’s deputy communications chief, Seung-ho Choi, told DW “we reached the preliminary conclusion that a connection between the vaccination side effects and deaths of these eight patients can be ruled out.”\n\nThe KDCA says it studied potential problems and anomalies linked to the vaccine administered to the eight patients in question. It also looked into the possibility of a serious allergic reaction, or anaphylaxis, that may have gone undetected following the vaccination.\n\nThe agency says both factors could be ruled out as causes of death. Most of the deceased in question suffered from preexisting medical conditions, such as cerebrovascular or cardiovascular diseases. These health issues, according to the KDCA, partially account for the deaths. Even so, the investigation is ongoing. Autopsies will be carried out on four of the eight deceased individuals. Additional investigations into the other deaths are ongoing in cooperation with local authorities.\n\nThe Paul Ehrlich Institute (PEI), which is in charge of vaccination in Germany, has been looking into 113 reported deaths in the country. In all these cases, those who died were aged between 46 and 100-years old and died between one hour and 19 days after receiving the vaccine. Of those 113, 20 died as a result of the COVID-19 infection (19 of them did not have full vaccination protection; the other case is still unclear). 43 people died as a result of pre-existing conditions or other infections, according to Brigitte Keller-Stanislawski, the head of the PEI’s department of safety for medical products.\n\n“Based on the data that we have, we assume that the patients died of their underlying disease — in a coincidental time with the vaccination,” she told German broadcaster n-tv. While she did not comment on individual cases, she said, “They were very seriously ill patients with many underlying diseases.”\n\n“If the elderly or people with severe pre-existing conditions are vaccinated, there will be a certain number of accidental deaths that occur shortly after vaccination, which cannot be causally associated with the vaccination. In its latest safety report, the Paul Ehrlich Institute highlights the cases of 20 vaccinated individuals who died in the setting of the COVID-19 disease.\n\nA press spokeswoman told DW via email that “all of them except one man had incomplete vaccination protection since the COVID-19 disease occurred after the first vaccination. Protection begins seven to 14 days after the second vaccination (depending on the vaccine) so it is possible to become ill and die from COVID-19 after receiving only the first dose. 33 Individuals with multiple pre-existing conditions are either suffering from the worsening of their underlying disease or from another disease independent of vaccination. Ten individuals died from another infectious disease, not COVID-19.”\n\n“In all other persons, there were in some cases multiple previous diseases such as carcinomas, renal insufficiency, heart diseases and arteriosclerotic changes, which were presumably the cause of death,” she added. In 50 cases, the cause of death remains unknown.\n\nAccording to calculations of the Paul-Ehrlich-Institut in this report, the deaths with an unclear cause reported by 31.01.2021 are not more frequent than the expected number of deaths.\n\nAccording to Ulrike Protzer, a virologist at the Technical University of Munich, the number of deaths after vaccination is below the expected number of deaths without vaccination. “If you make that comparison, it’s actually the case that fewer died after the vaccination than one would expect,” she told public broadcaster ARD.\n\nThe public prosecutor’s office is currently looking into another case of three elderly deceased people in Cologne. They died after being vaccinated, all three suffered from previous serious illnesses, according to Markus Rothschild, the director of the Cologne Institute of Forensic Medicine.\n\nIn an interview with DW in January, PEI President Klaus Cichutek, said the BioNTech-Pfizer and Moderna vaccines currently being used in Germany offer a high degree of safety and protection.\n\nSpain: ‘At least seven die at care home after getting Pfizer COVID-19 jab’\n\nSpanish media report that nine people died in a Spanish care home after receiving the first dose of the BioNTech-Pfizer vaccination, all of whom had previous illnesses.\n\nThe director of the El Salvador residence for the elderly in Lagartera said symptoms “such as headaches or occasional diarrhea” started showing in residents after five days and a doctor told him these could be due to side effects of the vaccinations.\n\nAll nine deaths have been attributed to complications with COVID-19 infection, as the consequence of an outbreak that took place while the vaccination schedule was underway.\n\nThe manager of the care home said: “The vaccine will protect you, infections are not derived from the first vaccination.”\n\nEven after a vaccination, it’s possible to develop the illness if the vaccination took place during the coronavirus incubation period (5-6 days). It is also possible to become infected after the vaccination has been administered, as it usually takes effect 10-14 days after the first dose, according to the Robert Koch Institute for Infectious Diseases (RKI).\n\nBothRussian andChinese state media have heavily reported on this case, with the latter citing the former.\n\nDespite the attention-grabbing headline, the original article from Russian state media clearly states, “There is currently no indication that the vaccine played any role in the deaths.”\n\nIt then refers readers to a fact-check stating that “It is statistically inevitable that some people will get sick and die after getting the shot, for reasons that are unrelated to their body’s response to the vaccine.” This disclaimer is missing from those who have replicated the article.\n\nWidely reported in India, this claim is based on a press release by Children’s Health Defense, an anti-vaccination advocacy group headed by prominent anti-vaxxer Robert F. Kennedy, Jr., and known for producing misinformation on vaccines and anti-vaccine propaganda.\n\nAlthough the headline claims that data comes from a “government database,” the figures linked to are on the website of the National Vaccine Information Center, an organization described as “the most powerful anti-vaccine organization in America,” by science, technology and public health journalist Michael Specter.\n\nDigging deeper, the National Vaccine Information Center (NVIC) claims their data is drawn from the US Government’s Vaccine Adverse Event Reporting System (VAERS), which explicitly states “anyone can submit a report to VAERS, including parents and patients,” and that “VAERS reports alone cannot be used to determine if a vaccine caused or contributed to an adverse event or illness.”\n\nFurthermore, VAERS encourages vaccines providers to report significant health problems “whether or not they believe the vaccine was the cause,” and disclaims that its data “cannot be interpreted or used to reach conclusions about the existence, severity, frequency, or rates of problems associated with vaccines” and “should be interpreted in the context of other scientific information.”\n\nAs far back as 2015, a study assessing claims of deaths from vaccinations highlights that data from the VAERS system is skewed, as it is a system which “accepts any submitted report of an adverse event without judging its clinical significance or whether it was caused by a vaccination.” The Centers for Disease Control and Prevention also warns against reporting bias and inconsistent data quality in the VAERS system.\n\nHowever, the NVIC also solicits reports through its own website in the same basic format as the VAERS report. It does not specify whether the two datasets are combined in their database or kept separate.\n\nNorway: ’30 people died in nursing homes following the coronavirus vaccine’\n\nThe Norwegian Medicines Agency, Statens Legemiddelverk, has investigated a total of 33 reports of deaths in nursing homes following vaccination of residents, as of January 26, 2021.\n\nIn a subsequent analysis, the agency writes “many of the nursing home residents who have been vaccinated so far are very frail or terminally ill patients. Every day, an average of 45 people die in Norwegian nursing homes or other similar institutions. Therefore, deaths that occur close to the time of vaccination is expected, but it does not imply a causal relationship to the vaccine.”\n\nThe European Medicines Agency’sPharmacovigilance Risk Assessment Committee (PRAC) also investigated the cases, stating in a report that “the review did not reveal any safety concerns,” adding, “(multiple) pre-existing diseases seemed to be a plausible explanation for death. In some individuals, palliative care had already been initiated before vaccination.”\n\nWhen assessing the cases, an article in the British Medical Association’s peer-reviewed medical trade journal quotes Steinar Madsen, medical director of the Norwegian Medicines Agency saying, “There is no certain connection between these deaths and the vaccine.” Instead, Madsen said that “common adverse reactions, that are not dangerous in fitter, younger patients and are not unusual with vaccines, may aggravate underlying disease in the elderly.”\n\n“We are not alarmed or worried about this, because these are very rare occurrences and they occurred in very frail patients with a very serious disease,” he said.\n\nIn Belgium, the Federal Agency for Medicines and Health Products (FAMHP) reported that 14 people died after being vaccinated against the coronavirus. However, causality has not been found.\n\nAll of the patients were over 70 and five over 90, the Brussels Times reported. Further details of the individuals who died have not been released.\n\n“The fact that the reported deaths did not present a common clinical picture is a rather reassuring element, as is the fact that the deaths occurred after a variable period of time,” the FAMHP told the Brussels Times, adding “to date, no causal relationship has been formally found” with the COVID-19 vaccine.\n\nAs a result, the FAMHP has published weekly reports examining vaccine side effects. The February 4 report outlined “To date, no formal causal relationship with the COVID-19 vaccine has been established.”\n\nAlthough the exact vaccinations were not specified in these cases, Belgium issues the Pfizer/BioNTech and Moderna coronavirus vaccines.\n\nCayetano Heredia University, which was conducting a study on China’s Sinopharm vaccination had to unblind a local Peruvian trial after a participant died of COVID-19-related pneumonia, according to Reuters.\n\nAfter unblinding the trial, it was revealed that the volunteer who died has not been administered the vaccine but was instead in the placebo group. In a statement, the university said, “It is important to stipulate that the death of the participant is not related to the vaccine since she received the placebo.”\n\nThis article was updated on March 12 to reflect new developments in Austria and South Korea, and on March 15, after Italy suspended use of the AstraZeneca vaccine.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fact check: No links found between vaccination and deaths | Europe | News and current affairs from around the continent | DW | 15.03.2021 - Vaccine Safety Info", "description": "With COVID-19 vaccine distribution underway around the world, all eyes are on the people who have already received their jabs.", "url": "https://www.dw.com/en/fact-check-no-links-found-between-vaccination-and-deaths/a-56458746", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Vaccines", "image": "https://vaccinesafety.info/wp-content/uploads/2021/08/4581-55060271_6.jpg", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2021/08/4581-55060271_6.jpg", "image:width": "940", "image:height": "529", "image:alt": "Fact check: No links found between vaccination and deaths | Europe | News and current affairs from around the continent | DW | 15.03.2021", "image:type": "image/jpeg", "article:published_time": "2021-08-30T04:58:14+00:00"}, "tags": ["BioNTech-Pfizer", "via bookmarklet", "Coronavirus", "AstraZeneca", "COVID-19", "covid 19", "vaccines"], "tweets": [], "movies": [], "links": ["https://www.bloomberg.com/graphics/covid-vaccine-tracker-global-distribution/", "https://www.n-tv.de/panorama/Institut-prueft-zehn-Todesfaelle-nach-Impfung-article22292066.html", "https://www.pei.de/SharedDocs/Downloads/DE/newsroom/dossiers/sicherheitsberichte/sicherheitsbericht-27-12-bis-31-01-21.pdf?__blob=publicationFile&v=5", "/en/covid-vaccines-likely-effective-against-new-variants-say-health-experts/a-56229282", "https://www.lavanguardia.com/vida/20210202/6216751/brote-residencia-lagartera-toledo-deja-nueve-fallecidos.html", "#", "https://www.rki.de/SharedDocs/FAQ/COVID-Impfen/gesamt.html;jsessionid=AF1CDD00FD20CBB14B66BD476390C601.internet101?nn=13490888", "https://www.rt.com/news/514303-deaths-pfizer-vaccine-covid-spain/", "https://www.globaltimes.cn/page/202102/1214761.shtml", "https://leadstories.com/coronavirus/2021/01/fact-check-it-is-statistically-inevitable-some-people-will-get-sick-and-die-of-unrelated-causes-after-getting-the-COVID-19-vaccine.html?fbclid=IwAR31TBLIEq36RTJIOxsGNGc-bwgnYPDww-A98Rjnk_LstTTRgCOPthMEnBA", "https://www.prnewswire.com/news-releases/government-database-shows-7-844-injuries-and-181-deaths-following-covid-vaccine-as-of-jan-15-says-childrens-health-defense-301217037.html", "https://archive.org/details/denialismhowirra00spec/page/7/mode/2up?q=the+most+powerful", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4599698/", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-01/06-COVID-Shimabukuro.pdf", "#", "https://legemiddelverket.no/Documents/English/Covid-19/20210128%20Reported%20suspected%20adverse%20reactions%20corona%20vaccine.pdf", "https://www.ema.europa.eu/en/documents/covid-19-vaccine-safety-update/covid-19-vaccine-safety-update-comirnaty-january-2021_en.pdf", "https://www.bmj.com/content/372/bmj.n149", "https://www.brusselstimes.com/news/belgium-all-news/151678/14-deaths-after-vaccination-in-belgium-causality-not-established/", "https://www.fagg.be/nl/news/coronavirus_wekelijks_overzicht_bijwerkingen_covid_19_vaccins_van_4_februari_2021", "#", "https://www.reuters.com/article/us-health-coronavirus-sinopharm-peru-idUSKBN29V2FD"], "authors": ["Deutsche Welle (www.dw.com)"], "publish_date": "2021-08-30T04:58:14+00:00"}