{"result_id": "330010", "URL": "https://vaccinesafety.info/2022/07/17/we-should-be-doing-autopsies-on-every-single-one/", "timestamp": "2023-04-25 17:51:28 CEST+0200", "meta": {"description": "Robert Lowry, M.D., is a concussion and musculoskeletal expert who has been practicing medicine for over 25 years. When I spoke with him by phone last week,", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/07/17/we-should-be-doing-autopsies-on-every-single-one/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "“We Should be Doing Autopsies on Every Single One”", "cleaned_text": "Robert Lowry, M.D., is a concussion and musculoskeletal expert who has been practicing medicine for over 25 years. When I spoke with him by phone last week, Lowry told me he’s seen anupsurge in young patients—adults under 40—coming to him with neurological problems.\n\nThese problems, he said, include everything from severe headaches to Bell’s palsy (facial paralysis) to strokes.\n\nIn every case he has seen, Lowry said, his patient was vaccinated. For this reason, he believesthese neurological issues are actually COVID-19 vaccine adverse events.\n\nLowry pointed me to a 2021 article in Clinical Immunology that analyzed vaccine injury data from Mexico.\n\nThe study authors found that about 1 percent of people who got the first dose of the Pfizer vaccine reported having adverse neurological events afterwards.\n\nLess than one percent. No problem. Right?\n\nBut, Lowry argued, that number is likely underreported by a factor of 10. And, he insisted, even if it is accurate, that percentage of adverse neurological events is simply too high to justify vaccination in otherwise healthy young adults.\n\nWorldwide, some 12.2 billion dose of the COVID-19 vaccines have been given, according toOur World in Data, which was updated 2 days ago.\n\nSixty-six percent of people have received one dose. If two-thirds of the world’s human population have received one dose, that equals approximately 5.3 billion people. One percent of 5.3 billion people who have had one of these doses having some kind of post-vaccination neurological event, equals53 million people (53,000,000).Which means that some 53 million people have likely already suffered from neurological injury because of these vaccines.\n\nDr. Robert Lowry, M.D.: Risks of Vaccine Damage Outweigh the Benefits of the Vaccine for Young People\n\nIf you are curious about your risk of dying from COVID-19, you can enter your age, place of residence, and underlying health issues into an online risk calculator to estimate your individual risk.\n\nSince the chances of a healthy young adult dying from COVID are much less than 1 percent, Lowry said, why would you give healthy young people a vaccine known to cause severe neurological side effects in some people?\n\nThe risk-benefit analysis for young people just doesn’t add up, he said.\n\nWhat is adding up quickly, however, is young, otherwise healthy adults dying suddenly and unexpectedly.\n\nAs I’ve written about recently,you’re not imagining things. Young people are dying suddenly in numbers that we have never seen before.\n\nThese deaths may be self-inflicted or due to drug overdoses, whether accidental or deliberate. However, there is no question that we have indeed seen a sharp increase in age-inappropriate Sudden Adult Deaths since the roll-out of the vaccines.\n• A sailor in the navy was found dead on board the USS Carl Vinson last weekend. “…officials say they do not suspect foul play or suicide,” according to the San Diego Union Tribune. Darren Collins was 22 years oldand originally from Oklahoma.\n• A17-year-old in White Bear Township, Minnesota, died in her sleep of a “hidden heart condition,” her employer posted on Facebook.\n• Comedian Nick Nemeroff, died on June 27. He was 32, cause of death unknown.\n• Black Information Network Vice PresidentTanita Myers was “found unresponsive” on July 13 in a hotel room in New Orleans. She was 49.\n• Dominic Green died in January at age 28. His body was discovered five days later. Green was a contractor doing data entry to track COVID-19 cases for the Los Angeles Department of Public Health. The L.A. County medical examiner’s office deemed that he died a “natural death.”\n• Caroline Shea Kyle unexpectedly died in her sleep at home on July 9, 2022. She was 22 years old, according to her obituary.\n• Magnus David Penkava died April 29, 2022 in Southern Oregon. He was 20 years old.\n• Active firefighterMalcolm S. Willis “passed away suddenly” at his residence on July 13, according to the Houston Fire Department. He was 24.\n• The owner of OMG Coffee & Donuts, LaKisha Renae Hopkins, of Blue Springs, Missouri,also died unexpectedly on April 19, 2022. You can scroll through her public posts on Facebook to read her story. She was 39.\n\nWhen the deaths are “unexplained” and there is a history of vaccination within the past 12 months,Dr. Lowry believes the cause is likely the mRNA vaccines.\n\nSecond Shot More Dangerous Than the First\n\nHe walked me through the how and why, physiologically, mRNA vaccines may be causing SADS. Some people will have immediate reactions, some will have a delayed reaction, and some people won’t react for many months or even up to a year. The data from Mexico only looked at injuries after the first dose. But, Lowry said,physicians we are seeing many more severe reactions and neurological and cardiac injuries after the second dose.\n\nThe most likely ways—and these are all related so, yes, I’m simplifying—include micro-clots in the brain that result in neuron necrosis; myocarditis, pericarditis and other heart damage; and vasculitis (inflammation of the blood vessels).\n\nLowry says that the problems are compounded by something he callsimmuno-sensitivity.\n\n“After the second dose is when I see a lot of folks who come to me,” he said. “They notice something within minutes of getting that second dose. Something was wrong and it just snowballs from there. Their immune system was essentially sensitized from the first dose. So, when they get the second one, it’s much worse. That’s when it’s the immune system that’s been fiddled with. You get hypersensitive and you get a hypersensitive reaction to the second dose. It’s like a bee sting. The first time somebody is stung by a bee, generally they don’t have an allergic reaction. But people who are allergic to bee stings get sensitized by the first one but have their hypersensitivity reaction to the second one.”\n\nAn Urgent Need For Autopsies\n\nThe way to find out what is causing these unexplained deaths is by doing autopsies, Lowry said. An advanced autopsy can stain for the spike protein, in order to see where they were clustered in the body before death.\n\nLowry also told me that an experienced medical examiner who does an autopsy (usually a physician who was trained as a pathologist) can put in a marker to look specifically formRNA from the vaccineto see where it has accumulated.\n\nA pathologist can also examine every one of the cadaver’s organs to look and see what has happened to it. Was the spike protein or the vaccine mRNA just in the vasculature? Or was it also in the parenchyma (the functional tissue of an organ as opposed to the connective and supporting tissue)? These are urgent questions and it’s high time we got some answers.\n\n“We should be doing autopsies on every one of these young people,” Lowry insisted. “If we did, we would know for sure within 6 months what is actually going on.”\n\nEditor’s note: This post has been updated to correct an error in the initial article that mistakenly conflated the number of doses given with the number of people receiving vaccines.\n\nRelated posts:\n\n For 3 Deaths Prevented, 2 Caused?\n\n 40,000 Deaths But No Recall\n\n The Stunning Hypocrisy of Our Regulatory Agencies\n\nJennifer Margulis, Ph.D., is an award-winning science journalist. She earned her B.A. from Cornell University, her M.A. from the University of California at Berkeley, and her Ph.D. from Emory University. A former Fulbright grantee, she has worked on a child survival campaign in Niger, West Africa; appeared live on prime-time television in Paris, France; and taught helped train rural women who cannot read or write to become solar engineers in Zanzibar and India. Support independent journalism by becoming a paid subscriber or gifting a paid subscription to a friend or family member.", "opengraph": {"locale": "en_US", "type": "article", "title": "“We Should be Doing Autopsies on Every Single One” - Vaccine Safety Info", "description": "Robert Lowry, M.D., is a concussion and musculoskeletal expert who has been practicing medicine for over 25 years. When I spoke with him by phone last week,", "url": "https://jennifermargulis.substack.com/p/we-should-be-doing-autopsies-on-every", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "article:published_time": "2022-07-17T11:09:24+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0b6149cc-d65f-429f-93ff-789d8401800b_1565x1200.jpeg", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/ioQ_-RGs9VI9axUKtUCt2c-_hcsdflcQdx9oQ3Ics5gAwYpkYSutLYLGuMkpoClOk5atLS5oFlpPh1-3ZNxgc3NXdvgEdViMmT0ORzWlodmz4vGX2HihK7ci1-KRpaLqYji3EK_ybt6SJloP1WDqtC9FW9bc8HVKwLDU2Fl9L-GrNfGuG1YMzGnTd5ZMxGs95kiL65i7PF8jP7oKPQ8Jxy7NN7gwmFHdAG_0xfROPub-9cYzhGgDtXrF60kzIEC5rEymgn41dxYtXcmB5HNogzSau1jFWEd8ArxywOW845HI7Cd9HuU0o1JgdTYIcVG8spY", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/ikx-NPVGKGaq3wUfuAfzU-fYeJ8YIyb5WQIQzJ-J_mDQmhV9BBkUvR1_Dp5lgXySBcowzlzKWlgZTJDh1-VK2ffUf48AizN8heJBEVJxKpCtAtL6pZ2cxUZgxE8f3WOrnGVk5tnAvXlSEoW6CfbtDopowosuP4d_XR1VOsU6SzoWW9zC27syId8t5EBkEbUNTfTgs86YG1YyWpL-SqcnOpjso-b5bYmH8kHk2Ltpyu3eJP18v3BOd4m13_ZhOGQWeCxKO69cKxpiBhZlUXHLxv97gpYz9Uk0hXMdJchv3YnaGQQe9HgujpKUJmBl4wmBooJ3OdYD4yxDivg1wiMi12g8ThWAYOjukrKbO7DQN4skwJObwL06hBUxnhMms_zQPcnrDUPDtBsme54ePb_axDzOSJ44-Ph0RSP9RbCr", "https://ourworldindata.org/covid-vaccinations?country=OWID_WRL", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/wq9Vn3WLG8OlVnU9yUu_uUpilVuVr3ZSZhvZCw3s4gD8k3DF3PJvV_mCUBa7Hc_PAnG3riPBwBA5h1KaINUiGnajYmL5UEWc_p1tQFDJO59qlXTsh6Q41X-i1bxQV98jaaJJkxBh7Sa1unJ3AiVrxr0qPeSYd5zz6_CbyjEG71SQKkkfdL9cPSiCMbz6FY-CxDse_bDV4NSlwdUK_Rcv9F7pFxixnbZ8EEHxhbfkwB0-XRqj8Uke4ibiBMHmTGyPX1skIHr7cinr01u_RjR3DCZmWIZwlPZAECiSa7gLe-B7FEjAaekUrko0N5pnUTupAXkT269YFkNk", "https://jennifermargulis.substack.com/p/youre-not-imagining-things", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/pO-E18g3CdLRFMKrv6VCkkkGYkrssgp2Jf7dpTykFr-9p8q5wC-FhuZX2ShiYPhHZgxYX1XG_q_GD0xKMtZJDWOZITnbxRr3O7a38Hw2avalJ1Zc_FmZVkvsM5euR_JdHskKuyaH3-0Q3DPqSWKj_GcB2yGyqVgLrA1YABkWuARYr3KjtJmCGOpjJmsFnTvgv1OV5g1g1nTzJmN0GS9XSjDIeLukC3-KHYsMa7j4EG0TulMuL9MFjIINbiWXu2O2TSKjaR4Ne6ShB__Z-kXsJ2TBszTV3bmr_si05uDAM_7xnc322iVN5bk9wJPKdshuyqfwH5I1gkFQCcF3CHySBfuzB5bIAYManpR65iqif4LW5b7eLu98MdhisbHBdR0DEqla5kcn3rAUlRebLSk", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/iJPnO1EsBeDN8LC7s8-PIJnnQkcNmw0Tn1dUtstPB3ZEyvFv_hbcUTC6mYqDKrKn-kL6Oha06o3jcxjotjWoz7YYIEy6mQ7PxFWraPfe71vfKv7BiwJXNN6-dFGH3SeSE27gLVcfB_x9JgBH6gvmMu8k5MP9hxlwDg0GkaTuoXrnjmRX_ifXTJs6zgc6VSJy0AgNSnKoyFhQpjYUtDc6g76Ey968RwyRBGJ1O6PIFzgNe_G9HfR4s02Sk1vwD-9QeBj4YOjAyzH-C7JuQ-mdzyO1iDkeICxbuqeZ7P_vVITTvumFrH1QHWpw4tQEntNYcIC2lgpmrBRhaLVAV4gvZQVml4WWLqmCxNBbwMcc3RagLVNupKiLqAmEBgmtBGX2MNiAQu6lqi0Ma5yjxbeho1V1jXw_O3Dk0QH72N50", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/Bpc0fcBdd5zug6pUXS0XwmYmQMnjt63zE4VEErjcRIeXu-fJOIsx3-a45Xbg_LdauvL6GSfW5PAe5EgNGBVuc_GHJ1JhgekUlNexRKNwGHsscCoTA9wiZNhvkIFN9S6rXBqWW34GNffYG1i3apKSW79nOqbh71zwMvY0izlS9PTWlBXlgtWZHPEjwQQcPqzjxKsGNXVnSmuahua0OeS2McDlkiZqvHmfg5ikne4zr-eVkOWdh_PMd0-Ja1FY7j-_JUsTnTgPe2Fs41_KeUSC4VjfP5nJtvuziHqe7tbm7mfc5tIrcaPzZTIMvTk2mkfa4cqEHbi-NUYHI9OqC5iGUpCOFM5pcPlV3bLL3PvKEvPj1Yg", "https://rollingout.com/2022/07/14/black-information-network-vp-tanita-myers-dead-at-49/", "https://www.murrayfuneralhome.com/obituary/caroline-kyle", "https://www.mailtribune.com/top-stories/2022/05/07/southern-oregon-son-makes-final-journey-home/", "https://www.legacy.com/us/obituaries/name/lakisha-hopkins-obituary?id=34385179", "https://www.facebook.com/omgdonutshop", "https://jennifermargulis.substack.com/p/we-should-be-doing-autopsies-on-every/comments", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/ve_EibmWneVCEVQfsFN1yevEoz5rB5mqS_XEsGULMRJHF4wjpCzg9H3dCGiQMM4tm9UkbEYjZlMzLvFTErkzrgpWUiyI3WHSagWvZT9nfvJLeMmTcQdYLWre52d4hFFo72hEbH3x2dk8sMkeiP6eZx260JYIsTMrufxhUKCNVgLCxBZ59uyVU0D1jsSEmQT27EPkyoS9T3jvwBDZqNb3KW83UqAgFN7cZZa5EpksG75Y0eig7wxd0I0qd4CNzsgsMU_gW5rCxiEgiGdf9xxq7GgKTrhOXni8f1FRFuXfVKtBHIde71hxUI3te_O4i1gJKuRk9zZ1rgLhC73S7W2t1EIHJiLi", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/swropjpF1BDenkSYdLhD6zullL-sL3GI15b4Ka_CIZFpwDxDZLr_HckuUBcX9lpYoDQ0Og2HC_-9jE4TJMK2v_A6g3s1OLDVhqyHked7PtNi1bNQVY8zWbPKP740WkBv3J74HYX6ER9w0bRbBz4mAtWbQKkKY0B28adtjAIdovGr807UbJHW6TmVb9KCreLOv9JTq6I2tCEigIHqDrSnRHPwmoS38P9AjeZfsOLR7khgkpNuC3A920m8De9p-XzdesrXP2Ysp4eESDvqVEji1_LFg9Hv4udYu5f_Nul-wwspwTUO4veER1Ue1ndADIgAhnVvuOP2CZrnI3vgdxRoEf8HnrQgrRwvP9dibZ7QrwUbl-qNy6AduBVrvN6r3fs-ZzAZmAx3Pn0w6uJ9-qqq4SbcsLK_LXE4DzSlXtSu-wPM-qLMgJOKMOXnrA", "https://4buqw.r.ag.d.sendibm3.com/mk/cl/f/msqCzYXpIkq6rnWeMxRHw0qKRM3dFjwNoa6RzwlLbL5bfhVJcVfb-1JrNBINAykdaJofCX9rnYN-jqI1O4Lq-xzXMw2psTjlNj2GZ-hQE9Y9SHGbSFCr5QiuWNSxfqnurOP1drqr-jTI7_5a-_YvSpZWAqwpgZ8OZd8F8nCMk_xbu61HYqyvX2vNGWy9TN1CdXW5xf5nVJmbVw8OYKNgo1mgZCw1KfLD8wMC-KMJn81uxOPt8riovTbWsT3D_tfgqJYw8jtYS_Qz8E95rw0m4YkMoTuA1jfL6UhGUfZOK1_26OpRI9pYEX-pTspqm2sIe0wREY-LWok_gG31yjTA_vD1gR4MngAXOmM7G60G67tAy5HpuA", "https://jennifermargulis.substack.com/?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://jennifermargulis.substack.com/p/for-three-deaths-prevented-two-inflicted", "https://jennifermargulis.substack.com/p/40000-deaths-but-no-recall", "https://jennifermargulis.substack.com/p/the-stunning-hypocrisy-of-our-regulatory", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F566779eb-3182-407d-b09f-98a3f7013747.jpeg"], "authors": ["Jennifer Margulis"], "publish_date": "2022-07-17T11:09:24+00:00"}