{"result_id": "330038", "URL": "https://vaccinesafety.info/2022/03/30/global-trends-in-clinical-studies-of-ivermectin/", "timestamp": "2023-04-25 17:51:47 CEST+0200", "meta": {"description": "Morimasa Yagisawa, Ph.D.1,2, Patrick J. Foster, M.D.2, Hideaki Hanaki, Ph.D.1 and Satoshi Ōmura, Ph.D.1", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/03/30/global-trends-in-clinical-studies-of-ivermectin/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Global trends in clinical studies of ivermectin", "cleaned_text": "Response to the initial alarm bells of the Coronavirus infection, which occurred in Wuhan City, Hubei Province, China in November 2019, was delayed as it was announced to be a type of pneumonia of unknown cause. The WHO warned abouttraveling to China in January 2020. After much urging, the world was finally properly warned, but the Chinese government did not accurately announce the outbreak situation. Consequently, the delaying of the construction of an epidemic prevention system worldwide has resulted in the direst infection circumstances facing the world today. One year has passed since the WHO named the new coronavirus SARS-CoV-2 infection, COVID-19, and it was declared a pandemic on the 11th of March 2020, based on the judgment that it corresponds to “an internationally concerned public health emergency”. Suppression of virus transmission by vaccine has finally begun. To date, the pandemic has affected more than 115 million people and killed more than 2.5 million people in 220 countries/ regions around the world. There appears to a potential for control in the near future. However, there is a limit to the supply of vaccines and developed countries are competing to obtain the required amount of vaccination necessary for their own citizens. Although the WHO is trying to secure a certain amount for developing countries, it is predicted that a considerable period of time will be required before COVID-19 becomes controllable.\n\nOn the other hand, with regard to therapeutic agents for COVID-19, studies began at an early stage. The therapeutic effects of hydroxychloroquine or chloroquine, lopinavir/ritonavir combination, tocilizumab, interferon β1, as well as others, were found to have limited efficacies or no effect. Remdesivir improves recovery time by as much as 30% in critically ill patients, but it is not suitable for mild to moderately ill patients–which comprises the majority of infected individuals. Although the", "opengraph": {"locale": "en_US", "type": "article", "title": "Global trends in clinical studies of ivermectin - Vaccine Safety Info", "description": "Morimasa Yagisawa, Ph.D.1,2, Patrick J. Foster, M.D.2, Hideaki Hanaki, Ph.D.1 and Satoshi Ōmura, Ph.D.1", "url": "http://jja-contents.wdc-jp.com/pdf/JJA74/74-1-open/74-1_44-95.pdf", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "article:published_time": "2022-03-30T11:58:58+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": [], "authors": ["Author on Source"], "publish_date": "2022-03-30T11:58:58+00:00"}