{"result_id": "330031", "URL": "https://vaccinesafety.info/2022/10/30/heavy-periods-should-be-listed-as-covid-jab-side-effect-ema-dutchnews-nl/", "timestamp": "2023-04-25 17:51:43 CEST+0200", "meta": {"description": "Source: Heavy periods should be listed as Covid jab side effect: EMA – DutchNews.nl", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/10/30/heavy-periods-should-be-listed-as-covid-jab-side-effect-ema-dutchnews-nl/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Heavy periods should be listed as Covid jab side effect: EMA - DutchNews.nl", "cleaned_text": "Dutch medicines monitoring agency Lareb has received nearly 9,400 reports of heavy menstrual bleeding from women who have been given Pfizer/BioNTech and Moderna coronavirus vaccines, the agency said on Friday.\n\nBy far the most were about the Pfizer/BioNTech product, but this is also the most widely used vaccine in the Netherlands, Lareb said.\n\nOn Friday, the European Medicines Agency said it was recommending that heavy menstrual bleeding should be added to the product information as a side effect of unknown frequency with the two vaccines.\n\nCases of heavy menstrual bleeding have been reported after the first, second and booster doses of Comirnaty and Spikevax, the Amsterdam-based EMA said.\n\nThe data mostly involved cases which appeared to be non-serious and temporary in nature, the EMA said, adding that ‘menstrual disorders in general are quite common and they can occur for a wide range of reasons’.\n\nThere is no evidence to suggest the menstrual disorders experienced by some women have any impact on reproduction and fertility, the agency said.\n\nLareb, meanwhile, is conducting further research on the number of women experiencing menstrual disorders before and after the covid vaccination based on data from family doctors.\n\nIn total, the agency has had over 27,000 reports of menstrual side effects after vaccination, ranging from delays, to heavier or lighter blood loss and period pains.\n\nLareb said last year that menstrual irregularities are common and can also be caused by infections, sickness and stress. ‘It is not clear yet if menstrual irregularities are a side effect of the corona vaccines, but this is a possibility,’ it added. ‘The vaccine stimulates the immune system and this can affect hormone levels.’\n\nThank you for donating to DutchNews.nl\n\n The DutchNews.nl team would like to thank all the generous readers who have made a donation in recent weeks. Your financial support has helped us to expand our coverage of the coronavirus crisis into the evenings and weekends and make sure you are kept up to date with the latest developments. DutchNews.nl has been free for 14 years, but without the financial backing of our readers, we would not be able to provide you with fair and accurate news and features about all things Dutch. Your contributions make this possible. If you have not yet made a donation, but would like to,\n\n\n\n you can do so via Ideal, credit card or Paypal.", "opengraph": {"locale": "en_US", "type": "article", "title": "Heavy periods should be listed as Covid jab side effect: EMA - DutchNews.nl - Vaccine Safety Info", "description": "Source: Heavy periods should be listed as Covid jab side effect: EMA – DutchNews.nl", "url": "https://www.dutchnews.nl/news/2022/10/heavy-periods-should-be-listed-as-covid-jab-side-effect-ema/", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "image": "https://vaccinesafety.info/wp-content/uploads/2022/10/5624-Vaccination-vaccine-woman-tattoos.jpg", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2022/10/5624-Vaccination-vaccine-woman-tattoos.jpg", "image:width": "639", "image:height": "460", "image:alt": "Heavy periods should be listed as Covid jab side effect: EMA – DutchNews.nl", "image:type": "image/jpeg", "article:published_time": "2022-10-30T07:31:23+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://www.ema.europa.eu/en/news/meeting-highlights-pharmacovigilance-risk-assessment-committee-prac-24-27-october-2022", "https://www.lareb.nl/pub-filepreview?id=38357&p=33522", "https://www.dutchnews.nl/news/2021/10/ten-thousand-report-menstrual-issues-after-having-corona-vaccine/", "https://www.dutchnews.nl/donate-to-dutchnews-nl/"], "authors": ["robin"], "publish_date": "2022-10-30T07:31:23+00:00"}