{"result_id": "330027", "URL": "https://vaccinesafety.info/2022/07/17/did-the-covid-vaccine-kill-gwen-casten/", "timestamp": "2023-04-25 17:51:40 CEST+0200", "meta": {"description": "I called Sean Casten’s office to get the date that Gwen was last vaccinated.", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/07/17/did-the-covid-vaccine-kill-gwen-casten/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Did the COVID vaccine kill Gwen Casten?", "cleaned_text": "I called Sean Casten’s office to get the date that Gwen was last vaccinated.\n\nI can tell you if that happened to my child, I’d be publishing as much medical history of my child on the Internet as possible so people could figure out what caused the death so my child’s death could possibly save the life of other children.\n\nUS Congressman Sean Casten’s 17-year-old daughter Gwen Casten died in her sleep on June 12, 2022.\n\nHealthy young kids rarely died in their sleep before the COVID vaccine rolled out.\n\nI don’t know of a single doctor who has even heard of this happening prior to the COVID vaccines rolling out. Now it is the “new normal.”\n\nI’m 65 years old and I can’t recall ever reading about this in the news until the COVID vaccines rolled out. In the last year, I know of at least 6 deaths of young people who died in their sleep after being vaccinated.\n\nEven more stunning are anecdotes like one of my readers, Maggie Russo, who writes:\n\nMaggie went on to describe20 tragic deaths, mostly those who died in their sleep, all vaccinated.\n\nThe peer-reviewed medical literature also showsa crystal clear connection between the COVID vaccine and two adolescents who both died in their sleep shortly after their second vaccine dose, a connection that surely Rep. Casten’s doctors would have pointed out to him.\n\nLeaders like Rep. Casten simply look the other way to the possibility that he may have contributed to his daughter’s death by encouraging her to get vaccinated.\n\nWill Sean Casten use this as an opportunity to learn more about how dangerous the vaccines are? Unfortunately, that’s very unlikely to happen.\n\nI think he will convince himself that:\n• these unexplained deaths are ONLY happening to vaccinated kids is simply “bad luck”\n• these deaths, which only started happening after the COVID vaccines rolled out, are “unexplained”\n\nand continue to be a cheerleader for the COVID vaccines. That’s the real tragedy here.\n\nIllinois democrat and US Representative Sean Casten’s 17-year-old daughter Gwen died suddenly and unexpectedly in her sleep Sunday night, June 12, 2022.\n\nDoctors will tell you: healthy kids do not die in their sleep unexpectedly for no reason.The COVID vaccine is the most likely cause, hands down, for any child who has been vaccinated with the COVID vaccine and later dies in their sleep.\n\nUntil the COVID vaccines started rolling out, healthy kids dying in their sleep was never an issue. I don’t know of any doctor who had ever seen or heard of a case of that happening. Now, of course, it is the “new normal.”\n\nIn astatement yesterday, Casten said “The only thing we know about her death is that it was peaceful. And the only lessonwe can take from that is to savor the moments you have with your loved ones.”\n\nRep. Casten admits that both his kids were vaccinated. Not only did Casten allow this to happen, he encouraged it. So if Gwen’s death is found to be caused by the vaccine, he then bears some responsibility. That burden is too difficult for many people so they will simply not allow it to be a possibility.\n\nThe six deaths of young people I know about\n\nHere are six deaths of young people who died in their sleep after vaccination that I was aware of before I heard about Gwen’s death:\n• One of the doctors I talk to on a regular basis had this happen to one of his staff members., a 21-year-old male who was super fit. He died in his sleep less than 24 hours after taking the jab. I only talk to a couple of doctors on a regular basis, so this isn’t cherry picking.\n• Yesterday, I was just writing about another child, perfectly healthy15-year-old Odin Robinson of Santa Rosa, who died in his sleep just two days after his Pfizer shot (see item #13 in my questions for Congresswoman Anna Eshoo). The death was determined to be from the vaccine.\n• I know of a 7-year-old who died in his sleep right after his vaccine shot. Unfortunately, I’m not allowed to talk about it publicly other than to say it happened but if Congressman Casten contacts me, I will give him the details. It will convince him that these deaths are happening at a rate that cannot be explained by “coincidence” or “bad luck” and that these deaths are being covered up (as this one was).\n• There are other cases such asthe one in Australia; that one was very public. It happened to the president of the Australian Medical Association South Australia. Perfectly healthy. Dies in her sleep. No cause determined.\n• We had the father of 17-year-oldSean Hartman on the VSRF show (Episode #33) just 8 days ago! Sean died in his sleep too! He was perfectly healthy before he died. His mother found him on the floor dead. Chief Medical Officer of Health with the Simcoe Muskoka District Health Unit, Dr. Charles Gardner, says the death was unrelated to the jab. Then Dr. Gardner must know what caused it, but he never revealed it for some reason. However, the family talked to doctors and learned that the vaccine was determined to have caused his death. The Canadian health authorities were so embarrassed by this death that when the father went public with it asking for answers, they removed his video testimony from the public record because it makes them look bad for recommending a vaccine that kills kids in their sleep. We talked about their actions on the episode and you can see the video of Dan’s testimony that they removed from the public record here.\n• Jacob Cylnick, a 13-year-old Michigan boy, also died in his sleep just three days after getting a second dose of the Pfizer vaccine. The CDC has been investigating the case for almost a year. It’s still just a mystery.\n\nAll of these deaths are considered mysteries. All of the kids were vaccinated with the COVID vaccine. The denial is so bad that they have to remove Dan Hartman’s testimony of his son’s death from the public record!\n\nWhen they say “mystery” it’s their “code word” for “The vaccine caused it, but we don’t want to let anyone know that we’re killing people.” They know that Congress is NEVER going to hold the CDC or FDA accountable for these deaths even when it happens to their own kids! Sean Casten is proof of that.\n\nThe only clues we have to these mysterious deaths are:\n• It doesn’t happen to the unvaccinated.\n• It never happened before the COVID vaccines rolled out.\n• It usually happens very shortly after the COVID shot\n\nThe doctors cannot figure it out. A real mystery indeed!\n\nRepresentative Casten, will you consider the evidence that the vaccine might have caused your daughter’s death?\n\nYou cannot change the past.\n\nWill you make up for your mistake bylearning about how dangerous the vaccines areand doing everything in your power to raise the issue with the public?\n\nYou can start by readingthis slide deck or listening to this 90 minute presentation.\n\nIf that doesn’t open your eyes to the possibility that you’ve been lied to, I don’t know what will.\n\nI also have a list of over 2,500 people who have been killed by the COVID vaccine. Will you take a look at the list and have your medical experts try to explain what really killed these people?\n\nHow many more Americans must die before you stand up and call a halt to these vaccines?\n\nYou can call me if you have any questions.\n• The cause of Gwen’s death will be listed as “unknown” or as simply a “cardiac arrest.”\n• Sean Casten will refuse to consider the possibility that the vaccine might have caused his daughter’s death since it would mean he contributed to his daughter’s death\n• Sean Casten will continue to be a cheerleader for the vaccine and he will continue to encourage other parents to vaccinate their kids.\n\nThe basis for my prediction\n\nWe’ve seen this before. The politicians always refuse to consider the evidence and the possibility they are contributing to the problem. FromAMD in the comments:\n\nAn almost identical thing happened to the daughter of one of the leaders of the Australian medical Association last month and she responded in the same way Casten did:https://www.dailymail.co.uk/news/article-10811647/South-Australia-doctor-reveals-daughter-died-sleep-heartbreaking-Twitter-post.html (She blocked everyone who tried to link it to vaccination). What is truly insane about this is that the day after Casten’s daughter died, the FDA pushed through vaccinations for children (despite as you highlighted there been many valid and strong objections to doing so). I have often wondered what it takes to wake these people up, and it clearly is a very high bar. One of my major fears of the vaccinations was that some type of time delay effect was put into them so it took around one to three years for them to kill people after vaccination (as if the death rate was faster, there’s no way you can get most of population of vaccinate) andeveryone I know who has been monitoring this has noticed there has been a significant increase in the number of clearly vaccinated patients they are now seeing in the hospitals. I am very worried about what this is gonna look like in a year.\n\nHigh profile leaders have refused to acknowledge the evidence of harm in plain sight,even when it happens in their own household.\n\nIn Sean’s case, the denial is likely two-fold:\n• it’s too hard to admit you contributed to your child’s death and\n• you can’t get re-elected if you oppose the vaccine.\n\nSo don’t expect anything to change anytime soon.\n\nWhat is it going to take to get people to even consider the evidence that all of these deaths are not “bad luck”?\n\nHow many kids must die before they wake up?", "opengraph": {"locale": "en_US", "type": "article", "title": "Did the COVID vaccine kill Gwen Casten? - Vaccine Safety Info", "description": "I called Sean Casten’s office to get the date that Gwen was last vaccinated.", "url": "https://stevekirsch.substack.com/p/us-congressman-sean-castin-is-responsible", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "article:published_time": "2022-07-17T11:27:50+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F0af7066b-55a1-4c79-886c-f6cae20879fa_1024x682.jpeg", "https://stevekirsch.substack.com/p/us-congressman-sean-castin-is-responsible/comment/7219301", "https://meridian.allenpress.com/aplm/article/doi/10.5858/arpa.2021-0435-SA/477788/Autopsy-Histopathologic-Cardiac-Findings-in-Two", "https://twitter.com/RepCasten/status/1537173631570255872?s=20&t=S2AxFshPDKnHe3rhqe0nZw", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F82070abe-feda-4937-a0af-2fbc1eb0d65c_640x618.jpeg", "https://www.pressdemocrat.com/article/news/how-a-coroners-report-about-a-santa-rosa-15-year-olds-death-went-viral/", "https://stevekirsch.substack.com/p/questions-id-love-to-ask-congresswoman", "https://www.dailymail.co.uk/news/article-10811647/South-Australia-doctor-reveals-daughter-died-sleep-heartbreaking-Twitter-post.html", "https://shore-215.blogspot.com/2021/10/sean-hartman-died-from-covid-19-vaccine.html", "https://odysee.com/@VSRF:d/VSRF-Webinar-EP-33_060922_Final_Odysee:a", "https://odysee.com/@VSRF:d/VSRF-Webinar-EP-33_060922_Final_Odysee:a", "https://rumble.com/vsx2j4-dads-tearful-plea-for-answers-about-his-sons-death-after-being-vaxxed.html", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fed637fab-d0e4-4a14-abc1-53e7365eb31a_606x751.png", "https://www.freep.com/story/news/2021/07/02/jacob-clynick-pfizer-covid-vaccine/5323095001/", "https://www.freep.com/story/news/2021/07/02/jacob-clynick-pfizer-covid-vaccine/5323095001/", "https://www.freep.com/story/news/2021/07/02/jacob-clynick-pfizer-covid-vaccine/5323095001/", "https://www.fox13news.com/news/michigan-boy-13-dies-after-second-covid-19-vaccine-shot", "https:///www.skirsch.com/covid/elephant.pdf", "https://stevekirsch.substack.com/p/my-speech-at-calvary-chapel-last?r=o7iqo&s=w&utm_campaign=post&utm_medium=web", "https://stevekirsch.substack.com/p/us-congressman-sean-castin-is-responsible/comment/7216793", "https://www.dailymail.co.uk/news/article-10811647/South-Australia-doctor-reveals-daughter-died-sleep-heartbreaking-Twitter-post.html", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fc9700678-34e7-4b2e-9d67-5c348939cbc7_604x291.png", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fccbbe640-c89f-4986-b35b-f0d82c50a96e_590x203.png"], "authors": ["Steve Kirsch"], "publish_date": "2022-07-17T11:27:50+00:00"}