{"result_id": "330034", "URL": "https://vaccinesafety.info/2022/01/21/natural-immunity-against-covid-lowered-risk-more-than-vaccines-against-delta-variant-new-study-says-euronews/", "timestamp": "2023-04-25 17:51:45 CEST+0200", "meta": {"description": "Unvaccinated people who had previously contracted COVID-19 and survived were better protected against the Delta variant than those who were only vaccinated,", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/01/21/natural-immunity-against-covid-lowered-risk-more-than-vaccines-against-delta-variant-new-study-says-euronews/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Natural immunity against COVID lowered risk more than vaccines against Delta variant, new study says | Euronews", "cleaned_text": "Unvaccinated people who had previously contracted COVID-19 and survived were better protected against the Delta variant than those who were only vaccinated, according to a new study published on Wednesday.\n\nWith the release of the research, which was published in its Morbidity and Mortality Weekly Report, the Centers for Disease Control and Prevention (CDC) emphasised that “vaccination remains the safest strategy” against the disease.\n\n“Viruses are constantly changing, including the virus that causes Covid-19,” the CDC said in a statement.\n\n“The level of protection offered by vaccination and surviving a previous infection changed during the study period. Vaccination remains the safest strategy for protecting against COVID-19”.\n\nThe study also pointed out that relying on contracting the disease as a strategy to gain immunity potentially carries serious complications, such as hospitalisation, long-term health problems, and death, while vaccines have proven to be extremely safe and effective.\n\nThe study was conducted before booster doses were widely available, and before the emergence of the Omicron variant, which now accounts for more than 99 per cent of new cases in the US. It is, therefore, possible that the balance has shifted towards vaccination being more effective than immunity following infection.\n\nHowever, the results published on Wednesday provide key insights into the differences between vaccine-acquired and post-infection immunity.\n\nThe health authorities studied cases in the states of New York and California from late May to November 2021. Delta became the majority disease in the US at the end of June.\n\nDuring the period analysed by the researchers, the people with the least protection by far were those who had neither been vaccinated nor fallen ill in the past.\n\nBut before Delta, vaccinated people who had not previously contracted COVID-19 were better protected than unvaccinated people who had already fallen ill.\n\nAfter the introduction of Delta, the ratio was reversed.\n\nLess risk to infected but not vaccinated people\n\nThe study analysed the risk of getting Delta compared to the risk of those most likely to get it, in other words, people who had neither been vaccinated nor infected in the past by the beginning of October.\n\nThose that had been vaccinated but never infected with COVID-19 were six times less likely to get it in California, and about five times less likely in New York.\n\nBut the risk was even lower for previously infected but not vaccinated individuals: by 29 in California, and by 15 in New York.\n\nWhen analysing the risk of hospitalisation, this time in California only, the researchers found a similar reversal between the two periods.\n\n“This could be due to different immune response stimuli” caused either by encountering the real virus or a vaccine, the CDC explained.\n\nThe reversal also “coincided with the onset of vaccine-induced immunity decline in many people” before booster doses, the study authors added.\n\nThe CDC noted too that work on Delta in other countries “has also demonstrated increased protection of previously infected individuals, both vaccinated and unvaccinated, compared with vaccination alone”.\n\nThey emphasised that further studies were needed to investigate the durability of protection conferred by infection with each of the variants, including Omicron.", "opengraph": {"locale": "en_US", "type": "article", "title": "Natural immunity against COVID lowered risk more than vaccines against Delta variant, new study says | Euronews - Vaccine Safety Info", "description": "Unvaccinated people who had previously contracted COVID-19 and survived were better protected against the Delta variant than those who were only vaccinated,", "url": "https://www.euronews.com/next/2022/01/20/natural-immunity-against-covid-lowered-risk-more-than-vaccines-against-delta-variant-new-s", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Immunity", "image": "https://vaccinesafety.info/wp-content/uploads/2022/01/5227-1000x563_cmsv2_33286ccd-4616-51df-a838-2df750b3c5a3-6401292.jpg", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2022/01/5227-1000x563_cmsv2_33286ccd-4616-51df-a838-2df750b3c5a3-6401292.jpg", "image:width": "1000", "image:height": "563", "image:alt": "Natural immunity against COVID lowered risk more than vaccines against Delta variant, new study says | Euronews", "image:type": "image/jpeg", "article:published_time": "2022-01-21T03:08:46+00:00"}, "tags": ["COVID Vaccine", "via bookmarklet", "delta variant", "infection", "COVID-19", "covid 19", "Omicron", "immunity"], "tweets": [], "movies": [], "links": [], "authors": ["Author on Source"], "publish_date": "2022-01-21T03:08:46+00:00"}