{"result_id": "330003", "URL": "https://vaccinesafety.info/2022/09/01/myocarditis-vaccine-link-known-since-last-april-otago-daily-times-online-news/", "timestamp": "2023-04-25 17:51:22 CEST+0200", "meta": {"description": "You are not permitted to download, save or email this image. Visit image gallery to purchase the image.", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/09/01/myocarditis-vaccine-link-known-since-last-april-otago-daily-times-online-news/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Myocarditis vaccine link known since last April | Otago Daily Times Online News", "cleaned_text": "Information on a serious vaccine side effect had been collected since April last year, the Ministry of Health has told a coronial inquiry into the death of a Dunedin man. Plumber Rory Nairn died of myocarditis early on November 17 last year, 12 days after he received his first vaccination for Covid-19.\n\nHis fiancee Ashleigh Wilson found him collapsed on the bathroom floor of the house they shared, moments before they went to seek medical advice for the symptoms he had been experiencing.\n\nYesterday, Ministry of Health vaccine safety surveillance and research group manager Dr Tim Hanlon said New Zealand’s first serious case of myocarditis was notified to the Covid-19 Vaccine Independent Safety Monitoring Board (CBISNT) late April last year.\n\nMedsafe issued a monitoring report on June 9, which was upgraded to an alert about the rare side effect on July 21.\n\nThe risk of myocarditis was then communicated to the public through the ministry website and in a press conference held by then director-general of health Dr Ashley Bloomfield.\n\nIn early August, a pathologist’s report to the Centre for Adverse Reactions Monitoring was made regarding a death attributed to myocarditis, which was potentially caused by the Pfizer vaccine.\n\nMore information was made available to the public in response, including on a ministry webpage which discussed vaccine related side effects.\n\nAs of August 16, there were 200 reported cases of myocarditis supported by a clinical diagnosis, ranging along a spectrum of severity, Dr Hanlon said.\n\nIn early December, CBISNT met to consider three possible fatal cases of myocarditis since Mr Nairn’s death, although his was the only one which could be linked to the Pfizer vaccine with any likelihood.\n\nA press release was put out publicly and further information was circulated to practitioners, emphasising the importance of recognising myocarditis symptoms and raising awareness of its risks, Mr Hanlon said.\n\nMinistry of Health national contracts quality and workforce group manager Christine Nolan said notifications about the risk of myocarditis had been sent out though several channels and had flagged myocarditis as a rare side effect that especially affected young men.\n\n“I think the communication that came though highlighted that this was a rare and serious risk,” Ms Nolan said.\n\nTraining modules had been updated in response to new information to tell newly trained vaccinators about the risk of myocarditis and the importance of raising it.\n\nThose who had been trained previously received updates, Ms Nolan said.\n\nOn Tuesday, coroner Sue Johnson told the packed public gallery her role was not about finding fault or evaluating the benefits or drawbacks of vaccination.\n\nIt was accepted that Mr Nairn had died of myocarditis, likely due to receiving the Pfizer vaccine.\n\nThe purpose of the inquiry was to establish the facts and consider recommendations that could avoid future such incidents, she said.\n\nOn Monday the vaccinator who treated Mr Nairn told the inquiry she was aware that myocarditis could be a rare side effect of the vaccine, but she had not realised it could be fatal.\n\nAfter Mr Nairn died they had changed their processes to emphasise potential risks from myocarditis, and it was tragic he had to die for that to happen, she said, breaking down in tears.\n\nThe manager of the pharmacy spoke of a deluge of information coming from health authorities, with “millions” of emails being sent to vaccinators.\n\nInformation could get lost in the noise, she said, with some important safety information being contained within “a link within a link within a link”.\n\nBoth the names of the pharmacy and the pharmacist who administered the vaccine to Mr Nairn are suppressed.", "opengraph": {"locale": "en_US", "type": "article", "title": "Myocarditis vaccine link known since last April | Otago Daily Times Online News - Vaccine Safety Info", "description": "You are not permitted to download, save or email this image. Visit image gallery to purchase the image.", "url": "https://www.odt.co.nz/news/dunedin/health/myocarditis-vaccine-link-known-last-april", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "image": "https://vaccinesafety.info/wp-content/uploads/2022/09/5602-coroners_court_310822_0.jpg", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2022/09/5602-coroners_court_310822_0.jpg", "image:width": "1200", "image:height": "1156", "image:alt": "Myocarditis vaccine link known since last April | Otago Daily Times Online News", "image:type": "image/jpeg", "article:published_time": "2022-09-01T09:37:58+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["mailto:oscar.francis@odt.co.nz"], "authors": ["Author on Source"], "publish_date": "2022-09-01T09:37:58+00:00"}