{"result_id": "330023", "URL": "https://vaccinesafety.info/2022/03/08/official-new-zealand-ministry-of-health-data-shows-the-fully-vaccinated-are-developing-acquired-immunodeficiency-syndrome-the-expose/", "timestamp": "2023-04-25 17:51:38 CEST+0200", "meta": {"description": "But as is always the case here at The Expose, where there is a will, there is a way, and we have managed to uncover the true nature of the current Covid-19", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/03/08/official-new-zealand-ministry-of-health-data-shows-the-fully-vaccinated-are-developing-acquired-immunodeficiency-syndrome-the-expose/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Official New Zealand Ministry of Health Data shows the Fully Vaccinated are developing Acquired Immunodeficiency Syndrome – The Expose", "cleaned_text": "But as is always the case here at The Expose, where there is a will, there is a way, and we have managed to uncover the true nature of the current Covid-19 situation in New Zealand according to the Ministry of Health’s buried statistics, and the data strongly suggests the fully vaccinated are developing Acquired Immunodeficiency Syndrome (AIDS).\n\nThe New Zealand Ministry of Health (NZ MoH) have been publishing a daily ‘Covid-19: Case Demographics‘ report since August 2021, and in it they confirm the number of Covid-19 cases by vaccination status. However, the NZ MoH do not provide an archive of the data. Therefore, once a new update comes out it’s impossible to find what the data was showing the day before, a week before, or even two months before.\n\nBut just like Public Health Scotland originally did before we exposed them, and just like the Government of Canada are doing now, the New Zealand Ministry of Health only provide a cumulative total from the 16th August 21.\n\nWhich is both irritating, and extremely misleading when you consider New Zealand is currently experiencing it’s largest wave of Covid-19 to date by a country mile.\n\nBut that isn’t the only deception. On the 16th August 2021, the date the New Zealand Ministry of Health have chosen to provide a cumulative total from, just 18.4% of the population of New Zealand were considered fully vaccinated.\n\nIt isn’t until around early December that vaccination begins to slow and approximately 75% of the population of New Zealand are considered fully vaccinated. Therefore, it would be very helpful to know the Covid-19 situation by vaccination status after this date, but for some strange reason the New Zealand Ministry of Health do not want you to know that.\n\nHowever, thanks to the gift of the ‘Way Back Machine‘, and the irritating discovery that the New Zealand Ministry of Health recently changed the URL of their ‘Covid-19: Case Demographics‘ report, we have been able to find most of the previous reports, and have then been able to view the true picture of the Covid-19 pandemic in New Zealand by vaccination status, and unfortunately it strongly suggests the fully vaccinated are developing AIDS.\n\nThe following table is taken from the ‘Covid-19: Case Demographics‘ report published 25th Feb 2022, and it shows the number of Covid-19 cases by vaccination status in New Zealand between 16th Aug 21 and 24th Feb 22.\n\nThe following table is taken from the ‘Covid-19: Case Demographics‘ report published 12th Feb 2022, and it shows the number of Covid-19 cases by vaccination status in New Zealand between 16th Aug 21 and 11th Feb 22.\n\nThe following table is taken from the ‘Covid-19: Case Demographics‘ report published 6th Jan 2022, and it shows the number of Covid-19 cases by vaccination status in New Zealand between 16th Aug 21 and 5th Jan 22.\n\nNow all we have to do is perform simple subtraction to determine the true number of Covid-19 cases by vaccination status between 6th Jan and 11th Feb 22, and between 12th Feb and 24th Feb 22. But for the purpose of our analysis we’re only going to concentrate on the fully vaccinated population (2 doses), the unvaccinated population (over 12) and the partially vaccinated population.\n\nThe following chart shows the true number of Covid-19 cases by vaccination status between 6th Jan and 11th Feb, and between 12th Feb and 24th Feb.\n\nAs you can see in both periods the fully vaccinated population have accounted for the majority of Covid-19 cases, but the difference in the number of cases by vaccination status between 12th Feb and 24th Feb is shocking.\n\nMany people might say “this to be expected when the majority of people are fully vaccinated, but vaccination reduces the chances of being infected with Covid-19”.\n\nIt’s all fine and dandy to say that, but can they prove it?\n\nWell the best way to prove it is by looking at the number of cases per 100,000 individuals by vaccination status. But again, the New Zealand Ministry of Health doesn’t want you to know that, so we’ll just have to calculate them ourselves.\n\nThe total population size of New Zealand is 5.084 million.\n\nAnd according to the 2013 census, the number of people in New Zealand under the age of 12 is approximately 578,802.\n\nTherefore, because we’re disregarding the under 12’s due to them being ineligible for vaccination, we’re left with a population size of approximately 4,505,198.\n\nBut because Prime Minister Jacinda Ardern has done such a good job at forcing people to take an experimental injection via Draconian vaccination mandates in New Zealand, there isn’t actually that many people who are unvaccinated, approximately 50,000 or so.\n\nTherefore, for our analysis we are going to group the unvaccinated with the partly vaccinated population and compare them against the double vaccinated population.\n\nSo for the total population size by vaccination status between 6th Jan and 11th Feb, we’re going to go in the middle of the park and use the numbers published on 24th Jan 22.\n\nWhilst for the total population size by vaccination status between 12th Feb and 24th Feb, we’re going to go in the middle of the park and use the numbers published on 18th Feb 22.\n\nAfter some very boring maths we’re left with the following for the 24th Jan –\n\nAnd the following for the 18th Feb –\n\nNow to work out the Covid-19 case rate per 100,000 by vaccination status all we have to do is divide each population size by 100k, and then divide the number of cases by the answer to that previous equation.\n\nThe following chart shows the Covid-19 case rate per 100k population by vaccination status between 6th Jan and 11th Feb, and between 12th Feb and 24th Feb 22 –\n\nThese case-rates certainly pour water on the bonfire of anyone who says “vaccination reduces the chances of being infected with Covid-19”, don’t they?\n\nNow that we know the Covid-19 case-rates by vaccination status we’re able to use Pfizer’s vaccine effectiveness formula to work out the real-world vaccine effectiveness.\n\nThe following chart shows the real-world two-dose Covid-19 vaccine effectiveness between 6th Jan and 11th Feb, and between 12th Feb and 24th Feb 22 –\n\nBetween 6th Jan and 11th Feb the real-world Covid-19 vaccine effectiveness proved to be minus-94.4%, but by the 24th Feb, the real-world vaccine effectiveness fell to minus-281.35%. This means the fully vaccinated are 3.8 times more likely to be infected with Covid-19 than the unvaccinated/one dose vaccinated population. This is what double vaccination has done to the people of New Zealand.\n\nBut vaccine effectiveness isn’t really a measure of a vaccine, it is a measure of a vaccine recipients immune system performance compared to the immune system performance of an unvaccinated person.\n\nThe Covid-19 vaccine is supposed to train your immune system to recognise the spike protein of the original strain of the Covid-19 virus. It does this by instructing your cells to produce the spike protein, then your immune system produces antibodies and remembers to use them later if you encounter the spike part of the Covid-19 virus again.\n\nBut the vaccine doesn’t hang around after it’s done the initial training, it leaves your immune system to take care of the rest. So when the authorities state that the effectiveness of the vaccines weaken over time, what they really mean is that the performance of your immune system weakens over time.\n\nTherefore, in regards to the Covid-19 injections –\n• A vaccine effectiveness of +50% would mean that the fully vaccinated are 50% more protected against Covid-19 than the unvaccinated. In other words the fully vaccinated have an immune system that is 50% better at tackling Covid-19.\n• A vaccine effectiveness of 0% would mean that the fully vaccinated are no more protected against Covid-19 than the unvaccinated, meaning the vaccines are ineffective. In other words the fully vaccinated have an immune system that is equal to that of the unvaccinated at tackling Covid-19.\n• But a vaccine effectiveness of -50% would mean that the unvaccinated were 50% more protected against Covid-19 than the fully vaccinated. In other words the immune system performance of the vaccinated is 50% worse than the natural immune system performance of the unvaccinated. Therefore, the Covid-19 vaccines have damaged the immune system.\n\nThe problem we’re seeing here is that the immune system isn’t returning to its original and natural state. If it was then the outcomes of infection with Covid-19 would be similar to the outcomes among the not-vaccinated/one dose vaccinated population.\n\nInstead, it continues to decline at a rate that means the not-vaccinated population have a better performing immune system, so this means the Covid-19 injections are decimating the immune systems of the fully vaccinated.\n\nBut to work out immune system performance we have to alter the calculation used to work out vaccine effectiveness slightly and divide our answer by either the largest of the vaccinated or unvaccinated case rate.\n\nThe following chart shows the real-world immune system performance of the fully vaccinated population in New Zealand between 6th Jan and 11th Feb, and between 12th Feb and 24th Feb 22 compared to the immune system performance of the unvaccinated population –\n\nBetween 6th Jan and 11th Feb, the immune system performance of the fully vaccinated equated to -49%, meaning they were down to the last 51% of their immune system. But fast forward to 24th Feb, and we find that the immune system performance of the fully vaccinated in New Zealand has fallen to -74%, meaning the fully vaccinated populations immune systems have degraded by a further 25% in just 13 days, and they are now down to the last 26% of their immune system.\n\nIf the fully vaccinated population continues to degrade at the same rate, then they could have developed full blow AIDS by the middle of March 2022.\n\nAIDS (acquired immune deficiency syndrome) is the name used to describe a number of potentially life-threatening infections and illnesses that happen when your immune system has been severely damaged.\n\nPeople with acquired immune deficiency syndrome are at an increased risk for developing certain cancers and for infections that usually occur only in individuals with a weak immune system.\n\nUnfortunately, the New Zealand Ministry of Health data shows that the fully vaccinated population are now just weeks away from developing Acquired Immune Deficiency Syndrome, (AIDS) or a novel condition with similar attributes that can only be described as Covid-19 Vaccine Induced Acquired Immune Deficiency Syndrome (VAIDS), and the repurcussions of this are already being seen in the official Covid-19 hospitalisation statistics for New Zealand –", "opengraph": {"locale": "en_US", "type": "article", "title": "Official New Zealand Ministry of Health Data shows the Fully Vaccinated are developing Acquired Immunodeficiency Syndrome – The Expose - Vaccine Safety Info", "description": "But as is always the case here at The Expose, where there is a will, there is a way, and we have managed to uncover the true nature of the current Covid-19", "url": "https://dailyexpose.uk/2022/03/02/nz-moh-data-fully-jabbed-have-vaids/?fbclid=IwAR1H2RqFvjd9rI91VN7XJdMrcmb33_atSRHQLXDmA_OOEpaZhH8eucofBRk", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "image": "https://vaccinesafety.info/wp-content/uploads/2022/03/5289-nz-22.png", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2022/03/5289-nz-22.png", "image:width": "1200", "image:height": "675", "image:alt": "Official New Zealand Ministry of Health Data shows the Fully Vaccinated are developing Acquired Immunodeficiency Syndrome – The Expose", "image:type": "image/png", "article:published_time": "2022-03-08T03:48:45+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-case-demographics#vaccinations-details", "http://archive.org", "https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-case-demographics#vaccinations-details", "https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-case-demographics#vaccinations-details", "https://web.archive.org/web/20220213230159/https://www.health.govt.nz/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-case-demographics", "https://web.archive.org/web/20220106022928/https://www.health.govt.nz/our-work/diseases-and-conditions/covid-19-novel-coronavirus/covid-19-data-and-statistics/covid-19-case-demographics", "https://figure.nz/chart/3pRQhmIcVu2QCTlm-f4viNoJvwtknd8oD", "https://dailyexpose.uk/2022/02/24/new-zealand-4-in-5-covid-cases-hospitalisations-fully-vaccinated/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2021/12/01/christmas-fundraising-campaign", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/2022/03/05/march-fundraising-campaign/", "https://dailyexpose.uk/asp-payment-box/?product_id=39025", "https://dailyexpose.uk/asp-payment-box/?product_id=39646", "https://www.buymeacoffee.com/dailyexpose", "https://commerce.coinbase.com/checkout/0e00a4d8-4c4a-43b1-8746-6e477dac325d", "https://dailyexpose.uk/2022/03/07/ukraine-destroying-evidence-of-us-funded-bioweapons/", "https://dailyexpose.uk/2022/03/07/vera-sharav-how-eugenics-leads-to-genocide/", "https://dailyexpose.uk/2022/03/07/uk-gov-reveals-triple-vaccinated-account-90-percent-covid-deaths/", "https://dailyexpose.uk/2022/03/06/victims-of-covid-vaccine-damage-arent-statistics/", "https://dailyexpose.uk/2022/03/06/military-grade-psyops-used-to-instil-fear-in-british/", "https://dailyexpose.uk/2022/03/06/russia-distraction-from-fact-covid-jabs-cause-vaids/", "https://dailyexpose.uk/2022/03/06/ivermectin-the-truth-vs-goliath-tess-lawrie/", "https://dailyexpose.uk/2022/03/06/phs-refuse-publish-data-shows-fully-vaccinated-have-aids/", "https://dailyexpose.uk/2022/03/05/putin-signs-new-law-punish-foreigners-human-rights-abuse/", "https://gab.com/dailyexpose", "https://gettr.com/user/dailyexposegb"], "authors": ["The Exposé"], "publish_date": "2022-03-08T03:48:45+00:00"}