{"result_id": "330016", "URL": "https://vaccinesafety.info/2022/05/21/new-study-points-to-longer-duration-of-axillary-lymphadenopathy-after-covid-19-vaccine/", "timestamp": "2023-04-25 17:51:32 CEST+0200", "meta": {"description": "In sharp contrast to previous reporting of side effects from clinical trials of COVID-19 vaccines, new findings from breast ultrasound research revealed a", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/05/21/new-study-points-to-longer-duration-of-axillary-lymphadenopathy-after-covid-19-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "New Study Points to Longer Duration of Axillary Lymphadenopathy After COVID-19 Vaccine", "cleaned_text": "In sharp contrast to previous reporting of side effects from clinical trials of COVID-19 vaccines, new findings from breast ultrasound research revealed a significantly longer duration of axillary lymphadenopathy among people who had COVID-19 vaccination.1\n\nThe retrospective study, which was recently published in the American Journal of Roentgenology, involved 111 patients (mean age of 52) who developed unilateral axillary lymphadenopathy within eight weeks after having the Pfizer or Moderna COVID-19 vaccine. Initial breast ultrasound examination revealed a 4.7 mm mean cortical thickness of the largest axillary lymph node. Patients had subsequent ultrasound exams at four- to 12-week intervals until there was resolution of the condition, according to the study.1\n\nResearchers found that the mean resolution of axillary lymphadenopathy occurred 97 days after the initial ultrasound exam and 127 days after initial administration of COVID-19 vaccination. For the 60 patients who had the Pfizer COVID-19 vaccine, the mean resolution of axillary lymphadenopathy since the first vaccine dose took 117 days in comparison to 139 days since the first dose for the 51 patients who had the Moderna COVID-19 vaccine.1 Previous clinical trials for COVID-19 vaccines had noted an average one to 10-day duration of axillary lymphadenopathy.2,3\n\n“The prolonged resolution time supports a follow-up interval of at least 12 weeks for suspected vaccine-related lymphadenopathy and avoidance of delaying screening mammography after vaccination,” wrote Michele B. Drotman, M.D., chief of the Division of Breast Imaging and associate professor of clinical radiology at Weill Cornell Medical College, and colleagues.\n\nIn order to address patient anxiety and help prevent overdiagnosis of the increased frequency of unilateral axillary lymphadenopathy during the initial vaccine rollout, the Society of Breast Imaging (SBI) initially recommended a delay of breast screening exams until four to six weeks after a second dose of a COVID-19 vaccine. In 2021, the SBI also recommended short-term imaging follow-up at four to 12 weeks for unilateral axillary lymphadenopathy that was suspected to be vaccine-related. In March 2022, the SBI issued an updated recommendation of 12 or more weeks for follow-up imaging, a change that appears to align with the findings by Dr. Drotman and colleagues.\n\n“The presence of subclinical lymphadenopathy and the long resolution time of lymphadenopathy, as observed in this study, should reassure radiologists and patients when lymph nodes suspected to be vaccine-related persist over multiple visits,” emphasized Dr. Drotman and colleagues.\n\nOther predictive factors of a longer duration of axillary lymphadenopathy included greater cortical thickness on the initial ultrasound exam and having the second vaccine dose after initial ultrasound examination, according to the study.\n\nThe study authors acknowledged the potential for selection bias in the retrospective single-center study. Determining a more precise time for resolution of the lymphadenopathy was hampered by variability in the time between follow-up ultrasound exams and subsequent four to 12-week follow-up intervals, according to Dr. Drotman and colleagues. They also noted that patients with concurrent breast cancer were excluded from this study and that unilateral lymphadenopathy requires careful assessment in this patient population.\n\n1. Lane EG, Eisen CS, Drotman MB, et al. Time for resolution of COVID-19 vaccine-related lymphadenopathy and associated factors. AJR Am J Roentgenol. 2022 May 18. doi: 10.2214/AJR.22.27687. Online ahead of print.\n\n2. Local reactions, systemic reactions, adverse events, and serious adverse events: Moderna COVID-19 vaccine. Centers for Disease Control and Prevention. Available at: https://www.cdc.gov/vaccines/covid-19/info-by-product/moderna/reactogenicity.html . Accessed May 20, 2022.\n\n3. Local reactions, systemic reactions, adverse events, and serious adverse events: Pfizer COVID-19 vaccine. Centers for Disease Control and Prevention. Available at: https://www.cdc.gov/vaccines/covid-19/info-by-product/pfizer/reactogenicity.html", "opengraph": {"locale": "en_US", "type": "article", "title": "New Study Points to Longer Duration of Axillary Lymphadenopathy After COVID-19 Vaccine - Vaccine Safety Info", "description": "In sharp contrast to previous reporting of side effects from clinical trials of COVID-19 vaccines, new findings from breast ultrasound research revealed a", "url": "https://www.diagnosticimaging.com/view/new-study-points-to-longer-duration-of-axillary-lymphadenopathy-after-covid-19-vaccine", "site_name": "Vaccine Safety Info", "article:tag": "Weill Cornell Medical College", "article:section": "Uncategorized", "image": "https://vaccinesafety.info/wp-content/uploads/2022/05/5577-6b42b54af8cbb889ccfd5104ea7fb5cfcc839131-624x233.png", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2022/05/5577-6b42b54af8cbb889ccfd5104ea7fb5cfcc839131-624x233.png", "image:width": "624", "image:height": "233", "image:alt": "New Study Points to Longer Duration of Axillary Lymphadenopathy After COVID-19 Vaccine", "image:type": "image/png", "article:published_time": "2022-05-21T14:52:03+00:00"}, "tags": ["COVID Vaccine", "Weill Cornell Medical College", "Clinical trials for COVID-19 vaccines", "Society of Breast Imaging (SBI)", "covid-19 vaccine", "Pfizer COVID-19 Vaccine", "Society of Breast Imaging", "Axillary Lymphadenopathy", "Subclinical lymphadenopathy", "covid 19", "MD", "Ultrasound", "Breast Ultrasound", "covid", "Axillary Lymph Node", "via bookmarklet", "COVID-19", "Michele B. Drotman", "Moderna COVID-19 Vaccine"], "tweets": [], "movies": [], "links": ["https://www.ajronline.org/doi/10.2214/AJR.22.27687", "https://www.cdc.gov/vaccines/covid-19/info-by-product/moderna/reactogenicity.html", "https://www.cdc.gov/vaccines/covid-19/info-by-product/pfizer/reactogenicity.html"], "authors": ["Author on Source"], "publish_date": "2022-05-21T14:52:03+00:00"}