{"result_id": "330044", "URL": "https://vaccinesafety.info/category/vaccines/", "timestamp": "2023-04-25 17:51:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/category/vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Vaccines", "cleaned_text": "These are the key points one has to understand to be able to capture the never-ending discussion on whether or not mass vaccination campaigns work\n• Pandemics are by definition not static but dynamic events\n• Pandemics have both detrimental and beneficial effects (e.g., waves of morbidity & death and generation of herd immunity, respectively) that are phased in time\n• Pandemic waves hit populations of different age groups at different points in time\n• Normally (I should say: ‘naturally’), a pandemic starts with some bad news (a number of lives are lost) and ends with plenty of good news (all of the population protected by herd immunity)\n\nThis already illustrates that any assessment made during the course of a pandemic can only be a snapshot as long as the pandemic has not reached its ‘natural’ end station (which is herd immunity).\n\nAs a result, one might erroneously assume that pandemic is over when the first wave ends with a steep decline in morbidity and mortality rates. That happens when someone doesn’t understand that herd immunity (HI) cannot be achieved if the number of vulnerable people who recovered from the disease and acquired robust immunity is too small.\n\nThat is why – after the first wave – the virus launches a new attack. This results in an additional part of the population (i.e., younger age groups) contracting the disease. Survivors of that 2nd attack will build life-long protective immunity too and, thereby, further contribute to building herd immunity. The mechanism that allows the virus to proceed with its offensive, step-by-step strategy is sophisticated, as repeatedly explained in previous contributions of mine. Several waves can take place before the resulting immunological capacity of the population will suffice to establish full-fledged HI and hence, to control viral transmission.\n\nIt’s important to note that a high background level of innate population-level immunity will prevent the virus from wiping out a whole population. Part of this immunological capacity will be eroded as the infectious pressure rises; however, it will subsequently be replaced by robust, naturally acquired immunity when people who became vulnerable recover from the disease. This mechanism enables the host population to keep the virus under control while – in return – providing the virus with a renewable reservoir for asymptomatic transmission (i.e., by virtue of asymptomatically infected people). This is how Sars-CoV-2 could have become endemic. Under such circumstances, short-lived (i.e., self-limiting) outbreaks may intermittently occur when the innate immune defense of a sufficient number of previously asymptomatically infected subjects becomes sufficiently suppressed, for example as a result of high infectious pressure (e.g., due to crowding). So, nature has shaped the interaction between the virus and the population in ways that provide a homeostatic balance between protective HI on one hand and virus survival on the other.\n\nLet’s now consider the additional impact of human intervention on the Sars-CoV-2 pandemic. Human intervention too may have both detrimental and beneficial effects which may be age-dependent as well and equally evolve over time.\n\nMore importantly, influences from human intervention will interfere with those caused by the evolutionary dynamics of a natural pandemic. Infection prevention measures may, for example, have a beneficial short-time effect in that they diminish viral transmission and, therefore, reduce morbidity rates in vulnerable people (i.e., primarily in the elderly). In the longer run, however, they may lead to insufficient training of innate immune mechanisms, which would primarily become manifest in those who primarily rely on innate immunity as a first line of immune defense (i.e., children).\n\nLikewise, mass vaccination campaigns may have a beneficial short-time effect in that they reduce viral spread and protect vulnerable people from disease (e.g., elderly people and those with underlying disease), but will eventually drive the propagation of more infectious variants.\n\nDominant circulation of the latter will lead to a resurgence of viral infectious pressure, thereby eroding the innate immune defense of the unvaccinated (i.e., mostly younger age groups including children) and thus making them more susceptible to contracting Covid-19 disease. This already explains why mass vaccination campaigns conducted in the middle of a pandemic will only cause Sars-CoV-2 to engender more disease and claim more human lives. Because of this mass vaccination program, waves of morbidity will continue for much longer, as more (recovery from) disease cases will be required to compensate for the erosion of the population’s innate immunity and, therefore, to make up for the latter’s deficient contribution to HI.\n\nWhen one considers that all of these effects, whether beneficial or detrimental, will mutually interfere and that the average of population segments that are adversely or favorably affected by the overall impact of this multifactorial phenomenon will shift over time, it can become very complex and challenging to elucidate whether any single human influence has a beneficial or detrimental impact. It all depends on what ‘endpoint’ (e.g., protection against infection versus protection against disease) one is looking at in which part of the population at which stage of the pandemic and within which environmental context. On the other hand, the extent of infection-prevention measures, the distribution of vaccine coverage rates and the time point of emergence of new dominant circulating variants and their level of infectiousness may dramatically differ between countries/ regions and so will the corresponding ‘snapshot’ results recorded for a particular country/ region.\n\nThis is why experts currently look at the impact of mass vaccination campaigns either as at a glass that is half full (‘the vaccines work’!) or one that is half empty (‘the vaccines don’t work well enough’).\n\nThat is precisely THE issue: A vaccine that only prevents hospitalizations and severe Covid-19 disease is not good enough to be used to combat a pandemic.\n\nFrom a global or even public health perspective, these are, therefore, not the right criteria to evaluate the success of mass vaccination campaigns deployed during a pandemic. Using these criteria as an indicator of the level of control over the pandemic will inevitably lead to a further escalation of this morbidity and mortality rates.\n\nThere should be no doubt that non-transmission-blocking vaccines (i.e., so-called ‘leaky’ or ‘imperfect’ vaccines) can never ever control a pandemic, even though they may temporarily protect against disease. Only temporarily? Yes, indeed. Given the globally increasing immune pressure and concomitant infectious viral pressure, genomic epidemiologists have no doubt that this pandemic roller coaster will not stop before it takes us over the cliff into the abyss of complete viral resistance to anti-spike (S) antibodies. That is where all runaway trains of the different ongoing pandemics of highly infectious variants will be coming together and converge into a big whirl where they can no longer be distinguished from one another.\n\nThe first stages of this evolution is what we now begin to see in countries which have already massively vaccinated their population (e.g., Israel). There is no doubt that other countries like the United Kingdom and the United States will soon go down the same path.\n\nDue to increasing resistance to neutralizing anti-S antibodies (Abs), these countries are now even beginning to shift from a primarily beneficial (i.e., less susceptible to severe disease) to a primarily detrimental effect (more susceptible to severe disease) in the vaccinated as compared to the unvaccinated ( ).\n\nThe current situation is highly problematic as ALL segments of the population will dramatically suffer from a situation where anti-S Abs still bind strongly enough to suppress the vaccinee’s innate immune response against non-mutable, highly conserved Coronavirus (CoV) motifs while no longer being able to sufficiently neutralize highly infectious variants. Instead, poor binding affinity of anti-RBD (receptor-binding domain) Abs to Sars-CoV-2 S protein as a result of mutations in the N-terminal domain (NTD) could tip the scale in favor of infection-enhancing Abs and thereby make vaccinees prone to suffering Ab-dependent enhancement (ADE) of Covid-19 disease (Liu et al., 2021; Yahi N et al., 2021).\n\nViral resistance to these S-specific Abs is a terrifying thought as spike protein is not only required but sufficient for enabling CoV infectiousness and pathogenicity (Belouzard S, 2012; Weiss and Navas-Martin, 2005).\n\nThis underscores the importance for each and every Public Health authority to look beyond the end of their nose to understand where this train is heading instead of focusing on intermediate stations (snapshots!) that – in contrast to the end station – look extremely different depending on a number of population-specific environmental and human influences.\n\nAs distinct types and dynamics of protection are now concomitantly shaping the ‘phenotypic’ characteristics of the pandemic, some people tend to make conclusions that are merely based on correlations. However, correlation does not imply causation. The most telling example of this can be found in countries which dramatically scaled up their mass vaccination campaigns in the midst of a spectacular surge of cases.\n\nThe subsequently observed decline of morbidity and mortality rates is often attributed to the ‘success’ of the aggressive mass vaccination campaign (e.g., in UK, Israel and, more recently, in India where a steep decline in cases occurred in Jan-Feb 2021 and May-June 2021, respectively).\n\nHowever, many elements argue against the conclusion that mass vaccination triggered the rapid and dramatic decrease in cases. First, these mass vaccination campaigns were flanked by stringent infection-prevention measures, even including lockdowns (e.g., UK, Israel) and have, more recently, been shown to not prevent transmission of highly infectious variants (such as the Delta variant).\n\nSecondarily, it is well known that natural immunity in its own right can abrogate a surge in cases during a natural pandemic and result in a steep decline of viral infectivity rates. The latter always results from the combined effect of naturally acquired antigen-specific immunity following recovery from disease (typically occurring in the more vulnerable part of the population) and innate oligospecific immunity that serves as the first ‘generalist’ line of immune defense, particularly in younger and healthy age groups.\n\nThese are the cornerstones on which herd immunity will eventually be established. Mass vaccination can only contribute to a decline in cases to the extent that it diminishes viral transmission and, hence, the likelihood for young and healthy people to become re-exposed to Sars-CoV-2 shortly after their previous infection, i.e. at a point in time where they become susceptible to the disease because of temporary suppression of their innate oligospecific Abs (Vanden Bossche, August 2021).\n\nAs already mentioned, though, the beneficial effect of mass vaccination on viral transmission is only of short duration as universal vaccination campaigns provide more infectious immune escape variants with a competitive advantage and eventually enable them to reproduce more effectively.\n\nIndia, for example, has recently been witnessing a spectacular decline in cases although clear evidence has been provided that Covid-19 vaccines have, if at all, only minor impact on transmission of the highly infectious Delta variant, which was responsible for India’s surge in cases during April-May 2021.\n\nThis is unambiguous proof that the steep decline in cases was primarily caused by immune defense mechanisms that were not based on protection from disease (as provided by Covid-19 vaccines) but on protection from infection and transmission (as provided by natural immunity).\n\nInnate polyreactive Abs that are directed against non-mutable common structures of otherwise highly mutable CoVs likely protect against all kinds of different CoVs, including their variants. This is in sharp contrast to anti-S-specific vaccinal Abs, which can escape from spike variants.\n\nIt is fair, therefore, to conclude that mass vaccination campaigns are not responsible for the abrupt decline of cases observed after a prominent surge but that this effect is primarily due to the sterilizing effect of both acquired and innate antiviral immunity. This clearly illustrates that declines in surges that are correlated with an aggressive roll-out of mass vaccination campaigns do not imply that these campaigns are the cause of the decline.\n\nConclusively, mass vaccination campaigns during a pandemic of highly infectious variants fail to control viral transmission.\n\nInstead of contributing to building HI, they dramatically delay natural establishment of HI (Vanden Bossche, August 2021). This is why the ongoing universal vaccination campaigns are absolutely detrimental to public and global health.\n\nSeparating the wheat from the chaff\n\nThe above examples already illustrate why it is so critical to separate the wheat from the chaff and to not even consider advice from people, sometimes even scientists, who have no profound understanding of the dynamics of host-pathogen interactions.\n\nThey are simply unable to understand that the outcome of these interactions continuously evolves as a result of changing infectious viral pressure due to changing environmental conditions.\n\nPeople, no matter their names and reputation, who are not knowledgeable in the fields of immunology, virology, vaccinology and evolutionary biology/ epidemiology are, therefore, not a good source for information or advice.\n\nThis particularly applies to politicians.\n\nThe vast majority of them are not only scientifically illiterate but they are typically also unable or unwilling to work in a mid- or long-term perspective. Because they have no understanding whatsoever of the evolutionary dynamics of this pandemic, they simply do not understand that the rise in cases of disease currently observed in a number of European countries as well as in the US is due to enhanced circulation of more infectious variants that enjoy exceptional training as mass vaccination only increases the immune pressure exerted by the overall population.\n\nTheir simplistic reasoning make them conclude that vaccinating the unvaccinated (i.e., younger age groups and children) is going to solve the problem, whereas each and every independent (!) knowledgeable expert understands that this is only going to further raise the population-level immune pressure on viral infectiousness and, therefore, promote the adaptation of additional mutations that will eventually enable full neutralization escape of circulating, highly infectious variants (Vanden Bossche, June 2021).\n\nAre my peers from the Vaccine Industry not allowed to engage in a scientific discussion, or maybe not even allowed to talk at all?\n\nIt was no later than early March 2021 when, in response to my call urging all Global Health organizations and influential regulatory agencies to stop mass vaccination, that I received a reply of one of the most renown vaccinologists on this planet, a true icon in the field of vaccinology.\n\nHe was courageous enough to share that I was right and that these vaccines would basically only breed new variants but that it would not be worth going against the current because people would not listen.\n\nThat is when I realized that a narrative started to circulate that used whatever possible tools in trying to invalidate and destroy any argument that scrutinizes the rationale behind the mass vaccination program, even though it could be predicted for a fact by any experienced vaccinologist that such an experiment would not lead to a happy end, and certainly not to herd immunity.\n\nIf this person spoke out, neither the WHO nor any other international or public health organization would have had a choice other than to give the mass vaccination program at least a second thought. It’s likely, however, that the top vaccinologists on the globe appeared to think it was more prudent to keep quiet while hoping they could soon make up for the bad start by designing a ‘smarter’ approach for a second-generation vaccine.\n\nI’ve been trained in vaccinology in the Vaccine Industry.\n\nSo, isn’t it surprising that I am not receiving any feedback from my previous peers on any of the several articles I shared so far? It usually just takes a single message on MSM or in an email before you get connected for an exchange on a topic of mutual interest. Are all of them all of a sudden bound to a code of silence? I don’t know.\n\nI am only finding that among the many messages I am receiving on a daily basis, not a single one comes from the Vaccine Industry. However, these are the people who’re most knowledgeable about vaccines and the impact they have at a population level.\n\nOnly the Vaccine industry can afford to pay the very best vaccinologists, immunologists, epidemiologists and virologists on this planet and bring them together around one and the same table. I cannot rid myself of the impression that none of them is even allowed to speak or to even share any kind of comment on social media.\n\nSo, I feel like I am wasting my time talking to scientific illiterate “fact-checkers” or people who have no hands-on experience in vaccinology. But no matter how hard the “fact-checkers” try to debunk my scientific arguments, all of them ended up retreating with tails tucked firmly between their legs. Not that I am considering this as a compliment: Their background in immunology, virology, vaccinology or evolutionary biology does not usually suffice to grasp the complexity of the evolutionary dynamics of this pandemic which is now increasingly shaped by man. Some of these “fact-checkers” are MDs or even professors who merely rely on their title or reputation for gaining sufficient confidence to extrapolate their knowledge to fields of science in which they are anything but knowledgeable about. Names of some of the most arrogant ones can be found on my website; they will forever be engraved in my memory.\n\nFor lack of an open discussion with experts from the Vaccine Industry, some academics and self-appointed colleagues from the classical pharmaceutical Industry have stepped in to present their statements and arguments on why mass vaccinations are not a good idea. Unfortunately, they have not always brought the correct arguments to the table, primarily for lack of understanding of immunology. Some have suggested that herd immunity is already well established as a result of cross-immunity between Sars-CoV-2 and other CoVs, or that T-cell based immunity would prevent the virus from evading vaccine-induced immunity or that it would only make sense to massively vaccinate the elderly or vulnerable people. I fundamentally disagree with all of these statements as I have previously explained in several of my social media posts.\n\nLack of scientific consolidation of the arguments that have been advanced to counter mass vaccination campaigns has only added to the confusion of the broader public and been grist to the mill for fact checkers. Indeed, it’s not that the latter are only devoid of any relevant scientific background in this field, they are – more than anything else – executing on a political agenda and paid for undermining the credibility of independent scientists and ridiculing their scientific arguments. Their vicious tactics are tailored to the level of understanding of the broader public and targeted at amplifying the current short-sighted narrative and spreading the mantra of mass vaccination, no matter what.\n\nThe ever-changing narrative ( see table at the bottom ) and the never happening opportunity for an open scientific debate\n\nInitially, people were told that ‘the more you vaccinate, the more you will prevent mutants from being generated and the less more infectious variants will spread’. This mantra proved miserably wrong as not only viral spread has increased in a number of countries despite very high vaccine coverage rates but it has now also become clear that the vaccinated spread the virus as much as the unvaccinated do (whereas it is even highly likely that vaccinees are a more important source of transmission of naturally selected, highly infectious variants ).\n\nSadly enough, even a number of MDs have joined the club of fact checkers and have been taking advantage of their titles and reputation to divulgate simplistic and erroneous interpretations of the effect of mass vaccination campaigns.\n\nI cannot emphasize enough that, although none of them combine sufficient knowledge of virology, immunology, vaccinology and evolutionary biology to be able to understand what is driving the evolution of these pandemics towards a disastrous outcome, they have engaged in vilifying attacks that excelled in arrogance but were never built on solid scientific grounds.\n\nAs if none of this were sufficient, TV channels and MSM have blindly supported the destructive rhetoric of plenty of substandard fact checkers instead of providing a forum for an open scientific debate. Furthermore, the travel and meeting restrictions that come with the Covid-19 crisis have made it very difficult to align and organize our science-based defense against the irrational and offensive mass vaccination campaigns. This is just another obstacle which makes it even more challenging to share and consolidate our findings and analyses with peers and other scientists.\n\nAll of this has only added to the confusion of those who initially saw themselves confronted with the difficult choice between getting the shot or letting it pass but are now often pressured to getting jabbed for risk of losing their job.\n\nMy story won’t end like Don Quixote’s fight with the windmills…\n\nOf course, if none of our arguments is taken seriously, if any offer for an open public debate gets declined, if we’re only getting insulted, vilified and humiliated, if all counter-arguments are targeted at undermining our credibility, if independent scientists are being played for fools and end up being censored and silenced on all MSMs, one has no choice but to hope that ‘the people’ will finally wake up, start to do their own research and rely on their common sense before taking an informed decision on how to react to this crisis.\n\nAs an independent expert, I have come to the conclusion that if stakeholders override the emergency brake, it is better to concentrate on solutions for when the crash takes place.\n\nThe wake-up shock is unlikely to occur before the percentage of Covid-19 disease and death in vaccinees largely exceeds that observed in the unvaccinated group in at least several of the ‘model’ countries (let’s hope that by then we will still have an unvaccinated control group).\n\nSuch an observation would indicate that the virus has largely escaped from neutralization by vaccine-induced Abs. Given the speed at which the virus is currently evolving, one cannot imagine that we will go through another winter before viral resistance will have occurred in a number of countries with high vaccine coverage rates.\n\nOne can always do more, write more articles, bring more scientific evidence to the table, do more interviews and podcasts, reply to more questions and destroy more of the non-sense divulgated by scientifically incompetent experts or illiterate fact checkers.\n\nHowever, I’ve decided to not continue along this path as I knew from the very start that this big alliance of stakeholders would not listen and as the primary purpose of my endeavors has always been to share, as broadly as possible, my scientific insights on why this experiment is an incredible blunder, so that none the involved experts, key opinion leaders, public health authorities or peers from Industry could ever pretend that this was unknown and simply unpredictable (as they tend to say: ‘Nobody has a crystal ball’!).\n\nI am a seasoned vaccinologist and have gone several times against groupthink, which, unfortunately, also happens in science. My upper management didn’t want to listen to me when about 15 years ago I predicted that a Herpes simplex virus type-2 (HSV-2) vaccine candidate would not protect against infection and only turn vaccinees into asymptomatic carriers (much as Covid-19 vaccines do), who could then inadvertently transmit genital herpes disease to their partner. I deliberately quitted my position as project manager of that project as I considered the candidate vaccine an unethical immune intervention.\n\n Similar things happened when I was working with GAVI and pointed out that the results of the phase III Ebola vaccine trials conducted by WHO and published in a peer-reviewed journal were falsely concluding that the vaccine had an efficacy of 100%. As everyone will appreciate from the scientific report posted on my website , the truth looked extremely different.\n\nI am getting vilified for pretending to have a crystal ball (which, in fact, I never did) whereas ‘nobody could reasonably predict the outcome of this pandemic’. To me, such allegations simply illustrate that many of our experts and scientists, even including a substantial number of renowned professors, are so stuck within their small silos that they have simply lost touch with reality.\n\nAs I previously stated (see my article: Separating the wheat from the chaff), analyzing a pandemic is essentially about putting the pieces of a complex, multidisciplinary puzzle together. It’s not primarily about biological stamp collection of molecular details and the accumulation of ever-growing data sets within an isolated scientific discipline. A handful of very different pieces that match well together will often provide more insight than tons of pieces that don’t match. That’s the approach I’ve followed all along and which I’ve used to extensively predict the outcome of this pandemic, i.e., before and after complete viral resistance to anti-S antibodies will have occurred.\n\nI am not changing any of my predictions. However, one should not fall prey to frustration about the downfall of science, or to anger about all of the ongoing injustice, or to fear for the upcoming escalation of this crisis. Instead, I’ve decided to convert all of this negative energy and influences into fine-tuning and further developing a more rational and scientifically ‘healthy’ approach to educating our immune system on how to fight a diversified spectrum of highly infectious Sars-CoV-2 variants and, more generally, on how to enable its preparedness to future pandemics (see below).\n\nAs HI is no longer considered within reach (in fact, it should never have been!), there is no longer a clear-cut goal for conducting the mass vaccination program. Without such a goal, there can be no strategy either to get to the endgame and bring a panoply of highly contagious circulating variants under control. Currently, we’re witnessing a variety of complex, mostly scientifically irrational, tactics that countries are using in a desperate attempt to extinguish or avoid the never-ending pandemic waves.\n\nNone of our political leaders or policymakers seems to even understand that the word pandemic relates to an infectious disease that spreads across multiple continents or worldwide. So, instead of collaborating on a strategic global plan, each of them seeks to hunting down the virus locally.\n\nSo, let’s summarize the major issues associated with mass vaccination campaigns to then reflect on how we could remedy them knowing that mass vaccination campaigns may not stop any time soon .\n\nFrom a purely public health perspective, the negative consequences of the ongoing mass vaccination campaigns can be summarized as follows:\n• Instead of forcing the virus into endemicity, mass vaccination campaigns will force more infectious viral variants into adaptation to the viral environment (i.e., the host[ile] population’s immune defense). This is to say that these campaigns will eventually drive dominant propagation of super variants that are not only highly infectious but that also increasingly resist vaccine-induced neutralizing Abs and could even be more virulent\n• Erosion of innate immune defense in the non-vaccinated (due to high infectious pressure exerted by enhanced circulation of more infectious variants)\n• Erosion of naturally acquired immunity (due to increasing viral resistance to neutralizing S-specific Abs)\n• 2) and 3) combined prevent herd immunity from being established\n\nGiven all of these detrimental consequences, the question arises as to how on earth will we protect the human population from Covid-19 disease when the vaccines themselves will no longer be able to do so?\n\nThe answer is simple: Via herd immunity!\n\nBut how on earth can we build HI after the vaccines will precisely have prevented herd immunity from being established (due to erosion of both, naturally acquired and innate immunity as a direct or indirect consequence of mass vaccination, respectively)?\n\nSo, this comes down to asking ourselves the question as to how the population can build HI if it will have to start from scratch and is now even facing viral variants that are far more infectious, and potentially even more virulent, than the virus which circulated at the outset of this pandemic.\n\nHere comes the answer:\n• Early treatment of people showing first sign and symptoms will result in enhanced rates of recovery from disease and, therefore, raise the number of people who develop life-long protective immunity against the viral variant they got infected with as well as against a diversified spectrum of other, more infectious circulating variants. Enhanced recovery rates will, therefore, contribute to building HI.\n\n This particularly applies when a large percentage of the population becomes highly susceptible to Covid-19 disease. Starting multidrug treatment at an early enough stage of the disease may, however, become much more challenging when dealing with ADE.\n• Mass antiviral treatment with whatever drug that effectively reduces viral infectious pressure. This will prevent innate Abs in previously asymptomatically infected individuals from being suppressed by short-lived, S-specific Abs and thus, enable the healthy, unvaccinated part of the population to deal with all Sars-CoV-2 variants.\n\n Such mass antiviral campaigns may need to include pets and live-stock and be combined lockdown rules for as long as titers of these short-lived Abs are measurable (i.e., 6-8 weeks). In addition, healthy unvaccinated individuals are likely to contribute to further reducing viral infectious pressure as has recently been observed in the UK shortly after it opened up its society and economy following a period of lockdown rules . The higher the fraction of the unvaccinated population, the more ‘more infectious’ immune escape variants face competition from circulating less infectious variants and the more dominant circulation of more infectious variants can be attenuated.\n• As Sars-CoV-2 is notorious for causing high viral shedding in the upper respiratory tract at an early stage of infection and has a high proportion of transmission even in pre‐symptomatic and asymptomatic individuals , the above measures are unlikely to succeed in sufficiently reducing transmission among healthy individuals.\n\n Asymptomatic Sars-CoV-2 transmission may become problematic in that it could result in regular outbreaks, especially in areas with higher population density (e.g., in cities) or at times where people have close physical contact (e.g., when they live more indoors during winter or at mass gatherings).\n\n A durable control of the pandemic will, therefore, ultimately require an immune intervention that is able to prevent infection in all age groups that are naturally susceptible to Covid-19 disease (those are likely to include some age groups < 65 years due to the high level of innate immune suppression exerted by highly infectious circulating variants). As long as such an immune intervention is not available, antiviral chemoprophylaxis may need to be repeated at regular intervals. However, antiviral chemoprophylaxis should not be considered a long-term strategy since overuse of any antiviral compound could potentially promote viral resistance to it. It will, therefore, be critical to closely monitor viral infection rates and restart antiviral chemoprophylaxis as soon as a new surge in cases is about to start.\n\nBecause a durable control of the pandemic may not be possible without preventing infection in all age groups that are naturally susceptible to Covid-19 disease, I’ll start to focus my efforts – more than ever before – on advancing vaccine research work on NK cell vaccines. I remain convinced that this is the only human intervention possible to provide a durable and universal immune protection against a panoply of highly infectious, circulating Sars-CoV-2 variants while also ensuring preparedness to other future potential pandemics.\n\nNo single S-based vaccine will succeed in controlling this pandemic because the spike protein is highly mutable and universal vaccination using S-based vaccines during a CoV pandemic will only promote propagation of naturally selected, more infectious immune escape variants as the latter become increasingly well trained to reproduce when exposed to widespread S-directed immune pressure exerted by a massively vaccinated population. There is no way that any S-based vaccine could block viral transmission in the context of mass vaccination during a pandemic. As the spike protein is not only required but even sufficient for viral infectiousness, even inclusion of other conventional, i.e., foreign-centered, proteins in the vaccine formulation is not going to prevent more infectious variants from being selected and expanding in prevalence.\n\nNK cell-based vaccines are the only type of vaccines that could conceivably prevent immune escape upon use in vaccination campaigns conducted during a pandemic. This is because NK cell vaccines are capable of targeting non-mutable, phylogenetically conserved motifs in otherwise highly mutable viruses, and pathogens in general. Similarly to natural Abs, NK cells recognize all variants of the virus and are, therefore, characterized by multi-specific targeting.\n\nOver the last 10 years, increasing evidence has been generated that NK cells can also acquire memory. Provided vaccines can educate NK cells to recognize conserved, pathogen-encoded molecular patterns in ways they can memorize, primed NK cells could be recalled upon future exposure to the original virus, or any variant thereof, sometimes even including phylogenetically unrelated pathogenic agents. NK cell vaccinology is still an emerging field, and it is met with a high level of scrutiny and not receiving significant attention in mainstream vaccinology. The role of NK cells as a potential target for vaccines is highly controversial and not yet part of the vaccine paradigm. There can be no doubt, however, that because of their oligospecificity and lack of Major Histocompatibility Complex (MHC)-restriction, NK cells are ideally equipped to target and kill a broad spectrum of viral variants, regardless of the immunogenetic background of the host.\n\nThis is not possible at all with conventional Abs or T cells. If we still believe in some old vaccine wisdom saying that ‘a vaccine is only as good as the antigen it contains’, the challenge to designing a functional NK cell vaccine comes down to identifying the type of antigen that is capable of educating innate NK cells to recognize pathogen-associated motifs that, on one hand, are reminiscent of self and, on the other hand, are characterized by a high level of homology across a multitude of distinct pathogens. This is the only type of vaccines that could protect against a series of viral pandemics caused by a diversified spectrum of distinct viruses expressing some common, phylogenetically conserved, structures on the surface of infected cells.\n\nI’ve already been providing ample information to the Vaccine Industry about the simple and straightforward concept I’ve been designing back 10 years ago (and which I recently fine-tuned based on additional experiments). As with my Ebola report, many parties are interested in hearing and learning more about new insights and disruptive innovation, but then some ‘scientific groupthink’ kicks in, which all of a sudden appears to silence their interest. One can only wonder why the Vaccine Industry is not interested in further exploring the feasibility of a highly promising concept that could truly revolutionize Vaccinology.\n\nCould it be that universal vaccines are only attractive from a scientific viewpoint but that universal vaccination is much more attractive from a commercial perspective?\n\nDriven by a passion for the truth and a moral obligation to find science-based solutions\n\nBesides my focus on further exploring the feasibility of an NK cell-based vaccine, I will continue to follow the further evolution of this new, man-shaped pandemic and provide meaningful support whenever possible or even have additional interviews, provided their reach and impact is substantial. However, as much as I would like to continue answering the innumerous questions I am receiving on a daily basis on MSM, I will have to face reality as neither time nor resources permit.\n\nAs stated in my third and last letter to all Global Health and influential regulatory agencies, I remain open to any public scientific debate and to providing help to solving this crisis in any way I can.\n\nAt this stage, though, it appears extremely difficult for public health agencies to admit that substantial mistakes have been made and that a fundamentally different approach is needed to first mitigate the situation to then design a more rational strategy for fighting the ongoing pandemic in particular, and being prepared to potential future pandemics in general.\n\nElected officials and staff can hide or quit their job, but that is not going to help us solve the problem. To be open, I am not sure how this crisis will end if our governments and health agencies continue their irrational stubbornness and rather prefer to watch the master (i.e., the virus) at work than to turn the tide.\n\nHow can we, the vaccinated and unvaccinated people, best protect ourselves and others in the highly likely event that the virus becomes resistant to both the current Covid-19 vaccines and upcoming booster immunizations?\n\nAs indicated on the website, I am afraid to re-iterate that I cannot give any personalized advice to people. I do want to emphasize, however, that nothing of what I shared on my website, social media or alternative broadcasting platforms in terms of public health advice would not also apply to people’s individual health.\n\nI’d like to summarize a few general recommendations on how people can protect themselves against highly infectious variants in countries with high vaccine coverage rates (i.e., assuming full isolation is not an option):\n\nIn case one got vaccinated, it is important to realize that protection from the vaccine is waning, not that much because the vaccinal Ab titers are dropping (one still has B memory cells that can be recalled), but because the predominantly circulating viral lineages now consist of highly infectious variants (e.g. Delta variant), the S protein of which is no longer well recognized by the vaccinal Abs, which are directed against the original Wuhan strain.\n\nAs a result, the vaccines continue to work for the time being, in that they still protect well against severe disease, but they don’t work well enough, in that they’re no longer diminishing transmission or even largely protecting vaccinees from mild to moderate disease.\n\nDue to the ongoing evolutionary change of circulating variants in response to enhanced S-directed immune selection pressure exerted by massively vaccinated populations, the decline in the protective capacity of vaccinal Abs will only become more and more pronounced.\n\nIt seems like a no-brainer that vaccinees should, therefore, be well prepared to using early treatment as soon as they experience any early sign or symptom that might be related to Covid-19 disease.\n\nIn this way, they can dramatically increase the likelihood of protection from enhanced disease, avoid hospitalization and enable their immune system to build protective immunity, not only against the Sars-CoV-2 variant they got infected with but, most likely, to other more infectious circulating variants as well.\n\nEarly, multidrug therapy has now been extensively described in the literature as being very successful in preventing severe disease and hospitalization (McCullough P, et al., 2020). Of course, physical exercise, getting enough rest, healthy nutrition and lifestyle, as well as dietary supplements (e.g., zinc, vitamin B and D) may help counter suppression of innate Abs by vaccinal anti-S Abs and, thereby, reduce the risk of contracting severe Covid-19 disease (Af Geijerstam A et al., 2021; Sallis R et al., 2021; Samad N et al., 2021; Shakoor H et al., 2021; Teshome A et al. 2021).\n\nEarly treatment is, of course, also indicated for the unvaccinated who develop early symptoms of Covid-19 disease. However, as will follow from the section below, the main challenge for them is to preserve the functional capacity of their innate Abs which – in contrast with the situation for vaccinees – are not suppressed by long-lived S-specific Abs that bind with much higher affinity to spike protein.\n\nOnce the virus has escaped from neutralization by anti-S Abs, avoidance of high infectious pressure may not be sufficient for vaccinees to protect themselves from contracting the disease. Their priority, therefore, should not be targeted at receiving never-ending booster shots, as those will only expedite viral resistance , but on educating themselves on concrete options for gaining access to early outpatient treatment.\n\nIn case one is not vaccinated, it will be critical to continue avoiding exposure to high infectious pressure. This is to say that one should adhere to stringent protective measures, especially when attending indoor gatherings, particularly in spaces that are not well ventilated.\n\nFor an unvaccinated person, viral re-exposure can be very problematic for as long as titers of short-lived anti-spike Abs are measurable in their blood (these Abs last for max. 8 weeks after previous asymptomatic infection). During the lifetime of these short-lived Abs, innate, variant-nonspecific Abs are suppressed and thereby render unvaccinated individuals more susceptible to Covid-19 disease.\n\nIt would, therefore, be of tremendous help if a reliable finger prick self-test became commercially available in order for unvaccinated individuals to be able to measure their anti-S Abs such as to assess their susceptibility to disease . Positive anti-S Ab titers would require them to use a high level of caution in their contacts whereas a negative test result combined with a decent health status would indicate that their innate Abs are fully functional (Vanden Bossche, June 2021; Vanden Bossche, August 2021).\n\nThe mass vaccination hype will undoubtedly enter history as the most reckless experiment in the history of medicine. It will be cited as the unequivocal proof of how overuse or misuse of man-made antimicrobials leads to antimicrobial resistance, regardless of whether the antimicrobial is an antibiotic or an antibody administered through passive immunization or elicited via active immunization.\n\nMass vaccination campaigns conducted in the middle of a viral pandemic will, for generations to come, become the most sobering example of the boundaries of human intervention in nature in general and of the boundaries of conventional vaccinology in particular.\n\nThis irrational experiment will unambiguously highlight the clear-cut limitations of conventional vaccine approaches. It will convincingly illustrate that – unlike natural acute self-limiting infection or disease – ‘modern’ technologies alone do not suffice to develop vaccines that are capable of preventing viral transmission or immune escape. For that matter, even ‘modern’ vaccines will not allow conventional B or T cell-directed antigens to generate herd immunity when massively administered in the heat of a pandemic of a highly mutable virus.\n\nBecause of the disastrous consequences the current mass vaccination campaign will entail, I cannot imagine that the word ‘vaccine’ will continue to persist in the medical vade-mecum. In order to highlight the short-comings of all vaccines eliciting conventional B- or T cell-centered immune responses I propose to coin a new term for these vaccines and refer to them as ‘conditionally immune protection-inducing formulations’ (CIPIFs).\n\nWhile the word ‘vaccine’ may be banned, the word ‘fact checker’ will only gain traction as a general term used for any scientifically illiterate person who uses arrogance to vilify those who speak the truth and promotes – in exchange for dirty money – a narrative and groupthink mentality that are merely inspired by the interests of the stakeholders they blindly support.\n\nLast, to all those who’re still convinced the official narrative about the beneficial effect of mass vaccination is correct, I’d like to suggest they solve the following 5 important questions as food for further thoughts:\n• Why does a pandemic all of a sudden cause disease in younger age groups whereas those were protected from disease during previous waves?\n• Why would asymptomatically infected people mount anti-S Abs when the virus gets already eliminated by the time these Abs start to peak?\n• Why did the UK see a substantial decline in cases during the 2 weeks that followed the end of their lockdown rules (i.e., between July 20th and August 3rd)?\n• Molecular epidemiologists have provided compelling evidence of growing selective S-directed immune pressure exerted by the population. How can this be explained given that full-fledged innate or naturally acquired immunity do not promote natural selection or dominance of more infectious variants (as also illustrated by the Influenza pandemic of 1918!)?\n• How could mass vaccination even contribute to controlling transmissibility of highly infectious Sars-CoV-2 variants?\n\nAs long as questions like these remain unsolved by those who take the decisions on how to manage this pandemic, there should be plenty of reason for people to be extremely skeptical. When questions as basic as those listed above cannot be answered, one cannot conclude there is anything fundamental our leaders or advising experts understand about the pandemic.\n\nWhen dealing with an issue having as much impact on global health as a pandemic, one cannot afford leaving any stone unturned and certainly not to leave any basic question unanswered. For lack of insight, international and public health authorities will continue to blame lack of success on the more infectious variants and propose (impose?) boosters as a never-ending strategy to chasing new emerging variants.\n\nThis should ring a bell to people and make them understand that the mass vaccination program is nothing else but a big experiment. For how much longer is the public going to believe the treacherous narrative? One can only hope that more and more people will begin to realize that the outcome of this experiment is being evaluated on a purely empirical basis and fully unpredictable, at least in the mind of those who’re overstepping their competence and authority to impose vaccine mandates on never-ending booster shots and thereby trample on human rights while humiliating independent scientists who fight back with rational arguments out of passion for the truth.\n\nOnly a mind that has lost its grasp on reality can fail to see how pathetic all this has become.\n\n1) Inasmuch as some SARS-CoV-2 variants escape from neutralizing antibodies, their immune recognition by vaccinal Abs may be at risk of causing ADE\n\n2) In India, the impact of innate and naturally acquired Abs on reducing viral transmission may have been confounded by widespread use of Ivermectin.\n\n3) However, shedding and transmission of new, more infectious variants by vaccinated as compared to non-vaccinated people is no longer measured by public health authorities as it is officially considered irrelevant and a waste of resources\n\n4) Direct: As mass vaccination causes enhanced immune pressure on viral infectiousness and thereby enables vaccine-resistant variants to reproduce more effectively in the population\n\n5) Indirect: As dominant circulation of more infectious variants increases viral infectious pressure and thereby augments the risk for unvaccinated healthy people to become temporarily susceptible to Covid-19 disease\n\n6) Because Covid-19 is a zoonotic disease, there can be no doubt that Sars-CoV-2 variants could use pets and even live-stock as a natural host and as a reservoir for re-entering the human species in a spillover event.\n\n7) This effect was only observed for about 2 weeks as no measures were taken to reduce the high infectious pressure (due to enhanced circulation of Delta variant ) and as the aggressive mass vaccination program continued to put more and more natural immune selection pressure on viral infectiousness\n\n8) Unvaccinated healthy people do not exert selective immune pressure and will, therefore, not provide more infectious immune escape variants with a competitive advantage\n\n10) Subjects who previously recovered from Covid-19 disease will not be eligible as the overwhelming majority of them are naturally protected from Covid-19 disease.\n\n11) As has previously been shown, innate immune responses against blood group A and B antigens (e.g., in individuals with blood group O) have a protective effect against Covid-19 (Gallo et al.; 2020)\n\n12) Follow-up boosters with updated S-based vaccines will place more and more pressure on viral infectiousness and hence, drive dominance off immune escape variants with a higher level of infectiousness.\n\nAf Geijerstam A, Mehlig K, Börjesson M, et al. Fitness, strength and severity of COVID-19: a prospective register study of 1.559.187 Swedish conscripts (2021). BMJ Open 2021; 11:e051316. doi: 10.1136/ bmjopen-2021-051316\n\nBelouzard S, et al. Mechanisms of Coronavirus Cell Entry Mediated by the Viral Spike Protein (2012) Viruses. 2012 Jun; 4(6): 1011–1033; doi: 10.3390/v4061011\n\nLiu Y, Arase N, Kishikawa J, et al. The SARS-CoV-2 Delta variant is poised to acquire complete resistance to wild-type spike vaccines (2021) bioRxiv preprint doi: https://doi.org/10.1101/2021.08.22.457114\n\nSallis R, Young DR, Tartof SY, et al. Physical inactivity is associated with a higher risk for severe COVID-19 outcomes: a study in 48 440 adult patients (2021) Br J Sports Med. doi: 10.1136/ bjsports-2021-104080\n\nSamad N, et al. The Implications of Zinc Therapy in Combating the COVID-19 Global Pandemic (2021) J Inflamm Res. 2021; 14: 527–550 doi: 10.2147/JIR.S295377\n\nShakoor H, et al. Be well: A potential role for vitamin B in COVID-19 (2021) Maturitas 144, P108-111, Feb 2021; doi: https://doi.org/10.1016/j.maturitas.2020.08.007\n\nTeshome A, et al. The Impact of Vitamin D Level on COVID-19 Infection: Systematic Review and Meta-Analysis (2021) Front. Public Health, March 2021 https://doi.org/10.3389/fpubh.2021.624559\n\nVanden Bossche G. Why is the ongoing mass vaccination experiment driving a rapid evolutionary response of SARS-CoV-2? (June 2021) https://trialsitenews.com/why-is-the-ongoing-mass-vaccination-experiment-driving-a-rapid-evolutionary-response-of-sars-cov-2/\n\nYahi N, et al. Infection-enhancing anti-SARS-CoV-2 antibodies recognize both the original Wuhan/D614G strain and Delta variants. A potential risk for mass vaccination? (2021) Journal of Infection 2021; August 16, 2021 doi: https://doi.org/10.1016/j.jinf.2021.08.010\n\nTable: The ever-changing official narrative on Covid-19 vaccines (Jan 2021-Aug 2021) is merely reflecting the increasingly complex evolutionary dynamics of a man-shaped C-19 pandemic", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines - Vaccine Safety Info", "url": "https://vaccinesafety.info/category/vaccines/", "site_name": "Vaccine Safety Info"}, "tags": ["National Institutes of Health", "government", "corporations", "herd immunity", "facebook censorship", "Moderna COVID-19 Vaccine Is More Effective", "Hospitalization rates", "Synthetic / genetics", "harassment", "COVID-19 Previous Infection More Protective During Delta Variant 2021", "Synthetic / adverse effects*", "covid 19", "Vaccination* / methods", "medicine", "truth", "Centers for Disease Control", "defamation", "Coronavirus / immunology*", "Brief", "stereotyping", "SARS (Severe acute respiratory syndrome)", "MMWR", "Humans", "tech giants", "PubMed Abstract", "COVID-19", "COVID-19 Vaccines / adverse effects*", "Synthetic / immunology", "BioNTech-Pfizer", "COVID-19 Previous Infection Natural Immunity Protection", "Polyethylene Glycols / adverse effects*", "AstraZeneca", "COVID-19 Vaccination Versus Natural Immunity", "vaccines", "BMJ", "brainwashing", "freedom", "Lede", "Coronavirus / genetics", "deception", "covid19", "Treatments", "corruption", "ccdh", "Pfizer-BioNTech And Janssen COVID-19 Vaccines Are Less Effective", "NCBI", "obey", "disinfo", "National Center for Biotechnology Information", "vaccine wars", "British Medical Journal", "Adult Health", "Health", "due process", "facebook", "manipulation", "Coronavirus", "FDA", "slander", "Hospitals", "MEDLINE", "doi:10.1016/j.clim.2021.108748", "Moderna COVID-19 Vaccine More Effective Against Hospitalizations", "public policy", "COVID-19 Vaccination Protection", "vaccination", "COVID-19 Vaccines / immunology", "Risk Factors", "COVID-19 Vaccines / genetics", "Drug Hypersensitivity / immunology*", "SARS-CoV-2 / immunology*", "Boosters", "propaganda", "Geert Vanden Bossche (DVM PhD)", "via bookmarklet", "imran ahmed", "National Library of Medicine", "Anaphylaxis", "official narratives", "Coronavirus [CoV]", "NIH", "Spike Glycoprotein", "first amendment", "COVID-19 Vaccine Effectiveness Against Hospitalizations", "big tech", "Vaccination* / adverse effects", "wuhan", "lies", "NLM", "Science.", "Donald Trump", "information warfare", "drugs", "immune system", "Viktorija Erdeljic Turk", "Science", "Morbidity & Mortality Weekly Report", "Top Story", "anti-vaxxers", "pmid:33932618", "COVID-19 Natural Immunity More Protective During Delta 2021", "PMC8080508", "fascism", "pfizer", "COVID-19 / immunology*", "free speech"], "tweets": [], "movies": [], "links": ["https://www.geertvandenbossche.org/", "https://www.gov.uk/government/publications/investigation-of-novel-sars-cov-2-variant-variant-of-concern-20201201", "#viewer-et7qq", "#viewer-f5v05", "#viewer-39ihh", "#viewer-b66cd", "https://37b32f5a-6ed9-4d6d-b3e1-5ec648ad9ed9.filesusr.com/ugd/28d8fe_485cd4e01c4f41219253ff69cd8d761e.pdf", "#viewer-c3gmi", "#viewer-4dh6i", "#viewer-e8e1c", "#viewer-4a3on", "#viewer-flcs7", "#viewer-asb7l", "#viewer-aqjmb", "#viewer-dp23s", "#viewer-7ncce", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7537046/pdf/RMV-9999-e2171.pdf", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7641391/pdf/jgv-101-791.pdf"], "authors": ["Deutsche Welle (www.dw.com)", "Author on Source"], "publish_date": "2022-03-20T15:22:35+00:00"}