{"result_id": "330005", "URL": "https://vaccinesafety.info/2022/02/25/pfizer-vaccine-trial-bmj-report-whistleblower-raises-data-safety-concerns-at-contractor-ventavia-news-com-au-australias-leading-news-site/", "timestamp": "2023-04-25 17:51:24 CEST+0200", "meta": {"description": "An investigation by a respected medical journal has alleged serious issues with Pfizer’s vaccine safety trials, including claims of “falsified data”.", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/02/25/pfizer-vaccine-trial-bmj-report-whistleblower-raises-data-safety-concerns-at-contractor-ventavia-news-com-au-australias-leading-news-site/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Pfizer vaccine trial BMJ report: Whistleblower raises data, safety concerns at contractor Ventavia | news.com.au — Australia’s leading news site", "cleaned_text": "An investigation by a respected medical journal has alleged serious issues with Pfizer’s vaccine safety trials, including claims of “falsified data”.\n\nAustralia’s medicines regulator has sought additional information from Pfizer after an investigation by the British Medical Journal alleged serious issues with a small number of its vaccine safety trials, including claims of “falsified data” and slowness following up on adverse reactions.\n\nThe Therapeutic Goods Administration (TGA) has stressed that Pfizer’s vaccine is “highly safe and effective”, and that Australians “should not be concerned about the issues raised in the article”.\n\nThe BMJ’s report, published last week, centred on a former employee of Ventavia Research Group, a Texas-based contractor involved in the phase-three trials for Pfizer’s Covid vaccine last year.\n\nAccording to Brook Jackson, a former regional director at Ventavia, the company “falsified data, unblinded patients, employed inadequately trained vaccinators, and was slow to follow up on adverse events”, the BMJ reported.\n\nThe whistleblower, who provided the BMJ with “dozens of internal company documents, photos, audio recordings and emails”, recounted that she repeatedly notified the company of the problems before finally emailing a complaint to the US Food and Drug Administration on September 25, 2020.\n\nShe was sacked the same day, with the company saying in her separation letter she was “not a good fit”.\n\nIn a statement to The Conversation, Ventavia said Ms Jackson was employed for “approximately two weeks” in September of 2020 and “no part of her job responsibilities concerned the clinical trials at issue”.\n\nVentavia said the “same accusations” were investigated and “determined to be unsubstantiated” last year.\n\nPfizer’s full phase-three trial involved about 44,000 participants across 153 sites. Ventavia enrolled more than 1000 participants at three sites – or only around 2 per cent of the total.\n\nThe drug company made no mention of the alleged problems at the Ventavia sites in a briefing document submitted to an FDA advisory committee meeting on December 10, 2020.\n\nThe FDA, which never audited Ventavia after receiving the complaint, issued its emergency use authorisation for the vaccine the next day.\n\nA Pfizer Australia spokeswoman declined to comment on the BMJ report.\n\nNews.com.au understands the TGA has contacted Pfizer to further clarify the issues raised, although given the allegations only pertain to 2 per cent of the trial population, the overall results are not expected to be impacted.\n\n“The Pfizer Covid-19 vaccine is highly safe and effective and has been approved for use in nearly 100 countries and also approved by the World Health Organisation,” a TGA spokeswoman said.\n\n“Australians who have received the Pfizer vaccine should not be concerned about the issues raised in the BMJ article.”\n\nShe noted that “the safety and efficacy of the Pfizer Covid-19 vaccine demonstrated in clinical trials has been thoroughly substantiated by real-world use in many millions of people worldwide”.\n\n“The benefits of vaccination are clear and not in dispute,” she said.\n\n“All eligible Australians who are not yet vaccinated are strongly encouraged to get vaccinated as soon as possible.”\n\nMs Jackson told the BMJ she repeatedly complained to her superiors about poor laboratory management, patient safety concerns and data integrity issues.\n\nIn one email circulated among company leaders in August 2020, a list of “action items” included three staff members with whom to “go over e-diary issue/falsifying data, etc”, with one of them “verbally counselled for changing data and not noting late entry”.\n\nAccording to Ms Jackson, participants may have been “unblinded”, meaning staff were able to see who had received the Pfizer vaccine and who had received the placebo, which could potentially affect the way conclusions were reached.\n\nVentavia was also not keeping up with data entry queries, she alleged. In September 2020, another research firm working on the trial warned Ventavia that all queries were expected to be addressed within 24 hours.\n\nThe company then highlighted more than 100 outstanding queries older than three days, including two cases in which individuals reporting “severe symptoms/reactions” should have been urgently followed up.\n\nThe BMJ spoke anonymously to two other former Ventavia employees, who both “confirmed broad aspects of Jackson’s complaint”.\n\nOne of those employees said problems persisted after Ms Jackson’s departure. In several cases, the employee said, Ventavia lacked enough employees to swab all trial participants who reported Covid-like symptoms to test for infection – despite laboratory-confirmed symptomatic Covid-19 being the trial’s primary focus.\n\nAnother former employee said Ventavia had been nervous and expected a federal audit of its vaccine trial, but one never came.\n\n“People working in clinical research are terrified of FDA audits,” Jill Fisher, professor of social medicine at the University of North Carolina School of Medicine, told the journal. She said she was surprised the FDA never inspected the company.\n\n“You would think if there’s a specific and credible complaint that they would have to investigate that,” she said.\n\nAfter its full approval of the vaccine in August this year, the FDA published a summary of its inspections from the phase-three trials.\n\nNine of the 153 trial sites were inspected, and Ventavia’s sites were not listed among the nine.\n\nPfizer has since hired Ventavia to work on four other vaccine clinical trials, including for children and young adults, pregnant women, and booster doses.\n\nDr Aseem Malhotra, a British cardiologist and public health campaigner, said the BMJ report was “absolutely shocking”.\n\n“That Pfizer trial, that pivotal trial … because of that data, millions and millions of people have taken the vaccine.”\n\nHe said he had received both doses of the vaccine “very early on” this year despite the fact he was not high risk, to protect his patients from getting the infection from him.\n\n“What’s now very clear is that there’s no significant reduction in transmission from taking the vaccine,” he said.\n\n“I’m pretty convinced the vaccine most likely does prevent serious illness and death, and we’ve got some real-world data to support that, but it changes the conversation because we then start looking at lower-risk groups and whether they should take the vaccine, and this also applies to mandates.”\n\nDr Malhotra said the allegations were “not that surprising if you look at the history of research integrity from the pharmaceutical industry going back many years”, and that for a long time clinical decisions had been “made on incomplete, biased and in many cases potentially corrupted data”.\n\n“Unfortunately the reason it hasn’t been tackled is because there have not been any effective interventions or sanctions put on the pharmaceutical industry,” he said.\n\n“Between 2009 and 2014, most of the top 10 pharmaceutical companies have paid fines [for] criminal activity of around $US13 billion for hiding data on harms, illegal marketing of drugs, manipulation of results, and nothing really seems to have changed in the system.”\n\nDr Malhotra cited the example of GlaxoSmithKline, which in 2012 paid $US3 billion in fines, but “they made $US25 billion in profit during the period covered by the settlement, nobody was fired, nobody was jailed”.\n\n“So this is business as usual for many of these companies,” he said.\n\nContrary to Dr Malhotra’s claims about virus transmission, analysis from NSW Health released Tuesday concluded Covid-19 vaccines – both AstraZeneca and Pfizer – mainly protected against serious disease but also protected against infection.\n\nOf the 61,800 infections between the start of the Delta outbreak in mid-June until October 7, 63.1 per cent (39,017) had received no “valid dose” of a vaccine, 9.2 per cent (5668) had received one dose, and 6.1 per cent (3736) had received two doses.\n\nA dose is only counted as “valid” if it occurs at least 21 days prior to disease onset in the case of the first dose, and 14 days in the case of the second.\n\nOf the 39,017 people in the report categorised as having no doses received, more than one quarter (10,090) had “received vaccine dose/s but the interval from receipt to onset of disease was too short to be potentially effective”.\n\nThe most common serious side effects associated with the Pfizer and Moderna mRNA vaccines are myocarditis and pericarditis, or inflammation of the heart and the lining around the heart.\n\nMyocarditis is reported in about one out of every 100,000 people after receiving the Pfizer vaccine, but is more common in men and teenage boys after the second dose at three to seven cases in 100,000 people.\n\nThe TGA, which monitors reports of adverse vaccine reactions, says as of October 31 it has received 253 reports assessed as likely to be myocarditis, from about 21.9 million doses of the Pfizer vaccine.\n\nOf those, around half were treated in hospital with eight treated in intensive care, according to the TGA’s most recent weekly safety report.\n\nMost patients treated in hospital were discharged within four days.\n\nThe youngest case classified as “likely myocarditis” to date was 12 years old.\n\nThere have also been an additional 446 suspected myocarditis cases, either alone or in combination with pericarditis, and 1085 cases of suspected pericarditis.\n\n“We encourage people to seek medical attention if they experience symptoms that could suggest myocarditis or pericarditis,” the TGA says.\n\n“This includes chest pain, palpitations (irregular heartbeat), fainting or shortness of breath, particularly if they occur within one to five days of vaccination.”\n\nIn the US, researchers have begun to explore possible explanations for rare inflammatory heart conditions associated with mRNA vaccines.\n\nSome theories centre on the type of spike protein the body produces in response to vaccines, The Wall Street Journal reported over the weekend.\n\nOne researcher, Baylor College professor of medicine Biykem Bozkurt, told the newspaper there may be similarities between the spike protein and proteins found in the heart, which then come under attack from vaccine-produced antibodies.\n\nAnother theory was proposed by cardiovascular consultant Jay Schneider from the Mayo Clinic, who said his early lab tests suggested some of the mRNA in the vaccines may also be taken up by heart cells to produce the spike protein, which could then draw an antibody response.\n\nOther doctors have theorised improper injections are to blame, with the vaccine going into the vein rather than the shoulder muscle.\n\nAround 420 million doses of the Pfizer vaccine have been administered across the world.\n\nUnder Australia’s booster program which began last week, Pfizer will be used regardless of the vaccine received for the first or second dose.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer vaccine trial BMJ report: Whistleblower raises data, safety concerns at contractor Ventavia | news.com.au — Australia’s leading news site - Vaccine Safety Info", "description": "An investigation by a respected medical journal has alleged serious issues with Pfizer’s vaccine safety trials, including claims of “falsified data”.", "url": "https://www.news.com.au/technology/science/human-body/tga-requests-information-from-pfizer-after-medical-journal-alleges-contractor-falsified-safety-data/news-story/342806323e802035bb1d810e561977f4", "site_name": "Vaccine Safety Info", "article:tag": "Whistleblower raises data", "article:section": "Uncategorized", "article:published_time": "2022-02-25T03:45:17+00:00"}, "tags": ["lab tests", "data entry", "federal audit", "shoulder muscle", "Australia", "pivotal safety trials", "separation letter", "pivotal phase-three trials", "booster shots", "safety report", "Northern America", "public health campaigner", "theories centre", "phase-three trials", "vaccination clinic", "antibody response", "Brook Jackson", "vax claim", "safety concerns", "vaccinesChildren aged", "laboratory management", "Greg Hunt", "Mayo Clinic", "advisory committee meeting", "PFIZER INC.", "start getting", "company documents", "Heart inflammation", "Ventavia Research Group", "Whistleblower raises data", "inflammatory heart conditions", "Baylor College", "British cardiologist", "age group", "criminal activity", "briefing document", "America", "GlaxoSmithKline plc", "rare side", "London-based radio station", "research integrity", "suspected myocarditis cases", "trial participants", "homeless people", "individuals reporting", "North America", "hiding data", "via bookmarklet", "audio recordings", "falsified data", "Los Angeles", "mRNA vaccines", "Rare side effects", "Australia and New Zealand", "British Medical Journal", "vaccine trial", "spike protein", "booster doses", "University of North Carolina School of Medicine", "booster program", "Whistleblower claims", "Food &amp;amp;amp;amp; Drug Administration", "adverse vaccine reactions", "patient safety concerns", "Jill Fisher", "Aseem Malhotra", "research firm", "way conclusions", "United States of America", "pharmaceutical industry", "Oceania", "data integrity", "side effects", "California", "Jay Schneider", "drug company"], "tweets": [], "movies": [], "links": ["https://www.bmj.com/content/375/bmj.n2635", "https://theconversation.com/vaccine-trial-misconduct-allegation-could-it-damage-trust-in-science-171164", "https://theconversation.com/vaccine-trial-misconduct-allegation-could-it-damage-trust-in-science-171164", "https://www.nytimes.com/2012/07/03/business/glaxosmithkline-agrees-to-pay-3-billion-in-fraud-settlement.html", "https://www.health.nsw.gov.au/Infectious/covid-19/Documents/in-focus/covid-19-vaccination-case-surveillance-051121.pdf", "https://www.news.com.au/lifestyle/health/health-problems/sydney-woman-reveals-rare-side-effect-after-getting-pfizer-vaccine/news-story/a5b5791cc5e824ad4c5cdcae94921b75", "https://www.tga.gov.au/periodic/covid-19-vaccine-weekly-safety-report-04-11-2021", "https://www.wsj.com/articles/researchers-probe-link-between-covid-19-vaccines-and-myocarditis-11636290002", "mailto:frank.chung@news.com.au"], "authors": ["Author on Source"], "publish_date": "2022-02-25T03:45:17+00:00"}