{"result_id": "330002", "URL": "https://vaccinesafety.info/2023/02/06/pfizer-sales-before-child-safety-by-usforthem/", "timestamp": "2023-04-25 17:51:22 CEST+0200", "meta": {"description": "Free pass promotional opportunity given by BBC to Pfizer", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2023/02/06/pfizer-sales-before-child-safety-by-usforthem/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "Pfizer: sales before child safety - by UsForThem", "cleaned_text": "Free pass promotional opportunity given by BBC to Pfizer\n\nOn 2 December 2021, the BBC published on its website, its popular news app and in the BBC News at One programme, a video interview and an accompanying article under the headline‘Pfizer boss: Annual Covid jabs for years to come’.\n\nThe interview by the BBC’s medical editor, Fergus Walsh, conducted as a friendly fireside chat, gave Dr Albert Bourla, the Chairman and CEO of Pfizer, a free pass promotional opportunity that money cannot buy — as the UK’s national public service broadcaster, the BBC is usually prohibited from carrying commercial advertising or product placement.\n\nPerhaps unsurprisingly, Pfizer made the most of that astonishing opportunity to promote the uptake of its vaccine product. As the BBC’s strapline suggests, the key message relayed by Dr Bourla, responding to an obediently leading question from Mr Walsh, was that many more vaccine shots would need to be bought and jabbed to maintain high levels of protection in the UK. He was speaking shortly before the UK Government bought another 54 million doses of Pfizer vaccines.\n\nAmong his explicit and implicit encouragements for the UK to order more of his company’s shots, Dr Bourla commented emphatically about the merits of vaccinating children under 12 years of age, saying“[So] there is no doubt in my mind that the benefits, completely are in favour of doing it [vaccinating 5 to 11 year olds in the UK and Europe]”. No mention of risks or potential adverse events, nor indeed the weighing of any factors other than apparent benefits: Dr Bourla was straightforwardly convinced that we should immunise millions more children in the UK. In fact, it later emerged that the BBC’s article had misquoted Dr Bourla who in the full video interview recording had ventured the benefits to be “completely completely”in favour of vaccinating young children.\n\nDespite the strength of Dr Bourla’s unconditional and superlative pitch for vaccinating under-12s, the UK regulatory authorities would not authorise the vaccine for use with those children until the very end of 2021; and indeed this came just a few months after the JCVI — the body which advises the Government on whether and when to deploy vaccines in the UK — had already declined to advise the Government to roll out a mass vaccination programme for healthy 12 to 15-year-olds on the basis that“the margin of benefit, based primarily on a health perspective, is considered too small to support advice on a universal programme of vaccination of otherwise healthy 12 to 15-year old children…”.\n\nIn response, soon after the interview aired, UsForThem submitted a complaint to the UK’s Prescription Medicines Code of Practice Authority (PMCPA) — the regulator responsible for policing promotions of prescription medicines in the UK. The complaint cited the overtly promotional nature of the BBC’s reports and challenged the compliance of Dr Bourla’s comments about children with the apparently strict rules governing the promotion of medicines in the UK.\n\nMore than a year later, following a lengthy assessment process and an equally lengthy appeal by Pfizer of the PMCPA’s initial damning findings, the complaint and all of the PMCPA’s findings have been made public in acase reportpublished on the regulator’s website.** Though some aspects of that complaint ultimately were not upheld on appeal, importantly an industry-appointed appeal board affirmed the PMCPA’s original findings that Dr Bourla’s comments on vaccinating 5 to 11-year-olds were promotional, and were both misleading and incapable of substantiation in relation to the safety of vaccinating that age group.\n\nEven after UsForThem involved a number of prominent Parliamentarians, including Sir Graham Brady MP, to help accelerate the complaint, the process was dragged on — or perhaps ‘out’ — while the roll-out of Pfizer’s vaccine to UK under-12s proceeded, and the BBC’s interview and article stayed online. Even now the interview remains available on the BBC’s website, despite the PMCPA in effect having characterised it as ‘misinformation’ as far as vaccinating children is concerned.\n\nWhen news of the appeal outcome was first revealed in November 2022 by a reporter atThe Daily Telegraph newspaper, Pfizer issued a comment to the effect that it takes compliance seriously and was pleased that the “most serious” of the PMCPA’s initial findings — that Pfizer had failed to maintain high standards and had brought discredit upon and lowered confidence in the pharmaceutical industry — had been overturned on appeal.\n\nIt must be an insular and self-regarding world that Pfizer inhabits, that discrediting the pharmaceutical industry is considered a more serious matter than making misleading and unsubstantiated statements about the safety of their products for use with children. This surely speaks volumes about the mindset and priorities of the senior executives at companies such as Pfizer.\n\nAnd if misleading parents about the safety of a vaccine product for use with children does not discredit or reduce confidence in the pharmaceutical industry, it is hard to imagine what standard can have been applied by the appeal board which overturned that initial finding. Perhaps this reflects the industry’s assessment of its own current reputation: that misinformation promulgated by one of its most senior executives is not discrediting. According to the case report, the appeal board had regard to the “unique circumstances” of the pandemic: so perhaps the view was that Pfizer can’t always be expected to observe the rules when it gets busy.\n\nIndeed, a brief look at the PMCPA’s complaints log confirms that Pfizer has been found to have broken the UK medicines advertising rules in relation to its Covid vaccine a further four times since 2020. Astonishingly, though, for their breaches in this most recent case, and in each of the other cases decided against it, neither Pfizer nor Dr Bourla will suffer any meaningful penalty (the PMCPA will have levied a small administrative charge to cover the cost of administering each complaint). So in practice, neither has any incentive to regret the breach, or to avoid repeating it if it remains commercially expedient to do so.\n\nAnd this is perhaps the crux of the issue: the PMCPA, the key UK regulator in this area, operates as a division of the Association of the British Pharmaceutical Industry, the UK industry’s trade body. It is therefore a regulator funded by, and which exists only by the will of, the companies whose behaviour it is charged with overseeing. Despite Pharma being one of the most lucrative and well-funded sectors of the business world, the largely self-regulatory system on which the industry has now fordecadeshad the privilege to rely has been under-resourced and has become slow, meek and powerless.\n\nThe UK Medicines and Healthcare Products Regulatory Agency (MHRA) in principle has jurisdiction to hold the BBC accountable for what seems likely to have been mirroring breaches of the medicines advertising rules when it broadcast and promoted Dr Bourla’s comments, but no action has yet been taken.\n\nThis case, and the apparent impunity that companies such as Pfizer appear to enjoy, evidence that the system of oversight for UK Pharma is hopelessly outdated and that the regulatory authorities are risibly ill-equipped to keep powerful, hugely well-resourced corporate groups in check. The UK regulatory system for Big Pharma is not fit for purpose, so it is time for a rethink. Children deserve better, and we should all demand it.\n\nAs part of its defence of UsForThem’s complaint, Pfizer relied on the content of an internal briefing document that had been prepared for the CEO by Pfizer’s UK compliance team before the BBC interview took place. Pfizer initially asked for that document to be withheld from UsForThem on the grounds that it was confidential. When UsForThem later demanded sight of the document (on the basis that it was not possible to respond fully to Pfizer’s appeal without it), UsForThem was offered a partially redacted version, and only then under terms of a perpetual and blanket confidentiality undertaking.\n\nWithout knowing the content of that document, or the scope of the redactions, UsForThem was unwilling to give an unconditional perpetual blanket confidentiality undertaking, but reluctantly agreed that it would accept the redacted document and keep it confidential subject to one limited exception: if UsForThem reasonably believed the redacted document revealed evidence of serious negligence or wrongdoing by Pfizer or any other person, including evidence of reckless or wilful damage to the public health of children, UsForThem would be permitted to share the document, on a confidential basis, with members of the UK Parliament.\n\nThis limited exception to confidentiality was not accepted. Consequently, UsForThem never saw the briefing document and instead drew the inference that it contained content that Pfizer regarded as compromising and which it therefore did not wish to risk ever becoming public.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer: sales before child safety - by UsForThem - Vaccine Safety Info", "description": "Free pass promotional opportunity given by BBC to Pfizer", "url": "https://usforthem2020.substack.com/p/pfizer-sales-before-child-safety", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "article:published_time": "2023-02-06T07:49:38+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://www.bbc.co.uk/news/health-59488848", "https://usforthem2020.substack.com/p/pfizer-sales-before-child-safety?utm_source=substack&utm_medium=email&utm_content=share&action=share", "https://www.gov.uk/government/publications/jcvi-statement-september-2021-covid-19-vaccination-of-children-aged-12-to-15-years/jcvi-statement-on-covid-19-vaccination-of-children-aged-12-to-15-years-3-september-2021", "https://www.pmcpa.org.uk/cases/completed-cases/auth35911221-a-complaint-on-behalf-of-usforthem-v-pfizer/", "https://www.telegraph.co.uk/news/2022/11/26/pfizers-ceo-rapped-regulator-making-misleading-statements-childrens/"], "authors": ["UsForThem"], "publish_date": "2023-02-06T07:49:38+00:00"}