{"result_id": "330036", "URL": "https://vaccinesafety.info/2022/05/06/u-s-restricts-jjs-covid-19-vaccine-due-to-rare-blood-clot-risk/", "timestamp": "2023-04-25 17:51:46 CEST+0200", "meta": {"description": "WASHINGTON — U.S. regulators on Thursday strictly limited who can receive Johnson & Johnson’s COVID-19 vaccine due to the ongoing risk of rare but serious", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/05/06/u-s-restricts-jjs-covid-19-vaccine-due-to-rare-blood-clot-risk/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "U.S. restricts J&J’s COVID-19 vaccine due to rare blood clot risk", "cleaned_text": "WASHINGTON — U.S. regulators on Thursday strictly limited who can receive Johnson & Johnson’s COVID-19 vaccine due to the ongoing risk of rare but serious blood clots.\n\nThe Food and Drug Administration said the shot should only be given to adults who cannot receive a different vaccine or specifically request J&J’s vaccine. U.S. authorities for months have recommended that Americans get Pfizer or Moderna shots instead of J&J’s vaccine.\n\nFDA’s vaccine chief Dr. Peter Marks said the agency decided to restrict the vaccine after taking another look at the data on the risks of life-threatening blood clots and concluding that they are limited to J&J’s vaccine.\n\n“If there’s an alternative that appears to be equally effective in preventing severe outcomes from COVID-19, we’d rather see people opting for that,” Marks said. “But we’ve been careful to say that– compared to no vaccine– this is still a better option.”\n\nThe problem occurs in the first two weeks after vaccination, he added: “So if you had the vaccine six months ago you can sleep soundly tonight knowing this isn’t an issue.”\n\nThe FDA authorized J&J’s shot in February last year for adults 18 and up.\n\nThe vaccine was initially considered an important tool in fighting the pandemic because it required only one shot. But the single-dose option proved less effective than two doses of the Pfizer and Moderna vaccines.\n\nIn December, the Centers for Disease Control and Prevention recommended Moderna and Pfizer shots over J&J’s because of its safety issues.\n\nAs of mid-March, federal scientists had identified 60 cases of the side effect, including nine that were fatal. That amounts to 3.23 blood clot cases per 1 million J&J shots. The problem is more common in women under 50, where the death rate was roughly 1 per million shots, according to Marks.\n\nMarks said the FDA spent extra time analyzing the problem to be sure it wasn’t connected to a separate issue, such as women taking birth control medications that raise their risk of clotting.\n\nThe J&J vaccine will carry a starker warning about potential “long-term and debilitating health consequences” of the side effect.\n\nUnder the new FDA instructions, J&J’s vaccine could still be given to people who had a severe allergic reaction to one of the other vaccines and can’t receive an additional dose. J&J’s shot could also be an option for people who refuse to receive the mRNA vaccines from Pfizer and Moderna, and therefore would otherwise remain unvaccinated, the agency said.\n\nA J&J spokesman said in an emailed statement: “Data continue to support a favorable benefit-risk profile for the Johnson & Johnson COVID-19 vaccine in adults, when compared with no vaccine.”\n\nThe clotting problems first came up last spring, with the J&J shot in the U.S. and with a similar vaccine made by AstraZeneca that is used in other countries. At that time, U.S. regulators decided the benefits of J&J’s one-and-done vaccine outweighed what was considered a very rare ri sk — as long as recipients were warned.\n\nCOVID-19 causes deadly blood clots, too. But the vaccine-linked kind is different, believed to form because of a rogue immune reaction to the J&J and AstraZeneca vaccines because of how they’re made. Clots form in unusual places, such as veins that drain blood from the brain, and in patients who also develop abnormally low levels of the platelets that form clots. Symptoms of the unusual clots include severe headaches a week or two after the J&J vaccination — not right away — as well as abdominal pain and nausea.\n\nThe New Brunswick, New Jersey-based company announced last month that it didn’t expect a profit from the vaccine this year and was suspending sales projections.\n\nThe rollout of the company’s vaccine was hurt by a series of troubles, including manufacturing problems at a Baltimore factory that forced J&J to import millions of doses from overseas.\n\nAdditionally, regulators added warnings about the blood clots and a rare neurological reaction called Guillain-Barré syndrome.\n\nPfizer and Moderna have provided the vast majority of COVID-19 vaccines in the U.S. More than 200 million Americans have been fully vaccinated with the companies’ two-dose shots while less than 17 million Americans got the J&J shot.\n\nBy Associated Press Writers Matthew Perrone and Lauran Neergaard.\n\nHow to get tested\n\nTampa Bay: The Times can help you find the free, public COVID-19 testing sites in the bay area.\n\nFlorida: The Department of Health has a website that lists testing sites in the state. Some information may be out of date.\n\nThe U.S.: The Department of Health and Human Services has a website that can help you find a testing site.\n\nHow to get vaccinated\n\nThe COVID-19 vaccine for ages 5 and up and booster shots for eligible recipients are being administered at doctors’ offices, clinics, pharmacies, grocery stores and public vaccination sites. Many allow appointments to be booked online. Here’s how to find a site near you:\n\nFind a site: Visit vaccines.gov to find vaccination sites in your ZIP code.\n\nMore help: Call the National COVID-19 Vaccination Assistance Hotline.\n\nPhone: 800-232-0233. Help is available in English, Spanish and other languages.\n\nOMICRON VARIANT: Omicron changed what we know about COVID. Here’s the latest on how the infectious COVID-19 variant affects masks, vaccines, boosters and quarantining.\n\nKIDS AND VACCINES: Got questions about vaccinating your kid? Here are some answers.\n\nBOOSTER SHOTS: Confused about which COVID booster to get? This guide will help.\n\nBOOSTER QUESTIONS: Are there side effects? Why do I need it? Here’s the answers to your questions.\n\nPROTECTING SENIORS: Here’s how seniors can stay safe from the virus.\n\nGET THE DAYSTARTER MORNING UPDATE: Sign up to receive the most up-to-date information.\n\nWe’re working hard to bring you the latest news on the coronavirus in Florida. This effort takes a lot of resources to gather and update. If you haven’t already subscribed, please consider buying a print or digital subscription.", "opengraph": {"locale": "en_US", "type": "article", "title": "U.S. restricts J&J’s COVID-19 vaccine due to rare blood clot risk - Vaccine Safety Info", "description": "WASHINGTON — U.S. regulators on Thursday strictly limited who can receive Johnson & Johnson’s COVID-19 vaccine due to the ongoing risk of rare but serious", "url": "https://www.tampabay.com/news/health/2022/05/05/fda-restricts-jjs-covid-19-vaccine-due-to-blood-clot-risk/", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "image": "https://vaccinesafety.info/wp-content/uploads/2022/05/5552-EL5AZEHRRZGUMYFU4DA2TV772Q.jpg", "image:secure_url": "https://vaccinesafety.info/wp-content/uploads/2022/05/5552-EL5AZEHRRZGUMYFU4DA2TV772Q.jpg", "image:width": "1200", "image:height": "675", "image:alt": "U.S. restricts J&J’s COVID-19 vaccine due to rare blood clot risk", "image:type": "image/jpeg", "article:published_time": "2022-05-06T10:39:27+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://apnews.com/article/ap-top-news-anthony-fauci-coronavirus-pandemic-f13611719ad8d1655ed7b354af75a9a9", "https://apnews.com/article/coronavirus-pandemic-science-business-health-coronavirus-vaccine-dee1a2f0becff4090aa2775b19f04158", "https://apnews.com/article/health-science-business-europe-coronavirus-vaccine-839bf6a7c857b25df04078402b4d7b8a", "https://www.tampabay.com/news/health/2021/12/30/where-to-get-a-covid-test-in-tampa-bay-and-why-omicron-is-different/", "https://floridahealthcovid19.gov/testing-sites/", "https://www.hhs.gov/coronavirus/community-based-testing-sites/index.html#fl", "http://vaccines.gov/", "https://www.tampabay.com/news/health/2022/01/12/omicron-changed-what-we-know-about-covid-heres-how-to-stay-safe/", "https://www.tampabay.com/news/health/2021/11/04/got-questions-about-vaccinating-your-kid-here-are-some-answers/", "https://www.tampabay.com/news/health/2021/11/08/confused-about-which-covid-booster-to-get-this-guide-will-help/", "https://www.tampabay.com/news/health/2021/11/26/how-bad-are-covid-booster-side-effects-and-answers-to-other-vaccine-booster-questions/", "https://www.tampabay.com/news/health/2021/10/15/2022-medicare-guide-how-florida-seniors-can-stay-safe-from-covid/", "https://myaccount.tampabay.com/newsletter", "https://subscribe.tampabay.com/?utm_source=subscribe&utm_medium=articlelead&utm_campaign=newsroom"], "authors": ["Author on Source"], "publish_date": "2022-05-06T10:39:27+00:00"}