{"result_id": "330001", "URL": "https://vaccinesafety.info/2022/07/17/youre-not-imagining-things-by-jennifer-margulis/", "timestamp": "2023-04-25 17:51:20 CEST+0200", "meta": {"description": "You aren’t imagining things. Your social media news feed, the local television station, and the national (andinternational) newspapers are filled with an", "lang": "en", "keywords": "", "favicon": "https://vaccinesafety.info/wp-content/uploads/2021/04/V-logo-150x150.png", "canonical": "https://vaccinesafety.info/2022/07/17/youre-not-imagining-things-by-jennifer-margulis/", "encoding": "UTF-8"}, "image": null, "domain": "vaccinesafety.info", "title": "You're Not Imagining Things - by Jennifer Margulis", "cleaned_text": "You aren’t imagining things. Your social media news feed, the local television station, and the national (andinternational) newspapers are filled with an unprecedented number of reports of SADs: Sudden Adult Deaths.\n\nDimitrios “Jimmy” Hrisikos, who worked at a pizzeria, died during the night of May 24. No one is sure what time and no one knows why. He was 41 years old.\n\nAsreportedby the hyper-local website Patch.com: “An exact cause of death has yet to be determined, but Lioudis [his boss and longtime owner of Plaza Pizza] said he thinks Hrisikos suffered some sort of cardiac episode or heart problem. Incidents of SADS, or Sudden Adult Death Syndrome, are being reported across the country lately. This is when an otherwise healthy young adult dies for no apparent reason.”\n\nSarahBeth Hartlage, the associate medical director for the Louisville Metro Department of Public Health and Wellness, died unexpectedly in Orlando, Florida, while she was attending a medical conference. She was found dead by police in March. Hartlage was 36 years old. An autopsy showed that she “died of heart disease,” according to the local radio station. The article continues:\n\nCharlie Wilson, Alabama men’s basketball manager, died unexpectedly on June 1. He was 20 years old and remembered by the head coach as a “great kid.”\n\nThen there’s Illinois Congressman Sean Casten’s daughter, Gwen Casten, who reportedly “died in her sleep” on June 12, 2022. She was found dead in her room. Casten was only 17 years old.\n\nIf you read a news report about a “sudden death” or an “unexpected death,” and no cause of death is specified, there’s likely only one of two causes: vaccine-injury leading to a lethal heart eventor suicide.\n\n“Did the COVID vaccine kill Gwen Casten?” is the title of anexcellent and detailed Substack postby Steve Kirsch, a millionaire entrepreneur and MIT graduate who himself has funded COVID treatment trials. After paying careful attention to the scientific evidence, Kirsch is deeply concerned about the blaring safety issues surrounding these vaccines. Kirsch’s post also lists dozens of other deaths that were likely vaccine-induced.\n\nThere have been1,307,926 adverse events reported to the CDCafter COVID-19 vaccines through June 17, 2022. These adverse events include:\n\nVAERS is a passive reporting system. It’s designed to pick up safety signals. The safety signals are right here, in front of our faces, before our eyes.\n\nHealthy young people don’t just die in their sleep, all of a sudden, in unprecedented numbers.\n\nIt’s past time to halt the entire COVID-19 vaccination program, asmedical doctors have been urging. The virus was dangerous when it was novel. Now that it is becoming endemic, it is no longer a threat. Instead of pushing dangerous and useless booster shots on young people, we need to admit we made a mistake. The COVID-19 vaccines are not safe. They are not effective. And they aren’t necessary.", "opengraph": {"locale": "en_US", "type": "article", "title": "You're Not Imagining Things - by Jennifer Margulis - Vaccine Safety Info", "description": "You aren’t imagining things. Your social media news feed, the local television station, and the national (andinternational) newspapers are filled with an", "url": "https://jennifermargulis.substack.com/p/youre-not-imagining-things", "site_name": "Vaccine Safety Info", "article:tag": "via bookmarklet", "article:section": "Uncategorized", "article:published_time": "2022-07-17T11:23:08+00:00"}, "tags": ["via bookmarklet"], "tweets": [], "movies": [], "links": ["https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F583b94b6-f098-4ae7-9b5b-9040e7a516a6_673x554.webp", "https://jennifermargulis.substack.com/p/this-26-year-old-died", "https://patch.com/new-jersey/secaucus/well-known-secaucus-pizzeria-employee-dies-suddenly-age-41", "https://wfpl.org/autopsy-results-show-public-health-official-died-of-heart-disease/", "https://247sports.com/college/alabama/Article/Alabama-Crimson-Tide-Basketball-manager-Charlie-Wilson-dies-unexpectedly-188220574/", "https://abc7chicago.com/illinois-rep-sean-casten-congressman-daughter-gwen/11965975/", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fbff2604d-4bed-47a3-9bb4-a9331e9d8738_700x420.jpeg", "https://jennifermargulis.substack.com/p/for-three-deaths-prevented-two-inflicted", "https://jennifermargulis.substack.com/p/heart-attacks-in-young-people-increase", "https://stevekirsch.substack.com/p/us-congressman-sean-castin-is-responsible", "https://openvaers.com/covid-data", "https://www.theepochtimes.com/covid-vaccinations-for-children-is-criminal-must-stop_4529512.html", "https://jennifermargulis.substack.com/p/boosters-for-kids-ages-5-to-11-recommended"], "authors": ["Jennifer Margulis"], "publish_date": "2022-07-17T11:23:08+00:00"}