{"result_id": "331036", "URL": "https://vactruth.com/2016/02/18/mmr-vaccine/", "timestamp": "2023-04-25 17:52:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/02/18/mmr-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "You Decide: The Risks and Benefits of the MMR Vaccination", "cleaned_text": "Most of us weigh the risks and benefits of medical procedures prior to obtaining them. We sign an informed consent form with an understanding of the potential harm versus the perceived benefits.\n\nIn the case of vaccinations, the great majority of parents obtain vaccinations for their children, influenced by the “sales pitch” and “scare tactics” used by physicians. We are assured that the vaccination is safe and will protect us and our children from the various targeted deadly diseases. If we blindly trust our doctors, as I once had, we readily agree.\n\nIt is important that we think critically before agreeing to any vaccination, recognizing that vaccines are indeed medical procedures which carry serious risks of harm, along with only “theoretical” health benefits.\n\nWhat Is The MMR Vaccination?\n\nThe MMR vaccination is targeted against the diseases measles, mumps and rubella (German measles). The Centers for Disease Control and Prevention (CDC) reports that these three diseases are quite serious.\n\nThe CDC also reports that prior to vaccinations, these diseases were quite common, especially among children. Measles is reported to commonly cause rash, cough, runny nose, eye irritation and fever. Mumps can cause fever, headache, muscle pain, loss of appetite and swollen glands. Rubella is reported to cause rash and mild fever in children.\n\nThe CDC states that the MMR vaccine can protect children and adults from all three of these diseases.\n\nTwo dosages of the MMR vaccine are recommended, the first at 12-15 months of age. The second dosage is recommended between ages 4-6 years of age.\n\nIn very rare cases, measles has been reported to lead to ear infection, pneumonia, seizures, brain damage and death. Likewise, mumps in adults can very atypically cause deafness, meningitis, painful swelling of the testicles or ovaries and sterility. For a pregnant woman, being infected with rubella can potentially cause miscarriage or birth defects in her child. [1]\n\nWhat Are The Real Benefits Of The MMR Vaccine?\n\nTheoretically, the MMR vaccine provides protection from measles, mumps and rubella. In truth, the MMR vaccination, like all others, has only been proven to cause an increase in antibodies to these three diseases.\n\nNoted researcher and neurologist Russell Blaylock has written and lectured widely that while vaccinations are shown to increase targeted antibodies in the body, they simultaneously decrease cellular immunity, which is more critical for disease protection. [2]\n\nBlaylock has also argued that the actual immunity from vaccinations is quite small and time-limited, if any is provided at all. [3]\n\nMore Evidence Of Vaccine Failures In The Case Of Measles And Mumps\n\nDisease charts show that several childhood disease had significantly declined prior to the introduction of the practice of vaccinations. Improvements in sanitation and water are credited with the decrease in illnesses, not vaccinations. [4] [5]\n\nDr. Veira Scheibner has reported on several recent outbreaks of measles among fully-vaccinated children, which further disproves effectiveness of measles vaccinations. [6]\n\nDr. Russell Blaylock has similarly reported that among those recently infected with measles, the majority, and, in some cases, one hundred percent, have been vaccinated with the MMR vaccine. This vital information is not reported by mainstream media. [7]\n\nNews reports have also connected recent mumps outbreaks to be among those receiving the vaccination. [8]\n\nThe question must and should be asked, Why are vaccinated individuals becoming infected with diseases? if these vaccinations are indeed effective at preventing diseases as claimed.\n\nThe Relatively Benign Childhood Illness: Measles, Mumps And Rubella\n\nFor the vast majority who succumbed to measles, mumps and rubella in the past, it was treated as a very benign childhood illness. There was no mass hysteria that is seen today when outbreaks occur. Children simply rested at home for several days, until their symptoms subsided.\n\nAn episode of the Brady Bunch, a popular show in the ‘70s, showed how common and benign measles and mumps were considered to be. (Interestingly, while I had viewed this excellent episode when it was initially highlighted to demonstrate this point, CBS has since taken it down for alleged copyright purposes.) [9]\n\nFor the MMR vaccination, the following “side effects” have been reported. Merck, in MMR surveillance, reported brain inflammation and chronic brain dysfunction, along with the following health issues:\n\nThe National Vaccine Information Center (NVIC) reported the following:\n\n“Using the MedAlerts search engine, which facilitates an online search of the federal Vaccine Adverse Events Reporting System (VAERS) database, as of December 14, 2014 there have been 6,962 serious adverse events reported to the Vaccine Adverse Events Reporting System (VAERS) in connection with measles vaccine since 1990, with over half of those occurring in children three years old and under. Of these events 329 were deaths, with over half of the deaths occurring in children under three years of age.”\n• aseptic meningitis (inflammation of the lining of the brain)\n\nThe other huge risk associated with the MMR vaccination is autism. In spite of denials by mainstream media and conventional medical groups, the connection is quite strong. Autism is now commonplace, with one out of 50 children being diagnosed with this debilitating disorder. [11]\n\nMore recently, a huge scandal occurred in which a CDC scientist confessed to covering up a 2001 study showing a significant increase in autism rates for African-American boys who received the MMR vaccine. [12]\n\nClearly, when making an analysis of the risks versus benefits of the MMR vaccination, many health risks exist. It is not a safe vaccine, as is promised by the health industry: 6,962 reports of serious health injuries is significant; 329 deaths of young children is tragic. The strong association with an increase in autism is quite serious.\n\nThere is limited, if any, evidence showing health benefits of receiving this vaccination. Those receiving the vaccination continue to become ill with measles and mumps, which usually results in a mild illness.\n\nIt is important to weigh the risks and benefits prior to going forward with this medical procedure. After doing an important investigation of both risks and benefits, you alone must decide.\n• Blaylock, Russell. Outsmarting … And Beating … Infections. The Blaylock Wellness Report. Vol. 19, No. 4. April 2012.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/02/18/mmr-vaccine/", "site_name": "VacTruth.com", "title": "You Decide: The Risks and Benefits of the MMR Vaccination | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/02/mmr-vaccine.jpg", "description": "Most of us weigh the risks and benefits of medical procedures prior to obtaining them. We sign an informed consent form with an understanding of the potential harm versus the perceived benefits. In the case of vaccinations, the great majority of parents obtain vaccinations for their children, influenced by the “sales pitch” and “scare tactics” …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "vaccine injury", "article:section": "Logical", "article:published_time": "2016-02-18T12:43:52-05:00", "article:modified_time": "2016-02-18T13:11:09-05:00", "updated_time": "2016-02-18T13:11:09-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/02/mmr-vaccine.jpg", "image:width": "640", "image:height": "427"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/michelle-goldstein/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/02/18/mmr-vaccine/", "https://twitter.com/share?text=You Decide: The Risks and Benefits of the MMR Vaccination:&url=https://vactruth.com/2016/02/18/mmr-vaccine/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/02/18/mmr-vaccine/&media=https://vactruth.com/wp-content/uploads/2016/02/mmr-vaccine.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/02/18/mmr-vaccine/", "https://vactruth.com/wp-content/uploads/2016/02/us-measles.jpg", "http://www.cdc.gov/vaccines/hcp/vis/vis-statements/mmr.html", "http://www.h4cblog.com/vaccines-and-the-myth-of-herd-immunity", "http://www.healthsentinel.com/joomla/index.php?option=com_content&view=article&id=2654:united-states-disease-death-rates&catid=55:united-states-deaths-from-diseases&Itemid=55", "http://www.whale.to/vaccines/decline1.html", "http://healthimpactnews.com/2013/outbreaks-of-measles-in-vaccinated-children-intensifying/", "http://www.newsmax.com/Newsmax-Tv/Russell-Blaylock-vaccinations-media-hype/2015/02/03/id/622461/", "http://www.inquisitr.com/1177096/mumps-outbreak-at-ohio-state-almost-all-were-vaccinated/", "http://www.ageofautism.com/2015/01/a-very-brady-measles.html", "http://www.nvic.org/vaccines-and-diseases/Measles/measles-vaccine-injury-death.aspx", "http://www.whiteoutpress.com/timeless/courts-quietly-confirm-mmr-vaccine-causes-autism/", "http://www.greenmedinfo.com/blog/african-american-autism-and-vaccines-rfk-jr", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/rossanaf/15250820615/in/photolist-peErD2-mwkP46-9ytCVj-e7Krd3-apXj5z-nFNCDo-6Q338t-4LSrok-4LWC8y-6UXLJD-6qfHaL-37iWf7-4pdNJA-ch8wN-7weK2U-5Jepbt-ec5gUx-s5K6Gm-DoXSBZ-9rPXEz-yFxqi-nBPhJN-pXrTY7-474qu5-bYvhEL-7v9TKJ-irZ7UB-dG9nS-vUjiab-7iFV9u-dt72q-bCk7y2-pL13Bb-aEeMDs-irYY1K-guSizp-guR3tL-8bHuip-HhrGm-guR3EN-6kKQkP-guSit2-guRYVJ-4vo3eG-8mPsMk-btr8BD-pZ9HxZ-jJKLvY-4LWCUN-efDGF5"], "authors": [], "publish_date": "2016-02-18T12:43:52-05:00"}