{"result_id": "331009", "URL": "https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/", "timestamp": "2023-04-25 17:52:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "My Children are Vaccine-Damaged; are Yours?", "cleaned_text": "I was raised like most Americans. Doctors were highly respected in my parents’ home and their authority on health matters was not questioned. My parents followed their physicians’ advice on healthcare and I was no different when raising my own children.\n\nI was careful to follow the health and dietary recommendations when my children were young and I believed that vaccines would keep my children safe from disease. In fact, I believed wholeheartedly that the more vaccines we had, the better protected my family would be. Out of love, I gave myself and my children every new vaccine available. I consulted with our physicians and with full trust followed their advice.\n\nThe Vaccine That Woke Me Up To Vaccine Dangers\n\nAfter consulting with my trusted obstetrician, who had delivered all three of my children, along with my pediatrician, I made the fateful decision to vaccinate my two daughters with the HPV vaccination series. Several months later, one child developed a serious case of the debilitating autoimmune disorder, Crohn’s disease, which robbed her of several years of her childhood. We continue to battle this ravaging disease.\n\nIt took many years and countless consultations with integrative, holistic physicians before I recognized the link between the HPV vaccination and my daughter’s illness. To be honest, there was only one holistic physician, who specialized in autism, who helped us make this connection. The many others, including a certified functional medicine doctor, failed to connect these two events.\n\nI now believe wholeheartedly that the HPV vaccine and my daughter’s development of a life-threatening autoimmune disorder was no coincidence. Of course, the majority of doctors will claim illnesses and vaccines are not connected in any way. This is part of their education and training as physicians.\n\nI was so preoccupied with the serious illness confronting my one daughter, that I didn’t notice the impact of the vaccine on my other child until many years later. She had been an accomplished cello player, and I noticed her inability to perform at the same high level after the HPV vaccination.\n\nHer focus and school work also became more challenging for her, although she continued to perform at a high level. A few years later, she developed painful ovarian cysts, heavy menstrual bleeding, other cycle irregularities, intermittent stomach pains and a pancreatic cyst. Tragically, the HPV vaccine has been linked with several serious illnesses for female teenagers and young women, including infertility and cervical cancer. [1,2,3]\n\nRecent research has supported the connection between vaccinations and autoimmune disorders. Leading Israeli researchers published a report in Pharmacological Research in October 2015 which connects vaccinations to autoimmune disorders. The report stated:\n\n“In this review of the literature, there is evidence of vaccine-induced autoimmunity and adjuvant-induced autoimmunity in both experimental models as well as human patients. Adjuvants and infectious agents may exert their immune-enhancing effects through various functional activities, encompassed by the adjuvant effect. These mechanisms are shared by different conditions triggered by adjuvants leading to the autoimmune/inflammatory syndrome induced by adjuvants (ASIA syndrome).”\n\nThe report continued with this summary:\n\n“In conclusion, there are several case reports of autoimmune diseases following vaccines.”\n\nThe report calls for further research in this important area. [4,5]\n\nTremendous research has recently connected the adjuvant aluminum to the development of an inflammatory response in the body, leading to a variety of life-threatening illnesses, autoimmune disorders and inflammatory responses, including multiple sclerosis, autism, rheumatoid arthritis, Alzheimer’s disease and death.\n\nThe HPV vaccine, hepatitis B vaccine and other vaccinations containing aluminum have been linked to these inflammatory reactions. This debilitating response has been labeled ASIA, or autoimmune inflammatory syndrome induced by adjuvants.\n\nBeginning in January of 2014, a world register was created to track individuals affected with this syndrome. ASIA was first identified in 2011 by Dr. Yehuda Schonefeld in the Journal of Autoimmunology. [6]\n\nMore specifically related to our experience, several studies have linked the HPV vaccination with autoimmune disorders. A 2014 report summary stated:\n\n“HPV is a new vaccine that is being rolled out on millions of young girls and women, and now boys and men, globally, but few have heard of autoimmunity as a potential side effect.”\n\n“Cumulatively, the list of serious adverse reactions related to HPV vaccination worldwide includes deaths, convulsions, paraesthesia, paralysis, Guillain–Barré syndrome (GBS), transverse myelitis, facial palsy, chronic fatigue syndrome, anaphylaxis, autoimmune disorders, deep vein thrombosis, pulmonary embolisms, and cervical cancers,” declared Canadian vaccine researchers Lucija Tomljenovic and Christopher Shaw in an article in the Annals of Medicine published last March.\n\nCeleste McGovern, in a detailed report, made significant and disturbing points regarding the HPV vaccine and others. One finding is the fact that autoimmune disorders have been found to often have a late onset in reaction to vaccinations.\n\n“As long ago as 1982, research had established late onset of autoimmune disease including Guillain–Barre syndrome linked to vaccination.”\n\n“If vaccine insult to the immune system initially manifests as vague symptoms of joint pain and flu-like illness and “bridging symptoms” are misdiagnosed and ignored, then lie dormant for a secondary trigger to precipitate into full-blown autoimmune disease, perhaps years later, what proportion of the current epidemic of autoimmune disease has its origin in vaccination? A 2010 report of the American Autoimmune-Related Diseases Association (AARDA) estimates that 50 million Americans are currently living with at least one of the more than 140 identified autoimmune diseases ranging from Crohn’s disease and type 1 diabetes to multiple sclerosis and psoriasis. It is also a leading cause of death among girls and young women.”\n\n“An interval of six weeks between exposure and outcome is often used as evidence of a plausible causal association; however, immune and autoimmune diseases are chronic diseases that more often than not have a long incubation time.”\n\nThis diagnostic criteria used by established medical institutions helps to partially explain the discrepancy of vaccine damage found in reports between government institutions and other groups. [7]\n\nGovernment institutions such as the Centers for Disease Control and Prevention (CDC) continue to maintain the safety of the Gardasil vaccine, in spite of admission that 32,925 reports of injury following the vaccine have been made. The CDC admits that death, fertility issues and other serious injuries have followed the Gardasil vaccination, but argues that causation cannot be proven. [8]\n\nMeanwhile, independent medical groups have recently warned about the risks to fertility of the Gardasil vaccine for young women. In a January 2016 report of the American College of Pediatricians, authored by Scott S. Field, MD, warnings were made to pediatricians of the link between the HPV vaccination and fertility issues for young women. Following the Gardasil vaccination, 213 reports of amenorrhea, along with reports of premature ovarian failure, were cited as reasons for concern. The lack of safety studies examining post-vaccination ovarian dysfunction was mentioned as well. [9]\n\nNaysayers will continue to argue that vaccines are safe and effective, one of the greatest medical myths in existence, but the facts don’t support this. The National Vaccine Information Center (NVIC) compiles statistics on vaccine-damaged children. The childhood diseases of asthma, learning disability, autism, diabetes and autoimmune disorders have skyrocketed with the corresponding increase in vaccination rates.\n\nIn 2013, one in six children had learning disabilities, compared to one of thirty children in 1976. In 2013, one out of nine children had asthma compared to one of 27 in 1980. One out of 50 children had autism in 2013, compared to one out of 555 in 1990.\n\nBetween 2001 and 2013, the rates for diabetes increased from one out of 500 children to one out of 400. At the same time, the CDC recommendations for vaccines have skyrocketed. In 2013, the CDC recommended 69 dosages of 16 vaccines between birth and age 18. [10]\n\nAutoimmune disorders, including celiac disease, lupus and type 1 diabetes have increased dramatically between 2001 and 2009. Genetics do not change significantly in such a short period of time, so environmental causes are suspected. [11]\n\nThe Failure Of The Vaccine Courts And NVIC Reporting\n\nThe vaccine court, paid for by consumers of vaccines, is set up to deny awards. By 2010, the Court of Claims had awarded nearly $3 billion to vaccine victims for their injuries, including a maximum award of $250,000 for death. Two out of every three applicants are denied compensation.\n\nMost vaccine-damaged individuals never make it to court. Most vaccine-damaged children, including those in our family, never see a dime of this money. The vast majority of misery and cost of addressing health damages falls on the family. [12]\n\nThe National Vaccine Information Center (NVIC) gathers reports on vaccine side effects resulting from vaccinations. It is estimated that less than one to ten percent of actual reactions are reported. Their reports of vaccine reactions include the following: high fever, collapse and shock, convulsions, brain inflammation, seizures, uncontrollable behavioral problems, onset of chronic ear and respiratory infections, regression, allergies, arthritis, severe diarrhea, crossing of eyes, hearing loss, memory loss, inability to concentrate, extreme sleepiness, paralysis, and sudden death. [13]\n\nMy three young adult children have struggled with a litany of illnesses. Outwardly, they look fine and today are able to function at high levels, but their bodies have been damaged. The following list of their combined diagnosed diseases betray their outward appearance of good health.\n\nThe following are some of their medical diagnoses:\n\nThis is NOT normal, as physicians would lead us to believe. I cannot claim vaccinations are entirely responsible for these health problems, but I cannot excuse vaccinations as a primary contributing factor for many of them.\n\nI believe toxins in our air, food and water have also contributed. I also hypothesize that vitamin and nutritional deficiencies resulting from following incorrect dietary recommendations made by physicians and health care institutions were a causative factor. Overuse of antibiotics for ear infections and strep throat likely did damage as well.\n\nThe Years It Took For Me To Put It All Together\n\nAs previously stated, I honestly did not connect my children’s health struggles with vaccinations until quite recently. The myth of vaccine safety and effectiveness is so strong that I struggled to connect these two realities. It logically makes sense that injecting poisons, chemicals and viruses into one’s body would lead to illness and a compromised immune system.\n\nOne of our consulting physicians who specialized in treating autism made a strong argument linking the HPV vaccine with the development of Crohn’s disease in my daughter. She detailed all of the toxins contained in the vaccine, along with the timeline for the first symptoms of the disease, which were only a few weeks apart.\n\nAt some point, I picked up the book The Vaccine Guide by Dr. Randall Neustaedter at a consulting homeopathic physician’s office, and began reading this informative guide. I then started digging deeper into the many online resources on vaccinations. It took me several more years of vaccine research and pondering to connect many of my children’s other health problems with vaccines.\n\nMy Apologies And Hope For Our Future\n\nI have sincerely apologized to my children for my decision to vaccinate them. They understand that I made the decision based on the information available to me at that time. They have forgiven me.\n\nMy hope is that this barbaric practice of injecting toxins into our children and ourselves will end before it is too late. We are facing a tremendous health epidemic for our children, one in which the longevity of our children is now predicted to be less than for living adults. Quality of life is seriously endangered with the multiple health problems children now much more commonly endure.\n\nAt the very least, I hope that we can maintain and regain our health freedoms to decide whether we want to have this medical procedure done. The fight will be a difficult one and has been fought since the very first vaccine.\n\nThere have always existed groups of anti-vaccinators, although they have remained the minority. I believe that with the growing number of vaccine-damaged children and adults, the anti-vaccine movement may grow in strength.\n\nA growing number of today’s children suffer from vaccine damage. Most individuals do not make the connection between health problems and vaccines. When asked about the cause of autoimmune disorders, asthma, allergies, diabetes, learning disabilities, attention deficit disorder, autism, and other common childhood diseases and illness, the majority of health care providers advise patients that the causes are unknown. Doctors, including most integrative physicians, fail to make the connection to vaccines.\n\nIt takes one moment to permanently damage the health of an adult or child, but takes a lifetime to try to undo the damage. The responsibility to regain health will fall alone on you. Your physician and healthcare system holds NO liability. Do your research before vaccinating.\n\nI have made the painful conclusion that all of my children have suffered in significant ways from vaccine damage. Are your children also vaccine-damaged?\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics which impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/", "site_name": "VacTruth.com", "title": "My Children are Vaccine-Damaged; are Yours? | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/02/hpv-vaccine-my-child.jpg", "description": "I was raised like most Americans. Doctors were highly respected in my parents’ home and their authority on health matters was not questioned. My parents followed their physicians’ advice on healthcare and I was no different when raising my own children. I was careful to follow the health and dietary recommendations when my children were young and I …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "vaccine injury", "article:section": "Logical", "article:published_time": "2016-02-05T15:41:17-05:00", "article:modified_time": "2016-02-05T16:30:28-05:00", "updated_time": "2016-02-05T16:30:28-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/02/hpv-vaccine-my-child.jpg", "image:width": "640", "image:height": "348"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/michelle-goldstein/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/", "https://twitter.com/share?text=My Children are Vaccine-Damaged; are Yours?:&url=https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/&media=https://vactruth.com/wp-content/uploads/2016/02/hpv-vaccine-my-child.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/02/05/my-children-are-vaccine-damaged/", "http://www.naturalnews.com/041512_Gardasil_ovary_destruction_HPV_vaccine.html", "http://sanevax.org/hpv-vaccine-vaers-reports-march-2012/", "http://www.acpeds.org/the-college-speaks/position-statements/health-issues/new-concerns-about-the-human-papillomavirus-vaccine", "http://www.sciencedirect.com/science/article/pii/S1043661815001711", "http://info.cmsri.org/the-driven-researcher-blog/on-vaccines-adjuvants-and-autoimmunity", "http://www.greenmedinfo.com/blog/new-autoimmunity-syndrome-linked-aluminum-vaccines?page=2", "http://www.greenmedinfo.com/blog/hpv-vaccine-linked-nervous-system-disorder-and-autoimmunity?page=1", "http://www.cdc.gov/vaccinesafety/vaccines/hpv/hpv-safety-faqs.html#A2", "http://www.acpeds.org/the-college-speaks/position-statements/health-issues/new-concerns-about-the-human-papillomavirus-vaccine", "http://www.nvic.org/downloads/49-doses-posterb.aspx", "http://www.medicalnewstoday.com/articles/246960.php", "http://www.nvic.org/vaccines-and-diseases/Measles/measles-vaccine-injury-death.aspx", "http://www.nvic.org/Ask-Eight-Questions.aspx", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/84744710@N06/16362526505/in/photolist-qVUe4X-ffbGsw-9hULn5-8uBozv-8uBLnZ-4m3bC-8uBCsV-8uEYiQ-pMLHb-innn1D-fhres3-pMLH8-uebbX-8uBMyM-8uAXSz-8uEwN9-8uBTSz-8uEVkd-inni38-innodN-4m3hA-4m3ee-innWQH-inowbP-innYPw-4m3nC-8uEFgq-hwhyu-inpQhY-innDwW-5WUNDn-innyh6-iJ4fKH-hTFhnd-8uEgA5-8uF8D3-8uBV6B-8uBqCT-8uEQeL-8uC99Z-8uC13M-8uF2cm-8uBXSD-8uF76A-8uF2D7-8uF1Ey-8uBXj6-8uBVXr-8uC2G4-8uC2ri"], "authors": [], "publish_date": "2016-02-05T15:41:17-05:00"}