{"result_id": "331025", "URL": "https://vactruth.com/toolbox/overview/", "timestamp": "2023-04-25 17:52:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/toolbox/overview/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Overview", "cleaned_text": "\n• What tools should I be using to look into vaccines?\n• What terms should I be familiar with?\n• What are the greatest risks to my child?\n• What books do you recommend I read?\n• Where can I get more information on vaccine exemptions?\n• What type of vaccine exemption is the best?\n• What should I put on my vaccine exemption form?\n• What if I live in a state with only medical exemptions?\n• Where can I find more information on vaccine reactions?\n• If I am vaccinated, can I give the virus to someone else?\n• How much mercury is in a vaccine?\n• How much aluminum is in a vaccine?\n• Can the ingredients in vaccines cause cancer?\n• What can I expect after I find out I am pregnant?\n• ​How will my first appointment go with the pediatrician?\n• What happens if my doctor bullies me?\n• Do I need to take my child to a pediatrician?\n• Vaccine waivers to immigrate to the United States\n• The properties of chemicals used in products (PUBCHEM)\n• Clinical trials being run in the United States\n\nAdverse event. An untoward event that occurs after a vaccination that might be caused by the vaccine product or vaccination process. Adverse events include those that have the following characteristics: 1) vaccine induced (caused by the intrinsic characteristic of the vaccine preparation and the individual response of the vaccinee): these events would not have occurred without vaccination (e.g., vaccine-associated paralytic poliomyelitis); 2) vaccine potentiated: the events would have occurred anyway but were precipitated by the vaccination (e.g., first febrile seizure in a predisposed child); 3) programmatic error: the event was caused by technical errors in vaccine preparation, handling, or administration; and 4) coincidental: the event was associated temporally with vaccination by chance or caused by underlying illness. Special studies are needed to determine whether an adverse event is a reaction to the vaccine or the result of another cause. Sources: Chen RT. Special methodological issues in pharmacoepidemiology studies of vaccine safety. In: Strom BL, ed. Pharmacoepidemiology. 3rd ed. Sussex, England: John Wiley & Sons; 2000:707-732; and Fenichel GM, Lane DA, Livengood JR, Horwitz SJ, Menkes JH, Schwartz JF. Adverse events following immunization: assessing probability of causation. Pediatr Neurol. 1989;5:287–90.\n\nAdverse reaction. An undesirable medical condition that has been demonstrated to be caused by a vaccine. Evidence for the causal relation is usually obtained through randomized clinical trials, controlled epidemiologic studies, isolation of the vaccine strain from the pathogenic site, or recurrence of the condition with repeated vaccination (i.e., rechallenge); synonyms include side effect and adverse effect.\n\nAdjuvant. A vaccine component distinct from the antigen that enhances the immune response to the antigen.\n\nAntitoxin. A solution of antibodies against a toxin. Antitoxin can be derived from either human (e.g., tetanus immune globulin) or animal (usually equine) sources (e.g., diphtheria and botulism antitoxin). Antitoxins are used to confer passive immunity and for treatment.\n\nHyperimmune globulin (specific). Special preparations obtained from blood plasma from donor pools preselected for a high antibody content against a specific antigen (e.g., hepatitis B immune globulin, varicella-zoster immune globulin, rabies immune globulin, tetanus immune globulin, vaccinia immune globulin, cytomegalovirus immune globulin, botulism immune globulin).\n\nImmune globulin. A sterile solution containing antibodies, which are usually obtained from human blood. It is obtained by cold ethanol fractionation of large pools of blood plasma and contains 15%-18% protein. Intended for intramuscular administration, immune globulin is primarily indicated for routine maintenance of immunity among certain immunodeficient persons and for passive protection against measles and hepatitis A.\n\nImmunobiologic. Antigenic substances (e.g., vaccines and toxoids) or antibody-containing preparations (e.g., globulins and antitoxins) from human or animal donors. These products are used for active or passive immunization or therapy. Examples of immunobiologics include antitoxin, immune globulin and hyperimmune globulin, monoclonal antibodies, toxoids, and vaccines.\n\nIntravenous immune globulin. A product derived from blood plasma from a donor pool similar to the immune globulin pool, but prepared so that it is suitable for intravenous use. Intravenous immune globulin is used primarily for replacement therapy in primary antibody-deficiency disorders, for treatment of Kawasaki disease, immune thrombocytopenic purpura, hypogammaglobulinemia in chronic lymphocytic leukemia, and certain cases of human immunodeficiency virus infection (Table 3-5).\n\nMonoclonal antibody. An antibody product prepared from a single lymphocyte clone, which contains only antibody against a single antigen.\n\nSimultaneous. In the context of vaccine timing and spacing, occurring on the same clinic day, at different anatomic sites, and not combined in the same syringe.\n\nToxoid. A modified bacterial toxin that has been made nontoxic, but retains the ability to stimulate the formation of antibodies to the toxin.\n\nVaccination and immunization. The terms vaccine and vaccination are derived from vacca, the Latin term for cow. Vaccine was the term used by Edward Jenner to describe material used (i.e., cowpox virus) to produce immunity to smallpox. The term vaccination was used by Louis Pasteur in the 19th century to include the physical act of administering any vaccine or toxoid. Immunization is a more inclusive term, denoting the process of inducing or providing immunity by administering an immunobiologic. Immunization can be active or passive. Active immunization is the production of antibody or other immune responses through administration of a vaccine or toxoid. Passive immunization means the provision of temporary immunity by the administration of preformed antibodies. Although persons often use the terms vaccination and immunization interchangeably in reference to active immunization, the terms are not synonymous because the administration of an immunobiologic cannot be equated automatically with development of adequate immunity.\n\nVaccine. A suspension of live (usually attenuated) or inactivated microorganisms (e.g., bacteria or viruses) or fractions thereof administered to induce immunity and prevent infectious disease or its sequelae. Some vaccines contain highly defined antigens (e.g., the polysaccharide of Haemophilus influenzae type b or the surface antigen of hepatitis B); others have antigens that are complex or incompletely defined (e.g., Bordetella pertussis antigens or live, attenuated viruses).", "opengraph": {"type": "article", "url": "https://vactruth.com/toolbox/overview/", "site_name": "VacTruth.com", "title": "Overview | VacTruth.com", "description": "THE VACCINE TOOLBOX OVERVIEW Common Questions Useful Resources Key Terms Questions About Beginning Research Where do I start researching? What tools should I be using to look into vaccines? What terms should I be familiar with? What are the greatest risks to my child? What books do you recommend I read? Questions About Vaccine Exemptions …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "vaccinetruth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/toolbox", "https://vactruth.com/toolbox", "https://vactruth.com/toolbox/", "http://vactruth.com/vaccine-schedule/", "https://vactruth.com/vaccine-inserts-human/", "http://www.medalerts.org/", "https://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "https://www.treasurydirect.gov/govt/reports/tfmp/vaccomp/vaccomp.htm", "https://www.hrsa.gov/sites/default/files/vaccinecompensation/vaccineinjurytable.pdf", "http://www.uscfc.uscourts.gov/sites/default/files/Vaccine%20Attorneys.pdf", "https://www.uscis.gov/policymanual/HTML/PolicyManual-Volume9-PartC-Chapter3.html", "https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfcfr/CFRsearch.cfm?CFRPart=601", "https://ghr.nlm.nih.gov/gene", "https://www.usaspending.gov/Pages/Default.aspx", "https://taggs.hhs.gov/SearchRecip", "https://www.grants.gov/web/grants/search-grants.html", "https://www.followthemoney.org/", "https://www.usa.gov/", "https://grants.nih.gov/grants/oer.htm", "http://charitycheck101.org", "https://www.irs.gov/charities-non-profits/search-for-charities", "http://nccs.urban.org/", "http://coloradocapitolwatch.com/legislators/", "https://pubchem.ncbi.nlm.nih.gov/", "https://www.ncbi.nlm.nih.gov/pubmed/", "https://toxnet.nlm.nih.gov/", "https://java.epa.gov/oppt_chemical_search/", "https://www.atsdr.cdc.gov/", "https://clinicaltrials.gov/", "http://www.msds.com/", "http://www.cas.org/content/chemical-substances", "http://www.vigiaccess.org/", "http://thinktwice.com", "http://vaxxter.com", "http://greenmedinfo.com", "http://naturalnews.com", "http://ccfvc.org", "https://www.nvic.org/", "https://infowars.com", "http://vaccineimpact.com/", "https://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/timing.html#t-05", "https://www.cdc.gov/vaccines/hcp/acip-recs/general-recs/glossary.html"], "authors": [], "publish_date": null}