{"result_id": "331023", "URL": "https://vactruth.com/2016/05/26/chicken-pox-vaccine/", "timestamp": "2023-04-25 17:52:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/05/26/chicken-pox-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Why the Chicken Pox Vaccine Makes NO Sense", "cleaned_text": "The chicken pox vaccine, formally known as the varicella vaccination, was added to the recommended childhood vaccination schedule in 1995. Prior to this vaccine’s creation, it was a common practice for families to expose children to others who had the chicken pox. The disease was considered a normal part of childhood and it was widely known that chicken pox in childhood posed little to no risk of serious harm. Risks associated with chicken pox are more common in adults and those with compromised immune systems.\n\nMy Experience With The Chicken Pox Illness And Vaccination\n\nI clearly remember exposing my middle child to my older one during his outbreak of chicken pox, ensuring both would develop lifelong immunity to this once common, mild childhood disease. They both developed the common rash and mild discomfort of itching and low fever. I remember feeling relieved and happy when my middle daughter broke out in a skin rash, the telltale symptoms of chicken pox.\n\nUnfortunately, by the time my youngest child was in school, the chicken pox vaccine had been created and I willingly vaccinated her. I blindly trusted my pediatrician, our health care system and the practice of vaccinations at that time. Why experience the inconvenience of this childhood disease when it could be easily prevented by a simple vaccine? The natural health benefits of normally acquiring childhood diseases are, in fact, many, in addition to acquiring real, lifelong immunity to disease.\n\nNatural exposure to a disease ensures real immunity to disease, while immunity promised by vaccine makers often prove to be temporary, if it exists at all. Recent outbreaks of mumps in Harvard students, who were vaccinated for mumps, has been reported widely in the news. Less reported was the 2010 report that Merck falsified data in their MMR vaccine to show a 95 percent effectiveness rate against mumps. [1]\n\nNews reports of outbreaks of measles in those vaccinated have also been reported. These outbreaks again bring into question the true effectiveness of these vaccinations. A 2002 Centers for Disease Control and Prevention (CDC) study has shown only a 44 percent effectiveness rate for the chicken pox vaccination, which was earlier claimed to be 70-90 percent effective. [2, 3]\n\nThe chicken pox vaccine was added to the childhood vaccine schedule in 1995, with the booster dose added in 2006. A single dose of the vaccination promised to reduce the risk of chicken pox by 70-90 percent, with two doses reducing the risk more. The vaccine is available as a single vaccination, but also available as part of the MMRV vaccine (measles, mumps, rubella and varicella vaccine). [4]\n\nThe chicken pox vaccination was developed in Japan in the 1970s as a live attenuated vaccine. Two live virus vaccines are licensed for the chicken pox in the United States: Varivax and Proquad (MMRV), which are both manufactured by Merck. The CDC recommends vaccination at age 12 months, with a booster shot between ages 4 and 6. [5, 6]\n\nChicken pox is considered to be a mild disease in children, with most experiencing no complications. The first symptoms to appear are an itchy rash on the head, which spreads to the trunk of the body. The skin rash raises with blisters forming, until the blisters crust over and disappear, within 14 days. Fever and fatigue are also common symptoms.\n\nChicken pox is easily transmitted with 90 percent of non-immune family members contracting the disease. Transmission occurs through respiratory droplets and fluid from the blisters. One is considered infectious from one to two days prior to the rash appearing, until the blisters crust over, no longer containing fluid. [7]\n\nMost children and adults who have complications from chicken pox have compromised immune systems or other health problems.\n\nChicken pox, caused by the varicella zoster virus (VZV), is an acute infectious disease. The recurrent infection, herpes zoster, more commonly known as shingles, has been recognized since ancient times. Herpes zoster, or shingles, occurs when the latent VZV infection is reactivated, commonly later in life. Shingles, while painful, is generally short-lived, but can last longer in some cases. [8]\n\nRisks And Side Effects Of The Chicken Pox Vaccine\n\nReported complications from the chicken pox vaccine include shock, seizures, encephalitis/brain inflammation, blood disorder, Guillain-Barre syndrome, and death. As of September 1, 2015, 122 claims were filed in the federal Vaccine Injury Compensation Program for serious injuries and deaths following the chicken pox vaccination, including eight deaths.\n\nUsing the MEDAlerts search engine, as of September 30, 2015, there were 3,358 serious adverse events reported to the Vaccine Adverse Events Reporting System (VAERS) which were connected with the chickenpox vaccination. These reports of serious injury had occurred since 1990. More than half of the serious injuries reported were in children 6 years of age or younger. 161 deaths were reported. By 2011, nearly 50,000 total reports of adverse events were made to VAERS. [9]\n\nEffectiveness And Related Issues Of The Chicken Pox Vaccination\n\nA 2002 CDC study reported that the chicken pox vaccine was only 44 percent effective against the disease. Because of breakthrough of chicken pox in children vaccinated, a booster shot was recommended for all children ages 4-6.\n\nAnother 2002 study showed that adults exposed to children with natural immunity to chicken pox benefited from protection from shingles later in life. Due to concern that mass vaccination of children against chicken pox may lead to a shingles epidemic, Merck developed the shingles vaccine in 2006. The CDC recommends this vaccine for all adults over age 60. [10]\n\nChicken pox is considered to be a mild, childhood disease, which is self-limiting with symptoms of an itchy rash, often accompanied by mild fever. By contrast, the chicken pox vaccination, which theoretically offers protection from this mild illness, is associated with serious complications, including the deaths of 161 previously healthy children.\n\nDoes it make sense to vaccinate against a mild childhood disease with a vaccination which carries risk of serious injury and death? Only you can decide.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/05/26/chicken-pox-vaccine/", "site_name": "VacTruth.com", "title": "Why the Chicken Pox Vaccine Makes NO Sense | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/05/chicken-pox-vaccine.jpg", "description": "The chicken pox vaccine, formally known as the varicella vaccination, was added to the recommended childhood vaccination schedule in 1995. Prior to this vaccine’s creation, it was a common practice for families to expose children to others who had the chicken pox. The disease was considered a normal part of childhood and it was widely …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "Varicella vaccine", "article:section": "Logical", "article:published_time": "2016-05-26T12:43:57-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/05/chicken-pox-vaccine.jpg", "image:width": "640", "image:height": "427"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/michelle-goldstein/", "https://vactruth.com/category/top-stories/recent-articles-1/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/05/26/chicken-pox-vaccine/", "https://twitter.com/share?text=Why the Chicken Pox Vaccine Makes NO Sense:&url=https://vactruth.com/2016/05/26/chicken-pox-vaccine/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/05/26/chicken-pox-vaccine/&media=https://vactruth.com/wp-content/uploads/2016/05/chicken-pox-vaccine.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/05/26/chicken-pox-vaccine/", "https://vactruth.com/2016/04/30/harvard-mumps-outbreak/", "https://vactruth.com/2016/02/18/mmr-vaccine/", "http://www.nvic.org/Vaccines-and-Diseases/Chickenpox.aspx", "http://www.historyofvaccines.org/content/articles/chickenpox-varicella", "http://www.cdc.gov/vaccines/pubs/pinkbook/varicella.html", "http://www.nvic.org/Vaccines-and-Diseases/Chickenpox.aspx", "http://www.historyofvaccines.org/content/articles/chickenpox-varicella", "http://www.cdc.gov/vaccines/pubs/pinkbook/varicella.html", "http://www.nvic.org/Vaccines-and-Diseases/Chickenpox.aspx", "http://www.nvic.org/Vaccines-and-Diseases/Chickenpox.aspx", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/83633410@N07/7658298768/in/photolist-cEJMpW-8qNBEC-8BWFa9-7En8U-sztfA-pUHejt-6DTbAF-HS66y-6eBt8y-5eGQeG-6znZE-BCBrW-2M9UdB-7rYJ5k-81KZi2-7o37h4-7nzkbN-4CvS3s-4CrBdZ-c4Rw4G-pqxcb-4CrzUF-GQbj4-GQbiz-GQbhn-4D7JwS-hNH5RT-5UNWTt-mWhKE3-9GfN8H-i4WjGS-8d2LFo-7U844k-3nahKh-rcgVDe-bxWjvg-GQbjx-nHq9k3-2DhxoU-5vKc1-7udZut-69Gx1U-8uts1c-61Spk2-cYLFdQ-4kQjs2-5gHrUC-dvQTE2-dRF8w2-8Uej7i"], "authors": [], "publish_date": "2016-05-26T12:43:57-04:00"}