{"result_id": "331040", "URL": "https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/", "timestamp": "2023-04-25 17:52:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "What You Need to Know to Protect Your Daughter from the Gardasil Vaccine Disaster", "cleaned_text": "The HPV vaccine has proven to be a disaster. This vaccine, developed to protect young women from cervical cancer, has failed to provide protection. In fact, it has succeeded in doing the opposite by increasing cervical cancer rates in those vaccinated.\n\nReports of health damage caused by this vaccine are immense. The HPV vaccination has been linked with life-threatening autoimmune disorders, cancer, paralysis, infertility and death. In fact, several countries have opposed the vaccine, as evidenced through public warning or lawsuits.\n\nA lead researcher of the vaccine has advised parents not to use it. One independent group of physicians has recently issued a warning against the vaccine. However, in spite of overwhelming evidence against this vaccine’s effectiveness and safety, US physicians continue to strongly recommend it for their patients.\n\nWith the failure of the medical industry to recognize the HPV vaccine disaster, the responsibility falls to parents to do their own research. Parents must stand strong in their independent, educated decisions when facing opposition from their physicians who blindly follow industry recommendations without further investigation.\n\nIntimidation and other scare tactics may be used, but your children’s lives are in your hands. If your precious child suffers vaccine damage, physicians hold no liability or responsibility.\n\nWhat Is The HPV Vaccine?\n\nGardasil is a human papilomavirus (HPV) vaccine which supposedly promises protection against four types of HPV. The four types of HPV targeted include types 6, 11, 16 and 18. The Gardasil vaccine proposes protection against two types of HPV, which allegedly cause 70 percent of cervical cancer cases and up to 50 percent of vulvar cancer cases.\n\nThe vaccine also advertises protection from 80 percent of anal cancer cases, along with 90 percent of genital warts. The vaccine targets females and males ages 9-26. The Gardasil vaccination was licensed first and is the most widely used HPV vaccination in the United States. [1,2]\n\nHPV Vaccine Appears To Increase Risk Of Cervical Cancer In Young Women\n\nCervical cancer is a very low-risk cancer for young women, generally presenting in older women and easily screened by pap smears. This cancer is usually easily treatable when detected early. The rationale for this vaccination targeting young women makes no common sense, since young women are not at high risk for this cancer and the vaccine protection promises to last a short five years.\n\nSadly, the HPV vaccine appears to be having the opposite effect of what it proposes to do. By March of 2012, 669 young women had reported abnormal pap smears and cervical dysplasia to the Vaccine Adverse Event Reporting System (VAERS). Fifty women reported cancer as a result of the HPV vaccine. These reports are estimated to be a very small percentage of the actual events. [3]\n\nThese occurrences correlate with other reports of vaccines actually causing the very illness they propose to prevent. Recent measles and mumps outbreaks have been reported in those vaccinated. The polio vaccination was also accused of causing new cases of polio outbreaks. How effective are vaccines which, in reality, cause the very disease they propose to prevent? [4-6]\n\nThere are actually two HPV vaccines, the Gardasil vaccination and the Cervarix vaccine. Gardasil was licensed first in the US, so it has the majority of the market share. After Gardasil was licensed, thousands of reports were received of sudden collapse with unconsciousness within 24 hours, seizures, disabling fatigue, Guillain-Barré Syndrome, facial paralysis, brain inflammation, rheumatoid arthritis, lupus, blood clots, multiple sclerosis, strokes, heart and other serious health problems, including death.\n\nAs of September 1, 2015, 295 claims of injury were filed in the federal Vaccine Injury Compensation Program (VICP) for injuries and deaths following the HPV Gardasil vaccination, including 13 deaths and 282 serious injuries.\n\nAs of September 30, 2015, 37,474 vaccine adverse reactions associated with the Gardasil vaccination were reported to VAERS, including 209 deaths; 3,119 Cervarix vaccine adverse reactions, including 16 deaths were reported to VAERS. Gardasil vaccines have been linked to serious autoimmune disorders. [7]\n\nA 2014 report summary states autoimmune disorders are one of the serious adverse reactions related to the HPV vaccination. Autoimmune disorders often have a late onset in reaction to vaccinations.\n\nAs of 2010, it was estimated that 140 million Americans were living with one of 140 debilitating autoimmune disorders, including Crohn’s disease, type 1 diabetes, and multiple sclerosis.\n\nAutoimmune disorders are a leading cause of death among girls and young women. Another report estimates one of five Americans suffer from an autoimmune-mediated disease, a course which has reached epidemic numbers in recent years. [8,9]\n\nWithdrawal Of Support Of HPV Vaccine By Lead Developer\n\nIn 2009, Dr. Diane Harper, lead researcher for the Gardasil vaccination, issued extensive warnings to young girls and their parents about the Gardasil vaccination. Dr. Harper assisted in designing and carrying out the Phase ll and lll safety and effectiveness studies needed to get Gardasil approved. She was a paid speaker and consultant to Merck, the maker of the Gardasil vaccination.\n\nHarper reported that the serious adverse reports of health damage following the Gardasil vaccine outweigh any protection, lasting only five years, against the very small risk of cervical cancer. [10]\n\nDr. Scott S. Fields of the American College of Pediatricians issued a warning in a January 2016 report that the Gardasil vaccination could be associated with a rare but serious condition known as premature menopause, or premature ovarian failure. This warning is a significant step for an organized medical group to make. [11]\n\nWithdrawal Of Support For HPV Vaccine In Other Countries\n\nSpain, France, India and Japan have filed criminal lawsuits against Merck. Charges have been made on behalf of families of young women suffering serious adverse reactions to the vaccination. [12]\n\nIn 2013, the Japanese government withdrew its recommendations for the use of the HPV vaccination for girls, due to concerns with related health problems. Japan’s Ministry of Health, Labor and Welfare estimated that 3.28 million Japanese have received the HPV vaccination, with 1,968 negative health reactions reported following vaccination. These side effects include long-term pain, paralysis, and infertility. [13,14]\n\nBlind Endorsement Continues By The CDC And Physicians\n\nIn spite of overwhelming evidence of the HPV vaccine failure and related health damage, physicians continue to blindly recommend this vaccination. The Centers for Disease Control and Prevention (CDC) continues to recommend this vaccine for all males and female between the ages of 9-26. The CDC recommends three separate, subsequent vaccinations of this vaccination series. [15]\n\nThe majority of obstetricians and pediatricians continue to follow their professional organization’s guidelines for HPV vaccine recommendations. The following medical organizations recommend the HPV vaccination:\n\nIt is important for parents to review the evidence for and against the HPV vaccination. Parents must carefully weigh this vaccine’s pros and cons, until they are entirely comfortable with their decision.\n\nWe are fortunate to live in an era in which we still have freedom of speech on the Internet. Individuals can access several independent news sources to obtain factual independent data, not only the advertising provided by the makers and sellers of vaccinations.\n\nWhen discussing this vaccination with your health care provider, it is important to keep in mind that vaccinations continue to be the holy grail of modern medicine, in spite of the many holes in the theory of vaccine safety and effectiveness. Physicians are heavily biased in favor of vaccinations, which is a large part of their medical training.\n\nThe National Vaccine Information Center is a good resource for beginning your investigation into the HPV vaccine. Your child depends on you to make an informed decision.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics which impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/", "site_name": "VacTruth.com", "title": "What You Need to Know to Protect Your Daughter from the Gardasil Vaccine Disaster | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/03/gardasil-vaccine.jpg", "description": "The HPV vaccine has proven to be a disaster. This vaccine, developed to protect young women from cervical cancer, has failed to provide protection. In fact, it has succeeded in doing the opposite by increasing cervical cancer rates in those vaccinated. Reports of health damage caused by this vaccine are immense. The HPV vaccination has …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "Vaccine Death", "article:section": "Logical", "article:published_time": "2016-03-24T23:09:52-04:00", "article:modified_time": "2016-03-25T18:37:40-04:00", "updated_time": "2016-03-25T18:37:40-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/03/gardasil-vaccine.jpg", "image:width": "640", "image:height": "427"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/michelle-goldstein/", "https://vactruth.com/category/top-stories/recent-articles-1/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/", "https://twitter.com/share?text=What You Need to Know to Protect Your Daughter from the Gardasil Vaccine Disaster:&url=https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/&media=https://vactruth.com/wp-content/uploads/2016/03/gardasil-vaccine.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/03/24/the-gardasil-vaccine-disaster/", "http://www.nvic.org/vaccines-and-diseases/HPV.aspx", "http://www.gardasil.com/", "http://www.merck.com/product/usa/pi_circulars/g/gardasil/gardasil_ppi.pdf", "http://sanevax.org/hpv-vaccine-vaers-reports-march-2012/", "http://www.greenmedinfo.com/blog/polio-vaccines-now-1-cause-polio-paralysis", "http://www.naturalnews.com/048519_vaccines_measles_virus_shedding.html", "https://vactruth.com/2016/02/18/mmr-vaccine/", "http://www.nvic.org/vaccines-and-diseases/HPV.aspx", "http://info.cmsri.org/the-driven-researcher-blog/on-vaccines-adjuvants-and-autoimmunity", "http://www.greenmedinfo.com/blog/hpv-vaccine-linked-nervous-system-disorder-and-autoimmunity?page=1", "http://www.cbsnews.com/news/gardasil-researcher-speaks-out/", "http://www.acpeds.org/the-college-speaks/position-statements/health-issues/new-concerns-about-the-human-papillomavirus-vaccine", "http://healthimpactnews.com/2014/gardasil-vaccine-spain-joins-growing-list-of-countries-to-file-criminal-complaints/", "http://www.tokyotimes.com/hpv-vaccine-seen-differently-by-japan-and-the-u-s/", "http://www.naturalnews.com/041099_Gardasil_side_effect_Japan_infertility.html", "http://www.gardasil.com/", "http://www.gardasil.com/about-gardasil/who-should-get-vaccinated/", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/tostaada/8601055541/"], "authors": [], "publish_date": "2016-03-24T23:09:52-04:00"}