{"result_id": "331008", "URL": "https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/", "timestamp": "2023-04-25 17:51:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Anti-Vaccinators and their Brave Fight Since the Smallpox Vaccine", "cleaned_text": "With the development of the very first vaccination of smallpox, brave anti-vaccinators fought against the dangerous, ill-advised practice of vaccinations. Those fighting against vaccines included the most intelligent and respected physicians of their time. [1]\n\nThis fight has been steadfast and continuous, as anti-vaccinators fought against an unjust, dangerous medical procedure. Vaccinations have always only profited the vaccine makers, not the people targeted for vaccines. Today’s anti-vaccination movement, while still in the minority, is most likely the largest we have had in history.\n\nThe smallpox vaccine was first developed in 1775, credited to Edward Jenner, who first experimented with an eight year-old boy named James Phipps. Jenner claimed that the procedure of injecting cowpox pus prevented smallpox and he convinced King George that his vaccine would eliminate smallpox. King George awarded Jenner the equivalent of half a million dollars to inoculate the public against smallpox.\n\nAfter widespread vaccinations, the Smallpox Hospital in London reported a steady, disturbing increase in smallpox cases, rising from 5% to 96% by 1885. Mortality rates from smallpox also rose. The smallpox vaccine caused many diseases including syphilis, tuberculosis and leprosy.\n\nA group of anti-vaccinators fought against the new practice of vaccines, witnessing its devastating effects. Leading medical authorities, including M.Depaul, Chief of the Vaccination Service of the French Academy of Medicine, Dr. A Wilder, Professor of Pathology and former editor of New York Medical Times, and Dr. Maclean, all spoke out against the dangers of the smallpox vaccinations.\n\nThese first brave anti-vaccinators knew they were fighting an uphill, impossible battle because money and profits were to be made by this new experimental medical procedure.\n\nLittle has changed in the basic fight against vaccines, except today vaccinations are even more entrenched into our medical health care system and psyche. The medical myth of vaccine safety and effectiveness is one of the strongest and most dangerous accepted medical procedures of our time, with huge government investments being made to expand vaccine programs. [2]\n\nThe polio vaccine continued the vaccine myth. Individuals receiving the polio vaccination continued to develop polio. Statistical manipulation, after the vaccine creation, changed the diagnosis requirements of polio to show a reduction of disease outbreaks. Improvements in treatment also reduced the number of polio cases reported.\n\nVaccine graphs show that polio and several other disease outbreaks were reduced in countries prior to the introduction of vaccines. Improvements in sanitation are, in reality, responsible for disease reduction in several countries. [3, 4]\n\nIn his passionate anti-vaccination petition to the President of the United States, anti-vaccinator Charles M. Higgins requested an end to the practice of compulsory vaccinations for those in the Army and Navy. Higgin’s petition was published in 1920. He quoted, “Every law not based on wisdom is a menace to the state.”\n\nHiggins argued wisely that compulsory vaccinations were unconstitutional. He shared several quotes from fellow anti-vaccinators of his time:\n\n“This amazing act is the homicidal insanity of a whole profession. This is blood assassination.” – Dr. James J. Garth Wilkinson, 1876\n\n“It is unwise for the physician to force the operation upon those who are unwilling, or to give assurances of absolute harmlessness.” – Dr. Osler\n\n“Vaccination is not always a harmless procedure; it must be looked upon as the production of an acute infectious disease.” – Dr. Milton J. Rosenau, 1914\n\n“Against the body of a healthy man Parliament has no right of assault whatever, under pretence of the public health.” – Professor F. W. Newman of Oxford\n\nIn painstaking and extensive detail, Higgins describes multiple cases of soldiers, as well as children, who were perfectly healthy prior to vaccinations, but then suffered severe negative health consequences, including death, following vaccination.\n\nHiggins argued that compulsory vaccinations were not mandated for soldiers serving in England. He discussed how deaths from vaccinations were greater than those from smallpox disease. Higgins argued against the unfair punitive consequence of imprisonment for soldiers who refused vaccinations. He reported that current epidemics of disease were largely caused by vaccinations. [5]\n\nThe internet has raised awareness of vaccine dangers and has provided easier access to vaccination facts. This access to important health information is essential, given that most vaccination news presented by mainstream media is one-sided and pro-vaccination in nature.\n\nPharmaceutical companies are major sponsors of advertising, so they exert strong control over news reported.\n\nWith the growing numbers of vaccine-damaged people, resulting from an increase in vaccinations, it is probable that the anti-vaccine movement is larger than ever before, although still a minority view.\n\nPhysicians are noticing the change in parental views on vaccines. In 2013, 87% of pediatricians reported parents refusing to vaccinate their children in their belief that vaccines were unnecessary, in a report made by a survey of pediatricians, conducted by the American Academy of Pediatricians. This percentage was an increase from a previous survey completed in 2006. [6]\n\nIn the growing integrative medicine movement, many truth-seeking physicians and scientists have spoken out against vaccines. These include Andrew Wakefield, MD; Boyd Haley, PhD; Frank Engley, MD; Mayer Eisenstein, MD; Richard Haverson, MD; Bob Sears, MD; Julie Buckley, MD; Chris Shaw, PhD; David Berger, MD; Toni Bark, MD; Ken Stoller, MD; Michael Schachter, MD; Mitchell Fleisher, MD; and Kelly Brogan, MD. [7]\n\nMany individuals have been anti-vaccine, including some revered and famous independent thinkers. The following inspirational quotes can rally those in our movement.\n\n“Vaccination is a barbarous practice and one of the most fatal of all the delusions current in our time. Conscientious objectors to vaccination should stand alone, if need be, against the whole world, in defense of their conviction.” – Mahatma Gandhi\n\n“I am no longer ‘trying to dig up evidence to prove’ vaccines cause autism. There is already abundant evidence … This debate is not scientific but is political.” – David Ayoub, MD\n\n“Nothing but the natural ignorance of the public, countenanced by the inoculated erroneousness of the ordinary general medical practitioners, makes such a barbarism as vaccination possible … Recent developments have shown that an inoculation made in the usual general practitioner’s light-hearted way, without previous highly skilled examination of the state of the patient’s blood, is just as likely to be a simple manslaughter as a cure or preventive. But vaccination is nothing short of attempted murder. A skilled bacteriologist would just as soon think of cutting his child’s arm and rubbing the contents of the dustpan into the wound, as vaccinating it in the same.” – George Bernard Shaw\n\n“The fact is that sooner or later, Andrew Wakefield will be exonerated, his theory will be accepted, and a vaccine-autism connection will be proven.” – FE Yazbak, MD, FAAP\n\nHow You Can Join the Anti-Vaccine Cause\n\nIt is important to continue to read and share stories on alternative health news sites which tell the truth about vaccinations. If you have been damaged by vaccines, it is important to share your own personal story about vaccine damage to those willing to listen with an open mind.\n\nEducation is power, so continue to learn the truths about vaccine dangers. Educate congressional representatives if you have contacts with those in elected positions. We must all together continue fighting this insidious injustice which is quickly becoming a national health disaster.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/", "site_name": "VacTruth.com", "title": "Anti-Vaccinators and their Brave Fight Since the Smallpox Vaccine | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/11/changing-minds.jpg", "description": "With the development of the very first vaccination of smallpox, brave anti-vaccinators fought against the dangerous, ill-advised practice of vaccinations. Those fighting against vaccines included the most intelligent and respected physicians of their time. [1] This fight has been steadfast and continuous, as anti-vaccinators fought against an unjust, dangerous medical procedure. Vaccinations have always only …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "truth about vaccines", "article:section": "Logical", "article:published_time": "2016-11-20T16:35:29-05:00", "article:modified_time": "2016-11-20T16:41:57-05:00", "updated_time": "2016-11-20T16:41:57-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/11/changing-minds.jpg", "image:width": "492", "image:height": "212"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/michelle-goldstein/", "https://vactruth.com/category/top-stories/recent-articles-1/", "https://vactruth.com/category/top-stories/top-picks/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/", "https://twitter.com/share?text=Anti-Vaccinators and their Brave Fight Since the Smallpox Vaccine:&url=https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/&media=https://vactruth.com/wp-content/uploads/2016/11/changing-minds.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/11/20/anti-vaccinators-smallpox-vaccine/", "http://holistichealthtogo.com/vaccinations/the-great-medical-myth-of-vaccine-safety-and-effectiveness/", "https://vactruth.com/2016/09/10/dangerous-adult-vaccinations/", "http://whale.to/a/graphs.html", "http://whale.to/vaccines/decline1.html", "https://vactruth.com/download/vaccination_exposed.pdf", "http://www.medpagetoday.com/Pediatrics/Vaccines/59915", "http://www.ageofautism.com/2014/12/dr-stephanie-seneff-senior-mit-research-scientiston-vaccine-safety.html"], "authors": [], "publish_date": "2016-11-20T16:35:29-05:00"}