{"result_id": "331003", "URL": "https://vactruth.com/2018/08/30/vaccine-induced-autism/", "timestamp": "2023-04-25 17:51:56 CEST+0200", "meta": {"description": "\"Within a week of his vaccinations, he started screaming in pain for no reason, hitting his head and hitting me...He was no longer the child I knew.\"", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2018/08/30/vaccine-induced-autism/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Vaccine Induced Autism and the Fallout:Now What?", "cleaned_text": "At thirteen months old, my son David was a “genius” according to one pediatrician. David was able to recognize numbers and letters; he said, “Ma”, “Da”, “Hi”, “Bye”, “Brover” and “Love you”. He was well ahead of his developmental milestones for speech. He had great eye contact and loved to throw a ball back-and-forth.\n\nAt thirteen months old, I took him in for a well-child visit where he received twelve-month vaccines. Within 24 hours of his well-visit, his speech was gone, he stopped making eye contact, he was no longer interested in playing ball, counting or playing the alphabet game with me. He was no longer the child I knew. Within a week of his vaccinations, he started screaming in pain for no reason, hitting his head and hitting me. He suddenly had explosive green diarrhea and was projectile vomiting.\n\nFast forward three years later, David had become more violent and self-injurious. I was told to institutionalize him and put him on psychoactive drugs. During this time, I went through his medical file and realized that all of his chronic and debilitating symptoms began immediately following his vaccinations.\n\nHis pediatrician agreed that vaccines triggered these symptoms but was only concerned with me suing him. The pediatrician who belittled me and made me cry when I asked if my son’s symptoms could be related to vaccines stood before me, owning his part in my child’s deteriorating health concerned only with himself, reminding me that I could not sue him or the vaccine manufacturer.\n\nNow what? I asked myself as I carried my child, kicking and screaming to the car. Now what do I do? How do I work when my child is ill? What will happen to him as an adult? How am I going to pay his medical and therapy bills when the people responsible for his illness are exempt from liability?\n\nIt took years of research and over a hundred thousand dollars of my own money to sort it out, but I did. David is no longer violent or self-injurious, he reads and spells better than the average adult, he is kind, compassionate and can once again throw a ball with astounding accuracy.\n\nI restored my son’s health the best I could, and I became a fighter: I fought for his education, I fought for his health care, fought for services and for his rights. I became a fighter because what I learned is that once your child is vaccine injured, you are on your own.\n\nNo doctor, insurance company or service provider is interested in hearing about your child’s injury. There is no roadmap to heal your child, address special education, insurance law, therapy options, disability services, legal matters and life with autism until now.\n\nAfter years of research and having counseled hundreds of parents, I was able to pinpoint the most common and immediate needs of parents of children with autism. I wrote the book I needed when our world fell apart. I wrote a handbook on autism to help other parents who are looking for resources, guidance and the thing they need most which is hope.\n\nThere is hope for your child. There is hope for your family. There is hope of reversing the damage caused by vaccines, acetaminophen and myriad environmental factors. There is hope and I wrote this book to help restore peace-of-mind and quality of life for those struggling to find answers.\n\nMy book outlines just about everything you need to know in order to access services and to help your child have the quality of life you deserve. From one autism parent to another-there is hope and it starts here.", "opengraph": {"type": "article", "url": "https://vactruth.com/2018/08/30/vaccine-induced-autism/", "site_name": "VacTruth.com", "title": "Vaccine Induced Autism and the Fallout:Now What? | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2018/08/sarah-and-david-carrasco.jpg", "description": "\"Within a week of his vaccinations, he started screaming in pain for no reason, hitting his head and hitting me...He was no longer the child I knew.\"", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "vaccine-induced autism", "article:section": "Injuries & Deaths", "article:published_time": "2018-08-30T09:35:23-04:00", "article:modified_time": "2018-08-30T09:36:31-04:00", "updated_time": "2018-08-30T09:36:31-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2018/08/sarah-and-david-carrasco.jpg", "image:width": "1364", "image:height": "829"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-injury/", "https://vactruth.com/author/sarah-carrasco/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2018/08/30/vaccine-induced-autism/", "https://twitter.com/share?text=Vaccine Induced Autism and the Fallout:Now What?:&url=https://vactruth.com/2018/08/30/vaccine-induced-autism/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2018/08/30/vaccine-induced-autism/&media=https://vactruth.com/wp-content/uploads/2018/08/sarah-and-david-carrasco-1024x622.jpg", "https://plus.google.com/share?url=https://vactruth.com/2018/08/30/vaccine-induced-autism/", "https://www.amazon.com/Autism-Help-Book-Sarah-Carrasco/dp/0692141170/ref=sr_1_2?ie=UTF8&qid=1531849289&sr=8-2&keywords=Sarah+Carrasco", "https://www.amazon.com/Autism-Help-Book-Sarah-Carrasco/dp/0692141170/ref=sr_1_2?ie=UTF8&qid=1531849289&sr=8-2&keywords=Sarah+Carrasco"], "authors": [], "publish_date": "2018-08-30T09:35:23-04:00"}