{"result_id": "331001", "URL": "https://vactruth.com/2013/10/28/7-disgusting-ingredients/", "timestamp": "2023-04-25 17:51:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2013/10/28/7-disgusting-ingredients/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "7 Most Disgusting Ingredients Used to Make Vaccines", "cleaned_text": "Parents have the right to understand what is being put into their child’s body. The production of vaccines uses many disgusting ingredients. Additionally, the components used during the manufacturing process may violate your personal, religious, or ethical beliefs.\n\nLastly, remember that whatever colorful language is used by the scientific community (using such words as purified), using such substances can come with an enormous cost.\n\nAs you read this list, understand cell lines and vaccines do become contaminated. This is often hidden under the term “adventitious agents.”\n\nAborted fetal cells, listed on vaccine package inserts as “Human Fetal Diploid Cells.” Two aborted fetal cell lines, WI-38 and MRC-5, have been grown under laboratory conditions since the 1960s.\n\nThe cells are used to grow viruses used which are then collected from the cell cultures and processed further to produce the vaccine itself.\n\nOne of the more grotesque methods involved in vaccine manufacturing is the collection of fetal bovine serum. The purpose for serum is providing a nutrient broth for viruses to grow in cells.\n\nHow is the blood collected?\n\nAccording to the Humane Research Australia website:\n\n“After slaughter and bleeding of the cow at an abattoir, the mother’s uterus containing the calf fetus is removed during the evisceration process (removal of the mother’s internal organs) and transferred to the blood collection room. A needle is then inserted between the fetus’s ribs directly into its heart and the blood is vacuumed into a sterile collection bag. This process is aimed at minimizing the risk of contamination of the serum with micro-organisms from the fetus and its environment. Only fetuses over the age of three months are used otherwise the heart is considered too small to puncture.\n\nOnce collected, the blood is allowed to clot at room temperature and the serum separated through a process known as refrigerated centrifugation.” [1]\n\nThe FDA approved the Flublok vaccine on January 16, 2013.\n\nThis new technology is being touted as the wave of the future. It utilizes an insect cell line (expresSF+®) that is derived from cells of the fall armyworm, Spodoptera frugiperda.\n\nThe vaccine package insert for Flublok also mentions:\n\n“Each 0.5 mL dose of Flublok may also contain residual amounts of baculovirus and host cell proteins (≤ 28.5 mcg), baculovirus and cellular DNA (≤ 10 ng) …” [2]\n\nAs mentioned above, monkey kidney tissue is used to support the growth of certain viruses used in vaccine production. There remains a huge controversy over using these cells and their role contaminating the polio vaccine in the 1950s.\n\nThe story is best told in the Congressional papers of a courageous scientist, Bernice Eddy. The Executive Reorganization and Government Research of the Committee on Government Operations United States Senate, Ninety-Second Congress, Second Session [1972] states on page 500:\n\n“The next and only serious vaccine crisis that has occurred since the polio episode was the realization in mid-1961 that a monkey virus later shown to cause tumors in hamsters was contaminating both polio and adenovirus vaccines. The virus, known as SV40, was entering the vaccines and, just as in the polio case were surviving the formalin treatment.\n\nThere were several states by which the full extent of the SV40 problem became known. First was the discovery in 1959-1960 by a DBS scientist, once again Bernice Eddy, that an unknown agent in the monkey kidney cells used to produce polio and adenovirus vaccines would cause tumors when the cells were injected into hamsters.”\n\n“In 1954 Eddy, as a polio control officer, found live virus in supposedly killed polio vaccine; in 1955 she was relieved of her duties as polio control officer … After her discoveries concerning the SV40 virus, her staff and animal space were reduced and she was demoted from head of a section to head of a unit.”\n\n“ … even when the contaminating virus was found to be oncogenic [cancer causing] in hamsters, the DBS [Division of Biologics Standards] and its expert advisory committee decided to leave existing stocks on the market rather than risk eroding public confidence by a recall.”\n\n“There has been a tendency on the part of certain higher government circles to play down any open discussion of problems associated with vaccines … ” [3]\n\nOn November 20, 2012, the FDA approved the seasonal influenza vaccine, Flucelvax, manufactured by Novartis. [4]\n\nThis vaccine is mass-produced using the continuous cell line Madin Darby Canine Kidney (MDCK) as vaccine cell substrate. [5]\n\nViral vaccines prepared in tissue culture or mouse brain have been used in many Asian countries. According to the CDC website, the inactivated mouse brain-derived JE vaccine used in the United States since 1992 is no longer available. [6]\n\nOf course, with any vaccine, the adverse reactions are rarely tracked and downplayed by medical authorities. However, the injuries from vaccines can be quite serious. [7, 8]\n\nChickens and their embryos have long been used in the production of vaccines.\n\nThese methods were popularized in the 1920s and 1930s by Thomas Rivers and others at the Rockefeller Institute for Medical Research. [9]\n\n3. Executive Reorganization and Government Research of the Committee on Government Operations United States Senate, Ninety-Second Congress, Second Session. Page 499-505. April 20,21; and May 3,4, 1972.", "opengraph": {"type": "article", "url": "https://vactruth.com/2013/10/28/7-disgusting-ingredients/", "site_name": "VacTruth.com", "title": "7 Most Disgusting Ingredients Used to Make Vaccines | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2013/10/7disgustingingredients-11.jpg", "description": "The components used during the manufacturing process may violate your personal, religious, or ethical beliefs.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "vaccinetruth", "article:tag": "vaccine production", "article:section": "Jeffry John Aufderheide", "article:published_time": "2013-10-28T04:36:08-04:00", "article:modified_time": "2013-10-28T06:03:49-04:00", "updated_time": "2013-10-28T06:03:49-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2013/10/7disgustingingredients-11.jpg", "image:width": "604", "image:height": "304"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/writers/jeffry-john-aufderheide/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/jeffry_john/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2013/10/28/7-disgusting-ingredients/", "https://twitter.com/share?text=7 Most Disgusting Ingredients Used to Make Vaccines:&url=https://vactruth.com/2013/10/28/7-disgusting-ingredients/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2013/10/28/7-disgusting-ingredients/&media=https://vactruth.com/wp-content/uploads/2013/10/7disgustingingredients-11.jpg", "https://plus.google.com/share?url=https://vactruth.com/2013/10/28/7-disgusting-ingredients/", "http://www.humaneresearch.org.au/campaigns/fetal_calf_serum", "http://www.fda.gov/downloads/BiologicsBloodVaccines/Vaccines/ApprovedProducts/UCM336020.pdf", "http://www.fda.gov/NewsEvents/Newsroom/PressAnnouncements/ucm328982.htm", "http://www.novartisvaccines.com/downloads/flucelvax/Flucelvax_Fact_Sheet.pdf", "http://www.cdc.gov/japaneseencephalitis/vaccine/vaccineChildren.html", "http://jnnp.bmj.com/content/59/3/316.full.pdf", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2480758/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2131891/pdf/465.pdf"], "authors": [], "publish_date": "2013-10-28T04:36:08-04:00"}