{"result_id": "331016", "URL": "https://vactruth.com/2016/09/13/life-with-vaccine-injury/", "timestamp": "2023-04-25 17:52:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/09/13/life-with-vaccine-injury/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Life with Vaccine Injury: A Mother’s Perspective", "cleaned_text": "What is it like to have a vaccine-injured child? Well, some days, it’s like hell on a bad day. Some days, your child smears feces on the wall, into the carpet and throws it down the vents. Some days, your child is left on a school bus for three hours in the cold. Some days, your child has diarrhea ten times that runs down their legs and covers their back. It’s a lot like hell on a bad day.\n\nMy son David was diagnosed with autism in 2005 at the age of four. It wasn’t until I was told to “consider out-of-home-placement” that I pulled myself together and started thinking critically about his health.\n\nDavid was not born with autism. Logically, I knew there was a cause, but in the midst of caring for a severely disabled child, it was hard to stop long enough to think. I knew something triggered his autism and it wasn’t until I was faced with the prospect of putting my son in a home that I was able to determine that cause.\n\nWhen I was told by two well-meaning professionals to consider out-of-home placement for David, he was at his worst. He was violent, self-injurious, nonverbal and would scream bloody murder day and night for no apparent reason.\n\nBecause I could not send my son away, I was told the only other option was to try behavior meds. I had reservations about medicating a four year-old, so I scheduled a pharmacology clinic where I would meet with a child psychologist, child psychiatrist, David’s pediatrician and four other child development specialists. As required for the pharmacology clinic, I put David’s medical file in chronological order, including the dates he was vaccinated.\n\nAs I put the file in order, it became abundantly clear vaccines had triggered his autism, chronic diarrhea and changes in behavior. Although I was awestruck at the time, what was to come in the years ahead would prove to be much more difficult than the initial realization that my son’s disability was caused by vaccines.\n\nIn the days following this stunning realization, I was plagued by one thought. The country I love with everything inside of me was the catalyst in my son’s injury. My son, a son of the American Revolution, had been denied his civil liberties by the one thing I thought would protect him: vaccines.\n\nThe knowledge that my beautiful child was suffering unnecessarily was a second mourning. It could have been prevented. He could have had a better life.\n\nThen came the grief. The consuming, painful grief I felt for the loss of his childhood. My boy, my perfect baby, had slipped into a world of his own. I grieved the loss of him. At thirteen months, his pediatrician called him a “genius” because he knew his alphabet, could recognize numbers up to five and had a solid vocabulary for his age. All of that disappeared within forty eight hours after his vaccines.\n\nIf I hadn’t put his medical file in order, I would have never known the antecedent. The cause of my son’s regression into autism was vaccines which brought on the next wave of emotions; guilt.\n\nWhat had I done? I had taken my son to be vaccinated. He was healthy, he was thriving and he was helpless. It was my responsibility to protect him and I failed. I failed to read a vaccine package insert. If I had, I’d have known that the formulation of the DTaP vaccine they gave my son listed autism as an adverse reaction.\n\nIf I had taken five minutes to read an insert I’d have known that there were great risks involved but I didn’t. I didn’t read one word about vaccines before I took him in, held him down and allowed a stranger to permanently harm him.\n\nThe guilt that comes with vaccine injury is profound. Why didn’t I do my homework? When did I become so trusting of the government? Why didn’t I take the time to read up on something that was to be injected into my son? I was crippled by grief; after all, it was me who was supposed to protect him from the bad in this world and I failed to do so. [1]\n\nThen came the anger. I was so angry. I took David’s medical file to his pediatrician and let him have it. Then I sat down with the other pediatrician in the office and the nurse who had said to me during an office visit, “What the hell is wrong with this kid? What did you do to him?”\n\nI tore into both of them, leaving them both in tears. I thought it would make me feel better but it didn’t. Then I got angry at God. How could He let this happen to my boy? Where was He?\n\nNext came reality, the reality that my son may never get married, may never go to college, may never bathe himself. The reality of his future was incapacitating. Facing the reality that my once beautiful family was now a statistic was a tough blow.\n\nAbout eighty percent of couples who have a child with autism end up in divorce. My marriage, to the love of my life, was now nothing more than a statistic, a number on a chart somewhere.\n\nThen came the sadness. I felt so sad for David and his little brother Aidan. He’d missed out on fun, kisses from mom and dad, time spent reading and playing together because my life was no longer my own. My life now belonged to caring for his vaccine-injured brother and he always came second to David’s immediate needs.\n\nI was sad because I missed my friends, I missed being able to work, I missed my family. I was missing out on life and there was no other way to feel, it was a very sad time for us.\n\nAfter the emotions subsided and time was starting to heal the wounds, I was left with the brutal and ugly truth. Vaccines didn’t just trigger my son’s autism; they were triggering autism in the children around me.\n\nAs the years go by, there are fewer children on the playground, fewer children at the amusement park, fewer children running around playing outside. Where are all the children? They are inside where their mom can keep them safe. They are in therapy thirty hours per week. They are in residential treatment facilities. They have autism.\n\nThey say the truth is stranger than fiction, and in this case, that is accurate. We are taking our children to be vaccinated under the guise we are helping to prevent disease, but in truth, we are taking our healthy children to the pediatrician’s office and leaving with chronically ill, disabled children.\n\nThe truth has been the hardest part of this journey. The truth is that our government has known that vaccines increase the risk for autism, ADHD, tics and developmental delays since 2000.\n\nWhat the CDC Doesn’t Want Parents to Know\n\nIn 2000, members of the CDC, the American Academy of Pediatrics (AAP) and the World Health Organization (WHO) had a meeting about recent data collected on children who were exposed to thimerosal in vaccines. The data showed there was an increased risk for autism and other disabilities.\n\nInstead of reporting the data to the public, they altered it, for three years, until it produced the results they wanted. My son was born in 2001; if they had the guts to speak up, my boy and millions of American children would be healthy, but that is not the case. [2]\n\nOne in six American children now has a developmental disability. What do those kids have in common? Not much, other than their vaccination status and exposure to genetically modified foods (GMOs). [3]\n\nThe increase in autism coincides with the increase in vaccines. In 1986, the federal government passed a law exempting vaccine manufacturers from liability. Since then, the CDC schedule has increased from 20 vaccines by age eighteen to 72 vaccines by age 18. [4]\n\nThey cannot be held responsible if you or your child is injured or killed by a vaccine. Instead, there is taxpayer-funded pool of money that you can apply for if you are injured. The maximum amount of compensation is $250,000 and the process takes years to settle.\n\nThe large majority of cases are dismissed and victims receive no compensation. Taxpayers pick up the tab for people who are disabled by vaccines. It’s a win-win for vaccine manufacturers, AKA pharmaceutical companies. They make money off of the vaccine, they make money when you’re injured and need pharmaceutical drugs and they have zero financial liability if you’re injured. It’s business.\n\nDo members of the CDC, AAP and WHO know vaccines cause autism? Of course they do. Why are they allowing this to happen? Who knows?\n\nNico LaHood, the District Attorney for San Antonio, Texas, recently came out publicly and said vaccines triggered his son’s autism. He said,\n\n“The malicious person and the weak person give you the same result …The malicious person is trying to hurt you. The weak person is so weak they will let the malicious person harm you and won’t warn you about it. The result is the same.”\n\nHe is right. It doesn’t matter if members of the CDC, AAP and WHO are malicious or weak; we are getting the same result. Our children’s health is being destroyed by the one thing meant to protect them, vaccines. [5]\n\nSo … what is life with a vaccine-injured child like? It’s both heaven and hell.\n\nMy son, through the grace of God, after ten years of being gluten- and casein-free, with chelation and supplements, is now doing great. He is no longer violent, he’s speaking now, he’s kind and the most gentle, loving person I have ever met. He is an angel.\n\nThe upside to knowing your child is vaccine-injured is that if we know what caused it, we can cure it. Detox is key to recovery from autism. The blessing of knowing your child is vaccine-injured is that it gives you a road map to recovery.\n\nIf you remove the heavy metals from their body they were exposed to from vaccines, the child will improve. If you repair the gut from the damage caused by vaccines (and GMOs), the child’s health will improve as neurological and immune system function is dependent upon gut health.\n\nOn the other hand, the road to where we are now felt a lot like hell. I’m tired; I am 38 and feel like I’m a hundred years old. His recovery has taken every extra penny we have and there are no vacations and spa days in my world, just repairing the damage vaccines did all those years ago.\n\nThe grief, guilt, anger and sadness never really leave your soul. Although David is getting better and I feel more positive than ever, the painful emotions come back from time to time when he says things like, “They took fifteen years from me, Mother. They did this to me.”\n\nThey say time heals all wounds and while our wounds are almost healed, we are still left with the truth and that is, my son was not born with autism. He suffered and lost his childhood to multi-billion dollar corporations.\n\nLiving with vaccine injury is living with regret. A wise person learns from others’ mistakes; I hope that by me sharing our journey, it will help other parents to think critically about vaccines. The guilt is probably the worst part of it all; although it is not mine to bear, I still hold onto it.\n\nI hope that parents do not make the same mistake I did and that they read vaccine package inserts and do a bit of research before vaccinating their child. Although David is doing well and is the most loving, angelic, perfect person on Earth, this did not have to be his story. He was not born with autism; he was injected with it.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/09/13/life-with-vaccine-injury/", "site_name": "VacTruth.com", "title": "Life with Vaccine Injury: A Mother’s Perspective | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/09/life-with-vaccine-injury-1.jpg", "description": "What is it like to have a vaccine-injured child? Well, some days, it’s like hell on a bad day. Some days, your child smears feces on the wall, into the carpet and throws it down the vents. Some days, your child is left on a school bus for three hours in the cold. Some days, …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "World Health Organization (WHO)", "article:section": "Social", "article:published_time": "2016-09-13T12:19:30-04:00", "article:modified_time": "2017-11-26T06:30:51-05:00", "updated_time": "2017-11-26T06:30:51-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/09/life-with-vaccine-injury-1.jpg", "image:width": "640", "image:height": "360"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/social/", "https://vactruth.com/author/sarah-carrasco/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/09/13/life-with-vaccine-injury/", "https://twitter.com/share?text=Life with Vaccine Injury: A Mother’s Perspective:&url=https://vactruth.com/2016/09/13/life-with-vaccine-injury/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/09/13/life-with-vaccine-injury/&media=https://vactruth.com/wp-content/uploads/2016/09/life-with-vaccine-injury-1.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/09/13/life-with-vaccine-injury/", "http://www.fda.gov/downloads/BiologicsBloodVaccines/Vaccines/ApprovedProducts/UCM101580.pdf", "http://autismrawdata.net/blog/simpsonwood", "https://www.disabilityscoop.com/2011/05/23/cdc-1-in-6/13146/", "http://www.nvic.org/nvic-archives/newsletter/autismandvaccines.aspx", "https://www.youtube.com/watch?v=Pi9PNKW7w3Q", "https://www.flickr.com/photos/merille/3479029602/in/photolist-6iqWi1-ohM9JC-d4YRxL-o5EeNx-mMBAnH-8EJcJu-eUXv-cT1x2y-4xKoue-boxoZJ-rfPzSA-dvpBWk-92pHHp-scFdK9-cdqexm-4En7HK-8wNweX-pE4Tw-bBszDV-4R1rqn-rg2aun-8ULoDV-a9dWYP-5xpzQQ-awZXY4-g2MRN-PY3gM-2uQDvG-3Yjb1h-fiC4Uv-e7Fsc7-5uAFSW-9jvCrr-nB73qc-6JQvsT-bBddjN-9AXUEh-49gdpY-crwky1-fZSmav-BbcsJ-2uQDw3-4BqUof-5Ju5co-nY9tf9-oekE3q-dRNUp7-iNUE83-byv5eL-9ZhBhg"], "authors": [], "publish_date": "2016-09-13T12:19:30-04:00"}