{"result_id": "331044", "URL": "https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/", "timestamp": "2023-04-25 17:52:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "How Congress Allowed Vaccine Manufacturers to Dismantle the Constitution (in One Thousand Words or Less)", "cleaned_text": "Oh, Congress, you’ve made such a mess of things. When you were elected as a Representative, you must have been confused. To clarify, you represent the people of the United States, not corporations.\n\nThere is a little document called The Constitution of the United States of America. In that document, (which it appears many of you have not read) is what’s called The Bill of Rights. The Bill of Rights outlines the rights of American citizens. To betray those rights is treason. Go ahead and read it, you can find it online.\n\nYou, our Representatives, are sworn to protect The Constitution. The following are examples of our constitutional rights being violated by, well, you. You are free to correct these violations at any time.\n\nArticle I of The Bill of Rights states:\n\n“Congress shall make no law respecting an establishment of religion, or prohibiting the free exercise thereof; or abridging the freedom of speech, or of the press; or the right of the people peaceably to assemble, and to petition the government for a redress of grievances.”\n\nGee, Congress, it appears that vaccine injury violates all of our rights in Article I. Here’s how: Many live virus vaccines contain aborted fetal cells or pig DNA; Christians, Muslims and Jews may want to know this before vaccinating. [1, 2] Mandating live virus vaccines violates our right to freely exercise our religion. Oops!\n\nSecondly, Congress, you weren’t supposed to make laws to abridge free speech and free press. I assume it was y’all who allowed corporate funding of news media. Dang. That explains why we never hear about vaccine injury on the news, which is primarily funded by pharmaceutical ads. Notice the constant drug ads and awkward Viagra commercials? Yeah. That was probably illegal.\n\nThen we have those pesky rights about assembling and petitioning the government for a redress of grievances. Well, my son, who has vaccine-induced autism according to his pediatrician, can’t leave the house without me and can’t write more than a few paragraphs, so he won’t be assembling or petitioning the government.\n\nWhile we’re on the subject, I suppose the 83 federally recognized children who have vaccine-induced autism won’t be assembling or petitioning you either. Wow! [3]\n\nAnd … in case you didn’t know, a Senior Scientist from the CDC, William Thompson, said, in that study, he:\n\n“omitted statistically significant information in our 2004 article published in the journal Pediatrics. The omitted data suggested that African American males who received the MMR vaccine before age 36 months were at increased risk for autism. Decisions were made regarding which findings to report after the data were collected, and I believe that the final study protocol was not followed.”\n\nSo … it looks like vaccines are triggering autism and therefore denying millions of Americans their rights. [4]\n\nI know this is all new to you, Congress, so I’ll be brief. It’s a lot to take in. Article V states that no person will be deprived “life, liberty, or the pursuit of happiness without due process of law.” Oh, no! You guys passed a law in 1986 shielding vaccine manufacturers from liability. [5]\n\nThat means that all of the children who died or were permanently disabled due to unsafe vaccines were denied life, liberty and the pursuit of happiness. I’m not a legal scholar but I don’t think you were supposed to do that.\n\nAdditionally, there is Article VII (still talking about the Bill of Rights), which states:\n\n“In suits at common law, where the value in controversy shall exceed twenty dollars, the right of trial by jury shall be preserved, and no fact tried by a jury, shall be otherwise reexamined in any court of the United States, than according to the rules of the common law.”\n\nOh, umm … in case you weren’t aware, Congress, the 1986 ruling which protects vaccine manufacturers from financial liability is unconstitutional.\n\nYou see, my dear Representatives, your only job is to uphold The Constitution of The United States of America. It is just a piece of paper and if you don’t adhere to it, America falls apart and corporations take over. It’s all very Machiavellian.\n\nFeel free to repeal these unconstitutional laws at any time because, if you don’t, that’s called treason (hint: treason is defined in the thing I told you about called The Constitution). Your job, one more time, is to uphold The Constitution of the United States of America.\n\nYou can choose to represent us or corporations, but based on passed precedent, a bet against the American people is never a safe bet. Best of luck in all your endeavors. If you need a copy of The Constitution, let me know; I’ll get you one in a jiff!", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/", "site_name": "VacTruth.com", "title": "How Congress Allowed Vaccine Manufacturers to Dismantle the Constitution (in One Thousand Words or Less) | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/07/congress-vaccine-makers.jpg", "description": "Oh, Congress, you’ve made such a mess of things. When you were elected as a Representative, you must have been confused. To clarify, you represent the people of the United States, not corporations. There is a little document called The Constitution of the United States of America. In that document, (which it appears many of …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "William Thompson", "article:section": "Logical", "article:published_time": "2016-07-19T11:39:52-04:00", "article:modified_time": "2016-09-05T18:16:17-04:00", "updated_time": "2016-09-05T18:16:17-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/07/congress-vaccine-makers.jpg", "image:width": "640", "image:height": "457"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/top-stories/recent-articles-1/", "https://vactruth.com/category/writers/sarah-carrasco/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/sarah-carrasco/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/", "https://twitter.com/share?text=How Congress Allowed Vaccine Manufacturers to Dismantle the Constitution (in One Thousand Words or Less):&url=https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/&media=https://vactruth.com/wp-content/uploads/2016/07/congress-vaccine-makers.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/07/19/vaccine-makers-dismantled-constitution/", "http://www.livingwhole.org/what-you-didnt-know-about-the-aborted-baby-parts-in-your-vaccines/", "http://www.nvic.org/NVIC-Vaccine-News/April-2010/Vaccine-Contamination-Pig-Virus-DNA-Found-in-Rota.aspx", "http://www.prnewswire.com/news-releases/83-cases-of-autism-associated-with-childhood-vaccine-injury-compensated-in-federal-vaccine-court-121570673.html", "http://morganverkamp.com/statement-of-william-w-thompson-ph-d-regarding-the-2004-article-examining-the-possibility-of-a-relationship-between-mmr-vaccine-and-autism/", "https://www.billofrightsinstitute.org/founding-documents/bill-of-rights/", "https://www.flickr.com/photos/donkeyhotey/11001289643/in/photolist-hL9u8D-gog3yw-HYiKKd-cXND2h-k1H7g-MxynM-p3Ri2n-rhVvLu-c4o7Zd-GEb2th-mRbrgH-gaNZps-7USAyP-5H2vAQ-iokTsB-5MhCH8-rMrUHE-bxftr3-fwfSPG-gJuxQk-5nRRWN-iojkS5-HdEofM-8vYMiX-fQGbAr-iokWiM-5dvQ86-5jYFvg-a4eyS8-7ff35M-ngGeif-qQQeto-bpHjJr-5ZACNC-5UvDHE-fgd27h-8yHg8w-rvP1rN-9zueFh-5UvEv1-dSVfXC-HbjwhS-GUsL4s-HbjtvQ-uysK3M-pW87Po-rZLG2-fCzrUz-cgECSG-oerM13"], "authors": [], "publish_date": "2016-07-19T11:39:52-04:00"}