{"result_id": "331004", "URL": "https://vactruth.com/2015/08/03/271-vaccines-in-development/", "timestamp": "2023-04-25 17:51:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2015/08/03/271-vaccines-in-development/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Profit over Safety – Centers for Disease Control Names 271 New Vaccinations", "cleaned_text": "In a recent article published by Robert F. Kennedy, Jr., titled Children at Risk – Vaccines, Government & Big Pharma’s Dirty Money, [1] he highlighted the fact that every vaccine introduced to the vaccine schedule guarantees its manufacturer millions of customers, increasing vaccine revenue by billions of dollars. However, it appears that a minimum of 56 doses of 14 vaccinations before the age of eighteen is not quite lucrative enough for the pharmaceutical industry, as according to Mr. Kennedy’s research, the CDC has 271 new vaccinations under development in the hopes that vaccine revenues will reach a staggering $100 billion by 2025.\n\nKennedy called the Centers for Disease Control and Prevention (CDC) “a cesspool of corruption, mismanagement and dysfunction,” making it crystal clear to readers that financial gain fueled their decision making.\n\n“Public health may not be the sole driver of CDC decisions to mandate new vaccines. Four scathing federal studies, including two by Congress, one by the U.S. Senate, and one by the HHS Inspector General, paint CDC as a cesspool of corruption, mismanagement and dysfunction with alarming conflicts of interest suborning its research, regulatory and policymaking functions. CDC rules allow vaccine industry profiteers like Dr. Offit to serve on advisory boards that add new vaccines to the schedule. In a typical example, Offit in 1999 sat on the CDC’s vaccine advisory committee and voted to add the rotavirus vaccine to CDC’s schedule, paving the way for him to make a fortune on his own rotavirus vaccine. Offit and his business partners sold the royalties to his rotavirus vaccine patent to Merck in 2006 for $182 million. Offit told Newsweek, “It was like winning the lottery!””\n\nAs more and more states are choosing to mandate vaccinations, his words are very worrying, and what he says next does nothing to alleviate public concern:\n\n“Normally plaintiffs’ tort lawyers would provide a powerful check and balance to keep vaccines safe and effective and regulators and policymakers honest. But Pharma’s dirty money has bought the industry immunity from lawsuits for vaccine injury no matter how dangerous the product. An obliging Congress disposed of the Seventh Amendment right to jury trial, making it impossible for vaccine-injured plaintiffs to sue pharmaceutical companies for selling unsafe vaccines. That’s right! No class actions. No discovery. No depositions and little financial incentive for the industry to make vaccines safer.”\n\nIn other words, by mandating vaccinations, the government has made it impossible for parents to protect their children from being injected with harmful chemicals.\n\n“Ending exemptions is premature until we have a functioning regulatory agency and a transparent process. The best way to insure full vaccine coverage is for the vaccine program to win back public trust by ending its corrupt financial ties with a profit-making industry.”\n\nNew Vaccines Being Introduced Every Day\n\nTo discover exactly which vaccinations the CDC is planning to introduce, I followed the links provided by Kennedy, which led to a 2013 document, titled Medicines in Development – Vaccines – A Report on the Prevention and Treatment of Disease Through Vaccines. [2]\n\n“Today, biopharmaceutical research companies are developing 271 vaccines for infectious diseases, cancer, neurological disorders, allergies and other diseases.”\n\nFrom page nine, the report listed the 271 vaccinations currently under development.\n\nTheir list was endless, and while the majority of people consider vaccination a good idea, where does belief end and common sense kick in? How many vaccinations can our bodies tolerate?\n\nHow Many Vaccinations Are Too Many?\n\nAlthough the CDC has listed a total of 271 vaccinations currently under development, in reality, this number could be even higher.\n\nIn 2010, News Medical published an article titled 395 new vaccines being developed for infectious diseases: PhRMA. The article stated:\n\n“Scientists are also working to prevent, treat or cure other devastating diseases that mostly strike people in the developing world, such as the Ebola virus, dengue fever, yellow fever, typhoid and cholera.\n\nIncreasing attention is also being paid to “super bugs,” like Methicillin-resistant Staphylococcus aureus (MRSA) that have spread throughout the world. In the U.S., two million drug-resistant infections are reported each year, causing great suffering and costing the health system up to $34 billion a year, according to the Infectious Disease Society.”\n\nTheir words are very worrying; however, the title of the above-mentioned article is slightly misleading, because the actual number of vaccinations being developed is unclear. The authors stated:\n\n“Critical challenges remain in the centuries-old battles against infectious diseases, particularly as bacteria and viruses mutate and as the threat of bioterrorism grows. Responding to this need, America’s biopharmaceutical research companies this year have 395 new medicines and vaccines in the pipeline to fight infectious diseases. All 395 are in later stages of development, meaning in clinical trials or under Food and Drug Administration (FDA) review.” [3]\n\nIn other words, there are 395 new medicines and vaccinations awaiting FDA approval and there is very little that anyone can do to prevent each and every one of them from being introduced.\n\nMany New Vaccinations Being Tested in Developing World\n\nIt is a recognized fact that the developing world has been used by the World Health Organization (WHO) to test vaccines for decades. This has been proven in data and vaccine studies dating back as far as the 1970s. [4]\n\nIt appears that nothing much has changed because meticulous research has proven that many of the vaccinations under development and listed by the CDC in 2013 are currently being tested throughout the developing world.\n\nTrials Currently Taking Place in Thailand and Bangladesh\n\nA number of HIV vaccine trials have been reported to have taken place in Thailand since 2009. Although scientists initially reported a moderate success rate in the early trials, a trial which took place in 2013 failed miserably, when 41 volunteers became infected with the virus. [5]\n\nIn 2009, Bill Gates, who is keeping a close eye on the trials, published the following press release:\n\n“Statement on Results of the Thai AIDS Vaccine Study – Bill & Melinda Gates Foundation\n\nDr. Tachi Yamada, President of the Global Health Program at the Bill & Melinda Gates Foundation, made the following statement today regarding the results of a major HIV vaccine study conducted in Thailand (RV 144).\n\nToday marks a critically important milestone in the fight against AIDS.\n\nFor the first time, we have proof that a vaccine can provide protection against HIV infection in humans.\n\nThese results offer new hope that it’s possible to develop a highly effective vaccine with the power to break the back of the AIDS pandemic.\n\nThe scientific community must move with speed and urgency to build upon these findings. To accelerate the pace of progress, it will be essential to expand research striving for incremental improvements on this initial success. This will be a worldwide effort.\n\nAs research on HIV vaccines moves forward, we must also rapidly expand the use of existing, proven HIV prevention strategies, and continue exploring every other means to contain the pandemic.\n\nWe extend our thanks and heartiest congratulations to everyone who contributed to this historic milestone including the U.S. Army, the Thai Ministry of Public Health, the Royal Thai Army, NIAID, Global Solutions for Infectious Diseases (GSID/VaxGen), Sanofi Pasteur, and especially the many Thai volunteers who enrolled in the trial.” [6]\n\nInterestingly, the Global Solutions for Infectious Diseases, which was mentioned at the end of the press release, also receives funding from the Gates Foundation. [7]\n\nIn July 2015, a group of researchers and scientists, headed by Firdausi Qadri, Ph.D., published a study in The Lancet, titled Feasibility and effectiveness of oral cholera vaccine in an urban endemic setting in Bangladesh: a cluster randomised open-label trial. [8]\n\nAlthough the trial was deemed a success and reported favorably in several mainstream newspapers and scientific editorials, the results told a different story.\n\nThe study examined three groups of participants:\n• Those who received the vaccination and who were taught changes to their behavior, such as hand washing, with access to clean drinking water.\n\nIn the vaccination-only group, there was a 37 percent improvement and in the vaccination plus behavioral changes group there was a 45 percent improvement. As you can see, the results of the study only indicated a low to moderate percentage of improvement and the fact that the authors stated that they recorded no vaccine-related serious adverse reactions leaves this study open to interpretation.\n\nIt would have been interesting to have had a fourth group of participants. For example, those who had been educated in hygiene and had access to clean water but received no vaccination.\n\nAccording to many reports, the above results constituted a resounding success. The Sci Dev Net wrote:\n\n“Firdausi Qadri, director of the vaccines centre at the International Centre for Diarrhoeal Disease and Research, Bangladesh, who led the trial, says that the findings “show that a routine oral cholera vaccination programme in cholera-endemic countries could substantially reduce the burden of disease and greatly contribute to cholera control efforts.”” [9]\n\nAs a consequence of such reports, the vaccine is being used throughout the developing world. Outbreak News Today reported:\n\nA global stockpile, funded by the Bill and Melinda Gates Foundation, the ELMA Vaccines and Immunization Foundation, the EU Humanitarian Aid and Civil Protection department (ECHO), the Margaret A Cargill Foundation and the USAID Office of Foreign Disaster Assistance, initially made 2 million doses of the vaccine available. In 2015, with funding from the GAVI Alliance, the number of doses available for use in both endemic hotspots and emergency situations is expected to rise to around 3 million.\n\nThe oral cholera vaccine is an important tool in fighting cholera. Its use must be both supported by local authorities and used hand-in-hand with focused, sustainable water and sanitation actions in targeted communities.” [10]\n\nOnce again, on closer inspection, the study was found to be funded by the Bill and Melinda Gates Foundation, who appear to have a monopoly on vaccinations used in developing countries.\n\nHow many vaccinations will be considered to be a sensible number? If all of the vaccinations currently under development are deemed a success, how many of them will be added to the schedule? As there is little research to determine which ingredients are in the vaccinations listed as “under development” by the CDC, many parents are concerned about their toxicity and how best to protect their children.\n\nI will leave you with the wise words of Robert F, Kennedy Jr: “Vaccine industry money has neutralized virtually all of the checks and balances that once stood between a rapacious pharmaceutical industry and our children.”", "opengraph": {"type": "article", "url": "https://vactruth.com/2015/08/03/271-vaccines-in-development/", "site_name": "VacTruth.com", "title": "Profit over Safety – Centers for Disease Control Names 271 New Vaccinations | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2015/08/crying-child.jpg", "description": "In a recent article published by Robert F. Kennedy, Jr., titled Children at Risk – Vaccines, Government & Big Pharma’s Dirty Money, [1] he highlighted the fact that every vaccine introduced to the vaccine schedule guarantees its manufacturer millions of customers, increasing vaccine revenue by billions of dollars. However, it appears that a minimum of …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "World Health Organization (WHO)", "article:section": "Christina England", "article:published_time": "2015-08-03T04:00:15-04:00", "article:modified_time": "2015-08-03T04:01:30-04:00", "updated_time": "2015-08-03T04:01:30-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2015/08/crying-child.jpg", "image:width": "640", "image:height": "426"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/writers/c-england/", "https://vactruth.com/category/logical/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/christina-england/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2015/08/03/271-vaccines-in-development/", "https://twitter.com/share?text=Profit over Safety – Centers for Disease Control Names 271 New Vaccinations:&url=https://vactruth.com/2015/08/03/271-vaccines-in-development/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2015/08/03/271-vaccines-in-development/&media=https://vactruth.com/wp-content/uploads/2015/08/crying-child.jpg", "https://plus.google.com/share?url=https://vactruth.com/2015/08/03/271-vaccines-in-development/", "http://www.wnd.com/2015/07/vaccines-government-big-pharmas-dirty-money/", "http://www.copybook.com/pharmaceutical/news/271-new-us-vaccines-in-development", "http://www.news-medical.net/news/20100910/395-new-vaccines-being-developed-for-infectious-diseases-PhRMA.aspx", "http://www.google.co.uk/url?sa=t&rct=j&q=&esrc=s&source=web&cd=3&ved=0CDEQFjAC&url=http%3A%2F%2Fwww.who.int%2Fimmunization%2Fresearch%2Fmeetings_workshops%2FGroupAStrep_VaccineRD_Sept2014.pdf&ei=erzlVLKmJY-O7AaX4ICIDQ&usg=AFQjCNFronBgC08QqS9hiI_IlrggOsySDQ", "http://www.healthline.com/health/hiv-aids/vaccine-how-close-are-we", "http://www.gatesfoundation.org/Media-Center/Press-Releases/2009/09/Statement-on-Results-of-the-Thai-AIDS-Vaccine-Study", "http://www.gsid.org/support_gsid.html", "http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(15)61140-0/abstract", "http://www.scidev.net/south-asia/disease/news/oral-cholera-vaccine-proves-efficacy.html", "http://outbreaknewstoday.com/oral-cholera-vaccines-can-control-outbreaks-who-78779/", "https://www.flickr.com/photos/travelingtribe/3013318395/in/photolist-5Ah3zr-eyTUia-7E8AJ2-6cnC7y-7sPSQq-7nUMXM-bPSFda-tdiCR6-5f1qTu-8813D7-4LVZu-au4WnX-e4yVsw-e4tjv6-86MFP9-NVvaB-8aokZm-62gDAq-oBKV7h-4BC4YP-4BC4zM-61czET-arRQao-im921t-jvFwiA-iqFKtG-5Hdm8Z-4MbVuQ-5yJpjF-rgtHKT-nnpKSx-bBTZen-6nnNLP-dSj5Tr-dSpErW-7Cs9D7-6ocJuV-297aH-NM9YT-5HJntY-4a6brQ-5AFdne-rdPPS4-aBz89o-8R2AJj-5yNGSo-5AmjP9-59wT4N-pDAnQc-ecMhE"], "authors": [], "publish_date": "2015-08-03T04:00:15-04:00"}