{"result_id": "331010", "URL": "https://vactruth.com/2016/07/08/hepatitis-b-vaccine/", "timestamp": "2023-04-25 17:52:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/07/08/hepatitis-b-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "The Insanity of the Hepatitis B Vaccination", "cleaned_text": "The hepatitis B vaccination is one that even pro-vaccinators should question from a common sense perspective. The vaccination is now routinely given at birth for newborns, with follow-up vaccines scheduled during infancy.\n\nThis disease is one that is fairly rare, and more common in adults in high risk groups, including those who are sexually promiscuous, along with drug abusers who share needles.\n\nThe health risks of giving this vaccination to healthy newborns are relatively high and include death and permanent disability. The promised protection from hepatitis B is an empty promise at best. Even the makers of the vaccine do not guarantee that the vaccine provides any lasting immunity from hepatitis B.\n\nThe symptoms of hepatitis B disease include fatigue, nausea, vomiting, low grade fever, pain and swelling in joints, and headache. A cough may precede the illness one to two weeks prior to jaundice (yellow skin) and liver enlargement and tenderness which can last three to four weeks. Fatigue may last up to one year.\n\n95 percent of cases resolve completely with a very low fatality rate of .1 percent of those who do not recover completely. Those recovering acquire lifelong immunity to the disease. Of the five percent who do not recover completely, fewer than five percent become chronic carriers of the disease.\n\nHepatitis B is a disease that is very low occurring in children, with the majority of those infected comprised of adults ages 20-39. The US and western Europe have very low rates of .1-.5 percent of the general population.\n\nWhile infants may contract hepatitis B from infected mothers, this form of transmission is a small percentage of the cases of hepatitis B. Hepatitis B is considered to be an adult disease transmitted most commonly from infected blood or body fluids. It is not a highly contagious disease and uncommon in childhood. [1]\n\nThose at Higher Risk for Hepatitis B\n\nThe following populations are at increased risk of becoming infected with the hepatitis B virus:\n• Sexually active persons who are not in a long-term, mutually monogamous relationship (e.g., >1 sex partner during the previous 6 months)\n• Men who have sex with men\n• Health care and public safety workers at risk for occupational exposure to blood or blood-contaminated body fluids\n• Residents and staff of facilities for developmentally disabled persons\n• Travelers to countries with intermediate or high prevalence of HBV infection [2]\n\nWith the exception of infants born to infected mothers, infants and children are at very low risk of contracting hepatitis B. The rationale for vaccinating all infants against a relatively mild disease, for which they are unlikely to contract, makes no sense.\n\nIn 1991, the recommendation was first made to vaccinate all infants against hepatitis B. [3]\n\nIn 2005, the Centers for Disease Control and Prevention (CDC) instituted an updated policy that all infants receive the hepatitis B vaccination at birth, prior to discharge from hospitals. As part of the CDC recommendation, all mothers are tested for a hepatitis B antigen (HBsAG). For those mothers who test positive, infants are ordered to receive hepatitis B immune globulin (HBIG) in addition to the hepatitis B vaccination.\n\nMothers who test negative for hepatitis B, as well as those with inconclusive tests, are strongly urged to have their child vaccinated. In fact, infants are routinely vaccinated and parents not wanting their child vaccinated must make this very clear prior to going to the hospital to deliver their baby. The policy urges mothers to follow up with their infants’ pediatrician to complete the vaccination series. [4]\n\nWhat would make more sense, if one believed in the safety and effectiveness of the hepatitis B vaccine, would be to only give the vaccine to infants of mothers who test positive for hepatitis B.\n\nThe Advisory Committee on Immunization Practice recommends that all children receive their first dose of hepatitis B vaccination at birth, with completion of the three-vaccine series by age 6-18 months. It is recommended that older children and adolescents not previously vaccinated also receive the three-shot series. [5]\n\nThe childhood vaccination schedule for the hepatitis B vaccination is endorsed by the following medical groups:\n\nThe CDC recommends combination vaccines instead of individual vaccinations. [6]\n\nMade Up Facts Used to Justify Hepatitis B Vaccine Program\n\nIn 1991, the media reported statistics generated by the CDC to promote a mass hepatitis B vaccination program. These statistics are not linked to any documented facts and this data continues to be used today to perpetuate the imaginary need for this vaccination.\n\nThe CDC claimed that there were an estimated one million persons with chronic hepatitis B infection in the United States and that each year, 5,000 individuals die from liver disease. No scientific reference was ever given by the CDC. [7]\n\nNo vaccine has ever been proven to be effective against any disease. Only the creation of antibodies is tested, which is different than actual immunity to disease. [8]\n\nIn fact, recent outbreaks of measles and mumps in those vaccinated provides proof that vaccines are not effective. [9]\n\nThe case for hepatitis B vaccines is no different. This vaccine has shown a temporary increase in antibodies, but this does NOT equate to immunity. The vaccine makers themselves do not promise immunity. [10]\n\nFrom July 1990 to 1996, more than 16,000 reports of hospitalizations, injuries and deaths following hepatitis B vaccinations were reported to the United States Vaccine Adverse Events Reporting System (VAERS). The reports of deaths in infants are most commonly listed incorrectly as caused by SIDS (sudden infant death syndrome ). It is known that less than 10 percent of physicians report health problems following vaccinations.\n\nSeveral international medical journals have documented that the hepatitis B vaccination is causing chronic, serious, immune and neurological disease in both children and adults.\n\nIn 1996, Montinare et al published a study in Italy evaluating 30 children and adults, most aged 3 to 9 months, who suffered from seizures and autism following the hepatitis B vaccine. The authors concluded that autoimmune diseases are more frequent in countries where vaccines are widely used. [11]\n\nBetween 1992 and 2005, 36,788 official adverse reactions were reported to VAERS. 14,800 of these reactions required hospitalization and many were life-threatening, resulting in permanent disabilities. 781 individuals were reported to have died following the hepatitis B vaccine.\n\nThe following health problems have been caused by the hepatitis B vaccine:\n• Convulsions and brain disorders such as encephalitis\n\nThe hepatitis B vaccination program targeting newborns and infants does NOT make sense. The vaccination itself has not proven to be effective in preventing hepatitis B. There is very little risk of children becoming infected with hepatitis B.\n\nHepatitis B is a disease that is not highly infectious and tends to affect adults in high risk groups. The course of the disease is usually self-limiting with lifelong immunity acquired.\n\nIn contrast, many serious health consequences have resulted from the hepatitis B vaccination, including permanent disability and death.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/07/08/hepatitis-b-vaccine/", "site_name": "VacTruth.com", "title": "The Insanity of the Hepatitis B Vaccination | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/06/hepatitis-b.jpg", "description": "The hepatitis B vaccination is one that even pro-vaccinators should question from a common sense perspective. The vaccination is now routinely given at birth for newborns, with follow-up vaccines scheduled during infancy. This disease is one that is fairly rare, and more common in adults in high risk groups, including those who are sexually promiscuous, …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "truth about vaccines", "article:section": "Logical", "article:published_time": "2016-07-08T12:03:30-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/06/hepatitis-b.jpg", "image:width": "500", "image:height": "333"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/michelle-goldstein/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/07/08/hepatitis-b-vaccine/", "https://twitter.com/share?text=The Insanity of the Hepatitis B Vaccination:&url=https://vactruth.com/2016/07/08/hepatitis-b-vaccine/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/07/08/hepatitis-b-vaccine/&media=https://vactruth.com/wp-content/uploads/2016/06/hepatitis-b.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/07/08/hepatitis-b-vaccine/", "http://www.nvic.org/nvic-archives/newsletter/untoldstory.aspx", "http://www.cdc.gov/hepatitis/hbv/hbvfaq.htm#D4", "http://www.nvic.org/nvic-archives/newsletter/untoldstory.aspx", "http://www.immunize.org/catg.d/p2130.pdf", "http://www.cdc.gov/hepatitis/hbv/vaccchildren.htm", "http://www.cdc.gov/vaccines/schedules/downloads/child/0-18yrs-combined-schedule-bw.pdf", "http://www.nvic.org/nvic-archives/newsletter/untoldstory.aspx", "https://vactruth.com/2014/12/12/10-reasons-not-to-vaccinate/", "https://vactruth.com/2016/02/18/mmr-vaccine/", "http://www.nvic.org/nvic-archives/newsletter/untoldstory.aspx", "http://www.nvic.org/nvic-archives/newsletter/untoldstory.aspx", "http://articles.mercola.com/sites/articles/archive/2011/07/07/60-things-that-can-go-terribly-wrong-with-hepatitis-b-vaccination.aspx", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth"], "authors": [], "publish_date": "2016-07-08T12:03:30-04:00"}