{"result_id": "331005", "URL": "https://vactruth.com/2016/06/21/how-to-find-a-physician/", "timestamp": "2023-04-25 17:51:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/06/21/how-to-find-a-physician/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "How to Find a Physician to Support Your Vaccine Choice", "cleaned_text": "Working with a physician who supports your vaccine choice is essential for developing a cooperative, supportive relationship. Unfortunately, many doctors in private practice refuse to see patients who do not follow the aggressive Centers for Disease Control and Prevention (CDC) vaccination schedule. These physicians may be willing to make some allowances, but will push for many vaccinations.\n\nOther medical doctors employed by hospitals receiving government funding will likely favor vaccines, but are legally forced to accept parent choices regarding vaccinations and provide medical care to all patients. Where can one find a health care provider who respects parent vaccine choice and the right to not vaccinate?\n\nWhy are physicians so strongly pro-vaccine?\n\nWhy Do Most Physicians Favor Vaccines?\n\nThe medical training that physicians receive in medical school is heavily influenced by the pharmaceutical companies and CDC. Both the CDC and pharmaceutical companies push for a growing, aggressive vaccine schedule for children.\n\nPhysicians are only taught one side of the vaccine issue and are told that vaccines are safe and effective. Data regarding vaccine injury is minimized greatly. Physician education is also focused on compliance and how to diffuse parental concern about vaccine safety. Doctors are rewarded financially for vaccinating patients and sometimes penalized when their vaccination rates drop. [1]\n\nThe Importance Of Working With A Pro-Vaccine Choice Doctor\n\nDoctors who support your decision to not vaccinate your child are more likely to understand and support your overall parenting style. The conflict and discord should be reduced, making for an improved doctor-patient relationship.\n\nThe decision to not vaccinate is usually a very thoughtful choice made by parents who have spent considerable time doing tremendous research on the topic. To work with a physician who does not understand or respect this decision will likely create animosity, distrust and negative feelings. A majority of time may be spent debating with the physician about your vaccine decision with the doctor continually pressuring to vaccinate, instead of spending precious time discussing the heath of your child.\n\nDoctors employed by hospitals receiving government funding are not permitted to discriminate and deny services to patients based on vaccine choice, assuming that exemptions exist in that state. All states permit medical vaccine exemptions. Only two states, California and Mississippi, do not allow religious exemptions. Many states allow philosophical exemptions. To check on your particular state’s vaccine exemption laws, visit the National Vaccine Information Center’s website. It is important to be informed and assertive about the laws and your rights to make vaccine decisions for yourself and your child. [2]\n\nHundreds of physicians question vaccine safety, and hundreds more have concluded vaccines are harmful and dangerous to health. These physicians will support patients who choose not to vaccinate. A list of 240 doctors is provided by a health blogger. Their location and specific practice information is not identified, but the list may be useful as a starting point.\n\nThe International Medical Council on Vaccinations is a group of hundreds of physicians, nurses and other health care professionals who have identified themselves as anti-vaccination. These professionals have spent hundreds of hours examining the research and observing the vaccine damage done to patients. At one time, a list of practitioners was available on their site, but it was not available at this time. They continue to be an excellent source for information on vaccinations. [3]\n\nResources For Locating Physicians Who Support Your Vaccine Choice Rights\n\nPhysicians who associate with integrative or holistic health groups are more likely to support vaccine choice. These groups of heath care providers who likely support vaccine choice include the following organizations. The links go directly to their group’s page, allowing one to enter local zip codes to facilitate finding a practitioner close to home:\n\nOther Sources To Help Identify Physicians Who Will Support Your Vaccine Choice\n\nOne can talk to other pro-vaccine choice parents to see which physicians they use. Parents can google doctors in their area and call ahead to ask if they accept patients who are not vaccinated or choose alternative vaccine schedules. Local natural health food stores are often good resources for finding local, holistic-oriented doctors.\n\nFor those thoughtful parents who choose not to vaccinate or vaccinate on an alternative schedule, finding a physician to support this decision can be challenging. However, there are many resources available to assist. Legally, hospital-based physicians who are receiving government funding are not able to discriminate and deny services to patients who do not vaccinate, assuming your state has vaccine exemptions; 48 states allow both medical and religious exemptions.\n\nSpending time to find a physician who will support your vaccine choices is time well spent. The relationship with your physician will likely be much better if your physician respects your vaccine choice. Time can be devoted to maximizing your child’s health instead of debating the vaccine issue at every visit.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/06/21/how-to-find-a-physician/", "site_name": "VacTruth.com", "title": "How to Find a Physician to Support Your Vaccine Choice | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/05/find-doctor.jpg", "description": "Working with a physician who supports your vaccine choice is essential for developing a cooperative, supportive relationship. Unfortunately, many doctors in private practice refuse to see patients who do not follow the aggressive Centers for Disease Control and Prevention (CDC) vaccination schedule. These physicians may be willing to make some allowances, but will push for …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "Vaccine Exemption", "article:section": "Social", "article:published_time": "2016-06-21T11:32:34-04:00", "article:modified_time": "2017-11-26T06:54:49-05:00", "updated_time": "2017-11-26T06:54:49-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/05/find-doctor.jpg", "image:width": "640", "image:height": "427"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/social/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/06/21/how-to-find-a-physician/", "https://twitter.com/share?text=How to Find a Physician to Support Your Vaccine Choice:&url=https://vactruth.com/2016/06/21/how-to-find-a-physician/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/06/21/how-to-find-a-physician/&media=https://vactruth.com/wp-content/uploads/2016/05/find-doctor.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/06/21/how-to-find-a-physician/", "http://www.nvic.org/CMSTemplates/NVIC/pdf/state-vaccine-exemptions_blue.pdf", "http://journeyboost.com/2016/02/29/240-doctors-question-vaccine-safety-2/", "http://International Medical Council on Vaccinations", "http://acam.site-ym.com/search/custom.asp?id=1758", "https://www.functionalmedicine.org/practitioner_search.aspx?id=117", "http://www.icimed.com/member_search.php", "http://homeopathyusa.org/member-directory.html", "http://www.naturopathic.org/AF_MemberDirectory.asp?version=1", "https://www.aaemonline.org/", "http://hpadirectory.org/", "http://icpa4kids.org/Find-a-Chiropractor/", "http://www.homeopathycenter.org/find-homeopath", "https://vactruth.com/2016/03/22/why-doctors-recommend-vaccinations/", "http://www.know-vaccines.org/?page_id=1357", "http://www.vaccinationcouncil.org/about/", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/pahowho/9403941848/in/photolist-fjZEhq-pBwyXZ-aCWhkm-92wWAs-86kSPz-kPHsLc-9KPzww-568jvp-pTX7FR-fjKw3x-fjKxa6-fjZEs7-cqy5gG-jiwsit-eetXWe-Ndp4a-dL8rgn-irLoCr-bDcHHT-bvWywX-8u1zv6-bvWz8M-7BcYut-rzFD4-7BgLSo-aunRhi-6kL1Xf-bvW7un-bqhQcW-aunRmR-79xHvC-7BgM7m-bvW5DH-7BcXS4-bqtTsp-bvW8EZ-bvWJCP-8wVf1V-aEATu-bvWvQv-bvWvvD-bvWAha-bvVZCM-bvW7KB-bvWzrg-bvW8aK-7BgMt5-618N8o-bvWiqM-bvWcPM"], "authors": [], "publish_date": "2016-06-21T11:32:34-04:00"}