{"result_id": "331045", "URL": "https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/", "timestamp": "2023-04-25 17:52:25 CEST+0200", "meta": {"description": "Most states require college students to obtain the MMR vaccination to attend their universities, but scientists question its effectiveness against mumps.", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "The Failed MMR Vaccine Policies on College Campuses", "cleaned_text": "Most states have enacted laws requiring college students to obtain the MMR vaccine in order to attend their universities. This vaccine allegedly offers protection against the diseases measles, mumps and rubella. The effectiveness of Merck’s MMR vaccine against mumps has been questioned by many scientists.\n\nMeanwhile, the past five years have witnessed skyrocketing increases of mumps outbreaks across college campuses, among those students vaccinated, providing further evidence of the MMR vaccine’s failure. The MMR vaccine has been associated with injuries and deaths, while the diseases of measles and mumps which it targets are generally mild and resolve on their own.\n\nTo add to the insanity of these vaccine policies, campus authorities have urged students to receive booster MMR shots, after the failed MMR vaccines have resulted in mumps outbreaks among those vaccinated. This combination of events begs the question of whether the MMR college vaccine policies make any sense and what better alternatives exist. [1-3]\n\nGrowth of College Vaccine Policies and Why\n\nA CDC report shows that at least thirty of the fifty states in America have vaccine policies for college students, requiring incoming students receive the MMR vaccination. Most of the state laws focus on incoming freshmen living on campus, but the details vary by state. A search on this site entering the MMR vaccine and all universities will result in a detailed report. [4]\n\nOther states, not included in this list, also require the MMR vaccine, including Missouri and Washington state. The actual number of universities requiring the MMR vaccination is likely much higher. [5, 6]\n\nThe media has helped to create fear among the public of the once common, mild childhood diseases of mumps and measles, which provided real, lifelong immunity. Whenever there is a measles or mumps outbreak, this news makes major headlines. No deaths or serious illnesses generally result, but widespread hysteria does. [7]\n\nThere has been a tremendous increase in all vaccine recommendations and damages since the beginning of the highly ineffective government vaccine courts created in 1986, which provide total immunity to vaccine makers from any vaccine damages. The creation of the vaccine courts gave a free pass to pharmaceutical companies to provide profitable vaccinations, without any regard for safety measures. [8, 9]\n\nThe National Vaccine Information Center reports that 69 doses of 16 vaccinations are recommended between birth and age 18. [10]\n\nThe Center for Disease Control and Preventions’s vaccine schedule can be viewed here.\n\nThe Ineffectiveness of the MMR Vaccination for Mumps\n\nMerck’s own scientists have accused Merck of falsifying data to show that their mumps vaccine was 95% effective. The US federal court has been fighting Merck for several years and the battle is ongoing. Merck’s MMR vaccination has been known to be ineffective against mumps since the 1980s. [11, 12]\n\nOutbreaks of Mumps at College Campuses Provides Further Proof of Vaccine Failure\n\nA ten-year high rate of mumps infections, especially on college campuses, was reported by the CDC in December of 2016. As of December 2016, 2,879 cases of mumps were reported. College students infected with mumps include those from the states of Missouri, New York, California, Massachusetts and Maryland. Almost 100% of those infected with mumps had been vaccinated. [13, 14]\n\nAt the Mizzou campus in Columbia, Missouri, 341 cases of mumps were reported between August 2016 and February 2017. The mild disease causes discomfort, but resolves within a seven to ten day period. A third, free MMR vaccination was being offered to students in an effort to minimize further cases. Fifteen universities in Missouri reported outbreaks of mumps in the spring of 2017. [15-17]\n\nThe Risks of the MMR Vaccine Compared to the Diseases of Mumps and Measles\n\nWhile there have been no reported deaths resulting from the mild disease outbreaks of measles and mumps, hundreds of deaths and serious health complications have been associated with the MMR vaccination. Serious health problems caused by the MMR vaccination include autism, lupus, Guillain-Barre syndrome, encephalitis, meningitis, deafness, cardiomyopathy, and convulsions. The Vaccine Adverse Events Reporting System (VAERS) database, as of December 2014, had reported 6,962 serious health conditions in reaction to the MMR vaccination since 1990. [18]\n\nBetween 2003 and 2013, no deaths were reported from measles, while during that same time frame, at least 98 deaths were caused by the measles vaccine. In that ten-year span, 694 measles vaccine-related disability cases were reported. [19]\n\nThe Insanity of Policies Urging More Vaccinations After Mumps Outbreaks\n\nMany universities requested students obtain a third MMR vaccination during the mumps outbreaks, while simultaneously acknowledging that the majority of those with mumps were fully vaccinated. To ask students to obtain another ineffective MMR vaccination in an attempt to limit the inconvenient but relatively benign illness of mumps seems misguided at best. When one factors in the relative high health risks associated with the MMR vaccine, it makes no sense at all. [20]\n\nThe CDC advised that a third MMR vaccination was advisable on college campuses during outbreaks. At the university of Illinois at Champaign-Urbana, when this recommendation was carried out in August of 2016, students continued to contract mumps. Fifty of the 317 cases of mumps were identified among students who had received the third MMR vaccination. 232 of the mumps cases were among those vaccinated twice with the MMR, which is the standard dose of the vaccine. During the mumps outbreak, 8200 third dosages of the MMR vaccination were administered to students.\n\nMore Sensible Alternatives to Replace Dangerous, Ineffective Vaccinations\n\nHomeopathic vaccinations are both safe and effective and can be given to prevent almost all diseases including mumps, rubella and measles. The simple reason why these are not used as a replacement for the dangerous, ineffective MMR vaccination is that our country’s healthcare is highly influenced by pharmaceutical corporations’ profit model. Pharmaceutical companies profit from expensive vaccines which cause health damage, creating lifetime customers needing more pharmaceutical drugs and treatments. It is the perfect business medical model of sick care, not wellness. [21]\n\nEating healthy diets and using targeted nutritional supplements have been shown to provide immunity to disease and reduce symptoms of illness. Measles can be effectively treated with vitamin A and tetanus treated with vitamin C. Keshan disease common in China, New Zealand and Finland can be prevented with selenium. The research of brilliant dentist Weston Price showed that eating nutrient-dense diets provided natural immunity to the common disease of tuberculosis, but when native people adopted Western, unhealthy processed food diets, they lost their immunity and developed diseases. [22]\n\nWhile all universities appear to have several vaccination recommendations, most universities do allow for exemptions, either religious or medical. There seems to be stricter requirements for individual college programs, especially those which are health-related and this can pose a challenge for students interested in health professions who are opposed to vaccinations. If a disease outbreak occurs on college campuses, unvaccinated students can be penalized and excluded from campus activities, including attendance at classes and living on university property. It is important to research vaccination policies for any prospective university one is considering. [23]\n\nThe current policy on most college campuses requires verification that incoming students have received two doses of the MMR vaccination. The goal of this policy is to prevent the diseases measles and mumps. A longstanding federal trial against Merck, the pharmaceutical company responsible for making the MMR vaccine, accuses Merck of manipulating data to show the MMR to be more effective against mumps than it is.\n\nRecent outbreaks of mumps on college campuses by students vaccinated with the MMR vaccine provides additional evidence that the MMR vaccine is ineffective. Data from the Vaccine Adverse Events Reporting System proves that the MMR vaccine is responsible for thousands of serious injuries and almost 100 deaths. The actual diseases of measles and mumps are generally benign, mild diseases in both children and adults, resolving naturally within a few days.\n\nMore sensible university health policies would encourage safe, effective, inexpensive homeopathic immunizations and improved nutrition to prevent disease. Common sense would dictate the elimination of the mandatory MMR vaccination policy on college campuses.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/", "site_name": "VacTruth.com", "title": "The Failed MMR Vaccine Policies on College Campuses | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2017/07/mmr-vaccine-policy.jpg", "description": "Most states require college students to obtain the MMR vaccination to attend their universities, but scientists question its effectiveness against mumps.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "truth about vaccines", "article:section": "Law & Policy", "article:published_time": "2017-07-25T04:19:32-04:00", "article:modified_time": "2017-11-26T01:00:59-05:00", "updated_time": "2017-11-26T01:00:59-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2017/07/mmr-vaccine-policy.jpg", "image:width": "640", "image:height": "427"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-law-policy/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/", "https://twitter.com/share?text=The Failed MMR Vaccine Policies on College Campuses:&url=https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/&media=https://vactruth.com/wp-content/uploads/2017/07/mmr-vaccine-policy.jpg", "https://plus.google.com/share?url=https://vactruth.com/2017/07/25/failed-mmr-vaccine-policies/", "https://www.cdc.gov/vaccines/schedules/hcp/imz/child-adolescent-compliant.html", "https://www.cdc.gov/mumps/outbreaks.html", "http://www.cbsnews.com/news/mumps-cases-10-year-high-college-outbreaks-vaccination/", "https://www.insidehighered.com/news/2015/02/03/22-states-dont-require-measles-immunizations-college-students", "https://www2a.cdc.gov/nip/schoolsurv/schImmRqmt.asp", "http://studenthealth.missouri.edu/forms&policies/immunization.html", "https://hws.wsu.edu/medical-clinic/new-students/", "http://articles.mercola.com/sites/articles/archive/2015/03/24/dissolving-illusions-measles-vaccine.aspx", "http://vaccinesafetycommission.org/vaccine-court.html", "https://vaccineimpact.com/2016/vaccines-injuries-and-deaths-increase-in-government-vaccine-court-june-2016-report", "https://www.nvic.org/CMSTemplates/NVIC/pdf/49-Doses-PosterB.PDF", "http://www.huffingtonpost.ca/lawrence-solomon/merck-whistleblowers_b_5881914.html", "http://ahrp.org/former-merck-scientists-sue-merck-alleging-mmr-vaccine-eff", "http://www.naturalnews.com/2017-03-14-cdc-mumps-outbreak-can-still-occur-in-highly-vaccinated-communities.html", "http://www.greenmedinfo.com/blog/2013-measles-outbreak-failing-vaccine-not-failure-vaccinate1", "http://fox2now.com/2017/02/15/mizzou-battling-mumps-outbreak-on-campus/", "http://www.kshb.com/news/local-news/several-missouri-colleges-report-mumps-cases-on-campuses", "https://www.usnews.com/news/best-states/missouri/articles/2017-04-28/mumps-outbreak-reported-at-sou", "https://vactruth.com/2016/02/18/mmr-vaccine/", "http://www.chicagotribune.com/news/local/breaking/ct-mumps-outbreak-university-of-illinois-met-0805-20150804-story.html", "https://www.cdc.gov/mmwr/volumes/65/wr/mm6529a2.htm", "https://vactruth.com/2016/09/17/why-you-cant-find-safe-vaccines/", "https://vactruth.com/2016/09/24/nutrition-beats-vaccines/", "https://vactruth.com/2015/09/03/college-vaccination-policies/", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth"], "authors": [], "publish_date": "2017-07-25T04:19:32-04:00"}