{"result_id": "331026", "URL": "https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/", "timestamp": "2023-04-25 17:52:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "How to Protect Yourself if You are Force-Vaccinated", "cleaned_text": "Vaccinations have a strong history of causing damage to health. The very first vaccination for smallpox caused tremendous health damage, while also increasing the incidence of small pox. The damage caused by polio vaccinations continued this trend. Newer vaccinations continue to destroy health and even kill their recipients. [1]\n\nWhile many are able to choose to refuse this dangerous medical procedure, others are threatened with refusal of entry in day care, schools, and universities if they remain unvaccinated. Others are forced to choose between employment or vaccinations. Pressure to vaccinate is especially strong for those employed by health care and the US military.\n\nWhile the best option is to employ whatever exemptions may exist in your state, for many individuals, there appears to be no good escape route. This is a very sad state of affairs.\n\nIndividuals caught in this predicament may still choose to use health practices which will reduce the likelihood of vaccine health damage.\n\nIt makes sense that reducing the toxic load would reduce the potential damage of vaccinations. Obtaining as few vaccines at one time as possible should logically reduce the risks for damage. Obtaining only one vaccine at a time is the best option, if one chooses to vaccinate.\n\nStatistical data on vaccine damage supports this idea. Medical researcher Neil Z. Miller warns parents to avoid multiple vaccines at one visit, which can lead to serious reactions, including death. Miller discovered that 5.4 percent of vaccine reactions for those receiving five or more vaccines were fatal. Due to underreporting of vaccine injuries, this number is likely to be much higher.\n\nThe Centers for Disease Control and Prevention (CDC) continues to recommend infants receive eight vaccines (polio, diphtheria, hepatitis B, rotavirus, pneumococcal, tetanus, haemophilus influenza B and pertussis) at ages 2, 4 and 6 months, in spite of no safety studies. [2]\n\nWhile conventionally trained physicians will almost always recommend vaccinating a sick child or adult, integrative-minded practitioners warn against this practice. The immune system is already compromised, so introducing more toxins to the body will more likely overwhelm the individual’s fight to detoxify. [3]\n\nDo NOT Use Acetaminophen with Vaccinations\n\nComparing children in Cuba to those in the US, autism rates were significantly lower in Cuba. Several practices can account for this, including less and safer vaccine use in Cuba.\n\nAnother practice difference discovered was the routine use of acetaminophen prior to and after vaccines in the US. Acetaminophen found in Tylenol is used for pain relief, but it also reduces the production of glutathione, a powerful antioxidant used to eliminate toxins. [4]\n\nVitamin C has been shown in several studies to be highly effective at neutralizing the neurotoxin mercury which is found in many vaccines. It is recommended to take vitamin C prior to and after vaccinations. Dr. Russell Blaylock recommends 1,000 milligrams of buffered vitamin C four times daily between meals in his vaccination detox protocol. [5, 6]\n\nUse of Detox and Immune-Strengthening Protocol\n\nDr. Russell Blaylock is a respected neurosurgeon who has written extensively about vaccine dangers. Dr. Blaylock has outlined a detailed protocol which can be used to reduce the effects of toxic vaccinations.\n\nDr. Blaylock’s first suggestion is to bring a cold pack with you when vaccinated, and place on the injection site as soon as possible to help block an immune reaction. A cold pack and cold showers can also be used the following day.\n\nBlaylocks’s protocol includes the use of several powerful, safe antioxidants curcumin, quercetin and EPA omega 3 one hour prior to vaccination, as well as several days following vaccines.\n\nBlaylock recommends children take 5,000 units of D3 and adults 20,000 units of D3 for two weeks following vaccinations. The natural form of vitamin E, high in gamma-E, is recommended to reduce inflammatory cytokines. Taking a multivitamin high in B vitamins and selenium, but absent of iron, is also suggested.\n\nBlaylock also recommends 8 ounces of detox smoothies with parsley and celery, taken twice daily.\n\nHolistic physician Sircus has a very similar detox protocol to Dr. Blaylock, with a cold pack and vitamin C dosing as a first line of defense. Sircus emphasizes using baking soda to neutralize the poisons contained in vaccinations. Sircus recommends water hydration to help detoxify the body, as well as magnesium and spirulina. He also stresses the importance of using vitamins and nutrients, referencing Blaylock’s protocol, as well as avoiding other toxins in the environment. [7]\n\nAvoiding vaccines is the best line of defense against exposure to dangerous toxins. If one is faced with the necessity to vaccinate, there are several important health measures which may reduce damage.\n\nNot vaccinating when ill, and spreading out vaccinations as much as possible can reduce likelihood of vaccine damage.\n\nUse of a cold pack immediately following vaccination can help block an immune reaction. Use of vitamin C before and after vaccination is considered critical. Deciding on a protocol inclusive of several antioxidants including vitamins D3 and E is important. Smoothies made with celery and parsley and/or use of baking soda can help detox poisons from the body.\n\nAvoiding acetaminophen before and after vaccinations is also a helpful guideline.\n\n Many individuals understandably feel helpless when forced to vaccinate by their employers or schools, but utilizing these recommendations can hopefully minimize the negative impact of vaccinations.\n\nThe information contained within the VacTruth website is for educational and informational purposes only, and is not to be construed as medical advice. If you have a medical problem, you need the help of a trained medical professional.\n\nOur full disclaimer is available to read here.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/", "site_name": "VacTruth.com", "title": "How to Protect Yourself if You are Force-Vaccinated | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/08/forced-vaccines.jpg", "description": "Vaccinations have a strong history of causing damage to health. The very first vaccination for smallpox caused tremendous health damage, while also increasing the incidence of small pox. The damage caused by polio vaccinations continued this trend. Newer vaccinations continue to destroy health and even kill their recipients. [1] While many are able to choose …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "truth about vaccines", "article:section": "Law & Policy", "article:published_time": "2016-08-27T13:09:36-04:00", "article:modified_time": "2017-11-26T06:42:39-05:00", "updated_time": "2017-11-26T06:42:39-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/08/forced-vaccines.jpg", "image:width": "640", "image:height": "480"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-law-policy/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/", "https://twitter.com/share?text=How to Protect Yourself if You are Force-Vaccinated:&url=https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/&media=https://vactruth.com/wp-content/uploads/2016/08/forced-vaccines.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/08/27/if-you-are-force-vaccinated/", "http://www.naturalnews.com/043662_vaccine_safety_medical_myths_junk_science.html", "http://www.naturalnews.com/054426_vaccines_multiple_doses_fatalaties.html", "https://michaelgaeta.com/vaccine-damage/", "https://vactruth.com/2016/06/25/acetaminophen-and-autism/", "http://www.orthomolecular.org/resources/omns", "http://rense.com/general87/vaccin.htm", "http://drsircus.com/medicine/vaccines/prevention-treatment-of-vaccine-damages/", "https://vactruth.com/disclaimer/", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/pedroklien/5207791421/in/photolist-yPzPC-8YAdRB-d3c3U3-8WchXg-eemkAU-nMmYvc-nFe4ca-771RiR-ftqE1w-FsxKC6-83mVVT-5Z8LKt-afrtAs-fHux9-9AZtJ9-e1RT6x-dRBtkH-f92Jb-7fcNh1-uQBHx-8whD9T-6d5Bf4-dHvf26-9rZVZB-t1QSe-5wFf1R-oRC9Cu-cKYkpE-6mnb33-bnGefq-6h1fNK-7ggjCR-hb1bRC-8h4bmw-6ck1Xm-7b3t8W-zSbu8-ooeoqk-ekof5s-4gyZFW-cKXpFq-cKWeLQ-nJXxAz-8QJife-nZTQmB-48S5CY-GTiYh-5w493M-nkyjjr-5sobip"], "authors": [], "publish_date": "2016-08-27T13:09:36-04:00"}