{"result_id": "331019", "URL": "https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/", "timestamp": "2023-04-25 17:52:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Louisiana Mother Knows 8 Vaccine Doses Killed Her 2 Month-Old Son", "cleaned_text": "Two month-old Reid Thomas Englehart was vaccinated on May 20, 2015. He was given eight vaccine doses, which included the DTaP, Hib, polio, pneumococcal, hepatitis B and the oral rotavirus vaccines. These are the routine vaccines given to two month-old babies, even premature babies, in the United States and elsewhere. [1]\n\nAt the time of his appointment, Reid was still wheezing from a previous infection and still had a residual cough, but his doctor insisted it was fine to vaccinate him, after a test came back that Reid was negative for pertussis.\n\nNine days later, without a struggle and without any obstruction of his airways, he stopped breathing while his dad was holding him. Reid passed away in his sleep on May 29, 2015.\n\nA bloody-colored mucous substance stained his father’s shirt where Reid’s head rested on his chest. This tinged mucous is very commonly witnessed in babies dying after vaccination. More came out of Reid’s mouth when his mother performed CPR on him. After emergency responders showed up, they declared him dead on the scene.\n\nInvestigators Ignored The Vaccines As A Plausible Cause Of Death\n\nAn investigation was done and Reid’s death was ruled accidental. The immediate cause listed on his autopsy report and death certificate was due to “possible suffocation,” without any signs or proof he suffocated. Reid did not struggle when he lay asleep on his dad’s chest, as he slipped away; he just stopped breathing in his sleep.\n\nHis report stated his death resulted from an unsafe sleeping environment, known as co-sleeping, which humans have been doing safely since the beginning of our time. This is a common ruling in vaccine-related death cases even though there is typically no proof the baby died from suffocation, due to co-sleeping. In many of these cases, babies were vaccinated shortly before, within hours to a few weeks, but the vaccines have been disregarded.\n\nA claim has been filed with the National Vaccine Injury Compensation Program (NVICP), with the help of a vaccine injury attorney Reid’s mother found to represent their case. Although the odds are against parents to be awarded any money for their child’s vaccine-related death, this is the recourse they have. [2]\n\nThe maximum death benefit parents can be awarded is $250,000. Cases are usually settled for less and the majority of parents never receive any compensation. It is often cheaper to pay a death benefit to parents than to pay an award for a living, vaccine-injured child, because a deceased child won’t require future medical care, saving taxpayers money, since taxpayers are the ones paying for these awards.\n\nIf their case is awarded, Reid’s parents can accept the death benefit as full payment or they can decline it and sue the vaccine manufacturer(s) directly. The latter is rarely done because so many vaccines are given during these doctors’ visits, making it nearly impossible to prove which vaccine specifically, or if all of the vaccines acting together, caused the injury, protecting the vaccine manufacturers once again. [3]\n\nChristy contacted the doctor’s office soon after Reid died and requested someone at the office file a Vaccine Adverse Events Report through VAERS, involving her son and the vaccines he was given. [4] This request was documented in Reid’s medical files. To prove this file exists, Christy wanted people to see this report for themselves, to see this was documented. To this day, neither Reid’s pediatrician, nor anyone who cared for Reid, has filed a report with VAERS.\n\nThe vaccines have been ignored as the most plausible cause of his death by doctors, investigators and medical examiners. It is interesting how easily vaccines are ruled out, without ever having to prove the vaccines didn’t cause the injury, even though the list of associated reactions to each vaccine includes death.\n\nReid’s doctor is legally required to file a VAERS report, whether or not he thinks the vaccines were the cause of Reid’s reactions or death, but he has not done so. Nor has he been held accountable for vaccinating Reid, while he was still recovering from a previous infection.\n\nIn his short eleven-week life, Reid was directly given a vitamin K injection, morphine for days, and a total of nine vaccine doses. The ingredients in each one of these drugs is harmful and astounding. [5] Considering how safe co-sleeping is, it does not make sense to ignore the more harmful substances Reid received in his short life, administered by health care providers, known to trigger breathing cessation and apnea.\n\nIt has become obvious to parents in this situation that having the vaccines withheld on their children’s autopsy reports and death certificates, which is the most plausible cause of their death when nothing else was proven to be the cause, that this is actually the true cause of their death, hiding the truth intentionally so parents don’t find out or think to question.\n\nWhen vaccines injure you or your child, you can expect similar treatment. The vaccine program will be protected while your child’s life will be swept under the rug and hardly acknowledged.\n\nIn this article, this powerful and emotional testimony from Reid’s mother, Christy Day, is a reminder to all parents to diligently research vaccines, from sources other than those invested in them, to understand the true risks involved with allowing your child to receive any vaccine. She knew the moment she found out her son was dead that it was the vaccines that killed him.\n\nChristy went against everything she believed in when she contemplated having an abortion after she found out she was pregnant with her fourth child. She prayed for guidance and realized she could not worry about having another baby. In the third week of her pregnancy, she made an appointment to take an abortion pill but decided for her, it was not the right thing to do. She was so thankful she didn’t.\n\nWhile pregnant with Reid, her doctors insisted she keep taking a prescription drug named Suboxone®, for an opioid dependence she is recovering from, under the care of her obstetrician and another doctor, claiming it would be worse for her to stop taking it. [6]\n\nSuboxone taken during pregnancy can harm the fetus and is known to cause breathing problems. Christy didn’t want her baby born suffering withdrawals or any side effects, which can happen, as stated on the package insert, so she took a very small portion of what she was prescribed. [7]\n\nHer addiction to opiates, which are pain medications, started after she was prescribed pain pills at the age of 21, after having surgery on her shoulder. By the end of her prescription, she admitted she was addicted to her pain medication. There are many different things people can be addicted to. Christy feels drug addicts are judged because they find comfort in narcotics, rather than shopping, eating, religion, etc.\n\nDue to Christy’s blood type, she was told she had to receive a RhoGAM® injection, made from human blood. She was told she needed one shot during pregnancy and another after the baby was delivered. She didn’t like needles but felt she had no choice. Her doctor did not tell her that this drug has not been adequately tested in pregnant women and could cause harm to her developing baby, including respiratory problems. [8]\n\nChristy’s doctor had scheduled an induction because the Suboxone she was taking during her pregnancy would counteract any pain medicine she would be given during the delivery. So they needed to plan her delivery. She was told she had to stop taking the Suboxone 24 hours before the induction, or any pain medicine would not work.\n\nLess than two days before the scheduled induction, her water broke. She and the baby’s father, Dusty Englehart, rushed to the Women’s Hospital in Baton Rouge, Louisiana. Christy was having painful contractions by then and was given an epidural upon arrival. Epidurals do not counteract the prescription she was taking and it provided her some pain relief.\n\nSoon after, it was noticed her baby boy had turned and he was in the breech position. Christy’s doctor told her she would need to have a cesarean section to deliver him, something she had never done before.\n\nOn March 7, 2015, her son Reid Thomas Englehart was born at 39 weeks via cesarean section and weighed six pounds.\n\nAfter the epidural wore off, they gave Christy morphine, which her prescription counteracts, so she was still able to feel the pain from having the surgery to deliver her baby.\n\nShortly after Reid was born, he was injected with the vitamin K shot, which contains up to 100 mcg of aluminum and is known to cause more severe jaundice issues. Most parents, including Christy, were unaware of this shot. [9]\n\nThen Reid was injected with the hepatitis B vaccine that day, which contains 250 mcg of aluminum, among other known neurotoxins, and is associated with liver failure and numerous serious reactions parents are not informed about. [10]\n\nOn March 8, one day after Reid was born, the doctor had signed him off as a well baby and told his parents he was fine to go home the next day. He was drinking formula regularly.\n\nChristy was supposed to leave the hospital with him on March 9, but opted to stay an extra night, to make sure she would be all right. Considering she had just delivered a baby via cesarean section, a major surgery, she was scared to go home feeling the pain she was in, knowing the Suboxone medicine she was told to take would counteract the pain medication she was given, so she chose to stay in the hospital a little longer.\n\nThe next day, on March 10, while Christy was preparing to go home with her son, a nurse heard the word Suboxone and heard Reid sneeze, then claimed he looked like he was detoxing. Reid’s parents knew he wasn’t detoxing from Suboxone because he had been in the room with them the past three days and Christy and all the doctors were keeping a close watch.\n\nThey all knew it was possible he could be detoxing, just like with any medications one might detox from. The doctor who prescribed the Suboxone to Christy and her obstetrician communicated and neither felt Reid was detoxing from that. There was no concern by any doctor or nurse about him needing to detox from the vitamin K injection or hepatitis B vaccine he recently received.\n\nChristy admitted she took such a small amount of her prescribed drug during her pregnancy because she didn’t want her baby to be affected and she never felt he was; even the doctors agreed he was healthy after he was born and could go home.\n\nDespite what the doctors had written down, they kept Reid in the hospital for eleven days on morphine. Then Reid started withdrawing from the morphine. Reid’s medical records note after the 24 hours Reid was given morphine, he became much worse. Reid started crying a lot and started having diarrhea. This is a picture of Reid soon after they began giving him morphine.\n\nThey continued to give it to him for ten more days. Christy cannot understand why they would give a baby morphine related to Suboxone; she said that doesn’t even make sense. “It’s crazy they would do that to him.”\n\nReid’s parents fought to get their son out of there but were told there was nothing they could do. They felt he was being held hostage in the NICU, being given morphine, while losing weight and becoming less healthy.\n\nThey went to the patient advocates at the hospital and did all they felt they could, to get Reid out of there, because they knew that he did not belong in there. Had Christy left to go home when they were going to discharge her initially, had she not worried about the pain she was in, she believed the family would’ve been in the clear.\n\nReid’s medical records even show when the pediatrician signed him off as a well baby and said he was fine to go home. Reid was kept for eleven more days because a nurse made a false claim. Christy thought that nurse was under the influence of something herself, by the way she was acting.\n\nBefore Christy was finally able to leave the hospital with her son, her doctor asked her to take the Tdap vaccine. At this point, she had already received the second RhoGAM injection. Disliking needles, Christy asked if this Tdap vaccine was mandatory. The doctor said no, so she declined.\n\nReid Finally Comes Home From The Hospital After Being Given Morphine For Days\n\nOnce the family returned home together, Christy and Dusty were soaking up every moment with their sweet baby boy, knowing how fast time can pass and children grow up.\n\n“Dusty is such a good father. He treats my oldest two boys like they are his own, despite the fact that they have a different biological father. We also have a little girl together, and I hate to admit it, but she is definitely a daddy’s girl. He helped so much when I recovered from my terrible C-section; also when I contracted a terrible case of pneumonia after we got home, and once again, I was bedridden. It was terrible; I thought I was going to die.\n\nWe both juggled waking up at night, and feeding and changing baby Reid. He hit milestones just as he was supposed to; I can honestly say he probably surpassed his milestones and was advanced. He could hold his head up basically the second he was born. He started smiling and laughing very early, around four weeks or so. He had the cutest little smile and laugh that I have ever witnessed. He would smile with a little crooked smile, and laugh the same way.\n\nNaturally, we took him to the pediatrician and had his check-ups. When it came to two months, he needed vaccinations. I thought it was weird because I could’ve sworn that all my other kids were vaccinated at three months.\n\nOn May 7, 2015, he was a little congested when he went in for his two-month shots, and I was paranoid because I have heard about whooping cough and I wanted to make sure that is not what he had, since you should not vaccinate if the baby is sick.\n\nSo we put his shots off for another week or so, until the results for the whooping cough test were in. The results were negative and he did not have whooping cough. We summed his congestion up to having leftover mucus, especially since he was a C-section baby. So, when they called and gave me the results, they also scheduled his shots for May 20, 2015. Reid’s father, Dusty, took him to that appointment at Old Hammond Pediatrics, in Baton Rouge, Louisiana, to get the vaccines.”\n\nReid Reacted To The Vaccines But His Pediatrician Ignored The Warning Signs\n\n“When they came home from the doctor, Reid was passed out. I am not lying when I say he slept over 11 hours straight. Being my fourth child, I know that kids can act funny and get a fever that the doctors tell you can happen after the shots. We still called the doctor and told them, and of course, they said he was fine.\n\nWhen he woke up, he was very cranky. He would not let you put him down, so we had days of him being fussy. He never really smiled or laughed again. He never drank a full bottle again. He fussed and fussed. I can remember clearly that last little bath I gave him; he hated it and cried and cried. It was very unusual for him to cry like that. Reid had always drank a lot of milk; he was 11 weeks old and was drinking six ounces at a time, but from the time he had those vaccinations, he did not finish another full bottle.\n\nWe had some rough days after that vaccine appointment but I have now found comfort in him being fussy and not letting us put him down.”\n\nWhile Resting On His Dad’s Chest, Reid Passed Away\n\n“Nine days later, on May 29, 2015, I was scheduled to get my tubes tied. Dusty let me sleep that night and he had Reid and fed him at 4 am. Again, Reid did not finish his bottle. Reid was sleeping on his chest because he was cranky and would not let us put him down. I know Dusty had a rough time getting him to sleep.\n\nI woke up around 7 am; I checked on all of my babies and they were all asleep, except for my oldest son, Aiden. I checked on Reid and he was still breathing and sleeping on his daddy’s chest.\n\nI am going to be straight up; I did not judge him nor think that Reid was in any danger sleeping on his chest that way. I have let each and every one of my four babies sleep on my chest at some point in time.\n\nSo I proceeded to get ready. I got dressed and ready to go to the hospital, to get my tubes tied. I had to leave soon but I still had a little time, so I decided that I would just go pick up a quick breakfast from McDonald’s, me and my son, Aiden.\n\nWe were getting in the car and I told him to go ask Mr. Dusty if he wanted anything for breakfast. THIS IS THE MOMENT WHEN MY WHOLE WORLD CHANGED. You see, asking Aiden to go ask Dusty what he wanted for breakfast, that is the ‘BEFORE.’ Not even two minutes later, Dusty comes running out with the baby in his hands screaming, “SOMETHING’S WRONG.”\n\n911 was called. I took Reid from him and tried to wake him and he wouldn’t wake up. Then I set him down on the seat of my car and performed CPR to the best of my ability. I did exactly how I was taught. I know I did it right because I could feel his lungs fill up with my breath. I could not bring him back. Some sort of bloody mucus came up, but it was too late. And Dusty, his father, had the same bloody substance right on his shirt, right on his chest, where his little head was rested.\n\nI did everything I could to bring him back. I knew it hadn’t been long because when I woke up to get ready to go to the hospital, he was alive.\n\nEMS came and they pronounced him dead on site. I knew if I couldn’t bring my baby back, then nobody could. From then on, I was in total shock. I already knew before the ambulance arrived that he was gone … gone forever. Now it is ‘AFTER.’ I went into shock, I called my family, I screamed, I cried.\n\nThe cops came in and took the half drank bottle, they questioned us, they went through our house, looked though everything. They made Dusty do a replay of what happened, while they videotaped us. They told us before they left, that they had to investigate.\n\nFrom all the stories that I hear now, I feel that we were lucky that whatever investigator we had could clearly see that there was no ill intent from the get-go. I have heard so many stories now ‘AFTER,’ how the investigator comes in and takes the other children as well, while they finish their investigation. I do not know how I would have lived had they taken my other children.\n\nThey called Dusty and told him it’s easily ruled possible suffocation due to co-sleeping, but I know that wasn’t the cause. I know my baby would’ve fought to breath. Dusty would have felt him kick and scratch and Reid could pick up his head for weeks, by this time.\n\nMy baby’s life ended. I had him for a short 11 weeks before he became a sweet, innocent angel.”\n\n“Things were a blur, the funeral was quick. Dusty’s birthday is June 3, so he really wanted to bury him before that day, so he would not have to associate it with his birthday date. Dusty was so strong for me, I do not know how he did it.\n\nWe went and stayed with his mom for a while; my family had my other three kids, so I knew that they were in good hands. I was not in any shape to take care of anyone at that point. I really couldn’t even take care of myself. I also never went through with having my tubes tied.\n\nI have a few good friends and a sister that were by my side. My sister even came and dressed me, fixed my hair, and did my makeup for the funeral. FOR MY CHILD’S FUNERAL. This is all still surreal to me; I cannot even tell you who all attended the funeral. I had tunnel vision to his casket and his lifeless body. I constantly picture his little hands folded in that casket, it is so damn sad.\n\nDusty and his mom went and cleaned out all of Reid’s things from my home. When I got home it was just like, he is gone – along with all of his things – like erased. I died, I literally died spiritually for about three to four weeks. I did not move off of my couch, at all. You may think I am exaggerating but I did not move. I didn’t eat, bathe, brush my hair, nothing. Dusty would force feed me vitamins. I made myself so sick from not eating. Then, I saw my other son, and I finally woke up and was like, what am I doing? I realized I had to get off that couch and live for my other three beautiful kids.\n\nThey needed me, especially my sweet, sweet Aiden. He is six and he saw EVERYTHING that I saw. He has that same terrible memory as I do. I found myself believing I was just in a nightmare and somebody would wake me up. When the smoke cleared a little more, I woke up again and said, what the hell am I doing? I have to do something about this. I already knew in my heart and soul that those vaccinations killed my son.\n\nI started researching, and I still cannot believe all the stories I found online that were just like mine. There are so many grieving mothers and fathers, siblings and family members.\n\nThe pain is still very fresh. I try to go visit him at his grave as much as I can, although it makes me so weak and ill. I just hate thinking about my sweet, sweet baby Reid in that damn box under the f—ing dirt (excuse my language). It is not fair; those vaccinations robbed my son of his whole life.”\n\n“I just wish people would wake up! Friends I have that have babies, they are getting them vaccinated. Do they not understand? I have this burning will and desire to do something, something for Reid. Please do not vaccinate your babies; if this can happen to me, it can happen to you, I swear. I just couldn’t help but think, not me, not MY Baby.\n\nI communicate with other mothers that lost children to vaccinations on the internet and also just random people that know and believe what I know now. It is amazing how people can be so passionate and loving about this topic when they have not had to experience the hurt themselves.\n\nSome dedicate much of their lives spreading the word about these poisonous vaccinations that are killing our babies and injuring people at any age. You know it is crazy, you never think that something like this could or would ever happen to you, and when it does, you would think that your family or your spouse would just be there for you the most, but the truth is, these strangers are the ones that are there, any time of the day and every day.\n\nI think that in a situation like this, the ones closest to you just do not know what to say. Of course, they have taken a loss as well, and maybe they are not strong enough to talk about it. My honesty is that I would love to talk about it every day, all day if I could. There is never a moment or a day that goes by that I do not think of my child who is not here with me. I know he is an angel and in a better place, but I still want him here with me.\n\nHis birthday is coming up and he will be a year old, which is something that I cannot even comprehend. I cannot even imagine what he would look like, all I will ever know him as is a two month-old, nine pound, sweet, sweet baby, with that crooked little smile and laugh. The pain is endless. My children are my world and I thank God that I have the other three that I do, because I cannot say whether I would still be here or not.\n\nTrust me, I had thought about suicide for the first time in my life when he died, but I just have this rule written on my heart that if you take the easy way out of this hell hole called Earth, then you don’t make it to the place where I know my sweet child is. I know people have different opinions on that, and that is okay. All I want to do is stop people from getting those vaccinations, but many will not.\n\nI spread the word and tell a shorter version of my story to every pregnant woman I see or every woman I see with a small child. I ask them even if they still get the shots to please, please, just go to your computer and type the words ‘My child died from vaccinations.’ I would like to think that at least I plant a seed in the mothers to at least google it. It does not take much to google it. YOU DO NOT KNOW WHAT I WOULD DO, TO GO BACK IN TIME AND BE A MOTHER WHO GOOGLED ‘BEFORE.’\n\nRaising awareness is what’s important now. Reid will always be important, but it’s too late for him, but it might not be too late for another sweet baby whose mom is about to let them shoot their kid up with poison.\n\nI also just want to say that occurrences like this affect your home greatly. My sweet child, Aiden, the one who was six and went inside to get Mr. Dusty right ‘BEFORE’ he witnessed everything, I cannot say that he is the worst child in the world because he is not, but I can say that he rarely acted out before, and I cannot say that today. Sometimes he just looks so sad, and I ask him what is wrong and he just says ‘nothing.’ For me, it is difficult to comprehend how seeing what he saw could make him act out, or have a bad attitude, but the professionals say that it does and it certainly did.\n\nI cannot tell you how much of my life is now spent with counselors, psychiatrists, psychologists, and a few different doctors. I go to family counseling and couples counseling. I cannot even hold a job at this point in my life, because I have too many appointments.”\n\n“I Wish I Could Portray The Pain So People Stop Vaccinating”\n\n“Everything that was wrong between Dusty and I was pushed to the back burner when this happened to Reid, now each thing is slowly coming up one by one. People keep telling me that families do not normally make it when such a tragedy happens, and at first I thought they were crazy, because at first, Dusty is the only one that could really feel my pain, we needed each other more than anything. But now I cry alone, I cry alone each and every day.\n\nI swear, it does not matter what room I am in, if I am digging for something in a drawer and find one of his socks, or a pair of pants, those little things you put over their hands to keep them from scratching their face, each time I find something, the first thing I do is smell it, man, how I wish I could just smell him again, but it never smells like him, then I just leave my face in it and cry and cry and cry. I am getting more and more used to seeing his things, so I have pulled some out and plan to make a quilt, or as many quilts as I can out of his things.\n\nI just wish that I could really portray the pain, so much to where every single person who reads this story does the research and never, ever vaccinates their children or themselves again. This will be a revolution before long and I hope and pray it does not take too many more babies lives before it does.\n\nSadly, I am trying to put off the final touches to Reid’s headstone, because then I will have nothing left to do for my son, my son that I am supposed to go to his grave to do things for.\n\nOne of the tasks is to make a 2 lined quote for his headstone, A 2 LINED QUOTE … Can someone please tell me how the hell I can sum this up in two lines? This is the hardest thing I have ever had to psychically do in my life. But sadly, the more and more I put it off, the more he is missing a beautiful headstone like he deserves.”\n\nThere Is No Closure To Losing A Child\n\n“In the beginning, Dusty and I promised ourselves that we would go to the grave site every single Friday. Well, it worked out for a month or two, but of course, life just started getting in the way.\n\nYou see, people easily forget when they are not the ones going through it. Some people will not say Reid’s name or make any references about him. Others will only think about him when it’s something to do with themselves, like they are the one who has lost greatly in this situation. Then there are others who so easily forget what we just went through together, I mean ones that were there, ones that were so close and did so much in the time of need, but so quickly can throw me away.\n\nYou really find out what type of person someone is, when something like this happens. I have cousins I grew up with that I personally invited to the funeral that didn’t even reply. And cousins that I didn’t grow with show up … sometimes blood isn’t thicker than water.\n\nFor a short time, I attempted to block all of this out, as if it never happened. I mean I didn’t really TRY to; I guess my brain subconsciously pretended like none of the aforementioned ever happened.\n\nI am not ashamed to say that am a recovering drug addict (and I stopped long before I was pregnant with Reid). I tried to cope with drugs, I mean Xanax in particular. I really feel like even a non-drug addict would need a Xanax to cope, which I am so glad I did, because I finally found something that the drugs could not take the pain away from.\n\nWhen I did use pills, they always took the pain away; that’s the worst thing about them is they actually work, but not anymore for me. I ended up flushing them down the toilet because they didn’t work anymore.\n\nThe point is, it DID happen, I was pregnant damn near 40 weeks and I did have that terrible C-section, I did hold him for that first time and I did have him for those 11 weeks. I told him at least 30 times a day that I loved him. No matter how quick his things were taken away, it was real and it always will be real. I will always have to deal with the fact that I had a child and he was so handsome and already funny. The best gift God can give you. And now that child is gone, gone forever.\n\nThey say that time is different in heaven than on Earth. Well, I will wait my time out because that is all I can do and the other pieces of my heart are here on earth, but I hope that when I get there and I hold him in my arms, that it only seems like I was gone for a minute to baby Reid.”\n\nVaccines Are Killing Children And The World Needs To Know\n\n“I will leave you with this thought: I am a mother who rarely would let my child outside until they are three months old because they did not have all their shots yet. I am very protective of my babies and I love them with all my heart. I now am a mother that understands that the very child that I protected, I allowed someone to shoot them up with so much mercury, considered a hazardous waste, aborted fetus DNA, formaldehyde, and the list goes on.\n\nSo, now all you mothers who think you are protecting those sweet children by doing the routine shots, I hope you think of that last statement as you watch them shoot your child up with poison.\n\nWAKE UP PEOPLE, WAKE UP BEFORE YOU LIVE THE REST OF YOUR LIFE WISHING SOMEONE WOULD WAKE YOU UP FROM THIS NIGHTMARE, ONLY TO REALIZE YOU ARE AWAKE!\n\nMan, do I ever wish I had that stairway to heaven or could be in two places at once. I knew the moment it happened it was the vaccines. It’s just so wrong and unfair. The pain, man, the pain, it’s just so unbearable. I really hope we do help save others. I just want something good to come out of this tragedy. I need for something good to come out of this. My son’s life and death cannot be swept under the rug.\n\nCommon sense, there has got to be a way of knowing if a baby truly suffocated. I just do not believe those people don’t know when anyone suffocates … I just don’t believe that it is even right or possible for them to say, ‘Ughh, maybe, possibly the baby suffocated,’ and rule that as the cause of death, which they did.\n\nYou will never get closure to losing your child. You have to learn to live with it.\n\nThe world does need to know how much this is happening, so there can be a change and they will stop murdering our babies. You know how I feel and I do not oppose calling a spade a spade.\n\nLike this is my child. My child I birthed. And now he is gone forever. Vaccinations murdered him. People, please wake up. Do not learn like me, by a tragedy!!!\n\nThis is my true story. ‘Bereaved Mothers have a time line of before/after.’ That is a quote I have never seen until ‘after,’ and now it defines me. I have 4 kids, 3 have beating hearts and are with me on this earth, and sadly, 1 has no beating heart and he lives in heaven as a baby angel.\n\nThis page is to honor my sweet child that was taken from me at 11 weeks old, due to his two month-old shots: Reid Thomas Englehart: Death by routine Vaccinations.”\n\nReid’s mother shares, “This is my sweet angel baby, Reid Thomas Englehart, born March 7, 2015. He died on May 29, 2015, just 9 days after he was given 8 vaccine doses his doctor said was safe. I miss him and love him so, so, so very much.”", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/", "site_name": "VacTruth.com", "title": "Louisiana Mother Knows 8 Vaccine Doses Killed Her 2 Month-Old Son | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/03/Christy-Day-Reid-Englehart-Vaccines-1.jpg", "description": "Two month-old Reid Thomas Englehart was vaccinated on May 20, 2015. He was given eight vaccine doses, which included the DTaP, Hib, polio, pneumococcal, hepatitis B and the oral rotavirus vaccines. These are the routine vaccines given to two month-old babies, even premature babies, in the United States and elsewhere. [1] At the time of …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "Vaccine Death", "article:section": "Injuries & Deaths", "article:published_time": "2016-03-07T07:01:00-05:00", "article:modified_time": "2017-11-23T09:40:50-05:00", "updated_time": "2017-11-23T09:40:50-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/03/Christy-Day-Reid-Englehart-Vaccines-1.jpg", "image:width": "615", "image:height": "315"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-injury/", "https://vactruth.com/author/augustina-ursino/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/", "https://twitter.com/share?text=Louisiana Mother Knows 8 Vaccine Doses Killed Her 2 Month-Old Son:&url=https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/&media=https://vactruth.com/wp-content/uploads/2016/03/Christy-Day-Reid-Englehart-Vaccines-1.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/03/07/8-vaccine-doses-killed-2-month-old-baby/", "https://vactruth.com/wp-content/uploads/2016/03/VAERS.jpg", "https://vactruth.com/wp-content/uploads/2016/03/Reid-after-receiving-morphine-e1457332792113.jpg", "https://vactruth.com/wp-content/uploads/2016/03/Vaccine-Record-e1457332912880.jpg", "https://www.facebook.com/ReidThomasEnglehartkilledby2monthvaccinations/?notif_t=fbpage_fan_invite", "https://vactruth.com/wp-content/uploads/2016/03/Christy-Dusty-and-Reid-e1457332992597.jpg", "https://vactruth.com/vaccine-schedule/", "http://www.hrsa.gov/vaccinecompensation/", "http://articles.mercola.com/sites/articles/archive/2008/12/13/why-vaccine-injured-kids-are-rarely-compensated.aspx", "https://vaers.hhs.gov/index", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "http://www.suboxone.com/", "http://www.suboxone.com/content/pdfs/prescribing-information.pdf", "http://www.healthcoalition.com/files/pinfo/RhoGAM-P.I..pdf", "http://www.scribd.com/doc/33874512/Merck-Vitamin-K-Package-Insert-Aquamephyton-PI#scribd", "https://www.gsksource.com/pharma/content/dam/GlaxoSmithKline/US/en/Prescribing_Information/Engerix-B/pdf/ENGERIX-B.PDF"], "authors": [], "publish_date": "2016-03-07T07:01:00-05:00"}