{"result_id": "331032", "URL": "https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/", "timestamp": "2023-04-25 17:52:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Japanese Government Continues to Ban the MMR Vaccine", "cleaned_text": "For many years, controversy has surrounded the three-in-one vaccine against measles, mumps, and rubella. Most notably, the MMR vaccine is infamous for its disputed connection to autism, and despite the fact that it has been blamed in vaccine courts for causing autism, vaccine supporters still deny its fault in skyrocketing rates of autism spectrum disorder, which is at least one in 68 children, with even higher rates of diagnosis among boys. [1, 2]\n\nHowever, the vaccine has other serious risks in addition to the relationship it has with unmanageable numbers of autism in children, which has led to a ban of this vaccine in one industrialized nation.\n\nThe Japanese government banned the measles, mumps, and rubella vaccine from its vaccination program in 1993, after a record number of children developed adverse reactions, including meningitis, loss of limbs, and death. [3]\n\nThe MMR vaccine was introduced in Japan in April 1989, and parents who refused the compulsory vaccine were fined. After three months of analysis, officials realized that one in 900 children developed adverse reactions to the vaccine, a rate that was 2,000 times higher than the expected rate.\n\nOfficials had hoped to resolve the problem by switching to another version of the vaccine, but the excessive amount of adverse reactions persisted, with one in 1,755 children affected. Testing of 125 children’s spinal fluid determined that the vaccines had entered one child’s nervous system, with two additional suspected cases.\n\nFour years later, in 1993, the government removed the MMR mandate against measles and rubella. A doctor from Japan’s Ministry of Health and Welfare admitted that the separate, individual doses of measles and rubella cost twice as much to administer, and he defended the decision, stating, “but we believe it is worth it.” Furthermore, a member of the health ministry also stated that the ban has not caused an increase in deaths from measles. [4]\n\nJapanese officials were also concerned about the MMR vaccine causing additional cases of mumps, citing numerous studies in The Lancet. [5]\n\nMumps and hepatitis B vaccines are not part of the national immunization program in Japan. [6]\n\nWhat Many Parents Don’t Know About the MMR Vaccine\n\nThe list of adverse reactions to the MMR vaccine, straight from Merck’s vaccine package inserts, is long and alarming. A shortened version of the vaccine damage associated with the MMR vaccine includes vomiting, diarrhea, anaphylaxis, ear pain, nerve deafness, diabetes, arthritis, myalgia, encephalitis, febrile seizures, pneumonia, and death. [7, 8]\n\nA search of the Vaccine Adverse Event Reporting System (VAERS) database shows the following statistics from the United States: over 75,000 adverse events have been reported from any combination of measles, mumps, and rubella vaccines, including, most notably:\n• 692 cases of gait disturbance (not being able to walk normally)\n• 748 cases of hypokinesia (partial or complete loss of muscle movement)\n\nAnd finally, in some cases, the vaccine has caused the very diseases it is supposed to prevent, with the following data reported to VAERS:\n\nThe number of adverse events following vaccination are vastly underreported, as acknowledged by the Centers for Disease Control and Prevention (CDC). The National Vaccine Information Center estimates that less than one to ten percent of adverse reactions to vaccines are reported. Many of the numbers reported above could therefore be multiplied by one hundred to determine a more accurate amount of adverse reactions. [10, 11]\n\nJapan Takes a Protective Stance Against Other Vaccines, Too\n\nThe flu vaccine has also been the subject of controversy in Japan, after 100 deaths occurred from the vaccine by the end of 2009. Japan’s health ministry has been criticized for for its cautious stance against vaccines, but so far, government officials have wisely defended their position, citing public safety as the paramount concern.\n\nFinally, the Japanese government has also taken a protective stance against vaccines on behalf of its young girls, suspending the human papilloma virus (HPV) vaccine in 2013 after numerous cases of serious adverse events were reported, with one report citing as many as 1,968 adverse events, 358 of which were classified as serious.\n\nJapanese officials were concerned about the well-being of their young citizens, despite having invested $187 million in the program. Damage payments to only a fraction of the victims who have suffered adverse reactions to the HPV vaccine have reached $6 million. [12]\n\nAdditionally, since 2011, at least 38 infants have been reported to have died after they had been vaccinated against haemophilus influenza B and streptococcus pneumonia, according to records compiled by the health ministry in Japan.\n\nJapan has been criticized for being behind the times when it comes to vaccination. Vaccine advocates claim that Japan has not kept pace with other developed countries regarding the use of vaccines. Despite listing 110 infectious diseases in a government registry, Japan offers vaccines for only 22 of those.\n\nSome Japanese health experts disagree, however. Hiroko Mori, a vaccine researcher, is one of those experts. He was the former head of the infectious disease division at Japan’s National Institute of Public Health.\n\nHe has noted that Japan has one of the lowest infant mortality rates in the world and has advocated for fewer vaccines, stating that the country’s excellent sanitation and nutrition has boosted children’s health.\n\n“Medicine is supposed to be about healing, but babies who cannot speak are being given unnecessary shots because parents are scared. Children are losing their ability to heal naturally.\n\nThere are so many people who have suffered side effects. All we are asking is to establish the right to say ‘no.’ The right to choose should be recognized as a fundamental human right.”\n\nTetsuo Nakayama, Dean of Kitasato University’s Graduate School of Infection Control Sciences, is an expert who supports vaccines, but he, too, acknowledges the risks of vaccination, stating that:\n\n“There is no guarantee that your child will not be that one out of 1,000. You have to compare the risks between the side effects and what will happen if you are infected with the disease naturally.\n\nUnder the existing law, the decision to vaccinate your child or not is basically left up to the parents, but there is not enough information out there for them to make an informed decision.”\n\nMasako Koga, a former representative of the Consumers Union of Japan, has shared his concerns about the ulterior motives behind mass vaccination programs:\n\n“Vaccines should only be given to those who need them but that is not happening. The global industry is being driven by a strategy that promotes VPD [vaccine preventable diseases].\n\nWe must put a stop to it. Vaccines have close ties to money. From development to circulation to research on side effects, there are a lot of vested interests involved.”\n\nHe also summarized what motivates many parents’ decisions not to vaccinate their children:\n\n“There is no knowing who will suffer side effects as a result of vaccination.\n\n[Proponents of vaccination] say the chance of suffering a side effect is 1 in a million. For parents, however, that one is everything.”\n\nJapanese officials have made decisions that value the health and safety of their citizens when they have removed vaccines with dangerous side effects from their national vaccination program.\n\nJapan boasts a low infant mortality rate, despite — or perhaps because of — mandating only a fraction of the vaccines required by other developed countries, including the United States.\n\nIf you wish to learn more about the harmful ingredients in vaccines or the potential adverse reactions, we have compiled an easy-to-navigate list of vaccine package inserts from the manufacturers that you can view or download here.\n\nHas your child suffered an adverse reaction to the MMR vaccine or the HPV vaccine, both of which have been removed from Japan’s national vaccination program? If so, please share your story in our comment section below.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/", "site_name": "VacTruth.com", "title": "Japanese Government Continues to Ban the MMR Vaccine | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/06/japanese-mmr.jpg", "description": "For many years, controversy has surrounded the three-in-one vaccine against measles, mumps, and rubella. Most notably, the MMR vaccine is infamous for its disputed connection to autism, and despite the fact that it has been blamed in vaccine courts for causing autism, vaccine supporters still deny its fault in skyrocketing rates of autism spectrum disorder, …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "vaccinetruth", "article:tag": "Vaccine Death", "article:section": "Law & Policy", "article:published_time": "2016-06-23T11:39:01-04:00", "article:modified_time": "2017-11-26T06:55:12-05:00", "updated_time": "2017-11-26T06:55:12-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/06/japanese-mmr.jpg", "image:width": "640", "image:height": "428"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-law-policy/", "https://vactruth.com/author/missyfluegge/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/", "https://twitter.com/share?text=Japanese Government Continues to Ban the MMR Vaccine:&url=https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/&media=https://vactruth.com/wp-content/uploads/2016/06/japanese-mmr.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/06/23/japanese-government-bans-mmr-vaccine/", "https://vactruth.com/vaccine-inserts/", "http://www.naturalnews.com/041897_MMR_vaccines_autism_court_ruling.html", "http://www.cdc.gov/ncbddd/autism/data.html", "http://www.dailymail.co.uk/health/article-17509/Why-Japan-banned-MMR-vaccine.html", "http://news.bbc.co.uk/2/hi/asia-pacific/1808316.stm", "http://www.healthy.net/Health/Article/UPDATES/7591", "http://www.japantimes.co.jp/life/2014/10/04/lifestyle/vaccination-choice-two-unknowns/#.V2GZnc6XGkg", "http://www.merck.com/product/usa/pi_circulars/m/mmr_ii/mmr_ii_pi.pdf", "http://www.merck.com/product/usa/pi_circulars/p/proquad/proquad_pi.pdf", "https://vaers.hhs.gov/data/data", "http://www.cdc.gov/vaccines/pubs/surv-manual/chpt21-surv-adverse-events.html", "http://www.nvic.org/faqs/vaccine-reactions.aspx", "http://www.tokyotimes.com/side-effects-in-young-girls-take-gardasil-out-from-japanese-market/", "https://www.flickr.com/photos/alexxis/5287348012/in/photolist-94e3mC-dbDrys-5p2b8r-7kmjXk-bdcVzZ-d3vRRh-dZ2b4Q-98L2ok-bHAKgz-au1ytb-7Fu3so-8zNjPY-aqaP8R-94aXBn-NDyYT-94aXFi-94e3wU-94e3vY-94e3Am-94aXMp-94e3uU-94aXCa-mZhQ1Z-94e3t9-dut7z-94e3Bb-d9UiuJ-9a8nav-cNFatj-darZ9F-5hBVg4-ns6RAD-pw1ktF-egbV2Y-fNv2oD-4NaJuU-7RPa4p-dRCgKq-9vD26N-pFCpkm-iNpH9k-8zK9gg-f3dsbx-bmvkSd-7eddkw-2rZa3o-grbBB-ooH9Fz-94e3Fw-94e3zo"], "authors": [], "publish_date": "2016-06-23T11:39:01-04:00"}