{"result_id": "331030", "URL": "https://vactruth.com/2017/08/16/school-vaccine-threats/", "timestamp": "2023-04-25 17:52:15 CEST+0200", "meta": {"description": "Misleading news sources are reporting that children need a back to school vaccine regimen to attend public schools, failing to mention vaccine exemptions.", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2017/08/16/school-vaccine-threats/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "What Every Parent Needs to Know About Back to School Vaccine Threats and Exemptions", "cleaned_text": "Dozens of recent news headlines offer threats to parents that a back to school vaccine regimen is required for their children be allowed to attend school. Some of these reports may only mention vaccine exemptions in a brief sentence at the very end of the article. However, many of these articles fail to mention anywhere that vaccine exemptions are available and allowed in all fifty states. [1]\n\nThese misleading news sources are doing their readers a great disservice by not informing parents that their children do not need to be vaccinated to attend public schools.\n\nA writer from the Omaha World Herald stated that seventh graders in Iowa must be vaccinated against meningitis, claiming “the immunization requirement was changed by the Iowa Legislature and adopted by the Iowa Department of Health in January.” She failed to report that in Iowa, parents may obtain a medical or religious vaccine exemption for their child. [2]\n\nAnother Iowa news source, KCCI Des Moines, erroneously published a headline claiming “Thousands could miss school over mandatory meningitis vaccination.” At the end of their story, they reported that “although the vaccination is mandatory, some students may be exempted for medical or religious reasons.” All, not just some, students in Iowa are indeed eligible for medical or religious exemptions. [3]\n\nA recent editorial published by the Jacksonville Journal Courier claims that vaccinations are the “most important back-to-school need” for students in Illinois. The writer admonishes parents that, in addition to a mandate for the chicken pox vaccine “there also are requirements to guard against pertussis, polio, tetanus, diphtheria, influenza, pneumonia, hepatitis and tetanus.” [4]\n\nThe article mentions that some Illinois parents have claimed religious exemptions, but fails to mention that in Illinois, medical exemptions are also available.\n\nA short reminder published on the Florida Keys News website tells parents, “Don’t forget vaccinations as the start of school nears.” News staff claimed, “The following vaccines are required for children entering preschool and kindergarten through grade 12: Diphtheria, tetanus, pertussis (whooping cough), measles, mumps, rubella, polio, varicella (chickenpox) and hepatitis B.” This media source completely failed to inform its audience that in Florida, medical and religious exemptions are available. [5]\n\nA report published by The Leader-Herald detailed a long list of New York state vaccine requirements for children attending day care or school, but again, this warning to parents did not share a single word of information about the medical and religious exemptions that are available in New York. [6]\n\nThere are hundreds of editorials, articles, and reminders to parents just like these, warning them that vaccines are required for their child to attend school or public day care, but failing to inform parents that may claim an exemption for their child.\n\nParents must consider the reasons why news sources are sharing misleading information about vaccines. These media outlets may receive revenue and other funding from pharmaceutical companies and hospitals, both of which benefit from increased vaccine sales.\n\nAs we have reported previously in 8 Reasons Why Your Child’s Doctor Pushes Vaccines, doctors can be eligible for financial incentives and large bonuses when they achieve a high rate of vaccination among their patients.\n\nBecause the mainstream media has financial interest in promoting vaccines, informed parents must seek information elsewhere about back to school vaccine mandates and exemptions. Parents, as you prepare to send your child back to school, do your homework and determine which exemptions are available in your area. A list of vaccine exemptions for all fifty states is published online by the National Vaccine Information Center.\n\nSharing this article with other parents will also help them make informed decisions about vaccines.", "opengraph": {"type": "article", "url": "https://vactruth.com/2017/08/16/school-vaccine-threats/", "site_name": "VacTruth.com", "title": "What Every Parent Needs to Know About Back to School Vaccine Threats and Exemptions | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2017/08/backtoschool.jpg", "description": "Misleading news sources are reporting that children need a back to school vaccine regimen to attend public schools, failing to mention vaccine exemptions.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "vaccinetruth", "article:tag": "Vaccine Exemptions", "article:section": "Law & Policy", "article:published_time": "2017-08-17T03:25:55-04:00", "article:modified_time": "2017-11-23T10:00:59-05:00", "updated_time": "2017-11-23T10:00:59-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-law-policy/", "https://vactruth.com/author/missyfluegge/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2017/08/16/school-vaccine-threats/", "https://twitter.com/share?text=What Every Parent Needs to Know About Back to School Vaccine Threats and Exemptions:&url=https://vactruth.com/2017/08/16/school-vaccine-threats/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2017/08/16/school-vaccine-threats/&media=https://vactruth.com/wp-content/uploads/2017/08/backtoschool.jpg", "https://plus.google.com/share?url=https://vactruth.com/2017/08/16/school-vaccine-threats/", "https://vactruth.com/2016/08/06/8-reasons-doctors-push-vaccines/", "http://www.nvic.org/vaccine-laws/state-vaccine-requirements.aspx", "http://www.nvic.org/vaccine-laws/state-vaccine-requirements.aspx", "http://www.omaha.com/livewellnebraska/health/council-bluffs-doctors-offices-expect-spike-in-visits-for-new/article_aec3da12-b3fc-529e-8074-af4aa8869608.html", "http://www.kcci.com/article/thousands-could-miss-school-over-mandatory-meningitis-vaccination/10354308", "http://www.myjournalcourier.com/news/112531/editorial-immunizations-most-important-need-for-back-to-school", "http://www.flkeysnews.com/news/local/education/article165642137.html", "https://www.leaderherald.com/news/local-news/2017/08/children-need-to-be-immunized-for-school/", "https://www.flickr.com/photos/thebriscoes/29816495862/in/photolist-MqMkqS-98ENZC-5Wd7NF-UTEgxq-Uiav5H-9wMoWu-VX85BY-7xc5gj-e5VgJ2-ocmmKM-V19qPa-5fLBP7-SkqYde-3tRPCb-hKffr4-QPJ7at-hKeHJA-ywFuhS-9wJsCt-9Eu9Jt-pcVwx2-TsT3WY-nkVsBC-XitLti-9AdoS9-nAnwfm-phQuxD-osKYyf-4Mm1eX-7jgdKs-hEpHT2-VhAjxr-Te8fiv-7wWEjH-b8fDw6-8ASMaZ-nsDB84-5L4mdS-88bgji-VhAhPg-mkNTKv-QMeFXu-cantHN-g8kTYW-HyRmPT-hKe9Gc-d1vieS-7RkgXq-8YabCE-V7UhMZ"], "authors": [], "publish_date": "2017-08-17T03:25:55-04:00"}