{"result_id": "331029", "URL": "https://vactruth.com/2017/12/03/protecting-vaccine-choice/", "timestamp": "2023-04-25 17:52:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2017/12/03/protecting-vaccine-choice/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Protecting Vaccine Choice in Colorado: Part 1", "cleaned_text": "Colorado is one of sixteen states in the US in which parents are allowed, by law, to claim personal belief, religious, or medical exemptions from vaccinating their children. Thirty-two other states allow for religious and medical exemptions. Only two states, California and Mississippi, deny all exemptions except by doctor approval.\n\nAlthough these rights have been protected by statute in Colorado since 1963, there are constant corporate, legislative, and administrative attempts to restrict and even eliminate these rights. California, for example, recently passed legislation which eliminates nearly all vaccine choice; every child, every shot, no exceptions, no exemptions.\n\nThe rare medical exemption can still theoretically be obtained. Californian doctors, however, must follow stringent official guidelines and they risk persecution from the medical establishment if they dare to follow their own professional judgment in providing exemptions. Engaged citizens are doing everything we can to prevent that from happening in Colorado.\n\nContrary to official mythology, vaccine refusal did not begin with Dr. Andrew Wakefield and Jenny McCarthy.\n\nOpposition to vaccination has existed as long as the practice of vaccination itself. In 1885 the town of Leicester, England held a demonstration in which 80,000-100,000 citizens protested compulsory vaccinations. The city decided to forgo mandatory smallpox vaccines and developed instead a sanitation and quarantine program to effectively deal with the disease.\n\nLeicester’s vaccination rates dropped to below 10%, yet, the city’s death rate was one third of the country’s vaccinated population. In 1898 the British government introduced a “conscientious objector” exemption. This clause allowed parents to opt out of compulsory vaccination and is the origination of the term which would later become associated with those who refuse join the army.\n\nOn April 19, 1982 NBC aired the Emmy award winning documentary called DPT: Vaccination Roulette. This prime time broadcast detailed adverse reactions to the DPT shot.\n\nThe National Vaccine Information Center (NVIC) was also founded in that year and launched the vaccine safety and informed consent movement in America.\n\nNVIC is the nation’s oldest and largest consumer led organization advocating for vaccine safety and informed consent. In 1985, Harris Coulter and Barbara Loe Fisher, one of the cofounders of NVIC, published the unprecedented book, A Shot in the Dark. This was the first book to alert the public about the link between vaccinations and neurological injuries.\n\nThe right to vaccine exemptions in Colorado was codified in 1963 and reenacted in 1978. Specifically, CRS 25-4-903 states that a parent may obtain an exemption from vaccines by:\n\n“…submitting to the student’s school a statement of exemption signed by one parent or guardian … is an adherent to a religious belief whose teachings are opposed to immunizations or… has a personal belief that is opposed to immunization.”\n\nFor more than fifty years, most parents who chose to opt out of one or more vaccines simply signed the back of the State’s “Certificate of Immunization” stating their preference. (The word ‘Immunization’, it must be noted, is inaccurate and, by its very use, is misleading.\n\nThe act of getting a prescribed shot, or series of shots, does not absolutely confer immunity. It is estimated that as much as 10% of the population receive no immunity from any given shot. The correct term really is ‘Vaccination’, the root word of which is ‘vacca’ which means cow. The original smallpox vaccination was the pus from the udder of a cowpox infected cow, smeared into an open cut on one’s arm.)\n\nThe vaccine exemption process in Colorado has always been simple, effective, respectful, and, because it was provided directly to the school, protected by the Federal Educational Records Privacy Act (FERPA). For most parents who choose to forego or limit vaccines, it is not an act of protest or outrage.\n\nIt is simply the result of their careful consideration of the potential harm versus the potential benefit for the suggested vaccines. In 1983, 12 shots containing 34 vaccine doses were recommended, today in 2017, the schedule has expanded to more than 70 doses by age 18.\n\nIn 2007 the passage of what is known as the Immunization (there’s that word again!) Registry Act C.R.S. 25-4-2403, established, among other things, the state’s ability to create “a comprehensive immunization tracking system with immunization information gathered by state and local health officials”.\n\nNowhere in the 2007 law was it proscribed that the registry, now expanded to a privately run, multi-million dollar data tracking system known as the Colorado Immunization Information System (CIIS), be mandatory. As a matter of fact, clear provisions were made in the law to keep the system voluntary, confidential, and not for profit.\n\nAn often ignored piece of this legislation states that any notice that provides information on vaccinations shall also inform the recipient of “the option to refuse an immunization on the grounds of medical, religious, or personal belief considerations”.\n\nIn 2014, House Bill 1288 was introduced to curtail vaccine exemptions and closely track those who chose to use them. At that time there were only a few parents in Colorado who were actively involved in the legislative and legal protection of vaccine choice.\n\nOthers found out about the bill through an action alert from NVIC and came to the Capitol to testify against the bill. Even though their efforts were largely unorganized, the testimony offered was, according to one legislator, “the most coherent and intelligent of any group” he had ever seen.\n\nA deeply amended version of bill did pass. But the most onerous part of the bill, which would have forced exempting parents to complete a state and industry sponsored on-line ‘reeducation’ module, was removed. HB 14-1288, as passed, merely instructs schools to have their aggregate vaccine uptake rates available to the public and directs Colorado Department of Health and Environment (CDPHE) to promulgate rules regarding the frequency of submission of exemptions.\n\nThanks to active citizen engagement, the law does not authorize CDPHE to demand the use of “official” exemption forms, it does not give CDPHE permission to alter the legislatively approved exemption process, and it does not restrict vaccine choice in Colorado.\n\nThis article originally appeared in the Q3 2017 Regenerate Magazine.", "opengraph": {"type": "article", "url": "https://vactruth.com/2017/12/03/protecting-vaccine-choice/", "site_name": "VacTruth.com", "title": "Protecting Vaccine Choice in Colorado: Part 1 | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2017/12/vaccine-choice-colorado.jpg", "description": "Colorado is one of sixteen states in the US in which parents are allowed, by law, to claim personal belief, religious, or medical exemptions from vaccinating their children.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "vaccine choice", "article:section": "Law & Policy", "article:published_time": "2017-12-03T16:57:02-05:00", "article:modified_time": "2017-12-04T03:11:47-05:00", "updated_time": "2017-12-04T03:11:47-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2017/12/vaccine-choice-colorado.jpg", "image:width": "640", "image:height": "477"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-law-policy/", "https://vactruth.com/author/phil-silberman/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2017/12/03/protecting-vaccine-choice/", "https://twitter.com/share?text=Protecting Vaccine Choice in Colorado: Part 1:&url=https://vactruth.com/2017/12/03/protecting-vaccine-choice/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2017/12/03/protecting-vaccine-choice/&media=https://vactruth.com/wp-content/uploads/2017/12/vaccine-choice-colorado.jpg", "https://plus.google.com/share?url=https://vactruth.com/2017/12/03/protecting-vaccine-choice/", "http://www.nvic.org/Vaccine-Laws/state-vaccine-requirements.aspx", "http://www.vaccinationcouncil.org/2013/08/27/vaccination-a-mythical-history-by-roman-bystrianyk-and-suzanne-humphries-md/", "https://www.youtube.com/watch?v=VtOh6vFnWg4", "http://www.nvic.org", "http://cdpsdocs.state.co.us/safeschools/Legislation/HB%2014-1288.pdf", "https://ccfvc.org/", "http://www.nvic.org/Vaccine-Laws/state-vaccine-requirements.aspx", "http://www.vaccinationcouncil.org/2013/08/27/vaccination-a-mythical-history-by-roman-bystrianyk-and-suzanne-humphries-md/", "https://www.youtube.com/watch?v=VtOh6vFnWg4", "http://www.nvic.org", "http://cdpsdocs.state.co.us/safeschools/Legislation/HB%2014-1288.pdf", "https://leg.colorado.gov/sites/default/files/documents/audits/1417p_immunization_program-use_of_tobacco_settlement_funds_performance_audit_january_2016_department_of_public_health_and_environment_11.pdf", "http://www.ccfvc.org", "http://www.ccfvc.org", "http://www.denverpost.com/2016/03/15/the-real-goal-of-hb-1164-colorado-vaccination-bill", "http://ccfvc.org/vaccine-exemption-authority.html", "https://www.colorado.gov/pacific/cdphe/vaccine-exemptions", "http://ccfvc.org/cdphe-phishing-scam.html", "https://www.hslda.org/hs/state/co/201609020.asp", "http://ccfvc.org/colorado-exemption-law.html", "http://www.chalkbeat.org/posts/co/2016/06/29/six-charts-that-explain-whos-getting-vaccinated-in-colorado-and-whos-not/", "https://coloradopolitics.com/long-sb17-250-clarifies-vaccine-exemption-policy-colorado-schools-parents/", "https://issuu.com/regeneratemagazine/docs/regeneratemag7-17onlinemr?e=26800726/50464176", "https://www.flickr.com/photos/framphoto/7380316242/"], "authors": [], "publish_date": "2017-12-03T16:57:02-05:00"}