{"result_id": "331017", "URL": "https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "timestamp": "2023-04-25 17:52:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "A Truthful Vaccine Consent Form – That No Mom Could Ever Sign", "cleaned_text": "The duty and responsibility for ascertaining the quality of the consent rests upon each individual who initiates, directs or engages in the experiment. It is a personal duty and responsibility which may not be delegated to another with impunity.(1)\n\nThose are the closing words of the first tenet of the Nuremberg Code – informed consent – and make no mistake about it – from the most personal of parental perspectives, vaccination’s a macabre experiment, every time: no parent can be certain that a vaccine won’t permanently disable her child.(2) Egregiously, the administering doctor or nurse – or CVS pharmacist – in no way meaningfully fulfills his obligation by providing incomplete information, printed on a form he may or may not even offer, all the while touting the safety and effectiveness of the vaccine.\n\nMore fundamentally, the medical industry in no way fulfills its obligation when it omits from medical school curricula any meaningful education in the reality, nature or extent of vaccine injury, or the essential, fundamentally curative role of the disease recovery process.(3)\n\nLargely because of the internet, it’s now well known that many vaccinated kids develop the very diseases against which they’re supposedly protected. Indeed, there have been outbreaks of the various childhood diseases in which 100% of the kids were vaccinated.(4) Yet, the diagnostic bias which prompts a doctor to virtually discard the possibility of a disease in a patient who’s been vaccinated against it is commonplace, flying in the face of logic – and of good medical practice; of the very interests of the patient.\n\nIndeed, the effectiveness of vaccines is an illusion, a contrivance, the most biting example of which is polio. When following on the heels of the release of the polio vaccine the CDC in 1955 changed the diagnostic parameters of paralytic polio from twenty-four hours of paralysis to sixty days(5), they automatically eliminated 60% of the cases thenceforth to be diagnosed – around 9,000 each year. How arbitrary! Had they simply made it ninety days, they could likely have wiped out another 15%, since, despite the well-constructed public perception that polio disables you for the rest of your life, the great majority of patients ultimately recover. The most astounding change, however, was in the definition of a polio epidemic, from 20 in a population of 100,000, to 35, overnight cutting virtually in half the likelihood that any subsequent outbreaks would be so labeled, as though the severity, or importance, or noteworthiness of paralytic polio had suddenly diminished by half. The result, of course, as with the incidence of the disease itself, was not a real, but a semantic elimination of epidemics.\n\nThe industry has answered the increased awareness that vaccinated kids can develop the diseases anyway with an illusory promise: that though vaccination may not prevent infection, it’ll make the disease less severe. Obviously there can be no guarantee that that will be the case, since the severity of disease is dependent on so many individual factors other than the mere presence of the pathogen, and, there’s no way to back out of vaccination – on an individual basis, no way to compare, thus no way to know.\n\nThe most inane vaccine myth is that the unvaccinated are somehow a threat – walking, eternal disease vectors. It’s an absurdity. Certainly they are no more a threat than the vaccinated. Kids and adults alike breathe communal air, drink from communal fountains, touch communal doorknobs – potential pathogens can be picked up, carried and transmitted by anyone. Anyone, vaccinated or not, can become infected, and begin infecting others during the typical incubation period of three to five days, or more.\n\nRecently removed or renovated simply because the vaccine awareness community became aware of them, both the Johns Hopkins and St. Jude’s hospitals maintained on their websites advisories to immunocompromised patients, warning against allowing visits from anyone recently vaccinated with a live virus vaccine. Despite the hasty changes, the point is still made: neither hospital mentioned, or mentions, a word about unvaccinated kids being any kind of threat.\n\nNo – the reality is opposite, and sobering. We know from the 2013 FDA announcement that anyone vaccinated for whooping cough can develop an asymptomatic infection if subsequently exposed to the disease, and infect others for up to six weeks.(6) The presence of the vaccine-induced antibodies, produced without the participation and guidance of the innate immune system in the mucous membranes and gut, the first responder to natural exposure, convolutes the response process. In the case of whooping cough, then, the vaccination morphs the recipients into potential Trojan horses – the very disease vectors the uvaccinated are claimed to be.\n\nThe Lancet-published Ronne study(7) is revelatory. The title alone – Measles Virus Infection Without Rash in Childhood is Related to Disease in Adult Life – is a statement, telling us much: that measles rash isn’t only skin deep; that it’s the manifestation of a thorough cleansing, protecting the child against diseases later in life; that Mother Nature’s no fool, and is indeed gracious in unexpected ways, using the disease process early in life to prepare the child for successful adulthood. The study’s poignant in its text, as well:\n\nThe presence of measles virus specific antibodies at the time of infection interferes with the common immunological response to measles virus, especially with the development of specific cell-mediated immunity;\n\nIntracellular measles virus may then survive the acute infection, and cause diseases which develop in adulthood;\n\nThere is a highly significant association between the phenomenon of missed measles rash and later development of immunoreactive diseases, sebaceous skin diseases, degenerative diseases of bone and cartilage, and certain tumours.\n\nA Boston University(8) study corroborates, showing us that during a measles outbreak on that campus, not only were some of the vaccinated kids able to develop a full blown case of the disease, but the majority of them, with remaining vaccine induced antibody titers >120, were still able to develop the infection and accompanying respiratory symptoms, but not the rash. Measles is spread through respiration, so those students were likely able to infect others.\n\nNatural measles isn’t alone in its provision of protection against more serious, chronic disorders – mumps is significantly associated with protection against ovarian cancer.(9) It would be foolhardy to assume those are the only two diseases that may ultimately leave the person fundamentally in better health than before the infection developed.\n\nNot until the live virus varicella – chickenpox – vaccine was licensed and used, in 1995, did we see regularly reported occurrences of shingles in babies and toddlers. More serious and painful than chickenpox, shingles is a reactivation of the chickenpox virus, traditionally reserved for adults and the elderly.(10) Again, we see the evidence that because of its unnatural route of introduction vaccination, rather than preventing disease, simply masks it and thwarts its natural display.\n\nThe toxins in vaccines are by this time legendary – mercury, aluminum, formaldehyde, MSG, and more.(11) It’s virtually surreal to read the toxic hazard information and warnings associated with the ingredients in vaccines, while aware that they’re injected into millions, including newborns, infants, babies and toddlers. The damage they do, from minor and barely discernible to catastrophic and fatal, can hardly be called side effects; they’re the effects of the vaccines. The nature of vaccination and its unavoidable threat is clear in the government’s list of recognized injuries alone: anaphylactic shock; brachial neuritis; encephalopathy; chronic arthritis; thrombocytopenic purpura; and all the disorders and complications that may accompany them.(12) Historically, they include transverse myeltitis, Guillain-Barré Syndrome, cardiac arrest, death – and more.(13) Indeed, with virtually no exception, any vaccine can brain damage a child, and there’s no way known to predict who will so succumb, nor could there be, since it’s dependent on so many factors unique to each individual.\n\nThe exact same reasoning and logic apply to the simple fact that any vaccine can kill a child. Critically, vaccine toxins can accumulate in the body, so there’s simply no way to know whether the next introduction of neurotoxins will be the one to break the camel’s back. As well, the child’s vulnerability is forever changing, dependent primarily on nutrition, rest and environmental exposures to toxins – ironically, the most intimate and egregious of which are the previous vaccines. Vaccination’s simply a vortex of gathering likelihood of catastrophic reaction.\n\nFlying in the face of both decency and free market, neither vaccine manufacturers nor the medical establishment that administers and extolls the praises of vaccines are liable for any of the extensive damage they do, protected by the 1986 National Childhood Vaccine Injury Act and subsequent SCOTUS decision.(14)\n\nWe come to infectious disease, the underlying source of the vaccine industry’s nefarious success, and a distinction must be made. We call the dis-ease, the discomfort associated with illness, the disease, when it’s quite literally the cure, the display of the immune system at work, detoxing – eliminating the infection, deeply cleansing the body and returning it to wellness, with an innate intelligence far beyond the ken of science, as demonstrated by the aforementioned long term protections gained during the process.\n\nThe National Institutes of Health tells us that fever works for, not against the person – emphasis theirs; and that it can rise to over 107o with typically no damage expected.(15) Indeed, we read stories of new parents who have allowed the fever in their sick baby to take its natural course; of how the temperature rose to 103 or 104, or higher, but was short-lived – and successful; the baby recovered quickly and efficiently. The immune system’s exquisitely designed, and unreproducible, the engine of both disease prevention and disease recovery. Recovery from infectious disease often requires no special regimen, but when treatment is needed, the only rational approach, assuming there’s no truly critical, life-threatening condition, is to support the workings of the immune system, rather than use pharmaceuticals to artificially suppress the very processes that are eliminating the illness.\n\nThe tools that have been used to support the enormous recuperative powers of the body might surprise some. During the infamous Spanish flu pandemic of 1918, allopathic hospitals in the U.S. were losing more than 30% of their patients, while homeopathic hospitals lost only 3% or so. Poignant, however, is the report of the success of naturopath Dr. R. Lincoln Graham, who lost none of the many patients he treated in his clinic. His regimen: put the patient on a fast upon entry to the clinic; give a glass of spring water every hour; and give an enema each day. Picking up on the reported success of the treatment, another naturopath began implementing it, ultimately remarking that the complete recovery thus afforded his patients had become so expected as to be routine.(16)\n\nVitamin A for measles; vitamin C for whooping cough and many other illnesses – the list is long, and the resources many(17), and there are ample tales of people who’ve gone through entire lives, to old age, never having been vaccinated, never having taken an antibiotic, and never having visited a doctor other than for a fractured bone or other such injury.(18) The information’s so abundant, indeed, that it’s impossible that the infamous powers that be – those who control the policies and public face of the vaccine industry, at all levels – government, manufacturers, medical establishment and media – aren’t aware of it. It’s a darkly foreboding sign, then, that we’re all so well aware that the form I’ve provided, which is accurate in its statements, which meaningfully honors informed consent, and which no mom who still maintains a thread of connection to her instincts would ever sign, will never be provided by the AAP.\n• Clinical trial, phase IV: Studies are done after the drug or treatment has been marketed to gather information on the drug’s effect in various populations and any side effects associated with long-term use. http://www.nlm.nih.gov/services/ctphases.html\n• Access any of the MD interviews in the archives of The Vaccine Myth: An Issue of Trust http://www.VaccineMyth.org\n• You can request a copy of the Ronne Study at TheVaccineMyth@gmail.com\n• “After you’ve had chickenpox, the virus lies inactive in nerve tissue…Years later, the virus may reactivate as shingles.” http://www.mayoclinic.org/diseases-conditions/shingles/basics/definition/con-20019574\n• Immunization: The Reality Behind the Myth, by Walene James, pp. 116 – 117.", "opengraph": {"type": "article", "url": "https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "site_name": "VacTruth.com", "title": "A Truthful Vaccine Consent Form – That No Mom Could Ever Sign | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2015/05/vaccine-consent.jpg", "description": "Read the form which no mom who still maintains a thread of connection to her instincts would ever sign, and will never be provided by the American Academy of Pediatrics.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "Vaccine Consent Form", "article:section": "Logical", "article:published_time": "2015-05-25T17:08:46-04:00", "article:modified_time": "2015-05-25T17:32:51-04:00", "updated_time": "2015-05-25T17:32:51-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2015/05/vaccine-consent.jpg", "image:width": "640", "image:height": "427"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/logical/", "https://vactruth.com/category/writers/shawn-siegel/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/shawn-siegel/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "https://twitter.com/share?text=A Truthful Vaccine Consent Form – That No Mom Could Ever Sign:&url=https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/&media=https://vactruth.com/wp-content/uploads/2015/05/vaccine-consent.jpg", "https://plus.google.com/share?url=https://vactruth.com/2015/05/25/truthful-vaccine-consent-form/", "http://www.hhs.gov/ohrp/archive/nurcode.html", "http://www.nlm.nih.gov/services/ctphases.html", "http://www.VaccineMyth.org", "http://www.healthymuslim.com/articles/gjuqe-measles-outbreak-among-100-vaccinated-high-school-students---illinois-1993.cfm", "http://www.greatmothersquestioningvaccines.com/uploads/2/8/8/8/2888885/ratner_1960.pdf", "http://www.fda.gov/newsevents/newsroom/pressannouncements/ucm376937.htm", "#page_scan_tab_contents", "http://onlinelibrary.wiley.com/doi/10.1002/1097-0142%28196607%2919:7%3C1001::AID-CNCR2820190714%3E3.0.CO;2-S/abstract", "http://www.mayoclinic.org/diseases-conditions/shingles/basics/definition/con-20019574", "http://vaxtruth.org/2011/08/vaccine-ingredients/", "http://www.hrsa.gov/vaccinecompensation/vaccinetable.html", "http://www.mctlawyers.com/vaccine-injury/cases/", "http://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "http://www.nlm.nih.gov/medlineplus/ency/article/003090.htm", "http://astore.amazon.com/wellwithin?_encoding=UTF8&node=3", "http://www.vaccineinjury.info/component/content/article/469-stories-of-unvaccinated-children.html?showall=1", "https://www.flickr.com/photos/benmcleod/406567271/"], "authors": [], "publish_date": "2015-05-25T17:08:46-04:00"}