{"result_id": "331024", "URL": "https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/", "timestamp": "2023-04-25 17:52:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Vaccination, the Poisonous Paradigm", "cleaned_text": "So many doctors and nurses routinely state on social media that in all their years of practice, they’ve never seen a serious vaccine reaction… but they have.\n\nIf they’ve never seen any clinically obvious severe reactions, it’s likely because children suffering them are generally rushed from home straight to the ER, not back to the clinic or office where the vaccines were given.\n\nTo wit, the testimony of pediatrician Dr. Toni Bark, who tells us that while in her position as Director of a hospital pediatric emergency room she’d initially been very upset if parents brought in children who weren’t up to date on vaccines, but her attitude soon changed, and changed drastically. She began to see patterns:\n\n“Children who were seen in the vaccine clinic would then come to our ER with seizures, respiratory arrest and asthma attacks. I began to realize, not all children respond well to vaccination and in fact, some die.” (1)\n\nAnd from an ER nurse who calls himself Guerilla RN:\n\n“As an E.R. nurse, I have seen the cover up. Where do you think kids go when they have a vaccine reaction? They go to the E.R. They come to me…The child comes in with either a fever approaching 105, or seizures, or lethargy/can’t wake up, or sudden overwhelming sickness, screaming that won’t stop, spasms, GI inclusion, etc.” (2)\n\nHowever, there are a few reactions doctors and nurses see rather routinely, but don’t recognize as potentially serious. Nor, for the most part, do parents – at least, initially. The recognition comes weeks, perhaps months later, as the vaccine damage scenario unfolds and the parent digs deep for answers.\n\nTwo common reactions that are actually red flags are hidden in plain sight: fever; and nausea. Fever’s at the top of the list of reported reactions, by far, with nausea / vomiting close behind. Were it not for the utter lack in their medical educations of substantive information about the list of vaccine ingredients and the nature of the injuries they cause, doctors and nurses might stop to think about the serious implications.\n\nAfter natural exposure to potential pathogens, and then only if a resulting infection develops, symptoms won’t display ‘til after an incubation period.\n\nAs per the Mayo Clinic, chickenpox symptoms, for instance, don’t display until 10 to 21 days after exposure (3); pertussis, 7 to 10 days (4); Hepatitis B, 2 weeks to 4 months! post-infection (5); and so on. Seattle Children’s Hospital, meanwhile, tells us the following, which most of us know from experience anyway: “Fever with most vaccines begins within 12 hours and lasts 2 to 3 days. This is normal.” (6)\n\nHow preposterous! No, it’s not normal – common to vaccination, but not normal. Developing within only hours of the shots, post-vaccination fevers are unnatural; foreign. They aren’t related to the respective supposedly vaccine-preventable infectious illnesses in the traditional sense.\n\nFever following natural exposure is an immune system mechanism designed to help the body eliminate and recover from the resulting infection – it’s “fighting for, not against the person.” (7) When it develops within hours of vaccination, it’s something other – there’s been no time for an infection to develop. It’s related to something intrinsic to the vaccine ingredients and the route of introduction, injection.\n\nFever is one of the first signs of encephalitis – brain inflammation (8). The Merck Manual (9) and Health and Human Services, on its Vaccine Injury Table (10), both tell us that vaccines can cause encephalitis, and encephalitic reactions can occur within minutes. Moreover, brain inflammation can lead to brain damage – encephalopathy.\n\nIndeed, more than one medical professional has stated the belief that every vaccine causes brain damage; that it’s just a matter of degree, individual to individual; toddler to toddler; infant to infant. Regardless, social media abounds with eyewitness accounts of post-vaccination fevers, even if short lived, ultimately proving to be but the first step down a long road of debilitating autoimmune and neurological disorders.\n\nNausea and vomiting are critical immune system functions, purposed to eliminate poisonous substances from the body. They occur when toxins reach the area postrema of the brain – the “vomiting center” – its importance highlighted by the fact that it’s one of the few areas of the brain where the blood-brain barrier is weak. The faculty at the University of Washington explain the mechanism this way:\n\n“When a toxic substance enters the bloodstream it will get to the area postrema and may cause the animal to throw up. In this way, the animal protects itself by eliminating the toxic substance from its stomach before more harm can be done.” (11). Nothing could better emphasize the insidiousness of the vaccination paradigm.\n\nToxic – poisonous – substances are included in vaccines, and because of the route of introduction bypass the filtering, detoxifying organs of the body, entering the bloodstream directly from the muscle into which they’re injected. Nausea, then, as with fever, is an adverse reaction that cannot be viewed simply as minor, in that it literally indicates the introduction of poisons into the body. Moreover, as with fever again, nausea and vomiting may also be symptoms of encephalitis – of an encephalitic vaccine reaction – and can be a prelude to encephalopathy; to brain damage.\n\nLet’s keep it simple. From the Oxford dictionary, the definition of poisonous:\n\n1: (of a substance or plant) causing or capable of causing death or illness if taken into the body. (12)\n\n“Unavoidably unsafe” was the description of vaccines used by Congress in 1986, in its discussions surrounding the passage of the National Childhood Vaccine Injury Act, and repeated by SCOTUS in its 2010 Breusewitz decision. Though the most egregious damage is done to the very young, vaccines unarguably cause great pain and grief to many people, of all ages.\n\nThey are by definition, then, poisonous.\n\nVaccines trigger fever, nausea and vomiting because substances they contain are toxins, are poisons. We have an outrageous, untenable situation, where even the most commonly reported reactions to vaccines, couched as minor and of no concern, are in reality indications of injury, potentially severe, potentially life-altering, potentially fatal.\n\nThey can occur days or weeks post-vaccination – HHS lists the DTaP and MMR vaccines as causes of encephalitis for up to three days and two weeks, respectively. Yet, pediatricians and nurses don’t consider the implications, in large part, obviously, because of the egregious lack of relevant information in their medical educations about the known! list of toxic vaccine ingredients.\n\nNor are they taught the sorry histories of vaccine-induced severe autoimmune and neurological disorders that at this point have received going on $4 billion in compensation, from a national vaccine court that few people even know exists.\n\nMost unacceptably, it’s obvious at this point that there are many medical professionals who even though they’re aware of the list of vaccine ingredients, avoid considering how heinous can be the consequences. They simply don’t want to rock the professional boat, or disturb the bottom line.\n\nThey prefer living in the illusory world of benefits vs risk, willfully shunning the basic creed of: first do no harm. Of the many issues of trust I’ve covered in the five years of my show, the most disturbing will always be: the responsibility of the provider. One pediatrician told us in interview that his colleagues are so reluctant to discuss vaccines, the cognitive dissonance so strong, that they won’t even allow their curiosity to be aroused. Nothing could be more chilling.", "opengraph": {"type": "article", "url": "https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/", "site_name": "VacTruth.com", "title": "Vaccination, the Poisonous Paradigm | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2018/01/vaccination-fevers-1024x683.jpg", "description": "So many doctors and nurses routinely state on social media that in all their years of practice, they’ve never seen a serious vaccine reaction… but they have. If they’ve never seen any clinically obvious severe reactions, it’s likely because children suffering them are generally rushed from home straight to the ER, not back to the …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:tag": "fever", "article:section": "Injuries & Deaths", "article:published_time": "2018-01-06T19:04:03-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2018/01/vaccination-fevers-1024x683.jpg", "image:width": "1024", "image:height": "683"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-injury/", "https://vactruth.com/author/shawn-siegel/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/", "https://twitter.com/share?text=Vaccination, the Poisonous Paradigm:&url=https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/&media=https://vactruth.com/wp-content/uploads/2018/01/vaccination-fevers-1024x683.jpg", "https://plus.google.com/share?url=https://vactruth.com/2018/01/06/vaccination-the-poisonous-paradigm/", "https://vactruth.com/wp-content/uploads/2018/01/medline-fever.png", "http://vaccineimpact.com/2015/dr-toni-bark-m-d-do-not-remove-vaccine-exemptions-some-children-die-from-vaccines/", "http://www.organiclifestylemagazine.com/nurses-against-vaccines", "https://www.mayoclinic.org/diseases-conditions/chickenpox/symptoms-causes/syc-20351282", "https://www.mayoclinic.org/diseases-conditions/whooping-cough/basics/symptoms/con-20023295", "https://www.mayoclinic.org/diseases-conditions/hepatitis-b/symptoms-causes/syc-20366802", "http://www.seattlechildrens.org/medical-conditions/symptom-index/immunization-reactions/", "https://medlineplus.gov/ency/article/003090.htm", "https://www.medicinenet.com/encephalitis_and_meningitis/article.htm", "http://www.merckmanuals.com/home/brain-spinal-cord-and-nerve-disorders/brain-infections/encephalitis", "https://www.hrsa.gov/sites/default/files/vaccinecompensation/vaccineinjurytable.pdf", "https://faculty.washington.edu/chudler/bbb.html", "https://en.oxforddictionaries.com/definition/poisonous"], "authors": [], "publish_date": "2018-01-06T19:04:03-05:00"}