{"result_id": "331039", "URL": "https://vactruth.com/2016/08/13/aggressive-hospital-employee/", "timestamp": "2023-04-25 17:52:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2016/08/13/aggressive-hospital-employee/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "Aggressive Hospital Vaccine Policies: Get Vaccinated or Lose Your Job!", "cleaned_text": "Over the past several years, hospitals have steadily increased their aggression towards employees who choose not to vaccinate. What began as a recommendation for employees to be updated in their vaccinations is now commonly presented as a requirement for consideration of employment. Obtaining an annual flu vaccine is also forced upon employees. [1]\n\nEmployees who oppose vaccinations for philosophical or religious reasons often feel they are forced to choose between their employment and health. Out of fear of losing their jobs, many succumb to the pressure to vaccinate, hoping they will not become vaccine-injured.\n\nIt is a sorry state of affairs when employers have the ability to control what should be a private health decision to obtain a medical procedure, proven to be far from safe or effective. [2]\n\nUnfortunately, it has become fairly standard for vaccinations to be a requirement of employment at hospitals in this country. Employees are commonly being forced to obtain an annual flu vaccine or face losing their job.\n\nAccording to Alan Phillips, JD, vaccine exemption expert lawyer, most employees who attempt to obtain exemptions on their own are unsuccessful. The exemptions are typically written in a way that is very restrictive. Those who feel strongly about using exemptions, to avoid vaccines at their hospital job, must often employ a lawyer.\n\nIf employees are successful in obtaining vaccine exemptions, they are often forced to wear masks during flu season. Employees may also be reprimanded in writing for not following company policy. [3, 4]\n\nThe Centers for Disease Control and Prevention maintains strong recommendations for all hospital employees to receive the flu vaccine. A significant number of healthcare professionals, including nurses and physicians, oppose mandated vaccines at their workplace. [5, 6]\n\nSample of an Actual Flu Vaccination Policy Letter Sent to Hospital Employees\n\nThe following employee letter was sent recently, which provides evidence for growing coercion for hospital employees to become vaccinated. At one point, the letter threatens that “Those who are not in compliance will no longer remain employed at Mercy.” In previous years, employees were given the option to wear a mask if they chose not to vaccinate and were threatened with disciplinary action, but not fired.\n\nMercy has deep concern for the health and wellness of our co-workers and the patients, families and communities we serve, and we are committed to the delivery of safe, effective high-quality care. Our fellow co-workers and patients put trust in us as caregivers to act in accordance with the common good and the Mercy value of dignity. It is for this reason that each year we require flu immunizations by all Mercy co-workers, including Mercy Clinic physicians.\n\nVery few co-workers decline the vaccine each year, and we greatly appreciate your efforts to keep our patients and fellow co-workers safe. You should receive your vaccination by November 30, or have an approved and current documented medical or religious reason on file with Human Resources. Those who are not in compliance will no longer remain employed at Mercy. There is no grace period or counseling this year. The exemption process is also centralized for consistency and is more detailed than in previous years.\n\nThe reason for our flu vaccination policy is simple: protection against the flu virus saves lives, especially those of our most vulnerable patients. In support of our unyielding focus on health and safety, Mercy has revised our flu vaccination policy to require yearly flu immunizations by all Mercy co-workers, including Mercy Clinic physicians, as a condition of employment. This aligns with an existing policy that requires applicants who accept a position with Mercy to agree to receive all appropriate immunizations, including a flu vaccine, each year. Other health care organizations nationally and in some Mercy communities also require employees to receive flu vaccinations to remain employed.\n\nAs a society, we value the freedom to make our own health decisions, which are sometimes deeply personal for each of us. There are times, however, when our choices impact others. This is true with the resurgence of preventable diseases like measles, mumps and whooping cough. In health care, we must adopt best practices for those we serve. Should you have questions or concerns about receiving a flu shot, you are encouraged to reach out to a member of Mercy’s Infection Prevention team.\n\nAs part of our Zero Patient Harm goal, it’s important to reach 100% participation with flu shot administration for our co-workers. As in previous years, immunizations will be provided by Mercy in fall, based on supplies available and timeframes identified by the Centers for Disease Control and local health department. Be watching for information on immunization events coming to your location beginning in September.” [7]\n\nThe reality is that employees of hospitals who oppose vaccinations are being forced to choose between their employment and their health. Serious health risks are associated with the flu vaccine, including risk of death and permanent paralysis, while the effectiveness of this vaccine is not well established. It is considered by many to be the most dangerous of all vaccinations. [8, 9]\n\nThe very unfortunate reality is that health freedoms are increasingly becoming limited in our country. The choice to become vaccinated as an adult should be a private decision, but it is now being tied with conditions for employment at many hospitals.\n\nThose who fight for a religious or medical exemption are often denied due to the strict interpretations by hospital policy administrators. The assistance of a vaccine lawyer is often required to successfully utilize exemptions which hospital policies allow. Placing dedicated hospital employees in such a difficult position is unethical and unfair.\n\nMany who have researched the flu vaccination and wish not to be subjected to this dangerous medical procedure are left with an impossible decision. They must choose between their employment or health. No one should be placed in such a position.\n\nMichelle Goldstein is a mental health therapist who is passionate about holistic health, natural healing, nutrient-dense foods and the politics that impact them. She has published articles for Natural News, VacTruth, and other health websites. All of her published articles to date can be found at her health website, Holistic Health to Go. She can also be followed on her Facebook Page, Holistic Health to Go.", "opengraph": {"type": "article", "url": "https://vactruth.com/2016/08/13/aggressive-hospital-employee/", "site_name": "VacTruth.com", "title": "Aggressive Hospital Vaccine Policies: Get Vaccinated or Lose Your Job! | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2016/08/vaccine-policies.jpg", "description": "Over the past several years, hospitals have steadily increased their aggression towards employees who choose not to vaccinate. What began as a recommendation for employees to be updated in their vaccinations is now commonly presented as a requirement for consideration of employment. Obtaining an annual flu vaccine is also forced upon employees. [1] Employees who …", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "truth about vaccines", "article:section": "Law & Policy", "article:published_time": "2016-08-13T13:01:59-04:00", "article:modified_time": "2017-11-26T06:41:11-05:00", "updated_time": "2017-11-26T06:41:11-05:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2016/08/vaccine-policies.jpg", "image:width": "640", "image:height": "480"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/vaccine-law-policy/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2016/08/13/aggressive-hospital-employee/", "https://twitter.com/share?text=Aggressive Hospital Vaccine Policies: Get Vaccinated or Lose Your Job!:&url=https://vactruth.com/2016/08/13/aggressive-hospital-employee/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2016/08/13/aggressive-hospital-employee/&media=https://vactruth.com/wp-content/uploads/2016/08/vaccine-policies.jpg", "https://plus.google.com/share?url=https://vactruth.com/2016/08/13/aggressive-hospital-employee/", "http://www.hopkinsmedicine.org/mandatory_flu_vaccination/faq.html", "https://vactruth.com/2014/12/12/10-reasons-not-to-vaccinate/", "http://fox2now.com/2012/11/05/hospital-employee-to-be-disciplined-for-refusing-flu-shot", "http://www.vaccinerights.com/healthcareworkers.html", "http://www.cdc.gov/flu/healthcareworkers.htm", "http://www.vaccinerights.com/healthcareworkers.html", "http://www.vaccinationcouncil.org/2013/11/27/a-shot-never-worth-taking-the-flu-vaccine-by-kelly-brogan-md/", "https://healthimpactnews.com/2015/flu-shot-remains-most-dangerous-vaccine-based-on-injuries-and-deaths-compensated-by-government/", "http://holistichealthtogo.com/", "https://www.facebook.com/goldsteinhealth", "https://www.flickr.com/photos/mager/2767138644/in/photolist-5dwiUY-9XSoN-9G9Bpi-7zAst1-cogTib-iJYKMV-8CpJTx-dqwns5-4atqkV-6pypTD-avq84n-qh2n63-qq6x1j-929iXF-hGVfmq-gmCE6n-7GHAfC-34Ydj3-6pypBR-7rNLdi-g5HnXC-7S9rk2-7hfnUr-eco2iu-auo7zn-AEv48-oeRtgd-rQh7Hd-bM35ce-7mv3co-5WeaJN-8Cse3D-byqDku-kXWn8-dTCbaE-9PEyd7-2UBoac-bM35A6-iELLiG-46uZse-bKm55n-8Mkfzq-iQy5sH-bGW2Pv-6GbMkU-6XFqnh-kXWn7-5hEN9N-fajexS-czaG4C"], "authors": [], "publish_date": "2016-08-13T13:01:59-04:00"}