{"result_id": "331013", "URL": "https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/", "timestamp": "2023-04-25 17:52:03 CEST+0200", "meta": {"description": "Over two-thirds of chiropractors surveyed agreed that nutrition and sanitation are more important than vaccines in preventing infectious diseases.", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "The Big Divide: Why Chiropractors Oppose Vaccinations While Medical Doctors Embrace Them", "cleaned_text": "There exists a divide between practicing chiropractors and physicians regarding their views on vaccinations. Chiropractors often oppose the practice of vaccinations, understanding the body’s intrinsic ability to heal from illness, and how vaccinations interfere with this process.\n\nBy contrast, medical doctors are trained in medical schools and hospitals, largely funded by pharmaceutical companies’ dollars. Allopathic physicians are highly indoctrinated on the importance of vaccinations to prevent disease and illness, while receiving little to no knowledge on vaccine dangers and their negative impact on health.\n\nWhich argument makes more sense? Was the human body made to intrinsically heal and stay healthy if given good nutrition and environmental support? Were humans made lacking in the toxic cocktail ingredients found in vaccines needed to create artificial antibodies to fight illness?\n\nIn an abstract of the journal Pediatrics, in the year 2000, an analysis of chiropractors’ views on vaccinations was presented. In one small survey, 36% of respondents reported the belief that no scientific evidence exists to support the theory that vaccinations work. Over two-thirds of chiropractors surveyed agreed that nutrition and sanitation are more important than vaccines in preventing infectious diseases.\n\nThe researchers of the abstract explained that chiropractors believe that disease results from spinal nerve dysfunction caused by subluxated or misplaced vertebrae.\n\nThe first chiropractic school was founded by Daniel David Palmer in Davenport, Iowa, in 1897. Palmer’s son Bartlett Joshua took over the school at age 20 and focused teachings on the belief that chiropractic care did not heal, but rather removed interference allowing the body’s innate intelligence to heal itself. These philosophical views are contrary to those of pro-vaccinators and their emphasis on the germ theory.\n\nAn analysis of the Dynamic Chiropractic, a chiropractic trade paper, showed the following anti-vaccine argument categories to be prevalent:\n• There is disagreement and opposition to vaccinations among medical experts\n• Vaccination policy is dictated by the Medical-Pharma complex and is motivated by greed\n• Acceptance of vaccinations goes against chiropractic philosophy [1]\n\nIn an examination of the curriculum of the Logan Chiropractic School, there is no mention of vaccinations or drugs to prevent or treat diseases. The emphasis is on biology and chiropractic care, as well as nutrition. [2]\n\nThe International Conference of Pediatric Chiropractors offers weekend seminars, trainings and articles on the subject of vaccinations. An exploration of their website on the topic of vaccines demonstrates that they are clearly against vaccinations and their curriculum materials teaches students about the dangers of vaccinations. [3]\n\nChiropractic doctor Ted Koren founded Koren Publications which is the leading patient resource in the chiropractic profession with over 100 million brochures, booklets, posters and books in distribution. After his son was born, he began writing and lecturing on the topic of vaccinations. Dr Koren argues passionately about the dangers of vaccinations and how vaccines are the antithesis to the natural approach and history of chiropractic healing. Koren’s highly research-backed brochures bust hundreds of prominent vaccine myths promoted by the vaccine industry. [4]\n\nThe History of Medicine and Big Pharma\n\nOne hundred years ago homeopathic and naturopathic doctors competed with allopathic trained physicians. Homeopathic treatments were inexpensive, safe and effective, so were quite popular among patients. Rockefeller and Carnegie had large investments with pharmaceutical companies and wanted to eliminate their competition. With their monetary investments, they were able to create the Flexner Report, which essentially made it illegal for homeopathic and naturopathic physicians to continue practicing medicine in the US. The only legal medical school training allowed were those focusing on treatment and management of diseases with pharmaceutical drugs, including vaccinations. Essentially, Rockefeller and Carnegie created a monopoly of allopathic medicine practice and bought out our health care.\n\nBecause pharmaceutical companies continue to largely fund and influence medical education, a large focus of medical school training today includes vaccination courses. [5]\n\nMedical school training focuses on diagnosing diseases and treatment with pharmaceutical drugs and surgery. Their training also includes a strong emphasis on vaccinations to prevent disease. Their coursework includes intensive education on how to sell vaccinations to parents and patients who show hesitation and concerns. Physicians are only taught one side of the vaccine story, the myth that vaccinations are safe and effective. Doctors are not taught the serious side effects of vaccines, which include death. Many pediatric practices will not allow children to be seen if parents refuse vaccinations. [6]\n\nMy Experience with Holistic Chiropractors and Physicians\n\nIn my personal experience with integrative chiropractors and physicians, both as a patient and a professional, I quickly discovered a large divide between chiropractors and physicians on the subject of vaccinations. As a professional, I actively participate in meetings of an integrative licensed practitioner group, which gives me personal access to a large group, consisting primarily of physicians and chiropractors. Many are doing extremely innovative and healing work in their practices. While everyone agrees on the importance of holistic nutrition and supplements for preventing and healing disease, they are clearly divided on the issue of vaccines.\n\nChiropractors I know generally oppose the use of vaccinations, while physicians more often endorse vaccines. I was disappointed and had hoped that holistic doctors would be more receptive to the tremendous data showing vaccine danger.\n\nOne integrative physician who is trained and certified in functional medicine recently announced her offering of a flu clinic at her new spa-like practice location. Another gynecologist who is open to integrative practice ideas privately told me she endorsed the HPV vaccination. A pediatrician in the group, who is training in functional medicine, continues to endorse the practice of vaccinations. Another pediatrician who specializes in treating autism told me that she thought some vaccinations were still valuable.\n\nThere are several exceptions. One physician, who was trained in homeopathy and is from Europe, is opposed to vaccinations, along with another who has Chinese medicine training. A psychiatrist spoke openly at our meeting against the damaging toxicity of vaccinations.\n\nChiropractors are taught about the body’s innate ability to heal through nutrition and spinal corrections. Chiropractic training focuses on the dangers of vaccinations to health. Physicians are taught that vaccinations are necessary to prevent disease and their training focuses on disease diagnosis and pharmaceutical drug treatments. Chiropractors often oppose vaccinations while physicians generally support the practice.\n\nWhich view makes more sense to you? In the end, we are each responsible for our healthcare choices and those of our children. Independent research demonstrates that those vaccinated are significantly more ill than those not vaccinated.\n\nVaccinations carry serious risk of health damage. To find out your truth, do independent research of your own. In the end, your health is in your own hands and your child is depending on you to be informed. To learn more about vaccine dangers, the article Ten Reasons NOT to Vaccinate is a good starting point.", "opengraph": {"type": "article", "url": "https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/", "site_name": "VacTruth.com", "title": "The Big Divide: Why Chiropractors Oppose Vaccinations While Medical Doctors Embrace Them", "image": "https://vactruth.com/wp-content/uploads/2018/03/chiropractor-with-baby-1024x683.jpg", "description": "Over two-thirds of chiropractors surveyed agreed that nutrition and sanitation are more important than vaccines in preventing infectious diseases.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "https://www.facebook.com/goldsteinhealth", "article:tag": "truth about vaccines", "article:section": "Social", "article:published_time": "2018-05-03T04:00:36-04:00", "article:modified_time": "2018-05-03T03:27:17-04:00", "updated_time": "2018-05-03T03:27:17-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2018/03/chiropractor-with-baby-1024x683.jpg", "image:width": "1024", "image:height": "683"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/social/", "https://vactruth.com/author/michelle-goldstein/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/", "https://twitter.com/share?text=The Big Divide: Why Chiropractors Oppose Vaccinations While Medical Doctors Embrace Them:&url=https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/&media=https://vactruth.com/wp-content/uploads/2018/03/chiropractor-with-baby-1024x683.jpg", "https://plus.google.com/share?url=https://vactruth.com/2018/05/03/chiropractors-oppose-vaccinations/", "http://vactruth.com/2014/12/12/10-reasons-not-to-vaccinate/", "http://pediatrics.aappublications.org/content/105/4/e43", "http://catalog.logan.edu/preview_program.php?catoid=8&poid=38&returnto=399", "http://icpa4kids.org/", "http://www.korenpublications.com", "https://vactruth.com/2016/03/28/how-healthcare-was-bought-out/", "https://vactruth.com/2016/03/22/why-doctors-recommend-vaccinations/"], "authors": [], "publish_date": "2018-05-03T04:00:36-04:00"}