{"result_id": "331034", "URL": "https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/", "timestamp": "2023-04-25 17:52:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vactruth.com/wp-content/uploads/2017/11/logo_size_icon_invert-1.jpg", "canonical": "https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/", "encoding": "UTF-8"}, "image": null, "domain": "vactruth.com", "title": "17 Examples of Admitted Vaccine Failure", "cleaned_text": "As parents, we’re inundated with mixed messages about vaccines.\n\nOn one hand, doctors and mainstream media tell you how effective and safe vaccines are. On the other hand, you have parents like me who claim vaccines injured their children, or, in this case, that vaccines really “don’t work” as advertised.\n\nWhat is often quickly forgotten is how often (and badly) vaccines fail. Ask yourself, “Why don’t these vaccine failures regularly make the news?”\n\nIf you can imagine in your mind’s eye, for a moment, the cash register “cha-chinging” while Big Pharma is pulling out a wad of cash, I think you may be getting close to the real answer. There’s big money in making sure the vaccine program is perceived as a success by you.\n\nBut this isn’t why you’re here.\n\nBefore I give you the 17 examples of how vaccines have failed, please investigate the United States vaccine schedule. Children are injected with 36 vaccines by the time they are 6 years of age.\n\nYou’ll notice a common theme that when vaccines fail, the proposed solution is often more vaccines, even when the child has already received multiple doses to “protect” them.\n\nAs promised, here are examples of the children being injected with toxic and ineffective vaccines, which their parents trusted would protect their children from getting the disease.\n\nVaccine Failure #1 – Mumps Outbreak in Orthodox Jewish Communities in the United States (2010)\n\nA large mumps outbreak occurred among highly vaccinated U.S. Orthodox Jewish communities during 2009 and 2010. Of the teenagers vaccinated,\n• 89% had previously received two doses of a mumps-containing vaccine\n\nIn March, 2006, a total of 219 mumps cases had been reported in Iowa – the largest epidemic of mumps in the United States since 1988.\n\nOf the 219 cases reported in Iowa, the average age of infection was 21. Of the 133 patients investigated with a vaccine history,\n• 19 (14%) vaccine status could not be documented\n\nThose infected who received a vaccine: 79% (at least). [2]\n\nVaccine Failure #3 – Mumps Outbreak at a Summer Camp in New York (2005)\n\nOn July 26, 2005, the New York State Department of Health identified 31 cases of mumps, possibly introduced by an unvaccinated camp counselor from the United Kingdom (UK). The vaccine coverage for the entire camp was 96%. Of the infected 31,\n• 2 (6%) vaccine status could not be documented\n\n20 of the 31 people infected (65%) of the people infected were vaccinated.\n\nFrom October 1988 to April 1989, an outbreak involving 269 cases of mumps occurred in Douglas County, Kansas. Of the 269 cases, 208 (77.3%) occurred among primary and secondary school students, of whom 203 (97.6%) had received a mumps vaccination. [4]\n\nA measles outbreak in 2009 exposed and infected two physicians, both of whom had been fully vaccinated with two doses of the MMR vaccine. These physicians were suspected of having been infected by treating patients diagnosed with measles. [5]\n\nThe 1989 measles outbreak infecting 1,363 people in the province of Quebec was attempted to be explained away as occurring because of “incomplete vaccination coverage.”\n\nHowever, upon further investigation, it was discovered the vaccination coverage among cases was at least 84.5%. Vaccination coverage for the total population was 99.0%. [6]\n\nVaccine Failure #7–Outbreak of Measles Despite Appropriate Control Measures (1985)\n\nIn 1985, of 118 cases of measles which occurred on a Blackfeet reservation in Montana, 82% were vaccinated. Twenty-three of those cases occurred in the schools in Browning, Montana, where 98.7% of students were vaccinated. [7]\n\nIn 1985, an outbreak of measles occurred in a secondary school located in Corpus Christi, Texas. More than 99% had records of vaccination with live measles vaccine. The investigators concluded “that outbreaks of measles can occur in secondary schools, even when more than 99 percent of the students have been vaccinated and more than 95 percent are immune.”\n\nVaccine Failure #9 – Measles in an Immunized School-Aged Population in New Mexico (1984)\n\nIn 1984, 76 cases of measles were reported in Hobbs, New Mexico. Forty-seven cases (62%) occurred among students. The school reported that 98% of students were vaccinated against measles before the outbreak began.\n\nIn 1984, 21 cases of measles occurred in Sangamon County, Illinois.\n\nAll 411 students of the local high school were documented as having received the vaccination on or after their first birthday. Investigators remarked, “This outbreak demonstrates that transmission of measles can occur within a school population with a documented immunization level of 100%.”\n\nVaccine Failure #11 – Analysis of Measles Epidemic; Possible Role of Vaccine Failures (1975)\n\nIn 1975, a measles epidemic occurred in schools in Greensville, Ontario. Out of the 47 cases of measles,\n• 18 (18.3%) had not been vaccinated\n\nResearchers concluded one vaccine isn’t enough to protect children. They recommended children be injected with an additional measles vaccine.\n\nVaccine Failure #12 – Unexpectedly Limited Durability of Immunity Following Acellular Pertussis Vaccination in Pre-Adolescents in a North American Outbreak (2012)\n\nIn 2012, doctors at Kaiser Permanente Medical Center identified 171 cases of pertussis – 132 in children. They noticed increased cases in children between the ages 8-12. They claim vaccine effectiveness was as follows:\n\nOutside of using colorful adjectives such as garbage, worthless, or junk, the doctors hypothesized children need more vaccines to become “adequately protected.”\n\nVaccine Failure #13 – Clinical Presentation of Pertussis in Fully Immunized Children in Lithuania (2001)\n\nIn 2001, Lithuania’s vaccine coverage was 94.6% as a country. From May to December of that year, 53 children showed a serological confirmation of pertussis. Of the 53 children,\n\nResearchers conveniently grouped both partially vaccinated and unvaccinated children together. Twenty-eight of 32 fully vaccinated children (87.5%) had also received antibiotics.\n\nVaccinated children (who received at least three DTP vaccine doses) represented 43.2% of all pertussis cases diagnosed in 2001.\n\nMany health professionals are adamant that vaccines protect against infection. Evidence from a field investigation in Israel challenges this belief.\n\nIn 2000, a child died suspected of having pertussis. The baby received the first dose of DTP at two months of age – all family members were completely vaccinated with four doses of DTP.\n\nThe day care centers that two siblings had attended during the child’s illness were investigated. All the children in the day care had been vaccinated in infancy with four doses of diphtheria-tetanus toxoid pertussis (DTP) vaccine, and a booster dose at 12 months of age.\n\nFive fully vaccinated children were found to be colonized with Bordetella pertussis.\n\nAt the conclusion of the investigation, researchers stressed the following information:\n\n“Vaccinated adolescents and adults may serve as reservoirs for silent infection and become potential transmitters to unprotected infants. The whole-cell vaccine for pertussis is protective only against clinical disease, not against infection. Therefore, even young, recently vaccinated children may serve as reservoirs and potential transmitters of infection.”\n\nThey re-emphasized again, “Our results indicate that children ages 5-6 years and possibly younger, ages 2-3 years, play a role as silent reservoirs in the transmission of pertussis in the community.”\n\nIn 1996, over 280 cases of pertussis cases were identified in Vermont. Here is the breakdown of the age groups of those infected:\n• 12 (4%) were aged less than 1 year\n• 65 (23%) were greater than or equal to 20 years\n\nHow many of these 215 children were vaccinated? According to the report, of the children who had a known vaccine status,\n\nDisturbingly, 174 children were vaccinated and over half (61%) of the school children were considered “fully vaccinated!” It’s also important to keep in mind that in 1996, 97% of children aged 19-35 months in Vermont had received three or more doses of DT or DTP vaccine.\n\nComplete failure in vaccinated children: at least 80.9% [15]\n\nVaccine Failure #16 – Outbreak of Varicella at a Day Care Center Despite Vaccination (2012)\n\nSometimes instead of saying a vaccine is a complete failure, a term such as “breakthrough varicella” is used to describe how children get the disease for which they were vaccinated.\n\nIn December of 2012, an outbreak occurred in a private day care center in a small community near Concord, New Hampshire. There were a total of 25 cases of varicella reported in children.\n• 8 (32%) were unvaccinated – two of these children were vaccinated in late December and classified as “unvaccinated”\n\nThe investigators lamented that the vaccine was 44% effective, saying, “The reasons for the poor performance of the vaccine are not apparent…the findings in this investigation raise concern that the current vaccination strategy may not protect all children adequately.”\n\nVaccine Failure #17 – An Outbreak of Chickenpox in Elementary School Children with Two-Dose Varicella Vaccine Recipients (2006)\n\nWhen it is apparent one vaccine isn’t working, the answer is almost always more vaccines… ever notice?\n\nIn June 2006, a second dose of the chickenpox (varicella) vaccine was recommended for school entry. Shortly after school had begun, the Arkansas Department of Health was notified of a varicella outbreak in students.\n\nVaccination information was available for 871 (99%) of the 880 children. Ninety-seven percent of the children had been vaccinated for varicella! In this outbreak, 84 cases were reported.\n\nAs you can see from the above examples, vaccines fail and do so often. Trust me, there are many more examples I didn’t cover here.\n\nHere’s a tip for you if you want to look for more information. Open your browser right now. Go to Google.com and do a search for the terms “previously immunized for (x)” or “breakthrough (x) in school.” X, of course, represents a “vaccine preventable” disease such as pertussis, measles, varicella, etc., – you get the point.\n\nAs a parent, you trust doctors to provide you with accurate information. When doctors say vaccines work and they are effective, from whom are they getting their information?\n\nMaybe even more importantly, why aren’t the vaccine failures covered by mainstream media to inform you? The likely answer is the organizations who really need protection from the truth are the members of Big Pharma – and I don’t think there is a vaccine for that (although they may try to create one).\n\nIf you find other examples, please post them below (with the link to PubMed) for other parents to read.", "opengraph": {"type": "article", "url": "https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/", "site_name": "VacTruth.com", "title": "17 Examples of Admitted Vaccine Failure | VacTruth.com", "image": "https://vactruth.com/wp-content/uploads/2013/02/vaccine-effectiveness.jpg", "description": "Here are 17 examples of the children being injected with toxic and ineffective vaccines, which their parents trusted would protect their children from getting the disease.", "locale": "en_US", "article:publisher": "https://www.facebook.com/vaccinetruth/", "article:author": "vaccinetruth", "article:tag": "vaccine schedule", "article:section": "Jeffry John Aufderheide", "article:published_time": "2013-02-23T16:53:25-05:00", "article:modified_time": "2014-04-05T23:53:54-04:00", "updated_time": "2014-04-05T23:53:54-04:00", "image:secure_url": "https://vactruth.com/wp-content/uploads/2013/02/vaccine-effectiveness.jpg", "image:width": "300", "image:height": "264"}, "tags": [], "tweets": [], "movies": [], "links": ["https://vactruth.com/category/writers/jeffry-john-aufderheide/", "https://vactruth.com/category/top-stories/other-news/", "https://vactruth.com/category/top-stories/recent-articles-1/", "https://vactruth.com/category/top-stories/", "https://vactruth.com/author/jeffry_john/", "//www.facebook.com/sharer/sharer.php?u=https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/", "https://twitter.com/share?text=17 Examples of Admitted Vaccine Failure:&url=https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/", "http://pinterest.com/pin/create/button/?url=https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/&media=https://vactruth.com/wp-content/uploads/2013/02/vaccine-effectiveness.jpg", "https://plus.google.com/share?url=https://vactruth.com/2013/02/23/17-examples-of-vaccine-failure/", "http://vactruth.com/vaccine-schedule", "http://vactruth.com/wp-content/uploads/2013/02/number-vaccines.jpg", "http://www.nejm.org/doi/full/10.1056/NEJMoa1202865", "http://www.cdc.gov/mmwr/preview/mmwrhtml/mm55d330a1.htm", "http://www.cdc.gov/mmwr/preview/mmwrhtml/mm5507a2.htm", "http://www.ncbi.nlm.nih.gov/pubmed/1861205", "http://jid.oxfordjournals.org/content/204/suppl_1/S559.full.pdf+html", "http://www.ncbi.nlm.nih.gov/pubmed/1884314", "http://www.ncbi.nlm.nih.gov/pubmed?term=3618578", "http://www.nejm.org/doi/full/10.1056/NEJM198703263161303", "http://www.cdc.gov/mmwr/preview/mmwrhtml/00000476.htm", "http://www.cdc.gov/mmwr/preview/mmwrhtml/00000359.htm", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1956577/", "http://cid.oxfordjournals.org/content/early/2012/03/13/cid.cis287", "http://www.ncbi.nlm.nih.gov/pubmed/15918913", "http://wwwnc.cdc.gov/eid/article/6/5/00-0512_article.htm", "http://www.cdc.gov/mmwr/preview/mmwrhtml/00049244.htm", "http://www.nejm.org/doi/full/10.1056/NEJMoa021662", "http://www.ncbi.nlm.nih.gov/pubmed/19593254", "http://www.flickr.com/photos/prathambooks/4168663506/sizes/z/in/photostream/"], "authors": [], "publish_date": "2013-02-23T16:53:25-05:00"}