{"result_id": "332044", "URL": "https://vaxxter.com/nfls-vaccine-elephant-stomps-the-field/", "timestamp": "2023-04-25 17:53:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/nfls-vaccine-elephant-stomps-the-field/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "NFL’s Vaccine Elephant Stomps the Field", "cleaned_text": "When the ambulance rolled onto the field on Monday Night Football to attend to Buffalo Bill’s 24-year-old defender, Damar Hamlin, it became clear what happened to him. Clear, except to those mingling in the incestuous sheets with Big Pharma. That short list includes Big Tech, Big Media, Big Government, Big Sports, and their sponsors.\n\nThey couldn’t let the truth or even a discussion about the truth emerge in the public domain that the COVID-19 bioweapon, mislabeled a vaccine, destroyed the young life of one of the NFL’s rising young stars. So unable to sweep the “postponed” game under the rug, a parade of medical doctors hit YouTube—where real science and debate are banned—and other social media outlets to tell the world that an event, which never had happened in the league’s 100-year history, took place on the big stage of a nationally televised game.\n\nThe doctors’ banal and inaccurate observations about the football injury on a routine play with limited contact at half speed ran counter to what NFL announcers Troy Aikman, Kurt Warner, and Booger McFarland—all league players—said in a stone-cold sober manner: “I have never seen this happen on a football field before.”\n\nThey actually implied that they had never seen a cardiac arrest in a young fit athlete at any level of football. Pee Wee. High school. College. And the pros. Unprecedented is the understatement of the year.\n\nFor far too long, the Covid vaccine cartel gaslit, lied to, and force-fed vaccines as “safe and effective” to the American public. The mainstream media and corporations all repeated the refrain as if vaccines were the health holy grail. Big Everything, from media and tech to pharma and government health agencies, read off the same Covid script promoting vaccines as the “only way out of the pandemic.” Per their financial backer, Bill Gates.\n\nThey did it well before the Pfizer-BioNTech Covid bioweapon received Emergency Use Authorization (EUA) from the FDA in mid-December 2020.\n\nIt sounds like the fix was in by the Deep State.\n\nThe FDA withheld Slide No. 16 from the presentation deck, “CBER Plans for Monitoring COVID-19 Vaccine Safety and Effectiveness,” on a host of adverse events discovered during the Pfizer Covid vaccine trials.\n\nThat meeting, held on October 30, 2020, six weeks before EUA approval, was supposed to discuss “FDA Safety Surveillance of COVID-19 Vaccines.” Instead, with “death” and several kinds of “myocarditis” adverse events appearing on Slide No. 16, the FDA was criminally negligent in approving the Pfizer jab under EUA or any other act or measure.\n\nSlide no. 16 should have evoked “clear and present danger” and stopped the global vaccine rollout. It did not. Unimpeded by the financial gatekeepers of health, medicine, and science, the elites’ puppet agencies rolled out the Covid vaccine trials worldwide. And then had the audacity to call the venture an “experiment.”\n\nThat is not what happened. Instead of truth and transparency, or, at a bare minimum, genuine informed consent, the global Covid vaccine rollout turned inexorable.\n\nBut then truth seekers started to expose the blizzard of lies, conflicts of interest, and fraudulent on the clot shots, with excess deaths and disabilities skyrocketing in 2022. The vaccine elephant in the room analogy hit home since no one in mainstream media or the FDA or the CDC, or the NIH dared admit the Covid gene therapy injections being responsible for the explosion of “turbo” cancers, myocarditis in young mens, miscarriages and stillbirths in pregnant women, autoimmune diseases, and so much more.\n\nOn the proscenium of American sports, Monday Night Football, the fans witnessed not a brutal football injury but a vaccine-induced heart attack.\n\nFootball is a “collision sport,” as legendary Green Bay Packers Coach Vince Lombardi once said in the 1960s. But, this time, it’s different, with the NFL injecting more than 98 percent of its players.\n\nSome Covid vaccine holdouts include Green Bay Packers quarterback Aaron Rodgers and at least one Buffalo Bills receiver.\n\nIn grand virtue-signaling irony, NBC Sports declared the NFL and the players’ union, the NFLPA, should disclose the full list of “unvaccinated players.” That demand emerged back in August 2021.\n\nI agree with NBC Sports. It would be interesting to see the unvaccinated list and discover that the Buffalo Bills safety, Damar Hamlin, who collapsed on the field on a routine play last night, would be omitted from that list. With his name missing, it would reveal his vaccine status and lead to the cause of his scary injury that still can lead to his death.\n\nHey, NFL Commissioner Roger Goodell, let’s roll the dice. Go ahead, release the complete list of the unvaccinated and the double dosed, boosted players, too. Let’s aim for radical transparency.\n\nOr won’t the league’s crisis response team allow for this kind of transparency and then open the issue of Covid vaccines into a public forum. Isn’t that what the NFL is all about, education at the inner-city level?\n\nOkay, I get it. Before real transparency, the NFL sponsors will team with Big Pharma to craft a medical cover story that excludes any mention of the Covid injection or Hamlin’s vaccine status.\n\nOn a routine, 7-yard pass to Cincinnati Bengals wide receiver Tee Higgins, in which he lowered his head—slightly—and hit Buffalo Bills safety Damar Hamlin in the chest plate of the shoulder pads. Hamlin absorbed the shot and tackled the receiver to the ground. Tee Higgins and Damar Hamlin stood up in unison, but then something strange immediately happened. Hamlin lost his balance, froze, and keeled over. On his back, lifeless.\n\nHow did that happen since Hamlin wasn’t concussed, nor did he lower his head or running full speed? Last night, we didn’t witness battering ram of Earl Campbell plowing through defenders 40 years ago. Neither Damar Hamlin’s neck nor his helmet absorbed any shock to speak about. It was Higgins’ helmet that charged into Hamlin’s shoulder pads.\n\nThe somber mood turned into a death pall that fell over the entire stadium when the ambulance drove onto the field. The EMS technicians placed lifeless Hamlin on a board, ready to lift him into the back of the ambulance, but then recognized the severity of his condition. Full cardiac arrest. Hamlin couldn’t spontaneously breathe on his own. So two health problems appeared, not one.\n\nAs such, viruses don’t cause that type of cardiac arrests. Nor do blows on the football field. But myocarditis in thousands of over-vaccinated athletes does, as they suffer and die, while swept under the rug by mainstream media and social media platforms.\n\nTo the EMS credit, the technicians promptly performed CPR—Cardiopulmonary Resuscitation—to revive Hamlin’s pulse and breathing. They did so for more than ten minutes with five TV breaks amid the eerie atmosphere of the stadium that felt and looked like a gathering at the city morgue. When the EMS team got Hamlin’s lungs to breathe again, they drove him to a hospital, intubated him—under the Fauci protocol—and sealed him off from the public in the ICU ward.\n\nPlayers on both teams wept; they couldn’t mask their shock and grief. They huddled on their knees and prayed for Damar Hamlin’s survival.\n\nThe timing of the tragedy looms more prominent with the vaccine elephant on the field and streamed into now the public’s homes.\n\nThe day before the Hamlin tragedy, on Sunday, January 1, 2023, NBA Hall of Fame guard John Stockman claimed to possess a “list of hundreds of vaccinated athletes” who have dropped dead on the field or arena floor.\n\nOn my show “Unrestricted Truths,” having interviewed an array of scientists and medical doctors, I learned that the mechanism for dying in sport has to do with graphene oxide migrating to the most electrically active areas in the human body: the heart and the brain stem of the central nervous system. Increased cardio-activity in the vaccinated induces a heart attack that terminates athletes’ lives or disables them.\n\nThe researchers and scientists from GoodSciencing.com compiled a long list of athletes who fell into cardiac arrest, updated through December 9, with 1,616 people being disabled and 1,114 of them dying by the Covid injections.\n\nThe opening paragraphs of GoodSciencing.com tell it all:\n\n“It is definitely not normal for so many mainly young athletes to suffer from cardiac arrests or to die while playing their sport, but this year it is happening. Many of these heart issues and deaths come shortly after they got a COVID vaccine. While it is possible this can happen to people who did not get a COVID vaccine, the sheer numbers clearly point to the only obvious cause.\n\n“The so-called health professionals running the COVID vaccine programs around the world keep repeating that ‘the COVID vaccine is a normal vaccine and it is safe and effective.’”\n\nMaybe Damar Hamlin’s tragic collapse on a nationally televised game, with two teams competing for the Super Bowl, will wake millions of Americans to the dangers of the Covid psyop and gaslighting operation. Pfizer, Moderna, Janssen, and other vaccine manufacturers of the bioweapons are destroying lives at an unprecedented rate of 7,500 deaths and disabilities per day.\n\nThat research, conducted by the former Black Rock fund manager, Edward Dowd, emerged as a year-end warning to the general public.\n\nWith all that we witnessed on Monday night, how far will Big Media, Big Pharma, and Big Sports travel to cover-up the enormous health risks the Covid injections pose on athletes? When will the medical cartel or NFLPA educate the players on the perils listed on FDA Slide No. 16?\n\nIt’s time for the NFL and the NFLPA to tell the players the truth before the next vaccinated player suffers a tragic fate. The NFL playoffs are less that two weeks away with the Super Bowl looming on the horizon.\n\nVaccine roulette no longer favors the NFL or Big Pharma.\n\nThey are one more vaccine-injured player away from the Covid psyop coming unglued.\n\nLike what you’re reading on The Tenpenny Report?\n\n Share this article with your friends. Help us grow.\n\nJames Grundvig has written and published as a freelance journalist and columnist, covering subjects from autism, its cause and treatments, clean technology, green energy, and the BP Oil Spill, to business and Wall Street, and completed investigative reports on a wide range of topics since 2005. He is the founder of the cloud-based software startup in 2011 to integrate supply chain logistics in the Construction IT space. James has 25 years of consulting engineering and construction management experience on projects of scale and complexity in the New York City area. He is the author of Master Manipulator: The Explosive True Story of Fraud, Embezzlement and the Government Betrayal at the CDC.", "opengraph": {"locale": "en_US", "type": "article", "title": "NFL’s Vaccine Elephant Stomps the Field - The Tenpenny Report", "description": "January 3, 2023 By James Grundvig, American Media Periscope When the ambulance rolled onto the field on Monday Night Football to attend to Buffalo Bill’s 24-year-old defender, Damar Hamlin, it became clear what happened to...", "url": "https://vaxxter.com/nfls-vaccine-elephant-stomps-the-field/", "site_name": "The Tenpenny Report", "article:published_time": "2023-01-05T15:06:55+00:00", "article:modified_time": "2023-01-12T17:49:04+00:00", "image": "https://vaxxter.com/wp-content/uploads/2023/01/hamlin.jpg", "image:width": "863", "image:height": "563"}, "tags": ["James Grundvig", "American Media Periscope", "myocarditis", "vaccine mandates", "NFL", "buffalo bills", "cardiac arrest", "Damar Hamlin"], "tweets": [], "movies": [], "links": ["https://profootballtalk.nbcsports.com/2021/08/27/nfl-nflpa-should-disclose-the-full-list-of-unvaccinated-players/", "https://nypost.com/2023/01/02/bills-damar-hamlin-collapses-on-field-receives-cpr-after-making-tackle-in-chilling-scene/", "https://cpr.heart.org/en/resources/what-is-cpr", "https://hoopshype.com/2022/03/23/john-stockton-claims-to-have-list-of-hundreds-of-vaccinated-athletes-who-have-dropped-dead-on-the-field/", "https://americanmediaperiscope.com/category/unrestricted-truths/", "https://goodsciencing.com/covid/athletes-suffer-cardiac-arrest-die-after-covid-shot/", "https://www.theburningplatform.com/tag/ed-dowd/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://amzn.to/2Bmxe5K", "/nfls-vaccine-elephant-stomps-the-field/?login=1", "#", "#"], "authors": [], "publish_date": "2023-01-05T15:06:55+00:00"}