{"result_id": "332047", "URL": "https://vaxxter.com/faith-trust-or-science-the-covid-vaccines-part-2/", "timestamp": "2023-04-25 17:53:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/faith-trust-or-science-the-covid-vaccines-part-2/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Faith, Trust or Science? The COVID vaccines, Part 2", "cleaned_text": "Governments and health authorities are ramping up vaccination acceptance programming as the first doses of the new Covid-19 vaccine become available. This is despite only short-term vaccine safety trials and the fact a Coronavirus vaccine of this type has never before been used on humans.\n\nCountries around the world have pre-ordered millions of Covid-19 vaccine doses, investing billions of dollars. These countries are convinced that vaccinating as many of their citizens as possible is the correct course of action. And they are not about to let their money go to waste and change plans.\n\nThe information war is on.\n\nRed Cross President Francesco Rocca says governments and institutions should fight “fake news” about the Covid-19 vaccines. He says there is a pandemic of distrust about the vaccines which needs to be combated by building trust in communities about the need for a vaccine.\n\nThe World Health Organization has a special advisory group to discuss Covid-19 vaccine acceptance and public uptake. Cass Sunstein, founder and director of the Program on Behavioral Economics and Public Policy at Harvard Law School, chairs the advisory group. Sunstein is an outspoken proponent of government-led tactics to influence public opinion on policy and to undermine the credibility of “conspiracy theorists”. WHO has employed a public relations firm to “ensure the science and public health credibility of the WHO in order to ensure WHO’s advice and guidance is followed,” according to the Defender Children’s Health Defence news site.\n\nNew Zealand university research has found trust in the vaccine and “conspiracy theories” could be a barrier to high up-take. A trust-building communication campaign to ensure the public is confident Covid-19 vaccines are safe is planned. Combating “misinformation” would also be important, top vaccine proponents say.\n\nThis month, an opinion article on a New Zealand mainstream media website gave tips on how to “nudge people” to take the vaccine. It talks about which groups to focus efforts on, the use of peer pressure, rewards such as ice cream and “I got the Covid-19 vaccine” stickers. Simultaneously, Facebook doubled down on censorship of Covid-19 anti-vaccine material. It will be removing “harmful anti-vaxx propaganda” from its platform following a recent surge.\n\nAuthorities seem set to also embark on emotional manipulation to encourage people to take the Covid-19 vaccine. Why are they so set on getting everyone vaccinated when to the critical thinker it appears the virus is not as big of a threat as is made out? See my previous Vaxxter article on communitarianism and guilt and shaming tactics. An article discussing whether health professionals and vaccine companies openly disclose vaccine risks, It’s a Matter of Trust by Shawn Siegel, also on Vaxxter, is worth reading.\n\nThe Bible describes the body of a Christian as the temple of the Holy Spirit. Christians are instructed to glorify God with their bodies. Another portion of Scripture talks about the “abomination of desolation,” when an offensive sacrifice is performed in the Jewish temple. In my mind, a Christian would be justified in refusing to inject an offensive substance into their body. A vaccine containing aborted fetal cells would be defiling the body and would be a form of idolatry to God. Abortion can be compared to the Baal worship sacrificing of children.\n\nAnd then there is the issue of wisdom. God instructs his people to be as wise as serpents but as gentle as doves. The book of Proverbs is full of advice on seeking wisdom and understanding. Is the coming Covid-19 vaccine safe? Is the risk involved in taking an experimental vaccine against the risk of dying of Covid-19 worth it? And just how scared of dying should a Christian be? Quite frankly, if they trust in the Gospel, they should have no fear of dying at all.\n\nThe sinister and control-orientated effects of the Covid-19 vaccines should prompt everyone, Christian or not, to be very cautious. Potentially being controlled and manipulated by a vaccine sounds like witchcraft. Treating humans like a product and changing them both emotionally and cognitively is tinkering with God’s creation. This is control, manipulation, idolatry and a type of witchcraft, according to Biblical commentators.\n\nSome Bible believers raise concerns the vaccine could be the “mark of the beast” mentioned in Revelation. Depending on how the technology connected with the vaccine is used and what restrictions are placed on those who refuse vaccinations, there could be parallels. However, Revelation 19:20 is clear: Worshiping the beast or antichrist is a crucial aspect of receiving the mark.\n\nPutting Biblical perspectives aside, there are many other reasons to think very carefully about whether or not to take a Covid-19 vaccine, as outlined previously.\n\nChristians are instructed to care for others and are reminded in James that failing to do good acts is wrong. When considering all the facts, we need to be brave and take a stand for what we know is right despite the consequences. We should also consider our obligation to warn others if we think their health or life is potentially in danger. People are free to make their own choices. However, it is only fair they have all the information needed for informed consent.\n\nUse wisdom and discernment to see through the manipulation and the propaganda. Don’t give in to fear. Judge who can be trusted and look closely at their motivation. Consider the possible life-long complications of taking a Covid-19 vaccine. Think very carefully before placing your trust in the hands of organizations pushing an experimental, unproven vaccine for an infection that you and your family have every chance of surviving.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nRachael Parsons is a critical thinker and “real news” junkie from “Down Under”. She wrote for a New Zealand daily newspaper for eight years and also has a degree in teaching and learning and experience in business.", "opengraph": {"locale": "en_US", "type": "article", "title": "Faith, Trust or Science? The COVID vaccines, Part 2 - The Tenpenny Report", "description": "By Rachael Parsons, Journalist and Vaxxter Contributor Governments and health authorities are ramping up vaccination acceptance programming as the first doses of the new Covid-19 vaccine become available.  This is despite only short-term vaccine safety...", "url": "https://vaxxter.com/faith-trust-or-science-the-covid-vaccines-part-2/", "site_name": "The Tenpenny Report", "article:published_time": "2021-01-18T14:15:20+00:00", "article:modified_time": "2021-01-18T14:25:28+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/12/53e7d34b4c50a414f1dc8460962a3f7f1d37d8f852577140722e7edd974d_640_covid-vaccine.jpg"}, "tags": ["christianity and vaccines"], "tweets": [], "movies": [], "links": ["https://www.fxempire.com/news/article/covid-19-vaccine-update-focus-shifts-to-pre-orders-and-distribution-685679", "https://www.theguardian.com/us-news/2020/jul/22/pfizer-coronavirus-covid-vaccine-us-deal", "https://nbc-2.com/news/health/2020/12/01/fake-news-about-covid-19-vaccine-is-the-second-pandemic-red-cross-chief-says/", "https://childrenshealthdefense.org/defender/who-anti-conspiracy-covid-vaccine/", "https://www.nzherald.co.nz/nz/the-big-read-three-things-to-know-about-nzs-big-covid-19-vaccine-roll-out/P7HIVKGYOGVMOMI6XLWK3DIUOU/", "https://www.stuff.co.nz/national/health/coronavirus/300172183/covid19-how-to-nudge-people-to-accept-a-coronavirus-vaccine", "https://www.dailymail.co.uk/sciencetech/article-9014475/Facebook-start-removing-false-claims-new-coronavirus-vaccines.html", "https://vaxxter.com/category/oped/rachel-parsons/", "https://vaxxter.com/its-a-matter-of-trust/", "https://www.openbible.info/topics/temple_of_the_holy_spirit_", "https://www.compellingtruth.org/abomination-of-desolation.html", "https://www.marylutyndall.com/2019/01/abortion-and-worship-of-baal.html", "https://www.wiseandgentle.com/#:~:text=Wise%20As%20a%20Serpent%2C%20Gentle%20As%20a%20Dove,this%20world%2C%20against%20spiritual%20wickedness%20in%20high%20places.", "https://www.gotquestions.org/Bible-witchcraft.html", "http://www.peterjamesx.com/Docs%202007/Control%20And%20Manipulation%20Is%20Idolatry.htm", "https://propheciesofrevelation.org/witchcraft-occult-manipulation.html", "https://dailyverse.knowing-jesus.com/james-4-17", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "/faith-trust-or-science-the-covid-vaccines-part-2/?login=1", "#", "#"], "authors": [], "publish_date": "2021-01-18T14:15:20+00:00"}