{"result_id": "332006", "URL": "https://vaxxter.com/its-a-matter-of-trust/", "timestamp": "2023-04-25 17:52:35 CEST+0200", "meta": {"description": "Trust in vaccines is essential before any parent decides to inject their child. If the risks were explained would you support vaccinating your child?", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/its-a-matter-of-trust/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "It's a Matter of Trust: Do You Trust Vaccines?", "cleaned_text": "There are few things in life more awesome than a mother’s protective instinct. What follows is a dedication to that love and the power of discernment that accompanies it.\n\nIf vaccines were advertised on television, an ad for the DTaP vaccine, for instance, would have to include the following, accurate disclaimer:\n\nIf your child has had a prior adverse reaction to a DTaP vaccine, an encephalopathy within seven days of a previously administered pertussis-containing vaccine, or has a progressive neurologic disorder, the vaccine is contraindicated. Your child may develop a hard lump at the injection site, which may cause muscle pain and fatigue. And, though rare, may trigger the development of autoimmune diseases such as multiple sclerosis (MS) or amyotrophic lateral sclerosis (ALS, or Lou Gehrig’s disease); consult with your doctor at the first sign of any such reaction. If within twenty-four hours of vaccination the vaccine recipient develops an involuntary cry lasting for several hours, often repeated over the following few days, it may indicate brain inflammation, and may be followed by a lengthy period of regression, consult with your doctor. The DTaP may cause bulging fontanelle in infants. This typically subsides after a few days, but may indicate brain damage; consult with your doctor if your child exhibits unusual behaviors. Also in infants, there are reports of SIDS association with the vaccine; do not place your infant face down to nap or sleep until at least sixty days following the last of the three scheduled early infancy DTaP shots. Your infant may experience any combination of the following reported reactions, some of which may require hospitalization: abdominal pain, anaphylactic shock, apnea, autism, bacterial/viral infections, convulsions, disintegrative disorder, coma, abnormal EEG, blood disorders, diabetes, eye movement disorder, hearing loss, trouble walking, narcolepsy, paralysis, pneumonia, impairment of psychomotor skills, screaming, speech disorders and death. The vaccine has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.\n\nIt’s Already in the Insert\n\nThe above would be the TV ad disclaimer based on the information provided in the manufacturers’ own package inserts, a search through the national Vaccine Adverse Event Reporting System (VAERS) for reported reactions, and information about macrophagic myofasciitis, a syndrome related specifically to injected aluminum adjuvant, an ingredient in the DTaP. The list of adverse events is incomplete because many adverse vaccine reactions never make it into VAERS. Reporting is technically mandatory, but there is no penalty for non-compliance. Reactions go unreported for no other reason than the widespread reluctance — or refusal — of doctors to acknowledge vaccine reactions.\n\nAds for every other vaccine would be similar. Most disturbing is that while the disclaimer is a loose reflection of the many drug ads we see on TV, unless your doctor researches vaccines independently, checking with him/her about reactions would assuredly prove futile. MDs were denied this information in their medical educations.\n\nMany of the injuries for which the national vaccine court has awarded more than $4 billion (and counting) were related to the DTaP vaccine. The reactions typically involved vaccine-induced epileptic seizures and other neurologic disorders, in some cases resulting in death. To quote from the court records in one such case:\n\n“Within one day [of the DTaP vaccination], he developed a fever, which led to a complex febrile seizure. Subsequently, [the child] developed epilepsy. This fact pattern is commonly seen in the Vaccine Program.”\n\nIf this fact pattern is common in the Vaccine Program, then why is this “fact pattern” not common knowledge? After all, government agencies, the medical profession, pharmaceutical companies, and the mainstream media each have a responsibility to alert the public about the potentially serious adverse vaccine reactions. They all have access to VAERS reports, vaccine package inserts, and HRSA’s records. They also have records of the billions of dollars that have been awarded for vaccine injury. And yet, vaccine safety and harm caused by vaccination is ignored.\n\nThis should be a disturbing reality for any parent: Vaccine injuries, some are serious, some are catastrophic, some are fatal. None of the previously mentioned entities challenges the “vaccines are safe” paradigm. The Merriam-Webster dictionary defines safe as: “free from harm or risk; secure from threat or danger, harm or loss.” Many millions of parents who have been told repeatedly that vaccines are safe, assume they will do no harm.\n\nBut if vaccination can result in childhood diabetes, it is not “safe”. If vaccines can cause epilepsy, they aren’t free from risk and they are not “safe.” VAERS reports reactions such as tics, speech disorders, and regressive behaviors as being side effects of the DTaP vaccine. These are symptoms of autism, a syndrome that can forever transform family life. That means the vaccine is not free from harm and is not “safe.”\n\nThere is a terrible dichotomy between the information parents should expect from public agencies along with the media, and with what they actually are listening to. There are no doctors, nurses, or CVS pharmacists telling parents the true potential for risk or serious injury from each vaccine their child receives. They simply don’t know.\n\nThis is a matter of trust.\n\nThey ask for consent to inject vaccines into our kids when they don’t even know the real extent of what adverse reactions might occur. Millions of reactions have gone unreported. A study on the quality of the VAERS database submitted to HHS found that “fewer than 1% of adverse events are reported.” Our medical authorities are quick to point out that correlation isn’t causation, scolding us when we suggest a reaction that is temporally associated with vaccination may have caused the problem. The fact that they can deny the association is unacceptable. They tell us we must vaccinate our kids to get a public education. Yet they ignore that those shots can cause diabetes, learning disorder, epilepsy, and even death. We demand straightforward information about the associated risks. Healthcare providers must not make assumptions. They must stop pushing away parental concerns as irrelevant.\n\nIt’s an issue of trust, and there can be no question here. The CDC, the FDA, Health and Human Services, the Children’s Hospital of Philadelphia, state health agencies, the American Academy of Pediatrics, many doctors, and some journalists are well aware that there are extreme and catastrophic vaccine reactions. They are also aware that many more thousands of vaccine recipients are going to suffer. Yet, with a few notable exceptions, they say nothing. More egregiously, they portray vaccination as safe when they know it’s not. They not only betray our trust, but they also show it great disdain.\n\nYes, infectious illnesses can have complications, but it’s your liberty to determine which risk is acceptable for your child. You should be able to choose the short-term risk of the infection vs. the long-term consequences of the vaccine. Further, if they shirk their responsibility to give us complete information about vaccination risks, how can we trust them to be truthful in other areas?\n\nAdvancing the vaccination paradigm is the only form of trust they can have.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nJoin our list here or text MVI to 555888\n\nShawn Siegel has enough common sense to recognize a con game when he sees one. Thus, he was compelled to begin researching after discovering that immediately following the release of the polio vaccine the CDC radically changed the definition of the illness. He now hosts a weekly radio/internet show, The Vaccine Myth: An Issue of Trust, on the Logos Radio Network.", "opengraph": {"locale": "en_US", "type": "article", "title": "It's a Matter of Trust: Do You Trust Vaccines? - The Tenpenny Report", "description": "Trust in vaccines is essential before any parent decides to inject their child. If the risks were explained would you support vaccinating your child?", "url": "https://vaxxter.com/its-a-matter-of-trust/", "site_name": "The Tenpenny Report", "article:published_time": "2020-04-21T22:55:12+00:00", "article:modified_time": "2020-04-22T20:27:03+00:00", "image": "https://vaxxter.com/wp-content/uploads/2018/09/e837b3072ef6063ecd0b470de7444e90fe76e7d61eb5154891f8c4_1280_doctors.jpg", "image:width": "1280", "image:height": "853"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.vaccinesafety.edu/package_inserts.htm", "http://wonder.cdc.gov/vaers.html", "https://www.sciencedirect.com/topics/immunology-and-microbiology/macrophagic-myofasciitis", "http://www.cdc.gov/vaccines/pubs/pinkbook/downloads/appendices/B/excipient-table-2.pdf", "http://www.ageofautism.com/2011/01/cbs-covers-court-award-for-dtap-whooping-cough-vaccine-death.html", "http://www.merriam-webster.com/dictionary/safe", "https://vaxxter.com/informed-consent-losing-ground-in-america/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://www.vaxxter.com", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "/its-a-matter-of-trust/?login=1", "#", "#"], "authors": [], "publish_date": "2020-04-21T22:55:12+00:00"}