{"result_id": "332017", "URL": "https://vaxxter.com/part-1a-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "timestamp": "2023-04-25 17:52:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/part-1a-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Part 1: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Referred to As COVID-19 \" Vaccines\"", "cleaned_text": "Note: The COVID-19 jabs are not vaccines; they are experimental injections. Dr Tenpenny does not support or endorse using the word ‘vaccine’ when relating to any of the COVID jabs. The article has direct quotes, and we are obligated to use the authors’ original wording.\n\nMany concerned individuals are asking if they can recover their health after the jab. Is it possible? The body is a miraculous creation of God, but unfortunately, Rockefeller medicine is more interested in the treadmill of Sick Care. With the COVID-19 injections, Big Pharma is arguably eliminating the immune system, not only literally but in people’s minds as well. There is an alternative to Rockefeller medicine and Sick Care and that is functional or integrative medicine, which strives to optimize your biology and deal with root causes in a holistic versus compartmentalized fashion.\n\nHow do these jabs and multiple kill-points cause damage? What exactly are they doing in the body? What poisonous ingredients are in these injections? If we do not understand the problem, how can we fully understand the solutions?\n\nA jabbed person is detoxing from what is arguably an engineered bio-weapon. Please consider that we are navigating uncharted territory, given that this experimental jab has never before been used in humans and is a genetic altering technology, not a vaccine.\n\nRecall that pharmaceutical companies have been working on a generalized coronavirus jab for about 20 years with no success – the shots never resulted in a safe or effective solution. Every single animal trial conducted on animals for a coronavirus injection had the same outcome. Challenge studies showed that instead of developing antibodies to protect animals and neutralize (eliminate) the virus, the manipulated S protein allowed the virus to be more easily dragged into the cell. This is called antibody-dependent enhancement because it makes the infection more dangerous.\n\nAs the mRNA jabs have been rolled out, the focus on spike proteins has been at the forefront. Injected people are producing massive amounts of spike protein, but what is a spike protein? Let’s do a brief review of coronaviruses before we dive into that topic.\n\nThe current coronavirus illness, called COVID-19, is caused by a coronavirus similar to the one that caused Severe Acute Respiratory Syndrome (SARS) in 2002. Therefore, the current virus is called SARS-CoV-2, and the disease it causes is called COVID-19. (In animals, the disease and the virus are both called SARS-CoV-2).\n\nCoronaviruses are a group of viruses that belong to the family Coronaviridae, classified in four different genera, historically based on serological analysis and now on genetic studies: alpha-, beta-, gamma-, and delta. Although the coronavirus family was discovered in the 1930s, the viruses gained particular notoriety when SARS became prevalent in 2002–2003. Interest in this family of viruses grew in the aftermath of that epidemic, leading to the identification of many new coronaviruses within the viral family.\n\nThe NIH states: “Coronaviruses (CoVs), enveloped positive-sense RNA viruses, are characterized by club-like spikes that project from their surface, an unusually large RNA genome, and a unique replication strategy.”\n\nAll members of the coronavirus family have spike proteins, sharp bumps that protrude from the virus’ surface. These are glycoproteins that play a very important role in how the virus infects its host because the spike attaches to surface proteins and enzymes, most commonly called angiotensin-converting enzyme (ACE-2) receptors, located on the surfaces of cells and organs. Once attached, the virus can easily enter the cell.\n\nThe NIH further stated: “Before gaining importance for public health in 2003, the diseases (more accurately called an illness) associated with coronaviruses were mainly of veterinary interest.”\n\n‘gain importance’ or did the virus gain function\n\nAfter an overall analysis of the Wuhan Coronavirus gene, a team of Greek experts released a report on January 27, 2020, saying they studied and analyzed the genetic relationship of the Wuhan bat virus and the SARS-CoV2 virus, comparing them with other coronavirus sequences. They found that the genes of the new Coronavirus had no close genetic relationship with other viruses in the sarbecvirus subgenus of Coronaviridae. Half of the SARS-CoV2 gene sequence is different from any other coronavirus, and half of the chimeric spike protein sequence was included in the different sections.\n\nThe spike protein is the key to helping the virus invade host cells. Modified spike can interact with ACE2 receptors to block the receptor’s normal function, and/or allow the virus to enter the cell. Receptors are surface proteins with different functions which may cause actions to occur within the cell or allow chemicals to enter the cell.\n\nIs this why the SARS-COV2 Virus was dubbed “novel?”\n\n“These research findings indicate that the Wuhan virus is a new type of Coronavirus and overthrew the author’s original assumption that the Wuhan virus originated from random natural mutations between different Coronaviruses. In other words, the Wuhan virus did not evolve naturally,” reported Great Game India.\n\nThis was discovered in part due to the envelope protein (E protein); its genes are adjacent to the spike-S-protein. Sean Lin, a Ph.D. in microbiology and former director of the Virology Laboratory at the former Walter Reed Army Institute, noted that in the viral RNA replication process, these two adjacent genes replicate with similar intracellular factors and viral RNA polymerase, so the error rate of gene replication during this replication process is also similar.\n\nWith this in mind, Lin concluded there was no reason that during the natural viral replication process, the S protein would produce so many different mutations while the E protein remained largely unchanged.\n\n“This is basically impossible to happen naturally because E protein has an indispensable effect on the virus morphology, assembly, budding, and virus pathogenicity of ?-type coronavirus. If the virus changes the host, many cytokines will change and the E protein will necessarily have corresponding changes to adjust the virus synthesis and pathogenicity.”\n\nThere was a seemingly perfect consistency of E protein, which is difficult to explain with “natural variation.”\n\nMeanwhile, Dr. Eric Feigl-Ding, a senior epidemiologist at Harvard University, also commented on an anomaly found on January 28 (the same day the DOJ announced ex Harvard Professor Charles Lieber’s arrest), citing the latest findings of the Greek scholars. He stated, “…Some parts of the virus and its spike protein have never been seen in any other type of coronavirus,” a group of RNA viruses that includes cold and flu viruses, SARS-1, MERS, and HIV.\n\nWith the opinion that the novel Coronavirus first identified in Wuhan, China, was created in a lab and with growing doubts over the official Chinese Communist Party (CCP) position, Wuhan Institute of Virology and well-known virus expert of the institute, Shi Zhengli, stepped into public view.\n\nInterestingly, in 2010, Zhengli’s team published a paper that examined the sensitivity of different types of bat ACE2 to human SARS-CoV spike protein (S protein),uses live SARS virus and HIV (AIDS) pseudovirus. In the experiment, they also changed several key amino acids of bat ACE2 receptors to test its binding to the S protein and constructed the HIV pseudovirus HIV/BJ01-S with the SARS virus BJ01-S protein. Shi Zhengli’s team realized the special relationship between the S protein and ACE2 receptor.\n\nBy January 11, the entire genome sequence of the Wuhan virus was uploaded by China’s National Center for Disease Control and Prevention. The Zhengli team was able to seemingly accomplish an enormous amount in just 12 days; somehow they were able to compare the Wuhan Virus and target the virus with the highest similarity from many coronaviruses in the virus bank, isolate the virus, upload the gene bank, and even write a paper.\n\n“An unnoticeable detail is that Shi Zhengli submitted the registration information of the RaTG13 bat virus on January 27th, showing that the virus was isolated from the feces of Yunnan horseshoe bats (chrysanthemum bat) as early as July 24, 2013. In other words, the extremely important “new horseshoe bat virus RaTG13”, which is likely to be the culprit causing the plague, was frozen in the Wuhan P4 laboratory for seven years,” wrote Great Game India.\n\nMeanwhile, a group of Indian scientists concluded that the Wuhan Coronavirus had been engineered with AIDS-like insertions, meaning it is unlikely for a virus to have acquired such unique insertions naturally in a short duration of time.\n\nBut wait, there’s more! Stay tuned for part 2 about the spike proteins.\n\nLike what you’re reading on The Tenpenny Report? Share this article with your friends. Help us grow.\n\nMaryam Henein is an investigative journalist, and founder, and editor-in-chief of the health magazine and marketplace HoneyColony. She is also a functional medicine consultant/coach, and the director of the award-winning documentary film Vanishing of the Bees, narrated by Elliot Page. Follow her on Gab: @ladybee. Email her: maryam @ honeycolony.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Part 1: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Referred to As COVID-19 \" Vaccines\" - The Tenpenny Report", "description": "By Maryam Henein  Note: The COVID-19 jabs are not vaccines; they are experimental injections.  Dr Tenpenny does not support or endorse using the word ‘vaccine’ when relating to any of the COVID jabs. The article...", "url": "https://vaxxter.com/part-1a-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "site_name": "The Tenpenny Report", "article:published_time": "2022-03-14T23:00:07+00:00", "article:modified_time": "2022-03-14T23:37:51+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/12/53e7d34b4c50a414f1dc8460962a3f7f1d37d8f852577140722e7edd974d_640.jpg", "image:width": "640", "image:height": "391"}, "tags": ["Coronavirus", "Wuhan Lab", "COVID19"], "tweets": [], "movies": [], "links": ["https://icnr.com/author/gerald-smith/", "https://icnr.com/alternative-medicine/how-to-detox-and-antidote-covid-19-vaccine/", "https://www.bitchute.com/video/63Z7x4B2lhUS/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7177048/#CR1", "https://web.archive.org/web/20211022013746/https:/www.mdpi.com/1999-4915/4/6/1011/htm#B1-viruses-04-01011", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4369385/", "https://www.biorxiv.org/content/10.1101/2020.01.26.920249v1", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://www.sciencedirect.com/science/artic", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://scholar.harvard.edu/ericfeiglding/bio", "https://twitter.com/DrEricDing", "https://vaxxter.com/from-espionage-to-tax-evasion-charles-lieber-found-guilty-on-all-six-counts/", "https://greatgameindia.com/covid19-files-scientific", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://link.springer.com/article/10.1007/s00705-010-0729-6", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7886638/", "https://greatgameindia.com/covid19-files-scientific-investigation-on-mysterious-origin-of-coronavirus/#Special_relationship_between_Sprotein_andACE2receptor", "https://greatgameindia.com/indian-scientists-discover-coronavirus-engineered-with-aids-like-insertions/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://t.me/truthavengers", "http://voyagela.com/interview/meet-maryam-henein-honeycolony-beachwood/?fbclid=IwAR0kT-yHZsay2AaWvYuM1qLOkbiftoD4xG0yFeC5JDF_ysT5ZVqKbpH03_U", "http://www.honeycolony.com/", "http://www.vanishingbees.com/", "https://gab.com/LadyBee", "/part-1a-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/?login=1", "#", "#"], "authors": [], "publish_date": "2022-03-14T23:00:07+00:00"}