{"result_id": "332048", "URL": "https://vaxxter.com/us-navy-shipyard-turns-the-tide-on-biden-says-no-to-vaccine-mandate/", "timestamp": "2023-04-25 17:53:43 CEST+0200", "meta": {"description": "US Navy reverses vaccine mandate", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/us-navy-shipyard-turns-the-tide-on-biden-says-no-to-vaccine-mandate/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "US Navy Shipyard Turns the Tide on Biden, Says \"No\" To Vaccine Mandate", "cleaned_text": "On, Monday November 22, Joe Biden’s initial mandate was issued for all federal employees to get the COVID vaccine. On November 16, the US Navy backed down.\n\nThe Norfolk Naval Shipyard in Virginia repairs and modernizes the US Navy’s warships. On their home page, they talk about their amazing team of people who “exemplify integrity, discipline, accountability, responsibility, and initiative in order to achieve toughness in all aspects of our duties.” They also talk about maintaining and strengthening the bonds of trust and confidence within that team.\n\nIn October, Norfolk Naval Shipyard Commander Captain Dianna Wolfson told her team that all shipyard employees needed to be fully COVID-vaccinated. The order was in line with President Biden’s Executive Order 14043 requiring all federal workers to “protect themselves and the public with whom they interact” against COVID-19.\n\nWolfson urged shipyard workers to stay united and focus on their mission. This was a subtle message to get vaccinated. Wolfson reasoned that US adversaries are only growing stronger and working together to undermine American naval dominance, seeming to imply that the unvaccinated would further weaken the Navy. However, Wolfson also said she respected each individual’s choice to leave the shipyard instead of getting the jab.\n\nWolfson’s team comprises 25,000 employees from Newport News Shipbuilding (NNS), the largest industrial employer in Virginia. NNS is a division of Huntington Ingalls Industries. The company holds a federal contract to be the sole designer, builder, and refueler of US Navy aircraft carriers. NNS also holds one of two contracts that do the same for US Navy submarines.\n\nThe company has a 550-acre facility in Newport News and has built more than 800 naval and commercial ships. The company was originally founded in 1886 as the Chesapeake Dry Dock and Construction Company. The Norfolk Naval Shipyard is one of America’s oldest institutions. It was established as Gosport Shipyard in 1767 and was destroyed during the American Revolutionary War. It was rebuilt, served as the first drydock in the 1830s, and became a Confederate shipyard during the Civil War. After it was destroyed again in 1862 during the war, it was rebuilt, given its current name, and has continued operations to the present day.\n\nIn October, shortly after Wolfson’s mandate edict, shipyard employees protested the government’s order to be vaccinated or else. Many had already left their jobs, citing religious or health exemptions. Many more remained on the job but were making preparations to quit, willing to lose their jobs over a mandate they felt was unconstitutional.\n\nWith the deadline just days away, the Navy backed down, telling Huntington Ingalls Industries (HII) on November 16 that they will not have to comply with the mandate. The Navy is no longer requiring shipyard employees to be vaccinated against the coronavirus as a “condition of continued employment.”\n\nWhy did the Navy back down? First, the deadline kept changing. Biden’s executive order called for a November 22 deadline, but shipyard employees were given until December 8. Then the deadline was once again extended to January 4.\n\nSecond, it appears that Huntington Ingalls executives took a deep dive into their contract with the Navy. The company has very clearly clarified with the Navy that their contracts do not include a requirement to implement such a vaccine mandate. The Navy officially confirmed this, and therefore employees “don’t have to comply with a vaccine mandate at this time.” The company appeared to have reviewed all contracts to determine modifications and re-pricing needed to reflect the new requirement. A subset of the employees are on a different Technical Solutions contract and the mandate still holds for those employees.\n\nThird, the Occupational Safety and Health Administration (OSHA) shifted gears. In early November, OSHA issued an emergency rule requiring all employers, federal or otherwise, with more than 100 employees to issue a vaccine mandate. A number of states and private sector entities sued. The day after OSHA’s issuance, the Fifth Circuit Court of Appeals blocked the mandate from nationwide implementation. A week later, on November 12, the Fifth Circuit conducted an additional judicial review and ordered the mandate to remain blocked.\n\nAdditionally, the Court directed OSHA to take “no steps to implement or enforce the Mandate until further Court Order.” Biden’s Department of Labor acknowledged the ruling. As a result, OSHA suspended their action regarding the “emergency temporary standard” issuance.\n\nWhere does this leave the shipyard employees?\n\nMultiple lawsuits are pending, and the federal Court of Appeals could change its decision. Representatives from Huntington Ingalls Industries communicated to their workforce that the federal mandate is a fluid situation. In a letter to employees, the company thanked employees for their patience and reiterated that it does not want to lose any employees – to the virus or to the mandate. Approximately 20 percent of the shipyard’s contractor workforce would be affected by a vaccine mandate.\n\nCan the US Navy really afford to lose employees at this time, particularly in light of the Navy shipyard’s other troubles? In mid-November, a former steel foundry employee pled guilty to fraud, admitting that she faked steel strength test results. The tests were in place to ensure the steel would not fail during wartime scenarios. However, the metallurgist who falsified records thought the strength tests were “stupid and unrealistic”, so she falsified test records – for decades. Much of that steel ended up at the Navy Shipyard in Newport News for building submarines.\n\nHHI and NNS are communicating to employees who have already given their retirement or resignation notices due to the mandate. They have let these employees know that they are welcome to reverse their decision. The company will also be reaching out to employees who have already left the company, not wanting to be vaccinated due to religious or medical exemptions, inviting them to come back to work.\n\nFed Up Texas Chick is a contributing writer for Vaxxter. She’s a rocket scientist turned writer, having worked in the space program for many years. She is a seasoned medical writer and researcher who is fighting for medical freedom for all of us through her work.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nJoin our list here or text DRT to 22828", "opengraph": {"locale": "en_US", "type": "article", "title": "US Navy Shipyard Turns the Tide on Biden, Says \"No\" To Vaccine Mandate - The Tenpenny Report", "description": "US Navy reverses vaccine mandate", "url": "https://vaxxter.com/us-navy-shipyard-turns-the-tide-on-biden-says-no-to-vaccine-mandate/", "site_name": "The Tenpenny Report", "article:published_time": "2021-11-28T23:30:29+00:00", "article:modified_time": "2021-12-16T17:51:11+00:00", "image": "https://vaxxter.com/wp-content/uploads/2021/11/submarine-95610-scaled.jpg", "image:width": "2560", "image:height": "1708"}, "tags": ["covid vaccine", "vaccine mandate"], "tweets": [], "movies": [], "links": ["https://www.navsea.navy.mil/Home/Shipyards/Norfolk.aspx", "https://www.federalregister.gov/documents/2021/09/14/2021-19927/requiring-coronavirus-disease-2019-vaccination-for-federal-employees", "https://www.wric.com/news/virginia-news/newport-news-shipbuilding-no-longer-requiring-vaccinations-workers-who-left-due-to-previous-requirement-can-request-return/", "https://tsd.huntingtoningalls.com/", "https://www.employers.org/blog/2021/11/08/default/special-alert-osha-s-vaccine-order-is-adopted-for-large-employers/", "https://www.natlawreview.com/article/osha-temporarily-suspends-ets-implementation-fifth-circuit-injunction", "https://www.popularmechanics.com/military/navy-ships/a38236575/foundry-employee-faked-steel-strength-tests-for-navy-subs/", "https://asiatimes.com/2020/06/us-navy-was-sold-subpar-steel-for-its-subs-for-decades/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "/us-navy-shipyard-turns-the-tide-on-biden-says-no-to-vaccine-mandate/?login=1", "#", "#"], "authors": [], "publish_date": "2021-11-28T23:30:29+00:00"}