{"result_id": "332020", "URL": "https://vaxxter.com/interview-and-insights-part-1-robert-kennedy-jr-on-mercury-and-vaccine-laws/", "timestamp": "2023-04-25 17:52:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/interview-and-insights-part-1-robert-kennedy-jr-on-mercury-and-vaccine-laws/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Interview and Insights, Part 1: Robert Kennedy, Jr - On Mercury and Vaccine Laws", "cleaned_text": "by Maryam Henein, founder of HoneyColony and Vaxxter contributor\n\nDespite the lack of meaningful coverage, the CDC quietly reported in early September that 94 percent of the coronavirus deaths had underlying health problems. Only six percent died of the virus alone. The majority of those who die are over the age of 70 with comorbidities, and 40 percent resided in nursing homes.\n\nWe know that in several states, like New York, they unconsciously put infected people into nursing homes. Perhaps this was what facilitated the notion of community spread? These facts are not meant to undermine death, but to illustrate negligence and show how the MSM and supposed health experts have managed to exaggerate COVID-19. In addition to the CDC cooking their books, it’s also been reported that health officials have been encouraged and bribed into classifying other death causes as COVID-19. What does a “coronavirus-related death” really mean?\n\nMost humans who are infected with this virus recover.\n\nBut there are fatalities which are caused by proxy; I call them death by COVID-19 default. For instance, placing someone on a ventilator massively reduces a person’s chances of bouncing back, according to several small studies from the U.S., China and Europe. Patients need a ventilator when their lungs can no longer deliver enough oxygen to keep the body going. And it’s an extreme measure, critical care specialist Dr. Tiffany Osborn told NPR.\n\nTo be put on a vent, one must be intubated. This means they are ostensibly placed into a coma, whereupon a miasma of swirling sedatives, often including fentanyl, are used. Often the high pressure of the vent traumatizes already inflamed lungs, versus less invasive CPAP or BiPAP machines which are unfortunately avoided due to fears of the virus spreading.\n\nAnother risk from being on a ventilator is that the tube carrying air and extra oxygen to the lungs provides a pathway for dangerous germs. Many ventilated patients get a new lung infection, a problem known as ventilator-associated pneumonia (VAP).\n\nMeanwhile, as investigative journalist Jon Rappoport states, “all sorts of case-number cons are running loose.” The case definition of what justifies a COVID-19 positive person is laughable. Symptoms ranging from dizziness to a sniffle to a headache and mild fever are now associated with COVID-19.\n\nAs an example, Dr. Stella Immanuel, one of the Frontline Doctors, advertises that “if you have flu-like symptoms, it’s likely COVID-19.” That is not only hogwash but arguably negligent. The clinic is not even saying you have the coronavirus but assuming a patient actually has the supposed disease.\n\nThe figures are also severely bloated due to the fact that the RT polymerase chain reaction test is not a diagnostic tool, which the inventor Kary Mullis himself has stated. It produces a high percentage of false positives.\n\nAccording to Carl Hennegan, Director of the CNIHR SPCR Evidence Synthesis Working Group and a practicing GP, if the false positive rate is 0.8 percent then that means that around 90 percent OF ALL POSITIVE TESTS ARE FALSE POSITIVES.\n\nAdditionally, the sequence “CTCCCTTTGTTGTGTTGT” is an 18-character primer sequence found in the World Health Organization (WHO) coronavirus PCR testing protocol document. The test primer sequences are what get amplified by the PCR process in order to be designated a “positive” test result. It just so happens this exact same 18-character sequence is also found on Homo sapiens’ chromosome 8! This finding means that the WHO test kits should find a positive result in EVERY human.\n\nConsider also that there are more than 100 PCR tests on the market that were released under FDA Emergency Use Authorization (EUA). More importantly, there is no golden standard or testing or for matching laboratory controls.\n\nThe PCR test, which simply amplifies genetic code, can detect traces of the virus’s genetic material for a much longer period than it remains infectious. The test cannot distinguish between a living virus and a short strand of RNA from a virus. A person who tests positive may have traces of the virus in their system, but that doesn’t mean they are infectious or that they can pass the virus forward. Given coronaviruses have been around for 60+ years and there are four strains known to commonly infect humans on all continents, the test may simply identify a previous exposure to a coronavirus. There are prodigious amounts of amplification involved in attempting to pick up a strand of viral genetic code.\n\nAdditionally, ‘confirmed cases’ in asymptomatic (i.e. healthy people) continue to rise while the death rate is small and remains relatively unchanged. When the asymptomatic cases are included in ‘fatality rate’ estimates, the actual risk of death from what they are calling COVID infections is shockingly low.\n\nAnd since ICD codes for certifying COVID-19 deaths require no testing, only a ‘suspicion’ of infection, there is actually no scientific nor medical evidence available to prove deaths attributed to COVID-19.\n\nA faulty test story is where the COVID-19 figures could have ended but sadly, 10 months later it seems the political climate is getting worse. This exaggerated hoax rages on with COVID-19 “cases” accelerating as we head toward the “Greatest Fall” and the “Darkest Winter.” So-called experts like Anthony Fauci are getting proverbial hard-ons at the thought of the flu season coinciding with “a second wave of coronavirus.” Additionally, Dr. Deborah Birx encourages everyone to get vaccinated with the influenza vaccine even though flu shots exacerbate the risk of coronavirus infection by 36%, according to a Pentagon study and other supporting studies.\n\nCoronaviruses have typically been part of the makeup of respiratory illness, so what is really going on? Other than this novel coronavirus was man-made and patented back in 2015 by the Pirbright Institute associated with Bill Gates.\n\nIf this virus is not as deadly as they claim, what is the true objective of all this medical tyranny and scientism? A global economic reset? A New World Order? Is fear being used as a marketing strategy for control, while massive profits are amassed with experimental vaccines and therapeutics? Was a Hegelian-esque manufactured industry created that revolves around COVID-19? Does COVID-19 serve to usher in a A.I driven existence replete with smart cities, obedience, and a social credit system that rewards mask-wearing netizens and vaccine supporters?\n\nAny bonafide Global Elitists cannot let a good crisis go to waste. Take Larry Brilliant, epidemiologist, technologist, philanthropist. He has worked for Google and the World Health Organization has said, they get better at pandemic preparedness with each pandemic. Mr. Kennedy points out that ‘Teflon Tony’ has spent $52 million in pandemic planning.\n\nHe’s not saying that this pandemic was necessarily planned, but that there is a budget that goes into planning for future pandemics, e.g. Event 201 in October 2019, which so happened to be a simulation for a coronavirus pandemic.\n\n“Governments love Pandemics,” Robert F. Kennedy Jr. said during a powerful historic speech to a peaceful crowd of 1.5 million people in Berlin, Germany in late August. He stood alongside others like David Icke and Del Bigtree to address the brutal unwarranted COVID-19 lockdowns and lies, and Big Pharma’s coup d’état against liberal democracy.\n\nMainstream media largely ignored the Berlin protest and shamelessly lied about the magnitude of the turnout, saying there were as few as 17,000 people who showed up. Other outlets reported 36,000 attendees. “Never has the gap between the institutional press and the alternative media been so wide,” wrote Senta Depuydt, President, Children’s Health Defense Europe. Read her story to find out what really happened on August 29th in Berlin.\n\nGiven my many years of investigating, writing, and advocating for vaccine safety, meeting Robert Kennedy Jr., who in 1999 was named a hero for the planet by Time Magazine, was an absolute honor to speak with a leader who has not succumbed to a magic spell and the COVID fears about a virus less fatal than the flu.\n\nSad Irony. Mr. Kennedy regularly got a flu vaccine. In 1996, at the age of 42, he suddenly found himself sounding scratchy a la Stephen Hawking. Mr. Kennedy didn’t instantly realize he too had been a victim of a vaccine.\n\n“My whole life is trauma,” he responded to her.\n\nHe was diagnosed with Vocal Dystonia, which happens to be one of the 400 documented side effects of vaccinations, particularly influenza vaccines. According to Kennedy, five of his children are members of the Thimerosal Generation — those born between 1989 and 2003, the period when children received large doses of mercury on a “vaccination day.”\n\nIn what I find a sweet gesture, Bobby often apologizes for his voice before he speaks and informs them that the more he talks, the better he’ll sound. Bobby is full of deadpan deliveries, and the comedic relief further lights people up. People are so tired of being slowly killed by Big Pharma. God bless Mr. Kennedy for taking on the medical mafia. I would say he is fulfilling his destiny by helping humans preserve their medical freedom rights.\n\nBobby’s journey toward helping families with vaccine-injured children began with his work with coal-burning power plants and mercury found in the flesh of fish. Today, he runs the biggest water protection group in the world called Waterkeeper Alliance.\n\nAlong the way in the early 2000s, several parents told him that if he was really interested in mercury exposure, he needed to look at the mercury in vaccines and that it dwarfed the mercury found in fish. Mercury is one of the most toxic substances known to man. It does not belong in the human body and it certainly should not be intentionally ingested or injected. Out of the gate, Kennedy learned that the flu vaccine alone contains 350 times the amount of mercury determined to be safe.\n\nBobby didn’t really want to pursue vaccine issues and wanted to continue to address pollution in waterways and fisheries. He joked that for a while he avoided parents who attended his talks. Eventually, one mother showed up at his home and plunked down a pile of science on his porch. She stated that she was not going to leave until he read the documents. Bobby, who was used to reading science critically, read them “under her supervision.”\n\nIt was here that he discovered a “breathtaking delta” between the peer-reviewed science and the reality of mercury damage when used as a so-called preservative. Vaccine’s adjuvants often activate the immune system into a hyper-vigilant state, exacerbating the body for life.\n\nIn 2005, Bobby spoke on the phone with pediatrician Dr. Paul Offit, who specializes in infectious diseases, vaccines, and immunology. Offit told him that ethylmercury found in vaccines was safe compared to methylmercury found in fish. Offit cited the FDA’s tuna fish study where it showed that mercury was still found in urine from methylmercury two months after digestion. He claimed the vaccines were safe because mercury wasn’t found in after a month. He then cited a 2002 study co-authored by Michael E Pichichero that reiterated the CDC claims that ethylmercury is much less likely to “accumulate in the body and cause harm.”\n\nBut, in reality, ethylmercury leaves the bloodstream and crosses the blood-brain barrier. It is deposited stealthily in the brain, leading to conditions such as speech delays, attention-deficit disorder, hyperactivity, and yes, autism. Thimerosal is the most active form of mercury and has been utilized in vaccines since the 1930s. Since that time, the childhood vacciantion schedule went from five doses to an obscene 72.\n\nAs an aside, Offit is the co-inventor of a rotavirus vaccine which he co-created for the pharmaceutical company Merck.\n\nDuring the phone call with Bobby, Offit went on to claim that mercury contained in some multi-dose preparation of the flu vaccine wasn’t harmful. Bobby brought up that ethylmercury is known to cross both the placenta and the blood-brain barrier. Once in the bloodstream, mercury also enters red blood cells where it binds to the hemoglobin, preventing them from carrying as much oxygen as they should.\n\nThere was complete silence from Offit. Bobby said, “He knew that I knew that he’d been caught lying.”\n\nOffit told Bobby he’d look into it and get back to him…and that was the last time Bobby heard from him. “I am hoping I will depose him one day soon,” says Mr. Kennedy.\n\nScientists have known for a long while that mercury in its various forms is extremely toxic. For example, in 1939 a paper was published showing that mercuric chloride at a level of 8 parts per billion kills a certain species of fish. Considering that one part per billion is roughly equivalent to one sugar cube in a swimming pool — as Thimerosal-preserved vaccines, with a concentration of 50 thousand parts per billion of mercury per dose, it can hardly be declared safe.\n\nShortly before 2005, after studying the leading scientific research and talking with many of the nation’s preeminent authorities on mercury, Mr. Kennedy came across the Simpsonwood transcripts. This further cemented the link between thimerosal and the epidemic of childhood neurological disorders, and the extent to which Big Pharma will go to prolong the false narrative that vaccines save lives.\n\nSimpsonwood refers to a secret meeting in June of a group of 52 top “health officials” and government scientists like host Walter Orenstein, CDC’s former director of the national immunization program. Representatives of every major vaccine manufacturer were also present. The meeting was held at the isolated Simpsonwood Methodist retreat and conference center in Norcross, Georgia was called “an individual simultaneous consultation.” It was called to discuss a disturbing study headed by CDC epidemiologist Tom Verstraeten, who analyzed the agency’s massive database containing the medical records of 100,000 children. He found that thimerosal appeared to be responsible for a dramatic increase in autism and a host of other neurological disorders among children. “I was actually stunned by what I saw,” Verstraeten told those assembled at Simpsonwood.\n\n“I don’t know why they recorded this [meeting],” Mr. Kennedy says in a deadpan manner, “especially after admitting that this would be a scandal if the public ever found out. Instead of coming out with the truth, they opted for the cover.”\n\nCDC officials repeatedly reminded participants the discussion was embargoed. There, they plotted on how to hide the damaging data. To falsely exonerate vaccines, the CDC paid the Institute of Medicine to conduct a new study to whitewash the risks of thimerosal, ordering researchers to “rule out” the chemical’s link to autism. It withheld Verstraeten’s findings, even though they had been slated for immediate publication, and told other scientists that his original data had been “lost” and could not be replicated.\n\nAnd to thwart the Freedom of Information Act, the CDC handed its giant database of vaccine records over to a private company, declaring it off-limits to researchers. By the time the Verstraeten study was finally published in 2003, he had gone to work for GlaxoSmithKline and reworked his data to bury the link between thimerosal and autism.\n\nThe different versions of crunching the data ‘before’ and ‘after’ Simpsonwood 2000 are described in great detail in Mr. Kennedy Jr.’s 2014 book Thimerosal, Let the Science Speak.\n\nHow much proof do we need that the government is far more adept at handling the damage than at protecting children’s health?\n\nKennedy’s book exposed the collusion between Big Pharma and the US government, and the dangers associated with vaccines produced by the pharmaceutical companies.\n\nIt didn’t take long for Bobby to learn that there are myriads of other problems with vaccines, mainly that they are not safety tested.\n\n“Vaccines have an exemption, unlike any other medical product, and are not tested against placebos. Without safety testing, no one can tell you with any medical authority if vaccines are injuring more people than they are helping,” he affirms.\n\nChildren’s Health Defense figured out a way to get around the National Childhood Vaccine Injury Act (NCVIA) of 1986 which was signed into law by United States President Ronald Reagan as part of a larger health bill. NCVIA’s purpose was to eliminate the potential financial liability of vaccine manufacturers due to vaccine injury claims from the DTP shot.\n\nGiven the impunity, the workarounds to successfully win a lawsuit include proving that the vaccine manufacturer knew about an adverse effect of a vaccine and failed to list it on the insert. Another way to thread the legal needle is if a manufacturer purposely designs a clinical trial to appear as if the vaccine is safe.\n\nBobby is currently suing the University of California for recently making flu vaccines mandatory to attend school. He has successfully sued Monsanto (now Bayer) over their cancer-causing Roundup/glyphosate. And he is suing Facebook for censoring, shadowbanning, and throttling posts by\n\nIncidentally, Adam Schiff (D) told Facebook and other social media tech companies like Google to censor those that stand for vaccine safety.\n\nGo here for Part 2 …\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nJoin our list here or text DRT to 22828\n\nMaryam Henein is a Canadian-born investigative journalist, activist, functional medicine consultant, filmmaker, and founder of HoneyColony. She directed the documentary Vanishing of the Bees narrated by Ellen Page Early life and education. Follow her on Twitter @maryamhenein and youtube.com/maryamheneinbeelady", "opengraph": {"locale": "en_US", "type": "article", "title": "Interview and Insights, Part 1: Robert Kennedy, Jr - On Mercury and Vaccine Laws - The Tenpenny Report", "description": "by Maryam Henein, founder of HoneyColony and Vaxxter contributor Despite the lack of meaningful coverage, the CDC quietly reported in early September that 94 percent of the coronavirus deaths had underlying health problems. Only six...", "url": "https://vaxxter.com/interview-and-insights-part-1-robert-kennedy-jr-on-mercury-and-vaccine-laws/", "site_name": "The Tenpenny Report", "article:published_time": "2020-10-15T15:11:46+00:00", "article:modified_time": "2020-10-15T18:43:41+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/10/dreamstime_xs_185150212.jpg", "image:width": "480", "image:height": "416"}, "tags": ["Kennedy", "mercury", "RFK Jr", "vaccine injury"], "tweets": [], "movies": [], "links": ["https://thetruthaboutcancer.com/cdc-inflates-coronavirus-deaths/", "https://www.npr.org/sections/health-shots/2020/04/02/826105278/ventilators-are-no-panacea-for-critically-ill-covid-19-patients", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)30566-3/fulltext", "https://emergencymedicine.wustl.edu/people/tiffany-osborn/", "https://www.dailymail.co.uk/news/article-8262351/Nurse-New-York-claims-city-killing-COVID-19-patients-putting-ventilators.html", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2765812/", "https://canadafreepress.com/article/covid-case-numbers-far-lower-than-claimed", "https://uncoverdc.com/2020/04/07/was-the-covid-19-test-meant-to-detect-a-virus/", "https://www.phc.ox.ac.uk/team/carl-heneghan", "https://pieceofmindful.com/2020/04/06/bombshell-who-coronavirus-pcr-test-primer-sequence-is-found-in-all-human-dna/", "https://pieceofmindful.com/2020/04/06/bombshell-who-coronavirus-pcr-test-primer-sequence-is-found-in-all-human-dna/", "https://news.sky.com/story/coronavirus-tests-may-be-picking-up-traces-of-dead-virus-12064151", "https://lockdownsceptics.org/lies-damned-lies-and-health-statistics-the-deadly-danger-of-false-positives/", "https://wp.me/p9YsH5-28a", "https://www.cdc.gov/coronavirus/2019-ncov/hcp/planning-scenarios.html", "https://childrenshealthdefense.org/news/vaccine-misinformation-flu-shots-equal-health/", "https://www.collective-evolution.com/2020/08/31/media-blackout-massive-gathering-in-germany-as-rfk-jr-exposes-bill-gates-big-pharma/", "https://childrenshealthdefense.org/advocacy-policy/what-really-happened-in-berlin-chds-senta-depuydt-was-there/", "https://www.latimes.com/california/story/2020-04-17/coronavirus-antibodies-study-santa-clara-county", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2783141/#B1", "https://waterkeeper.org/staff/robert-f-kennedy-jr/", "https://en.wikipedia.org/wiki/Paul_Offit", "https://www.chop.edu/centers-programs/vaccine-education-center/video/there-mercury-vaccines", "https://childrenshealthdefense.org/known-culprits/mercury/mercury-facts/the-comparable-dangers-of-ethylmercury-and-methylmercury/", "https://www.scirp.org/reference/referencespapers.aspx?referenceid=2314320", "https://en.wikipedia.org/wiki/Paul_Offit", "https://www.globalresearch.ca/vaccinations-deadly-immunity/14510", "https://www.globalresearch.ca/vaccinations-deadly-immunity/14510", "https://www.globalresearch.ca/vaccinations-deadly-immunity/14510", "https://www.globalresearch.ca/vaccinations-deadly-immunity/14510", "https://www.globalresearch.ca/vaccinations-deadly-immunity/14510", "https://www.amazon.com/Thimerosal-Evidence-Supporting-Immediate-Neurotoxin/dp/B00REWL6YG/ref=sr_1_1?dchild=1&keywords=Thimerosal%2C+Let+the+Science+Speak&qid=1602769225&sr=8-1", "http://1986theact.com/", "https://www.honeycolony.com/article/monsantocompany-cant-hide-evil/", "https://wp.me/p9YsH5-2tO", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "http://www.twitter.com/maryamhenein", "http://youtube.com/maryamheneinbeelady", "https://www.dreamstime.com/covid-contact-tracing-vector-illustration-hand-holding-smartphone-similar-to-google-android-apple-ios-iphone-mobile-cell-image185150212", "https://www.dreamstime.com/photos-images/covid-20totalitarian.html", "/interview-and-insights-part-1-robert-kennedy-jr-on-mercury-and-vaccine-laws/?login=1", "#", "#"], "authors": [], "publish_date": "2020-10-15T15:11:46+00:00"}