{"result_id": "332031", "URL": "https://vaxxter.com/new-survey-of-vaccine-free-group-exposes-long-term-impact-of-vaccination-policies-on-public-health-by-greg-glaser-and-pat-oconnell/", "timestamp": "2023-04-25 17:53:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/new-survey-of-vaccine-free-group-exposes-long-term-impact-of-vaccination-policies-on-public-health-by-greg-glaser-and-pat-oconnell/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "New survey of vaccine-free group exposes long-term impact of vaccination policies on public health by Greg Glaser and Pat O'Connell", "cleaned_text": "They tell us vaccines are “safe and effective.”\n\nThey tell us the risks of common diseases outweigh the risks of vaccines.\n\nThey tell us vaccine risks are “rare.”\n\nWhat if none of these claims are true?\n\nIn 2019, Joy Garner with The Control Group set out to answer that question by conducting a litigation survey of never-vaccinated people. They found that, in every case, the claims we hear from our vaunted government and TV experts about the risks and benefits of vaccines are demonstrably false.\n\nIn fact, they learned that the tiny, vaccine-free minority of Americans is far healthier overall than the vaccinated majority.\n\nBut let’s step back for a moment to the questions we should all be asking about those familiar claims.\n\nIn its 2011 case, Bruesewitz v. Wyeth, the US Supreme Court acknowledged that vaccines cause injuries.\n\n“The National Childhood Vaccine Injury Act of 1986 (NCVIA or Act) created a no-fault compensation program to stabilize a vaccine market adversely affected by an increase in vaccine-related tort litigation and to facilitate compensation to claimants who found pursuing legitimate vaccine-inflicted injuries too costly and difficult.”\n\nThe Court noted that vaccine injuries are unavoidable.\n\nJustice Scalia noted that the FDA regulations specify no criteria for measuring, much less ensuring, the claimed safety or effectiveness of vaccines.\n\nTo make our answer even clearer, the law classifies vaccines as “unavoidably unsafe products.”\n\nThe excerpt above aptly notes the common and more direct synonym for the word unsafe. That synonym is: dangerous.\n\nTo emphasize the point, the 1986 law gave vaccine makers immunity from legal liability and created a no-fault vaccine court that compensates families for documented vaccine injuries and deaths out of a taxpayer fund.\n\nSo the answer to the question “Are vaccines safe?” is a solid and resounding “No.”\n\nWe know for a fact vaccines are dangerous. They absolutely cause injuries and deaths. And yet “the authorities” have decided for us that the benefits outweigh the risks. What is that decision based on?\n\n(Q) DO THE RISKS OF COMMON DISEASES OUTWEIGH THE RISKS OF VACCINES?\n\n (A) WE DON’T KNOW.\n\nThat’s right: We. Don’t. Know.\n\nWHY we don’t know is a long story. But the key reasons are these:\n• real risks exaggerated, truth about those risks is suppressed by the authorities and the media. One on changes to the vaccine court’s injury table from the US Department of Health and Humans Services (HHS) repeats empty claims of vaccine benefit and discounts the scope and severity of vaccine harms without a shred of proof.\n• benefits of common diseases are rarely acknowledged by the authorities. (Yes there are benefits of getting diseases, including reduction in the risks of more serious illnesses like\n• Emergency vaccine s (like those for covid-19) may not be properly tested in animals before being approved for Phase 1 human trials. Animal trials are crucial to determine how vaccinated subjects react later, when they are exposed to the wild virus, to ensure they don’t create , which can trigger a dangerous, sometimes deadly, immune overreaction called a “cytokine storm.”\n• Vaccines not safety tested against harmless (inert) placebos like saline. They’re tested against false “placebos” consisting of other e vaccines already on the market or the most toxic ingredients in the new vaccine. That’s why we never know how vaccines stack up against Nature, or random chance. Similarly, vaccine clinical trials never use fully unvaccinated control subjects . This is like a tobacco company claiming cigarettes are safe because they compared people who smoke 70 cigarettes per week to those who smoke 69 cigarettes per week.\n• never compared the long-term health of the vaccine-free have caught these infections the health of those who have been vaccinated\n\nDespite what we’re told, we simply can’t know whether getting common infections is more dangerous than getting vaccinations for them without studying the health outcomes of both vaccinated and unvaccinated subjects.\n\n(Q) ARE THE RISKS OF VACCINES “RARE”?\n\n (A) WE DON’T KNOW.\n\nAgain, there’s something vitally important we don’t know about a widely and coercively used class of product.\n\nThere are many reasons we don’t know how “rare” (or common) vaccine injuries and deaths are. They include these:\n• The national Vaccine Adverse Events Reporting System (VAERS) captures fewer than 1% of all vaccine reactions and deaths according to the government’s own study by Harvard Pilgrim Health Care. In other words, the system misses more than 99% of harms caused by vaccines. That means any statistics showing the number of adverse reactions must be multiplied by 100 for a reasonably accurate estimate.\n• None And there is no system that tracks long-term vaccine consequences that only emerge after months or years of immune overstimulation by vaccine toxins that can’t be easily purged from the body.\n• None In three separate reviews of the best available science on claimed vaccine harms, the government’s Institute of Medicine majority of studies were “inadequate” to either prove or disprove causation . This means the studies were so poorly designed and/or executed they can’t prove , one way or the other.\n• vaccine schedule and the specific combinations of vaccines that children are routinely given at one time have never been studied for interactive or cumulative harms\n• never compared overall health vaccinated to that of vaccine-free\n• healthcare providers are taught, perhaps pressured, to see even distressing vaccine reactions as “normal,” diseases and disorders that arise weeks, months or years after vaccination as “ unrelated coincidences .” They may indeed see and worry about the declining health among patients, but never connect those declines with vaccines because the evidence that might connect them is lacking, inadequate or suppressed.\n\n“Rare” can only be judged in relation to something else. In the case of vaccine harms, we need a substantial group of vaccine-free citizens and a clear accounting of their health issues to compare the relative “rarity” (or frequency) of harms in people who get vaccines to the frequency of such harms in people who don’t.\n\nThis reference population exists for moment, though their numbers are falling. And our esteemed authorities steadfastly refuse to study them.\n\nThat’s why the answer to question three, “Are vaccine risks rare?” is also “We don’t know.”\n\nTHE LOOMING EXTINCTION OF OUR ENDANGERED VACCINE-FREE POPULATION\n\nJoy Garner realized that the most important group of people in America was being driven toward extinction by ever more forceful vaccine mandates, dwindling exemptions, and blatant coercion.\n\nHer survey group represents the desperately needed “control group” for this massive experiment our authorities have been conducting on our children, and increasingly on adults, for at least 30 years now. Only the never-vaccinated among us can show us what life and health look like when we let our immune systems do their jobs and manage illnesses as they come along.\n\nThe vast majority of Americans—99.97%, or more than 329 million—have been exposed to vaccines.\n\nBy contrast, our tiny group of vaccine-free citizens makes up only about 0.26% of the population, or roughly 800,000 children and adults.\n\nYet, curiously, they are often feared and blamed for all the ills of the majority. Do the healthy, unvaccinated few among us really have that much power?\n\nGarner saw the decline of the unvaccinated control population and knew it was vitally important to gather the wisdom manifested in their health trajectories while it was still possible. And it was important to protect this endangered species from extinction.\n\nGarner named her litigation The Control Group for obvious reasons. Her passion and love for others drove her to tackle this project our authorities should have done, and still should do on a larger scale.\n\nBut it was her intelligence and business experience that gave her the skills and confidence to pull it off.\n\nAfter all, at its core, the task was straightforward:\n• None Create a survey like the ones the authorities typically use to gather health data on Americans.\n• None Get the survey into the hands of the target population (the never-vaccinated).\n• None Crunch the numbers from the surveys, and validate the results.\n• None Compare health outcomes from the survey results to national health statistics for the vaccinated majority.\n\nThe survey instruments themselves were streamlined into two forms, and the process followed appropriate protocols for collecting and reporting health data for litigation. The forms prompted respondents to report all illnesses and disabilities.\n\nGarner reached the subject population by promoting the survey through social media, radio interviews, events, referrals and other means.\n\nSurveys were manually completed and mailed back (or handed back at events) to help eliminate some of the flaws in online, electronic surveys.\n\nFollow-up calls clarified unclear answers and helped ensure participants recalled and reported all health issues.\n\nGarner compiled and evaluated the results using established statistical practices, and engaged experts in relevant fields to validate the forms and the process as well as the results.\n\nAnd she acquired comparable statistics for the vaccination population from national health reports.\n\nIn the end, survey respondents represented a solid 0.179% of the entire vaccine-free population, estimated during the survey period at around 832,521 Americans, and ranged in age from under 1 year to 73.\n\nFrom the data on both groups—the vaccinated and the never-vaccinated—her team generated graphs that tell a powerful story, one every American, indeed, every citizen of the world, should hear. Now. While they still can.\n\nIn every case, the vaccinated majority of Americans (shown in orange) experienced far more illness and dysfunction than the vaccine-free survey population. How much more? See for yourself.\n\nThe first graph shows that at least 27%* of America’s vaccinated children have chronic health conditions in general. That’s 10 to 20 million kids and families dealing every day with issues ranging from allergies, asthma and rashes … to ADHD or autism … to epilepsy, cerebral palsy, cystic fibrosis, diabetes, or even cancer.\n\n* Because the definition of “chronic illness” has changed over the years, this chart uses the same 2010 national health data used to calculate a Pearson Correlation Coefficient showing a very high correlation between the CDC vaccine schedule and childhood chronic disease. As of 2020, the national rate of chronic illness is closer to 54% or higher.\n\nVaccinated kids are 3.5 times more likely to have one chronic illness and 5.7 times more likely to have multiple chronic conditions.\n\nThat means more family disruption, more medication and doctor visits, more expenses, and more risk from complications of infectious diseases like covid-19.\n\nFor our adult population, with their cumulative exposures to vaccinations, the picture is even more dramatic…and disturbing.\n\nNational statistics show that vaccinated adults are 9.5 times more likely to have chronic conditions, including asthma and arthritis, plus some of the leading causes of death such as diabetes, heart disease, respiratory illness, and cancer.\n\nVaccinated adults are 43 times more likely to have two chronic conditions.\n\nAnd 12% of the vaccinated have five chronic illnesses. These are the people we’ve heard about on the news who are at increased risk of hospitalization and death from infectious diseases like covid-19. Yet NONE among the vaccine-free population fall into that highest-risk category.\n\nLet’s take a closer look at how these general health issues manifest in specific illnesses.\n\nVaccinated children are many times more likely to suffer from asthma, eczema, food allergies, ear fluid, and strabismus (eye alignment issues).\n\nVaccinated populations also have far more developmental and neurological issues, learning disabilities, speech disorders, epilepsy, ADHD, and autism.\n\nFor example, the rate of ADHD is 19 times more common in vaccinated kids.\n\nSignificantly, NO vaccine-free babies had died from sudden infant death syndrome (SIDS).\n\nAnd NO vaccine-free children had cancer.\n\nVaccinated people had 44 times more digestive disorders, and a whopping 207.5 times more chronic sinusitis (sinus infections).\n\nIllnesses they DIDN’T SEE in the vaccine-free population\n\nPerhaps most astounding is the range of illnesses the vaccine-free subjects just didn’t have. The contrast between the vaccinated and the unvaccinated are illustrated in the graphics below. The vaccine-free had ZERO adult ADHD and asthma, ZERO arthritis, ZERO diabetes, ZERO heart disease, and even ZERO cancer.\n\nTo bring this message home, The Control Group’s statistical analysis of national health data shows a “very high correlation” between the increases in children’s health problems and the increases in vaccination since 1994.\n\nThese are not coincidences.\n\nRegardless of whether this survey fully reflects the overall vaccine-free population, the data collected here are more than compelling enough to warrant further inquiry.\n\nAny study can and should be challenged. That’s what real science is all about. The Control Group pilot survey is no exception.\n\nHowever, it’s important to note that two other studies (Hooker/Miller, and Thomas/Weiler-Lyons) were also released in 2020 comparing health outcomes of vaccinated and unvaccinated subjects.\n\nAnd in all three studies, the same pattern emerged: the vaccinated experienced far more overall illness and dysfunction than the vaccine-free.\n\nSo, while we may be inclined to take one, perhaps even two, studies with a grain of salt, when three independent studies—approaching the same question from three different perspectives, using different subjects—all tell the same story, it’s worth taking a closer look and conducting well-funded, comprehensive studies.\n\nIn fact, The Control Group’s Joy Garner has already designed and proposed such a study for the government to sponsor or conduct.\n\nMany questions remain. The resources listed at the end of this article provide more detailed information.\n\nWe don’t know how many Americans are vaccine free\n\nBecause federal agencies—like the Census Bureau in its National Survey of Childhood Health, which routinely surveys Americans’ health status—don’t bother to collect data on vaccination status, we cannot know the exact percentage of the population that’s never been exposed to vaccines. Most researchers estimate that number at well below 1%, more likely at 0.26%.\n\nWe can reasonably assume that any national health data includes that tiny number of never-vaccinated Americans. However, the results of these 2020 studies all suggest that, if the unvaccinated skew the national health statistics at all, they cause the true scale of our devastating national health crisis to be underestimated.\n\nThe Control Group had higher percentage of children than the overall population\n\nIn all fairness, this pilot survey surveyed toward the youthful side with nearly 86% of respondents under 18 and only 14% adults, whereas the national population has about 23% in the 0-18 group and 77% adults. Therefore, the data regarding illnesses that typically appear or increase in prevalence with age may be underrepresented in any of the combined (children and adults) results reported here.\n\nHowever, this disproportion between unvaccinated children and adults in the pilot study only highlights the difficulty we face of sustaining a fully-representative, natural control group through which to judge the overall effectiveness of public health measures like mass vaccination.\n\nSimply put: the older we get, the harder it is to remain vaccine-free. Jobs increasingly require vaccinations. Today we see pressures to vaccinate for travel and for admission to events and facilities. We may even be vaccinated during medical procedures without realizing it. And seniors in assisted living or nursing facilities are frequently urged to vaccinate and may face discrimination or loss of benefits if they refuse.\n\nOur natural control group of vaccine-free citizens is an endangered species and must be protected from extinction.\n\nTHE LEGAL CASE: PROTECTING THE VACCINE-FREE, FREEING EVERYONE\n\nGiven that vaccines are demonstrably dangerous yet their true risks have never been properly measured and quantified by the authorities using an unvaccinated control group, this practice of near-universal vaccination by public policy constitutes a massive medical experiment perpetrated on the American population without their fully informed consent. It must be halted until we have better data available.\n\nIn 2021 Informed Consent Legal Defense and The Control Group leaders and participants are bringing to federal court mountains of evidence for vaccine harms, with reasons to protect the unvaccinated and the right of everyone to freely give or refuse to give informed consent for vaccinations. Their first court appearance will be on Feb 22, 2021.\n\nThey are asking the Federal Judge for a Preliminary Injunction that will conditionally stop current mass vaccination policies and pressures until such time as the overall risks of vaccines are properly measured and reported by the government using a large group of never-vaccinated Americans as controls for comparison.\n\nThis legal action, if successful, will achieve one or more desired outcomes, including:\n• None Ensure that a wealth of critical facts about known vaccine risks are on the official record.\n• Document the scope of dangerous unknowns about vaccine risks and recognize the nature of current mass vaccination policy as “experimental.”\n• Ensure the results of The Control Group ’s pilot survey and their proposal for a large-scale, auditable survey are on the official record.\n• None Protect the endangered vaccine-free population and those who wish to make their own choices regarding vaccination, by authorizing the following actions:\n• None Remove from citizens the burden to prove vaccines caused their injuries and shift that burden of proof to the government to calculate and prove the benefits of vaccinations outweigh their lifetime risks. And until such time as the government publishes quantified proof of safety and “rarity” of risk, this action will also:\n• None Prohibit the practice of referring to vaccines as “safe” in marketing and promotion.\n• None Protect free citizens’ rights to give or withhold informed consent for medical experimentation, including for vaccination.\n• None Make all vaccinations voluntary, and authorize a proposed universal vaccine exemption called the National Informed Consent Exemption (NICE).\n• None Make any laws, regulations or policies unenforceable if they discriminate against or segregate free citizens based solely on their refusal to consent to medical experimentation in the form of vaccination.\n• None Prosecute any acts of discrimination or segregation that are based solely on vaccination status.\n• None Free parents from any charges of medical neglect, or denial of medical care for their children based solely on vaccination choices and status.\n\nRegardless of our individual beliefs, we should all want to know whether vaccines make us healthier or sicker as a human community. And if they are, indeed, harming us and our children for a lifetime in exchange for suppressing typically mild, short-term illness symptoms, we need to completely overhaul our public health policies.\n\nWe also need to review our personal choices, as well as The Control Group’s graphic revelations of health experiences in the lives of those who do and don’t use vaccines, then ask ourselves: Which life do I want to live? Which life do I want for my family?\n\nFOR MORE INFORMATION, CHECK OUT THE LINKS BELOW.\n\n(1) The Control Group survey: “Statistical Evaluation of Health Outcomes in the Unvaccinated.” This page provides links to the survey’s documents, including the full report and the actual forms used to collect the data, and the full-page graphs depicting their comparisons of health outcomes for vaccinated and surveyed unvaccinated populations.\n\n(2) The 1986 National Childhood Vaccine Injury Act (NCVIA) protects vaccine makers from legal liability for vaccine injuries and deaths, with the intention to make it easier for victims’ families to receive compensation for many known and unknown harms caused by vaccines. That goal has not been met.\n\n(3) The Vaccine Injury Compensation Program (VICP) executes the NCVIA, managed mostly within the HRSA under the HHS, but uses Department of Justice (DoJ) lawyers to oppose victims’ families in vaccine court.\n\n(4) The Bruesewitz ruling effectively stopped all lawsuits against vaccine makers for design defects. In Bruesewitz v. Wyeth (2011), the Supreme Court affirmed and reinforced the fact that the 1986 law acknowledged the unavoidable dangerousness baked into the design of vaccines and freed vaccine makers from legal liability for injuries and deaths caused by product design defects. Plaintiffs can still sue for manufacturing flaws, contamination, or even for the drug company’s failure to provide warnings and disclose all known or suspected side effects. But not if the product works as designed and still causes harm.\n\n(5) “Unavoidably unsafe products” are discussed in the Code of Federal Regulations, Restatement of Torts (Second) 402A (k) § 402A. Special Liability of Seller of Product for Physical Harm to User or Consumer, Comment k. These are just a few references:\n\n“Unavoidably Unsafe Products: Clarifying the Meaning and Policy Behind Comment K”\n\n(6) Just one example of baseless claims of vaccine safety and effectiveness: A 2021 HHS report on changes to the vaccine injury table falsely claims: “Vaccination is one of the best ways to protect against potentially harmful diseases that can be very serious, may require hospitalization, or even be deadly. Almost all individuals who are vaccinated have no serious reactions.” We’ve already shown that we have insufficient data to show the real vaccine risks and the “rarity” of them.\n\nVaccination is NOT the best way to protect: “It is true that natural infection almost always causes better immunity than vaccines.” https://www.chop.edu/centers-programs/vaccine-education-center/vaccine-safety/immune-system-and-health And the risks from most common diseases are wildly exaggerated.\n\n(7) Informed Consent Defense. This page contains links to all the legal documents associated with the “Request for Judicial Notice” and “Motions for Preliminary Injunction” filed on behalf of Joy Garner and others. There is a treasure trove of information here. Highlights and recommended reading are listed after the main link below.\n\nC5 – Proposed orders. If you want to understand the objective of the case, this reference skips to the end, offering three alternative rulings for the Court to choose from. The first asks for comprehensive relief; the other two are desired runners-up.\n\nA – The Verified Petition comprises the main arguments and requests being made of the Court.\n\nA3 – Appendix Two contains a wealth of sources supporting the assertion that vaccines are, indeed, dangerous.\n\nC3 – The expert declarations. This is where to find the survey’s raw data and a variety of relevant scientific information.\n\nCharts and infographics – Click the various images on the main page to see full-page visuals and summaries of key data depicting The Control Group’s survey findings as well as national statistics.\n\n(9) Harvard Pilgrim Healthcare study of VAERS conducted for the Agency for Healthcare Research and Quality (AHRQ) under the HHS concluded that “[F]ewer than 1% of vaccine adverse events are reported. Low reporting rates preclude or slow the identification of “problem” drugs and vaccines that endanger public health. New surveillance methods for drug and vaccine adverse effects are needed.”\n\n(10) “Vaccine Safety” a white paper summarizing the IOM’s reports and the vaccine safety question in general by the Informed Consent Action Network. Good overview.\n\n(12) Institute of Medicine’s 2011/2012 report “Adverse Effects of Vaccines; Evidence and Causality”\n\n(13) Other 2020 studies of vaccinated vs. unvaccinated children:\n\n(14) The current National Health Survey of Children’s Health questionnaire from the US Census Bureau has 19 pages with some 170 questions, not one of which even remotely attempts to identify the vaccination status of the child. The first link below is for the main page where you can find links to all questionnaires used. The second link below is to the form for the youngest children. There are similar forms for schoolchildren and teens.\n\n(16) A sampling of articles showing the benefits of having childhood illnesses\n\nChicken pox in children associated with decreased risk of shingles in adults\n\nHistory of chicken pox may reduce risk of brain cancer later in life\n\n(17) Pfizer COVID Vaccine Trial Shows Alarming Evidence of Pathogenic Priming in Older Adults – Pathogenic priming (or antibody dependent immune enhancement) can cause vaccinated people to overreact when exposed to the wild virus, triggering a dangerous cytokine storm, which can lead to multiple organ failure and death.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.", "opengraph": {"locale": "en_US", "type": "article", "title": "New survey of vaccine-free group exposes long-term impact of vaccination policies on public health by Greg Glaser and Pat O'Connell - The Tenpenny Report", "description": "  They tell us vaccines are “safe and effective.” They tell us the risks of common diseases outweigh the risks of vaccines. They tell us vaccine risks are “rare.” What if none of these claims...", "url": "https://vaxxter.com/new-survey-of-vaccine-free-group-exposes-long-term-impact-of-vaccination-policies-on-public-health-by-greg-glaser-and-pat-oconnell/", "site_name": "The Tenpenny Report", "article:published_time": "2021-02-22T21:39:53+00:00", "article:modified_time": "2021-02-26T01:04:54+00:00", "image": "https://vaxxter.com/wp-content/uploads/2021/02/main-photo-Picture1.png", "image:width": "539", "image:height": "206"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.thecontrolgroup.org/", "https://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "https://www.congress.gov/bill/99th-congress/house-bill/5546", "https://scholarlycommons.law.wlu.edu/cgi/viewcontent.cgi?article=2953&context=wlulr", "https://scholarship.kentlaw.iit.edu/cgi/viewcontent.cgi?article=4037&context=cklawreview", "https://public-inspection.federalregister.gov/2021-01211.pdf?utm_campaign=pi+subscription+mailing+list&utm_source=federalregister.gov&utm_medium=email", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2563790/#:~:text=We%20know%20that%20exposure%20to,by%20exogenous%20boosting%20of%20immunity).&text=Increased%20annual%20chickenpox%20rates%20in,the%2015%E2%80%9344%20age%20group.", "https://www.sciencedirect.com/science/article/abs/pii/S0361090X06000043", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-trial-pathogenic-priming/", "https://vaers.hhs.gov/about.html", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://www.thecontrolgroup.org/gallery", "https://journals.sagepub.com/doi/10.1177/2050312120925344", "https://www.mdpi.com/1660-4601/17/22/8674", "https://www.census.gov/content/dam/Census/programs-surveys/nsch/tech-documentation/questionnaires/2020/NSCH-T1.pdf", "https://www.kff.org/other/state-indicator/distribution-by-age/?currentTimeframe=0&sortModel=%7B%22colId%22:%22Location%22,%22sort%22:%22asc%22%7D", "https://informedconsentdefense.org/", "https://www.thecontrolgroup.org/", "https://www.congress.gov/bill/99th-congress/house-bill/5546", "https://www.hrsa.gov/sites/default/files/hrsa/vaccine-compensation/vaccine-injury-infographic-2017.pdf", "https://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "https://scholarlycommons.law.wlu.edu/cgi/viewcontent.cgi?article=2953&context=wlulr", "https://scholarship.kentlaw.iit.edu/cgi/viewcontent.cgi?article=4037&context=cklawreview", "https://www.crandalllaw.com/blog/2019/03/understanding-dangerous-design-defects-and-proving-them.shtml", "https://public-inspection.federalregister.gov/2021-01211.pdf?utm_campaign=pi+subscription+mailing+list&utm_source=federalregister.gov&utm_medium=email", "https://www.chop.edu/centers-programs/vaccine-education-center/vaccine-safety/immune-system-and-health", "https://informedconsentdefense.org/", "https://www.youtube.com/watch?v=ytryf-EziFU", "https://vaers.hhs.gov/about.html", "https://digital.ahrq.gov/ahrq-funded-projects/electronic-support-public-health-vaccine-adverse-event-reporting-system", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://www.icandecide.org/wp-content/uploads/2019/09/VaccineSafety-Version-1.0-October-2-2017-1.pdf", "https://www.vaccinesafety.edu/IOM-Reports.htm", "https://www.nap.edu/catalog/13164/adverse-effects-of-vaccines-evidence-and-causality", "https://journals.sagepub.com/doi/10.1177/2050312120925344", "https://www.mdpi.com/1660-4601/17/22/8674", "https://www.census.gov/programs-surveys/nsch/technical-documentation/questionnaires.html", "https://www.census.gov/content/dam/Census/programs-surveys/nsch/tech-documentation/questionnaires/2020/NSCH-T1.pdf", "https://www.kff.org/other/state-indicator/distribution-by-age/?currentTimeframe=0&sortModel=%7B%22colId%22:%22Location%22,%22sort%22:%22asc%22%7D", "https://www.sciencedirect.com/science/article/abs/pii/S0361090X06000043", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2563790/#:~:text=We%20know%20that%20exposure%20to,by%20exogenous%20boosting%20of%20immunity).&text=Increased%20annual%20chickenpox%20rates%20in,the%2015%E2%80%9344%20age%20group", "https://www.bcm.edu/news/chicken-pox-may-reduce-risk-brain-cancer#:~:text=History%20of%20chicken%20pox%20may%20reduce%20risk%20of%20brain%20cancer%20later%20in%20life,-Graciela%20Gutierrez&text=The%20chicken%20pox%20is%20one,reduced%20risk%20for%20developing%20glioma", "https://childrenshealthdefense.org/defender/pfizer-covid-vaccine-trial-pathogenic-priming/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "/new-survey-of-vaccine-free-group-exposes-long-term-impact-of-vaccination-policies-on-public-health-by-greg-glaser-and-pat-oconnell/?login=1", "#", "#"], "authors": [], "publish_date": "2021-02-22T21:39:53+00:00"}