{"result_id": "332033", "URL": "https://vaxxter.com/new-jerseys-cradle-to-grave-vaccine-crisis-show-up-or-lose-your-rights/?fb_comment_id=2871228212895425_2872548006096779", "timestamp": "2023-04-25 17:53:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/new-jerseys-cradle-to-grave-vaccine-crisis-show-up-or-lose-your-rights/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "New Jersey’s Cradle to Grave Vaccine Crisis: Show Up or Lose Your Rights", "cleaned_text": "Democratic legislators in New Jersey have injected the state with totalitarian legislation dictating that no student, from preschool through college, will be able to access education without being completely up to date on the CDC vaccine schedule.\n\nNew Jersey has seen just 19 measles cases this year—fewer than New York or California, and yet the legislature appears intent on enforcing the strictest mandatory vaccination bill American has seen yet.\n\nLast Thursday, the Senate Health, Human Services, and Senior Citizens Committee passed S2173 out of committee with a 5-4 vote. Droves of New Jerseyans flocked to the Statehouse that day to protest the decision, insisting it intrudes upon their First Amendment rights. So many arrive to protest the building was closed to comply with the fire code.\n\nThe media will not let parental voices be heard. Of the 1,600 who came to give testimonies, only 14 were heard. Senator Sweeney replaced 3 senators who are permanent members of the health committee with three Democrat members who said they would vote in favor of the bill.\n\nThe NJ Senate meets at 1 pm on December 16. If passed, S2173 would completely remove the religious exemption from state law, and also restrict the ability for doctors to freely provide medical exemptions to their patients.\n\nMake no mistake, this massive overreach of authority into the lives of New Jersey’s citizens is a carefully plotted attack against constitutional rights.\n\nOriginally, the S2173 gave no grace period for parents to get their kids caught up on vaccines before returning to school after the holiday season. An amendment has since been added that would allow only 180 days for all the “catch up” shots. That’s not a lot of time for the child who has never been vaccinated, or who hasn’t received shots in many years. Before the school begins in the fall of 2020, all students would have to be completely up to date or they will not be permitted to attend any public or private school in the state without a medical exemption from an approved physician.\n\nThis bill does not completely remove medical exemptions, but it would tighten up the ability to ever get one. Some legislators agree with the removal of the religious exemption if, and only if, the rules for medical exemptions are widened considerably, so the doctor has the right to discern who qualifies for a medical exemption without any interfere from the state. Companion bill A3818, proposed last year, also calls for removal of the religious exemption.\n\nA1991 is essentially a back-up to S2713 and A3818. It mandates the meningitis B vaccine for students living on campus and attending four-year colleges. If the latter two don’t get through the assembly, A1991 is has a provision to catch up the college students with all the mandated shots.\n\nHow Will NJ Pay for This?\n\nMany parents are threatening to pull their children out of public or private schools and even leave the state altogether if the law is passed.\n\nOne problem with this mandate, the way it is written, is the lack of New Jersey’s passing the law would conflict with the federal IDEA Act, which requires the state to support individuals with disabilities. Parents of students who currently make use of IEPs in public and private schools would be caught in a difficult position.\n\nState law cannot supersede federal law. Just because a mother must homeschool if she won’t vaccinate her child doesn’t mean the state is recused from their responsibility under the IDEA Act to provide paraprofessionals and other support structures to challenged students. What would that look like and how much would it cost? No one knows. New Jersey’s mandate bills are premature and obviously, financially irresponsible.\n\nI spoke to a New Jersey mother this morning. She is fighting tooth and nail alongside her peers to prevent these mandates from happening. She was also calm and collected—knowing that even with mandates, her children will not be vaccinated. She acknowledged they may be disappointed to leave their schools, and she may have to take on homeschooling, but she will not vaccinate her kids. Her words resonate with tens of thousands of parents in New Jersey and nationwide. Legislators believe parents will be forced into compliance, but most parents who have done their research, or already have one – or more – vaccine-injured child, will not succumb.\n\nKnow where this is going: mandatory vaccination and “catch up” schedules for all students who plan to go to college. Education in America is now given only after the injection of mandatory, toxic medications.\n\nS2173 ventures into uncharted territory where no mandate bill has gone before. Mandating vaccines for college students is a newer concept, especially for four-year colleges that also have graduate training programs. What about adults who return to college later in life? Or what about the retired senior citizen who wants to take an art class or learn photography through a college class? Will they be forced to have all the required vaccinations to participate? What does this mean for adults? Is this part of enforcing the Adult Vaccination Plan, released in 2015, as part of the Healthy People 2020 initiative?\n\nThis idea would tie right into the plan all states have for their citizens to be REAL ID-compliant by October of 2020. What vaccine risk awareness communities have warned about for years seems to be coming happening in real-time, right before our eyes, and just in time for an election year. What lies ahead is anyone’s scary guess.\n\nIn addition to S2173 and A3818, there are many other egregious pro-vaccine bills on the docket:\n\nS1003 would require healthcare workers to get a flu shot as a condition of their employment. There would be no option to allow those employees to opt-out and wear a mask. A1576 aims to require the flu vaccine for specific healthcare workers as well. S754 is lying in wait since last year and would expand the authority given to pharmacists and other pharmacy employees to administer certain vaccines.\n\nA1847 has been stalled since last year. This bill would require the Gardasil vaccine for HPV for all students in grades six through twelve.\n\nS634 and A3587 are targeting the formation of a Health Care Industry Representative Certification Act, which would dictate stricter vaccination policies and tighten the option for exemptions for health care representatives, such as vendors who visit hospitals for in-services or clinical education seminars.\n\nAs the law, these bills wouldn’t merely dictate which vaccines New Jersey citizens are required to give their children now but would open the floodgates any of the 300+ currently in the developmental pipeline.\n\nThe necessary step is clear.\n• Call your Senator and oppose S2173 and S1003.\n• Call your Assembly members and oppose A3818, A1576 and A1991.\n• Show up tomorrow at the Trenton Statehouse for the 1 pm hearing on S2173.\n• The vote is close. Thousands are needed to defeat this egregious bill and its lack of respect for American rights.\n\nGet the Democrats to oppose this bill before it’s too late.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow. Join our list.\n\nOr join our list by texting MVI to 555888 – follow the prompts\n\nDani Lasher is a writer, motherhood coach, and health advocate living just outside of Washington, DC. While passionate about informed consent and women’s birthing choices, she’s also slightly obsessed with city living and cooking. You can catch up with Dani at her site, BumpMama.", "opengraph": {"locale": "en_US", "type": "article", "title": "New Jersey’s Cradle to Grave Vaccine Crisis: Show Up or Lose Your Rights - The Tenpenny Report", "description": "Dani Lasher, Vaxxter Contributor Democratic legislators in New Jersey have injected the state with totalitarian legislation dictating that no student, from preschool through college, will be able to access education without being completely up to...", "url": "https://vaxxter.com/new-jerseys-cradle-to-grave-vaccine-crisis-show-up-or-lose-your-rights/", "site_name": "The Tenpenny Report", "article:author": "www.Facebook.com/vaxxterinfo", "article:published_time": "2019-12-16T04:33:04+00:00", "article:modified_time": "2020-02-02T22:00:36+00:00", "image": "https://vaxxter.com/wp-content/uploads/2019/03/Senate-dreamstime.jpg", "image:width": "480", "image:height": "325"}, "tags": ["mandates", "adult mandates", "mandatory vaccines"], "tweets": [], "movies": [], "links": ["https://www.nj.gov/health/cd/topics/measles.shtml", "https://www.njleg.state.nj.us/2018/Bills/S2500/2173_R1.HTM", "https://www.njleg.state.nj.us/2018/Bills/A4000/3818_R1.HTM", "https://sites.ed.gov/idea/about-idea/", "https://www.hhs.gov/vaccines/national-adult-immunization-plan/index.html", "https://vaxxter.com/real-ids-cards-and-government-tracking/", "https://www.njleg.state.nj.us/2018/Bills/S1500/1003_R1.HTM", "https://www.njleg.state.nj.us/2018/Bills/A2000/1576_I1.HTM", "https://www.njleg.state.nj.us/2018/Bills/S1000/754_I1.HTM", "https://www.njleg.state.nj.us/2018/Bills/A2000/1847_I1.HTM", "https://www.njleg.state.nj.us/2018/Bills/S1000/634_I1.HTM", "https://www.njleg.state.nj.us/2018/Bills/A4000/3587_I1.HTM", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "http://www.bumpmama.com/", "/new-jerseys-cradle-to-grave-vaccine-crisis-show-up-or-lose-your-rights/?fb_comment_id=2871228212895425_2872548006096779&login=1", "#", "#"], "authors": [], "publish_date": "2019-12-16T04:33:04+00:00"}