{"result_id": "332026", "URL": "https://vaxxter.com/part-10-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "timestamp": "2023-04-25 17:53:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/part-10-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Part 10: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Referred to As COVID-19 ” Vaccines”", "cleaned_text": "This is the final installment in my 10-part series, where we look at 5G, Charles Lieber, graphene and how all these poisons in the experimental injections negatively impact human health.\n\nDespite the remarkable speed of development of nanoscience, relatively little is known about the interaction of nanoscale objects with living systems.\n\nWhen I personally started seeing videos of people dropping like flies in Wuhan in late January 2020, I wondered if it was fear porn manufactured in Taiwan. While this is partially a joke, the video and footage were creepy, like a scene out of Contagion, a Hollywood film that was commissioned by Larry Brilliant, (WHO, GOOGLE, Fauci Friend) and others that also contained a virus supposedly released from a wet market in China. Do you remember the images of mindless Chinese people spitting in elevators?\n\nI found it interesting that the capital of central China’s Hubei Province was the first 5G demonstration zone in the Central Business District (CBD), according to a 5G cooperation agreement signed between China Mobile and local authorities on September 3, 2019.\n\nSo they piloted 5G services in Wuhan. I lived across from an AT&T Tower and learned from the genius Dr. Dietrich Klinghardt that Electromagnetic Field (EMF) frequencies excite bacteria, fungus, and parasites.\n\nWhat came to me in late February 2020 was that perhaps something injected in mandatory vaccines (we know many have nanotech contaminants) was “parlaying” with 5G or the I.O.T.\n\nBy this time, I came across Charles Lieber, whom the Department of Justice (DOJ) arrested on January 28th. They announced that the Chair of Harvard University’s Chemistry and Chemical Biology Department and two Chinese nationals had been charged in connection with aiding the People’s Republic of China.\n\nLieber was charged “with one count of making a materially false, fictitious, and fraudulent statement.” Yet in the end, the prized NanoTech King with pages of nano-related patents and lies, not to mention ties to China, Israel, Epstein, Harvard, and Bill Gates were all kept out of the narrative, and then the case pretty much disappeared.\n\nRegarding his nano innovations in specific biosensors, he stated:\n\n“This innovation is important because it indicates that when a man-made structure is as small as a virus or bacteria, it can behave the way biological structures do.”\n\nLieber had to relinquish his passport. I discovered that Harvard owned part of his home. He was involved in the Thousands People Project.\n\nOn March 10th the governor of MA declared a state of emergency. The very next day, Lieber asked to amend the conditions of release. By the 12th the judge granted him the ability to travel from PA & NJ for personal reasons. He later sued Harvard, fell terminally ill to cancer and died.\n\nAbout a month after I was deleted for stating that ‘graphene oxide is the secret sauce’, Astroworld happened in my article Open your eyes to a whole new universe.\n\nI bring up Astroworld because for many people it was a test. Did you know there were 11 people who experienced simultaneous heart attacks? Or did something inside of them communicate with their jab? Sounds crazy I know. Fear is the real virus. You can control people through fear. And fear, which produces the hormone adrenaline, also communicates with graphene oxide.\n\nThey love their adrenaline, I thought to myself. Could it possibly be that adrenaline also communicates with graphene oxide? I couldn’t believe what I found.\n\nAn NIH study illustrated that oxide nanoparticles grafted with graphene showed “excellent selective sensing ability towards Adrenaline and Tyrosine.”\n\nAdrenaline is a hormone that is released into the bloodstream and increases your heart rate, blood pressure, and energy source. It is released when your body is in an excited, stressful, and emergency situation.\n\nIf you think bridging the brain with bots is impossible and that this cannot be happening:\n\n“A new DARPA program aims to develop an implantable neural interface able to provide unprecedented signal resolution and data-transfer bandwidth between the human brain and the digital world.”\n\nIncidentally, in 2007, there was a Japanese anime based in the future, called Vexville (Vaxville) that came out. By the way, 2007 is the same year that Lieber got many of his creations patented.\n\n“It’s 2077, the disease was created by Daiwa and the “vaccine” was used as an excuse for Daiwa (DARPA) to begin testing experimental nanotechnology. … Essentially turning us into machines from the inside out.”\n\n“Precisely how these brain functions are manipulated is not known, but is now the subject of intense research. Interestingly, cities, where 5G roll-outs have occurred, have had severe Covid-19 cases and morbidity and mortality of the vaccinated — think Milano, Iran, and Wuhan. One relevant feature is that 41.6 GHz (in 5G) is the resonant frequency of Fullerene (C60), a specific type of GO. When the Fullerene resonates, it produces vibrations at the speed of thought (50m/s), which therefore influence and compete with real thoughts. 5G contains the optimal electron absorption band for GO, which maximizes its oxidizing activity, inflammation, and cell damage. ”\n\nPhysician Raymond Royal Rife found the resonant wavelengths/frequencies are harmonic (whole number) multiples of the size of the object you are trying to vibrate/destroy. Better put, “Resonant frequencies are equally spaced multiples of a lower frequency called the fundamental frequency. The multiples are called harmonics.” We know this is in the 5G bands for GO (approx 1nm size) which also explains the greater toxicity of the smaller (nm) GO crystals.”\n\nHow convenient that GO is the most versatile and researched material in history and that huge quantities are now being cheaply produced all over the world. One could never even have hoped for such synergy with the Covid-19 Plandemic.\n\nThere is plenty of evidence of the magnetic phenomenon —let’s call it “magnetic” in quotation marks— throughout the world not only with the issue of magnetization of magnets and metal objects, but also electromagnetic induction phenomena that generate variable electromagnetic fields inside the body when using measuring devices such as a gaussmeter or a multimeter, which also generates variable electric fields on the millivolt scale, but very out of the ordinary, in the order of 180mV to 200-350mV in some people, especially in the forehead.\n\nA superconductor that allows people to emit and receive signals?\n\nFor a deeper dive into ‘the wonder material’:\n• None Graphene Oxide (GO) as a potential drug-delivery system due to its special properties and biocompatibility\n• None about how to address the blood toxicity problem of GO\n• None discusses two-dimensional graphene oxide nanoparticles have great potential as a novel vaccine platform due to their extraordinary attributes”\n• None Evidence of GO used to make nanobot\n• None Why Are There Patents for Nanomagnets?\n• None Why Are There Patents for Quantum Dots?\n• None No proof of G.O? Hidden Ninja in Plain Sight\n• None The Brave New World Of Nanotechnology\n• None The rapid advancement of transparent flexible electronics has great potential for next-generation energy devices for self-powered nanosystems and nanosensors\n• None The Origin of Fluorescence from Graphene Oxide\n• None Investigation of porosity, microstructure, and mechanical properties of additively manufactured graphene\n• None Dynamic Viscosity and Surface Tension of Stable Graphene Oxide and Reduced Graphene Oxide Aqueous Nanofluids\n• None Graphene oxide nano-bio interaction induces inhibition of spermatogenesis and disturbance of fatty acid metabolism\n• None Toxicity of graphene-family nanoparticles: a general review of the origins and mechanisms\n• None Graphene Oxide: A Toxic Substance In the Vial of the Covid-19 mRNA Vaccine\n• None Graphene in Mice: Ultrahigh In Vivo Tumor Uptake and Efficient Photothermal Therapy\n• None Carbon nanotubes introduced into the abdominal cavity of mice show asbestos-like pathogenicity in a pilot study\n• None La Quinta Columna: ‘Graphene oxide has its absorption band in 5G\n• None Safety Assessment of Graphene-Based Materials: Focus on Human Health and the Environment\n• None Evaluating the mechanistic evidence and key data gaps in assessing the potential carcinogenicity of carbon nanotubes and nanofibers in humans\n\nHow All the Poisons Work Together\n\nAs explained, the jabs include a lipid nano-particle with an mRNA packet. What does happen, by design, is the mRNA is replicated by the cell protein production system, the endoplasmic reticulum, and ribosomes, etc. It hijacks the cell’s normal processes to make a chimeric spike. Graphene is used as a secret ingredient because the electrodynamic properties enable it to be made into trick bubbles that invade cells to deliver the mRNA payload.\n\nWhen a cell is infiltrated, the mRNA changes the DNA of the cell to manufacture spike protein. Spike protein has two functional parts, the main part is a key to the ACE-2 receptor lock. The other side of the “spike-protein” is a protein snippet from the HIV virus which apparently intended to disrupt the immune system.\n\nIn simple terms, vaccine-mutated cells are like cancer. The cells possess mutated DNA and have errant behavior. While cancer cells reproduce out of control, mRNA-mutated cells produce spike protein out of control.\n\nTo the immune system an mRNA mutated cell looks mostly like a cancer cell except it is more visible to the immune system:\n• None DNA signature is abnormal because of mutation;\n\nIn a nutshell, these vulnerabilities explain why ‘The Powers That Be’ are so insistent on multiple jabs and continuous boosters. A healthy person’s immune system can heal and even reverse cancer. But if the immune system and T-cells are destroyed, only the future will determine the extent of damage post-injection.\n\nSince writing this primer, more and more information has come out. As many of us suspected, it’s all horrible. There are now excessive deaths throughout the world. We hear daily about sudden deaths and turbo cancer where spike proteins from mRNA jabs serve as a carcinogen.\n\nI will be putting together an ebook along with protocols to help undo the damage of these kill shots. Thank you for your support of my work and I’ll let you know when the publication is ready!\n\nIn the meantime, here are the links to Parts 1 through 9 of this series:\n\nLike what you’re reading on The Tenpenny Report?\n\n Share this article with your friends. Help us grow.\n\nMaryam Henein is an investigative journalist, and founder, and editor-in-chief of the health magazine and marketplace HoneyColony. She is also a functional medicine consultant/coach, and the director of the award-winning documentary film Vanishing of the Bees, narrated by Elliot Page. Follow her on Gab: @ladybee. Email her: maryam@honeycolony.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Part 10: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Referred to As COVID-19 ” Vaccines” - The Tenpenny Report", "description": "This is the final  installment in my  10-part series, where we look at 5G, Charles Lieber, graphene and how all these poisons in the experimental injections negatively impact human health. Despite the remarkable speed of...", "url": "https://vaxxter.com/part-10-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "site_name": "The Tenpenny Report", "article:published_time": "2023-01-11T23:01:46+00:00", "article:modified_time": "2023-01-12T13:15:35+00:00", "image": "https://vaxxter.com/wp-content/uploads/2022/10/graphene-74998061-scaled.jpg", "image:width": "2560", "image:height": "1440"}, "tags": ["lieber", "nano particles", "Fauci", "5G", "graphene oxide", "Wuhan"], "tweets": [], "movies": [], "links": ["https://www.pnas.org/content/104/7/2050", "https://twitter.com/Baltahji/status/1222314373034708992?s=20", "http://en.hubei.gov.cn/news/newslist/201909/t20190905_1410979.shtml", "https://www.yicaiglobal.com/news/wuhan-to-build-china-biggest-5g-autopilot-test-zone-by-year-end-", "https://www.justice.gov/opa/pr/harvard-university-professor-and-two-chinese-nationals-charged-three-separate-china-related", "https://patents.justia.com/inventor/charles-lieber", "https://gab.com/LadyBee/posts/107083150196250275", "https://vaxxter.com/part-1-astroworld-open-your-eyes-to-a-whole-new-wicked-universe/", "https://vaxxter.com/part-2-astroworld-open-your-eyes-to-a-whole-new-wicked-universe/", "https://pubmed.ncbi.nlm.nih.gov/31514900/", "https://www.darpa.mil/news-events/2015-01-19", "https://twitter.com/BeeLady17/status/1447574417719111682?s=20", "https://www.nature.com/search?q=Neural+Effects+of+Graphene+Oxide&journal=", "https://www.nature.com/articles/s42254-020-0202-8", "https://elcolectivodeuno.wordpress.com/2021/06/16/with-5g-frequencies-of-42-6-ghz-1-2-nm-nanotubes-injected-into-vaccines-alter-our-brain-function/", "https://www.orwell.city/2021/07/graphene-oxide-5G-COVID-19.html", "https://duckduckgo.com/?q=Royal+Rife&atb=v213-1&ia=web", "https://cloudmind.info/dr-raymond-rife-cured-cancer-in-1934-then-he-was-killed/", "https://3.bp.blogspot.com/-SZ6YlJwegzg/WO98_-gZEpI/AAAAAAAABss/ZtLy1vqM8UsMwYK7DzHWEdJY2qYsrhCOgCLcB/s1600/EM_Spectrum.png", "https://nasafes.com/wp-content/uploads/2019/08/electromagnetic-spectrum-5g-by-nasafes-min.jpg", "https://duckduckgo.com/?q=Rife+Resonant+Frequencies&atb=v213-1&ia=web", "https://elcolectivodeuno.wordpress.com/2021/06/16/with-5g-frequencies-of-42-6-ghz-1-2-nm-nanotubes-injected-into-vaccines-alter-our-brain-function/", "https://www.researchgate.net/search.Search.html?type=researcher&query=Graphene%20Oxide", "https://graphene-flagship.eu/", "https://www.bitchute.com/video/NPT04lyCU4wT/", "https://pubmed.ncbi.nlm.nih.gov/21915922/", "https://www.cambridge.org/core/journals/journal-of-materials-research/article/understanding-the-hemotoxicity-of-graphene-nanomaterials-through-their-interactions-with-blood-proteins-and-cells/6748A9B2B8FE67A88F4DA504AC331E9A", "https://stateofthenation.co/?p=70400", "https://stateofthenation.co/?p=70400", "https://www.pnas.org/content/pnas/118/19/e2024998118.full.pdf", "https://pubmed.ncbi.nlm.nih.gov/22017285/", "https://youtu.be/2TjdGuBK9mI", "https://patentimages.storage.googleapis.com/fe/a6/eb/8f54ba8800d73b/US20120201859A1.pdf", "https://onlinelibrary.wiley.com/doi/10.1002/advs.201600130", "https://patentimages.storage.googleapis.com/d1/d5/03/2cb5028a1e528c/US20120265001A1.pdf", "https://patentimages.storage.googleapis.com/e6/9d/c3/787a071bfff162/US20120228565A1.pdf", "https://youtu.be/V1kbA8UfVpo", "https://pubs.acs.org/doi/abs/10.1021/tx200339h", "https://youtu.be/2TjdGuBK9mI", "https://youtu.be/dn2UjBIsrcI", "https://en.x-mol.com/paper/article/1253722607322030080", "https://www.researchgate.net/publication/233397449_The_Origin_of_Fluorescence_from_Graphene_Oxide", "https://www.era-learn.eu/network-information/networks/fetflag-02-2018/flag-era-joint-transnational-call-jtc-2019/graphene-enabled-optical-phased-array-for-lidar-applications", "https://pubmed.ncbi.nlm.nih.gov/24422439/", "https://tv.gab.com/channel/ladybee/view/more-on-graphene-oxide-618ea6da31b44e052d087aee", "https://www.researchgate.net/publication/338982026_Investigation_of_porosity_microstructure_and_mechanical_properties_of_additively_manufactured_graphene_reinforced_AlSi10Mg_composite", "https://ingentaconnect.com/content/asp/jon/2018/00000007/00000006/art00008;jsessionid=1q37p8c5bi0ou.x-ic-live-01", "https://pubmed.ncbi.nlm.nih.gov/30218681/", "https://historyheist.com/Wickedpedia/graphene-oxide/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5088662/", "https://www.bitchute.com/embed/17S4PiXkfU6t/", "https://www.researchgate.net/publication/45503980_Graphene_in_Mice_Ultrahigh_In_Vivo_Tumor_Uptake_and_Efficient_Photothermal_Therapy", "https://www.nature.com/articles/nnano.2008.111", "https://pubmed.ncbi.nlm.nih.gov/30218681/", "https://stateofthenation.co/?p=70400", "https://www.orwell.city/2021/06/la-quinta-columna-graphene-5G.html", "https://www.orwell.city/2021/06/radio-el-mirador-del-gallo.html", "https://pubs.acs.org/doi/10.1021/acsnano.8b04758", "https://www.tandfonline.com/doi/abs/10.1080/10408444.2016.1206061?journalCode=itxc20", "https://vaxxter.com/part-1a-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "https://vaxxter.com/part-2-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "https://vaxxter.com/part-3-a-primer-understanding-the-experimental-genetic-technology-referred-to-a-vaccine/", "https://vaxxter.com/part-4-a-primer-understanding-the-mechanisms-of-the-covid-19-vaccines/", "https://vaxxter.com/part-5-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines", "https://vaxxter.com/part-6-understanding-the-mechanisms-of-the-covid-19-vaccines/", "https://vaxxter.com/part-7-a-primer-understanding-the-mechanisms-of-the-covid-19-vaccines/", "https://vaxxter.com/part-8-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "https://vaxxter.com/part-9-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "http://www.maryamhenein.com", "http://voyagela.com/interview/meet-maryam-henein-honeycolony-beachwood/?fbclid=IwAR0kT-yHZsay2AaWvYuM1qLOkbiftoD4xG0yFeC5JDF_ysT5ZVqKbpH03_U", "http://www.honeycolony.com/", "http://www.vanishingbees.com/", "https://gab.com/LadyBee", "/part-10-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/?login=1", "#", "#"], "authors": [], "publish_date": "2023-01-11T23:01:46+00:00"}