{"result_id": "332040", "URL": "https://vaxxter.com/part-3-a-primer-understanding-the-experimental-genetic-technology-referred-to-a-vaccine/", "timestamp": "2023-04-25 17:53:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/part-3-a-primer-understanding-the-experimental-genetic-technology-referred-to-a-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Part 3: A Primer: Understanding the Experimental Genetic Technology Referred to a \"Vaccine\"", "cleaned_text": "Antibody-Dependent Enhancement (ADE) refers to a mechanism in which antibodies are unable to neutralize a virus but instead increase the ability to infect cells. ADE can arise in several different ways but the best-known is dubbed the ‘Trojan Horse Pathway.’\n\nADE occurs when a vaccine or past infection fails to shut down the pathogen upon re-exposure to the pathogen. Instead, the antibodies act as a gateway that allows the virus to gain entry and replicate in cells that are usually off-limits (typically immune cells like macrophages). When this occurs, the antibodies can activate other immune cells to become more aggressive and cause more damage.\n\nADE is not a new concept; it has been discussed since the late 1970s. For viruses like dengue fever and HIV that pose a major threat to human health, the presence of ADE is considered to be a major obstacle to vaccine development.\n\nEven Anthony Fauci has admitted that this would not be the first time that a vaccine that initially looked good actually made people worse.\n\nIn fact, according to Dr. Robert Malone, the inventor of the mRNA injection, this has happened with all attempts to develop corona virus-related vaccines.\n\n“Antibody-dependent enhancement (ADE) of disease is a general concern for the development of vaccines and antibody therapies because the mechanisms that underlie antibody protection against any virus have a theoretical potential to amplify the infection or trigger harmful immunopathology,” states a July 2020 article in Nature titled “A perspective on potential antibody-dependent enhancement of SARS-CoV-2.”\n\nBy the way, Big Harma cohorts renamed ADE “Vaccine Enhanced Disease.”\n\n“ADE not only promotes the virus to be recognized by the target cell and entering the target cell, but it also affects the signal transmission in the target cell,” according to the National Institutes of Health (NIH).\n\nIn effect, this means that the Covid-19 injections cause a vaccinated person’s immune system to go into overdrive when they come into contact with the virus, causing harm to the person and worsening disease.\n\nThere is a growing concern for individuals who have received a COVID shot and the pathology (illness) that will develop when these individuals are re-exposed to common coronaviruses or the SARS-CoV-2 virus. Because SARS-CoV and SARS-CoV-2 viruses have approximately 78-85% genetic overlap, it is presumed a reaction would be similar in both).\n\n“The combination of high viral replication rates in individuals who also produce suboptimal, non-neutralizing antibodies creates the exact environment in which resistant viruses are likely to emerge and spread,” according to a study in medRxiv.\n\nAnd now official data released by the UK government in early April 2020 show that the vaccinated are indeed suffering ADE.\n\n“The fully vaccinated individuals are up to three times more likely to be infected with Covid-19, two times more likely to be hospitalised with Covid-19, and three times more likely to die of Covid-19 than unvaccinated individuals,” according to the Daily Expose.\n\nIn fact, this is a pandemic of the vaccinated.\n\nEven worse – Pfizer and the FDA knew that the mRNA Covid-19 injections would do this. Instead, they claimed that “no new safety issues have been raised”.\n\nPhase three clinical trials are designed to uncover frequent or severe side effects, including ADE, before a vaccine is approved for use. Here is a small little detail – none of the Covid-19 injections have completed phase three clinical trials. The Pfizer phase three trial is not due to complete until February 2024, after previously being estimated to complete in April 2023.\n\nThe antibody response to mRNA shots is higher than titers seen in convalescent (recovering) individuals. This results in a high ratio of non-neutralizing antibodies.\n\nNeutralizing antibodies are the goal of any vaccine because they help prevent infection or symptoms from the infectious pathogen, neutralizing it from doing harm. In the case of the CoV jabs, which is more of a gene therapy experiment, neutralizing antibodies are also signaling immune cells to kill the human cells that contain the surface spike protein as if the human cells are a foreign virus. This reaction is similar to an autoimmune response or disease, except that many different types of cells throughout the body may all be involved instead of just specific autoimmune antibodies against thyroid tissue and gluten, for example (molecular mimicry – similar chemical shape).\n\nBecause the pathogen is accepted as ‘self’, immune cells will ignore the virus, allowing the infection to grow freely, which means the disease process is ‘enhanced’. This means that the infection will be much worse than if there hadn’t been vaccine-inducing non-neutralizing antibodies.\n\nNon-neutralizing antibodies are certainly not the goal of vaccines, and animal mRNA vaccine research found this was a big problem.\n\n“These types of ‘vaccines’; this modified RNA; they have tried them in the past on animals with terrible results,” says Dr. Carrie Madej. She says that at first they expressed a robust response but then when they came into contact with the virus, the body attacked it’s own self.”\n\nListen here to Dr. Madej explain ADE to Mike Adams.\n\nEventually, all the animals died once exposed to the wild-type virus. All jabbed test animals had autoimmune injuries to their lungs after a re-exposure.\n\nIn an NIH study, Lung tissue of vaccinated macaques monkeys revealed acute diffuse alveolar (ADA) injury with various degrees of severity at 7 and 35-days post-infection. Wound healing was blocked by anti-S-IgG antibodies, resulting in prolonged macrophage activity and promotion of severe lung injury.\n\nLung tissue in unvaccinated macaques revealed only minor to moderate inflammation. Alveolar monocytes/macrophages assume a wound-healing function as early as two days after the onset of infection in macaques who were unvaccinated.\n\nIf the non-neutralizing antibodies encounter a SARS-CoV2 virus, any variant with a closely matching spike protein will bind with the spike.\n\nPeople with minimal symptoms after the jabs may have been one of the lucky ones to get the estimated 30% saline solution batches. ADE reactions generally lead to the death of the research animal. There is limited information regarding humans, as adverse vaccine reactions tend to be called other things in lieu of performing autopsies. A nasal infection leading to lung infection would show more damage in the upper area of the lungs. An ADE infection would likely create more damage throughout the lungs and body.\n\nDid virus hunters who suffer from Vaccine Mania Vitriol Disorder (my take on ‘Vaccine Hesitancy’) finally unleash a bioweapon — maybe a tad too soon in a sloppy fashion? They had already published Agenda 21 in 1993, followed by Agenda 2030 and Rockefeller’s Lockstep, both a depopulation agenda and a transhumanist agenda. These vaccines represent large worldwide experiments on human beings. This is the biggest Nuremberg Code violation perpetrated in human history.\n\nConsider that in June 2020, a symposium weighed the pros and cons of bypassing animal trials ‘in the face of an emergency.’\n\n“Although this looks promising for fast-tracking vaccine development, there is division among the scientific community about bypassing animal models before Phase I clinical trials. In addition, agencies like PETA are against using animals for research purposes. The question remains: Can vaccine research do without an animal model?”\n\nNEW ABOVE THIS POINT\n\nWhere are the non-profit organizations that stand against using humans for research purposes? And by the way, PETA actually kills animals.\n\nAre we the lab rats — especially black lives, which too often have been experimented on in the past? Do they matter most to those in power because they are the most unvaccinated populace? Are they vaccine-hesitant because they remember the Tuskegee experiment which spanned four decades?\n\nThe SARS vaccine was ready in record time, but it didn’t make it through animal trials because it killed all the test animals. The animals created antibodies, but when they were reinfected, the immune system didn’t attack (non-neutralizing antibodies.) A cash-hungry biotech company is always optimistic though – everything would be fine. After all, they were creating a bioweapon arguably intended to be a slow kill.\n\nThe rollout of a vaccine usually takes eight to twelve years. Yet somehow in 2020, Big Pharma was able to ‘warp speed’ the creation of several vaccines? Also, keep in mind that the ‘novel’ coronavirus has not been photographed, isolated, or purified. Instead, we are left with a virtual sequence based on a mishmash of coronaviruses.\n\nThe SARS-CoV2 ‘virus’ represents a group of viruses. RNA viruses mutate very readily to suit different environments. On average, they are more heat tolerant in the lungs than the nose, and more acid-tolerant in the digestive tract.\n\n“The whole alternative point about there being “no virus” because of Koch’s Postulates – is simply wrong regarding RNA type viruses. RNA viruses are a group of variants rather than all being genetically the same organism like a malaria parasite is always a malaria parasite in some stage of growth. And there is definitely a chimeric spike protein that was patented in 2018, in the US by Ralph Baric out of the University of North Carolina. The chimeric spike protein has the characteristics of a computer sequenced bioweapon rather than natural mutations. All of the CoV injections use the same modified version of that, which NIH gave them – and they all used it. The bat coronavirus used as a carrier for the chimeric spike protein, in itself, is not that big a problem deal to a person of reasonable health, compared to anything designed to include the chimeric spike, because is toxic to us in many ways.” – Jennifer Depew, RD, Registered Dietitian. References – Spike Protein Risks & Aids – Summary Page.\n\nWith that said, there are various protocols and natural remedies to detox and attempt to restore metabolic and mitochondrial function. Arguably, these are things you should have been doing all along to keep your body functioning properly. The argument would be that to stay in normal health takes some care, but an immune challenge, whether an infection or manmade injection, causes a sudden and huge need for extra nutrients. Natural immunity does work – when you provide the tools that our cells and mitochondria need to function.\n\nThe question remains: Is anything out there that can re-repair your genetic code or DNA damage? The answer: Epigenetic changes can change back when methyl donor vitamins are available (methyl or hydroxy B12, folate, and choline). Phytonutrients may also help with DNA damage and protect against cancerous changes.\n\n“Recently, we have shown that dietary phytochemicals such as quercetin, rutin, rosmarinic acid, luteolin, and others not only protect DNA damage but also stimulate DNA repair in liver and colon cell lines (Lima et al., 2006; Ramos et al., 2008; Ramos et al., 2010b; Ramos et al., 2010a). These effects may contribute to their anti-carcinogenic effects”.\n\nWe have also included treatments useful for those who experience getting “spiked,” humans who were passively exposed to spike exosomes via those injected. “Vaccinated” people can shed spike protein and potentially the mRNA to create it, in small membrane packets called exosomes, which are similar to pheromones.\n\nWhen we are ‘love struck’, it may be because pheromones with a close enough genetic match were breathed in from a person who would potentially be a good genetic match for any future babies. The exosome or pheromone will only open for another cell that has a matching surface protein marker, and then the mRNA enclosed within the membrane packet will be released into the recipient cell which will start producing the protein encoded by the mRNA sequence. Depending on what it was, the cell may produce ‘love struck’ chemicals or spike protein or whatever other protein was encoded by the mRNA gene sequence.\n\nStay tuned for Part 4, which explains all things about the famous spike proteins.\n\nLike what you’re reading on The Tenpenny Report? Share this article with your friends. Help us grow.\n\nMaryam Henein is an investigative journalist, and founder, and editor-in-chief of the health magazine and marketplace HoneyColony. She is also a functional medicine consultant/coach, and the director of the award-winning documentary film Vanishing of the Bees, narrated by Elliot Page. Follow her on Gab: @ladybee. Email her: maryam @ honeycolony.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Part 3: A Primer: Understanding the Experimental Genetic Technology Referred to a \"Vaccine\" - The Tenpenny Report", "description": "Antibody-Dependent Enhancement Vs. Non-Neutralizing Antibodies Antibody-Dependent Enhancement (ADE) refers to a mechanism in which antibodies are unable to neutralize a virus but instead increase the ability to infect cells. ADE can arise in several different...", "url": "https://vaxxter.com/part-3-a-primer-understanding-the-experimental-genetic-technology-referred-to-a-vaccine/", "site_name": "The Tenpenny Report", "article:published_time": "2022-04-10T02:10:17+00:00", "article:modified_time": "2022-04-10T02:07:55+00:00", "image": "https://vaxxter.com/wp-content/uploads/2022/04/Antibodies.jpg", "image:width": "400", "image:height": "300"}, "tags": [], "tweets": [], "movies": [], "links": ["https://tv.gab.com/channel/ladybee/view/vaccine-enhanced-disease-624cb0227e936bc43cffbf2a", "https://www.nature.com/articles/s41586-020-2538-8", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8438590/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7827936/", "https://www.medrxiv.org/content/10.1101/2021.03.07.21253098v1.full", "https://dailyexpose.uk/2022/04/03/confidential-pfizer-docs-official-gov-data-vaccinated-suffering-ade/", "https://transcendingsquare.com/2021/12/10/adaptive-immunity-ade-and-antibodies/", "https://transcendingsquare.com/2021/12/10/adaptive-immunity-ade-and-antibodies/", "http://www.carriemadej.com/", "https://tv.gab.com/channel/ladybee/view/dr-carrie-madej-addresses-antibody-dependent-enhancement-624dc5aea8a09aa9bfbb2785", "https://transcendingsquare.com/2021/12/10/adaptive-immunity-ade-and-antibodies/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6478436/", "https://tv.gab.com/channel/ladybee/view/do-you-suffer-from-vmvd-616849e333dc7ba108709351", "https://tv.gab.com/channel/ladybee/view/do-you-suffer-from-vmvd-616849e333dc7ba108709351", "https://brandnewtube.com/watch/similarities-of-medical-abuse-in-30s-german-with-current-covid-19-policies_1jW7Cj9bJf6cENd.html", "https://www.shiftfrequency.com/1000-lawyers-and-10000-doctors-file-lawsuit-for-violations-of-nuremberg-code/", "https://www.bitchute.com/video/B3J22hfeggHx/", "https://www.ias.ac.in/article/fulltext/jbsc/045/0082", "https://nitter.social.cologne/CassandraRules", "https://www.mcgill.ca/oss/article/history/40-years-human-experimentation-america-tuskegee-study", "https://transcendingsquare.com/2021/12/20/therapeutic-goal-overview/", "https://transcendingsquare.com/2021/06/29/spike-protein-risks-aids-summary-page/", "https://transcendingsquare.com/2021/12/10/adaptive-immunity-ade-and-antibodies/", "https://www.intechopen.com/chapters/22717", "https://christiansfortruth.com/confirmed-covid-vaccinated-people-can-shed-spike-proteins-and-harm-the-unvaccinated/", "https://transcendingsquare.com/2021/12/10/adaptive-immunity-ade-and-antibodies/", "https://transcendingsquare.com/2021/12/10/adaptive-immunity-ade-and-antibodies/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://t.me/truthavengers", "http://voyagela.com/interview/meet-maryam-henein-honeycolony-beachwood/?fbclid=IwAR0kT-yHZsay2AaWvYuM1qLOkbiftoD4xG0yFeC5JDF_ysT5ZVqKbpH03_U", "http://www.honeycolony.com/", "http://www.vanishingbees.com/", "https://gab.com/LadyBee", "/part-3-a-primer-understanding-the-experimental-genetic-technology-referred-to-a-vaccine/?login=1", "#", "#"], "authors": [], "publish_date": "2022-04-10T02:10:17+00:00"}