{"result_id": "332013", "URL": "https://vaxxter.com/the-signals-for-covid-vaccine-mandates-emerge/", "timestamp": "2023-04-25 17:52:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/the-signals-for-covid-vaccine-mandates-emerge/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "The Signals for COVID Vaccine Mandates Emerge", "cleaned_text": "One hour after the Biden Inauguration, the World Health Organization (WHO) issued a timely update to governments and laboratory professionals around the world, superseding its previous instructions of December 14, 2020. The WHO’s notice focused on the cycle thresholds of PCR tests being used too high and that “careful interpretation of weak positive results is needed.”\n\n“The cycle threshold (Ct) needed to detect the virus is inversely proportional to the patient’s viral load. Where test results do not correspond with the clinical presentation, a new specimen should be taken and retested using the same or different NAT technology.”\n\nIn other words, the misused and maligned PCR test, which created tens of thousands of false-positive results, is only an “aid to diagnosis” and should have been used as such. Agreed. Then why did the WHO wait ten months after its pandemic emergency declaration of March 11, 2020, to make that update? Why withhold this recommendation until after the Trump Administration left office?\n\nWe may never have a definitive answer. But five weeks after the WHO’s PCR test “information notice,” the cases plunged by 77 percent. Like magic, the pandemic evaporated into thin air as global health agencies tamed the “casedemic” where it always existed: in the inflated data and not as “bodies on the street” as the WHO Director-General Dr. Tedros Adhanom Ghebreyesus warned about last year. It was an event that, not surprisingly, never came to fruition.\n\nHere are a few important questions to ponder:\n• Beyond the curious timing, what underlying purpose did the belated WHO instructions achieve in lowering the cases in Europe and, particularly, in the United States? And who did this new ruling serve?\n• With the pandemic waning, New York City has hired a recovery czar, Lorraine Grillo, to restore the economy. Why have Big Pharma’s media organs continue to ramp up attacks on vaccine risk-aware groups?\n• None Why have the social media gatekeepers banned, censored, and de-platformed the analysis of skeptics who question COVID vaccines as the only way out, when the outbreak is clearly over and herd immunity appears to have been established?\n\nSeeing through the fog of medical and scientific misinformation and propaganda, 33 health experts weighed in about the dangers of the Moderna and Pfizer-BioNTech mRNA vaccines that were rushed to the market, given full liability protection as a “countermeasure.” Under the FDA’s Emergency Use Authorization (EUA) protocols, established over many years through a series of congressional acts, COVID experimental vaccines were given complete liability protection when the “national emergency” was declared on March 13, 2020.\n\nThe flip side to the experimentation of a countermeasure in the United States is the COVID vaccines are only authorized for emergency use; they are not approved by the FDA. Therefore, they cannot be mandated by the government at the federal or state level.\n\nFor licensing to happen, the FDA needs a minimum of four (4) months of vaccine data. That would put such a review in mid-April.\n\nIf the shots are approved by the FDA only a week or two after reviewing the data, would the Biden Administration mandate the experimental vaccines for all Americans, with no possible religious or medical exemptions? This now seems the logical go-forward path and would explain why the WHO announced a revised PCR test notice when it did.\n\nRecall that in spring 2020, President Trump halted funding to the WHO, as a result of the organization withholding critical information on the outbreak, its source, and spread from Wuhan, China. In a complete reversal, President Joe Biden announced on February 18 at his first G7 global meeting he would immediately donate $2 billion to the COVAX program co-led by the World Health Organization and GAVI, found by Bill Gates. The goal is to vaccinate 20% of the world’s population with the experimental covid shots by the end of 2021.\n\nThe 27-minutes long, Ask the Experts video, which has been banned from YouTube but can be found on Rumble and UgeTube, showcases international experts in medicine, science, health, and journalism. Each speaker shared their insights, opinions, and advice on the experimental technology of the messenger RNA (mRNA) in the vaccines. They noted that mRNA jabs really aren’t vaccines per se, but a mix between “bioengineering gene therapy” (Dr. Andy Wakefield) and “medical devices” (Dr. David E. Martin) with roots in nanotechnology.\n\nAlthough the experts addressed the COVID vaccines from different angles, several common themes emerged:\n• No pandemic; COVID is the world’s greatest hoax\n• Not enough data; no long-term safety data\n• Too many false positives; misuse of PCR tests\n\nYet, one of the biggest takeaways from the video is censorship. The Experts know people are not allowed to question the science, debate the unproven technology, or discuss the dangers of the vaccines online or in public. That sets a dangerous precedent, to blindly entrust science and medicine to a single, higher, centralized authority. And it comes out of the IMF and World Economic Forum playbook of the Great Reset.\n\nThe Experts recognize that muzzling free speech threatens the human right of “informed consent,” which has been trampled by lies and propaganda. In one incident, a local medical doctor caught the New York State COVID website falsely claiming that COVID vaccines are approved and have been subjected to the same FDA “rigorous testing of other vaccines.” This was an obvious lie and, because they were in violation of federal law, New York State quickly removed the claim.\n\nSo, should people trust governments and their agencies to accurately disseminate data on the virus, on ‘mutants’, about testing methods and vaccines while their agents attack well-informed questions, concerns, and arguments about their propaganda?\n\nHere are excerpts from three ‘Ask the Experts.’\n\n“There’s no medical emergency… It’s comparable to seasonal flu in terms of harm and transmissibility. I reject the extreme disproportionate measures taken by our governments… All orchestrated to make you fearful enough to take the vaccine. We have no idea what their long-term effects will be… It might possibly change your DNA. This is irreversible and unrepairable for all future generations.”\n\n“There’s no worldwide pandemic for the virus… The PCR tests should not be used to diagnose… Hospitals gained financial incentives [to inflate the cases]… The vaccine is synthetic to the human body as is the nano-lipid technology being introduced to the human race… This is an alarm call to the world.”\n\n“… Non-neutralizing antibodies can lead to something called ADE – antibody-dependent enhancement. This allows the virus to replicate inside the cell, making the infection worse. mRNA from the vaccines can be transcribed into proteins inside the cell. This protein can then be incorporated into the host’s DNA by a process called transfection…That puts a snippet of the virus into your DNA and transforms your cell.”\n\nOn February 14, the BBC published a hit piece on Ask the Experts, “Covid-19: How did a volunteer panel react when we showed them an anti-vax video?” Written by Marianna Spring, who claims to be a “specialist disinformation reporter.” That ‘title’ seems better fitting for someone who would be working for ‘The Ministry of Truth’ described in George Orwell’s dystopian book, 1984, rather than a journalist working for the BBC.\n\n“Activists have been targeting people with fears about vaccines in a social media blitz. In an experiment, BBC Panorama showed a panel one video filled with falsehoods to see how it affected their willingness to get a jab.”\n\nSpring failed to mention that Big Pharma has bought and paid for MSM, such as the BBC. And it has been MSM, such as the BBC, that has been injecting fear into the public non-stop for the past year.\n\n“Some allege, contrary to the evidence, that Covid-19 vaccines are unsafe, that they can alter a person’s DNA – and even that the pandemic is somehow not real.”\n\nThe author neglects to explain that mRNA vaccines are only “authorized for emergency use” and not approved by either the US FDA or the UK’s NHS. She further downplays the 929 deaths and the nearly 16,000 adverse events that have been reported to VAERS in the first few months of administering the experimental vaccines.\n\nWhile Spring and her ilk attack professionals for raising serious concerns about a global vaccine experiment, the biggest fan of the digital muzzling, Facebook’s CEO Mark Zuckerberg, was outed last week as a two-faced hypocrite when a leaked audiotape, produced by Project Veritas, showed him questioning COVID vaccine safety.\n\n“But I do just want to make sure that I share some caution on this [vaccine] because we just don’t know the long-term side effects of basically modifying people’s DNA and RNA…basically the ability to produce those antibodies and whether that causes other mutations or other risks downstream…”\n\nAgain, it’s ironic how Spring blames the “social media boom” for anti-vax hysteria while failing to disclose that the Bill and Melinda Gates Foundation has subsidized BBC $51 million since 2010. Does the vaccine-pushing, pharma-sponsoring Gates Foundation pay a part of Ms. Spring’s salary? Why didn’t she disclose the clear conflicts of interest with the BBC being paid by the pro-vaccine foundation with a globalist agenda?\n\nIt’s not enough that the WHO changed the PCR protocols so late in the game. Or that it did so to lower the cases so that Moderna and Pfizer can claim that their experimental shots successfully curtailed the pandemic. Or that the FDA reviewed and twisted the data about the vaccines to fast-track the approval process. Or that, once the FDA fully licenses this experimental “countermeasure”, the door will be opened for states and the federal government to mandate the mRNA vaccines for all Americans.\n\nNo, mainstream media will continue to hire attack dogs and the social media platforms will continue to be the Thought Police, crushing dissent to snuff out concerns and doubts about these shots.\n\nAmerica is about to cross the Rubicon on the mRNA vaccines. The Julius Caesar moment and the point of no return is upon us. The elimination of dissent and camouflaging health concerns and deaths are only a few pen strokes away.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nJames Grundvig has written and published as a freelance journalist and columnist, covering subjects from autism, its cause and treatments, clean technology, green energy, and the BP Oil Spill, to business and Wall Street, and completed investigative reports on a wide range of topics since 2005. He is the founder of the cloud-based software startup in 2011 to integrate supply chain logistics in the Construction IT space. James has 25 years of consulting engineering and construction management experience on projects of scale and complexity in the New York City area. He is the author of Master Manipulator: The Explosive True Story of Fraud, Embezzlement and the Government Betrayal at the CDC.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Signals for COVID Vaccine Mandates Emerge - The Tenpenny Report", "description": "by James Grundvig, Investigative Reporter, Vaxxter Contributor One hour after the Biden Inauguration, the World Health Organization (WHO) issued a timely update to governments and laboratory professionals around the world, superseding its previous instructions of...", "url": "https://vaxxter.com/the-signals-for-covid-vaccine-mandates-emerge/", "site_name": "The Tenpenny Report", "article:published_time": "2021-02-25T21:37:28+00:00", "article:modified_time": "2021-02-27T01:47:50+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/12/53e7d34b4c50a414f1dc8460962a3f7f1d37d8f852577140722e7edd974d_640.jpg", "image:width": "640", "image:height": "391"}, "tags": ["covid shots", "COVID19"], "tweets": [], "movies": [], "links": ["https://www.who.int/news/item/20-01-2021-who-information-notice-for-ivd-users-2020-05", "https://www.cidrap.umn.edu/news-perspective/2021/02/global-covid-19-cases-fall-who-warns-complacency", "https://www1.nyc.gov/office-of-the-mayor/news/121-21/mayor-de-blasio-appoints-recovery-czar-lorraine-grillo#:~:text=NEW%20YORK%E2%80%94Mayor%20Bill%20de,on%20RecoveryForAll.nyc.gov.", "https://www.phe.gov/Preparedness/legal/prepact/Pages/prepqa.aspx#immune4", "https://www.foxnews.com/politics/trump-announces-funding-to-world-health-organization-who-halted", "https://www.reuters.com/article/us-usa-biden-covax/biden-to-pledge-4-billion-to-covax-vaccine-program-at-g7-meeting-friday-idUSKBN2AI2YP", "https://rumble.com/vboo0b-ask-the-experts-covid-vaccine.html", "https://ugetube.com/search?keyword=Ask+the+Experts", "https://www.imf.org/en/News/Articles/2020/06/03/sp060320-remarks-to-world-economic-forum-the-great-reset", "https://www.weforum.org/great-reset", "https://www.tomorrowsworld.org/magazines/2021/january/are-you-ready-for-the-great-reset", "https://www.icandecide.org/wp-content/uploads/2021/02/Letter-to-NYSDOH.pdf", "https://pubmed.ncbi.nlm.nih.gov/12725690/", "http://www.cell-transfection.com/", "https://www.bbc.com/news/blogs-trending-56047409", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19", "https://www.projectveritas.com/news/facebook-ceo-mark-zuckerberg-takes-anti-vax-stance-in-violation-of-his-own/", "https://www.misereor.de/fileadmin/publikationen/study-philantrophic-power-and-development-2015.pdf", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://amzn.to/2Bmxe5K", "/the-signals-for-covid-vaccine-mandates-emerge/?login=1", "#", "#"], "authors": [], "publish_date": "2021-02-25T21:37:28+00:00"}