{"result_id": "332002", "URL": "https://vaxxter.com/vaccines-are-terrible-but-if-were-being-honest/", "timestamp": "2023-04-25 17:52:28 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/vaccines-are-terrible-but-if-were-being-honest/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Vaccines Are Terrible, But If We’re Being Honest…", "cleaned_text": "Vaccines are the worst of course, but have you ever noticed that exposing vaccine danger actually creates a much larger health benefit?\n\nFor example, did your awareness of vaccine danger pre-Covid help prime your mental faculties, so you already knew instantly the Covid shots would be dangerous? If so, is it fair to say that previous vaccine danger helped you avoid an absolute catastrophe for your health this decade and probably your DNA?\n\nSuch is our world; where things that harm us routinely provide invaluable lessons that ultimately help us. My friend Denis wrote a new book about this subject.\n\nFor many of us in the health freedom movement, vaccine risk awareness was our gateway to natural health. Vaccines opened our eyes to the larger universe of health freedom issues, empowering us to be instantly immune from today’s biggest threats: people desiring transhumanism and artificial intelligence. How many of our friends and family members lack this hard-won immunity?\n\nBecause so many people are not learning these lessons and healing, our world is becoming more extreme.\n\nEarlier this month something hilarious happened on Twitter. A man posted his efforts at breaking the censorship of a popular artificial intelligence program called Chat GPT: https://twitter.com/Aristos_Revenge/status/1622840424527265792. See also for Bing AI: https://twitter.com/disclosetv/status/1626232719096291328\n\nWhat’s the big picture? Experts in artificial intelligence believe their technology will so radically transform the world in our lifetimes that politics is basically irrelevant.\n\nIn the words of quantum computer creator Geordie Rose:\n\n“…a complete and utter transformative change, the likes of which has never been seen before in the history of humanity making the Industrial Revolution look like a little tiny blip… there are entities that are not necessarily going to be aligned with what we want so this transition is really really massively important for our entire species to navigate … this [artificial intelligence] is happening in the background while people bicker about politics and what what’s gonna be in the health care plan in the US and underneath it all is this rising tsunami.” https://youtu.be/cD8zGnT2n_A\n\nIf this expert Geordie Rose is correct, then practically speaking, politics and culture are simply apologetics by those holding power.\n\nHistorically, politics and culture were completely dominated (almost predetermined) during the industrial revolution, because technology determined outcomes regardless of anyone’s politics or culture. In that sense, politics and culture were just apologetics for why societal outcomes were “true”.\n\nThe exact same pattern is happening today.\n\nThere are two competing forces for world domination right now (God and artificial intelligence), and everything else is a sideshow (practically speaking). Or in other words, either God or artificial intelligence will win, whilst politics and culture will engage in various apologetics to explain the truth of the winner.\n\nNote the paradox: God’s people and AI’s people, despite being diametrically opposed ideologically, are saying the same thing about themselves:\n• We will predict and dominate the future\n• We are right\n• Our opponents shall convert or perish\n\nEvery one of those statements is true, about God.\n\nGod gives us a beautiful relationship, and God protects and nurtures that relationship. By contrast, AI just wants to extract data from us and dominate.\n\nWant to know one of our greatest weaknesses this decade? It’s our need for modern identification.\n\nAll of these things in your life fundamentally depend on identification today: your rights, your citizenship status, your affiliations, your standing in court, your accounts, your privileges, your services, your land title, and more.\n\nGo ahead, try accessing any of these without your identification, mostly meaning your name but often your numbers.\n\nTo control the world, the powers that be must control ID. Even national governments are now dependent on their organizational and corporate IDs for their transactions, bonds, taxes, and privileges.\n\nNatural people today, like many Amish and other free men, who use zero modern ID are considered primitive. Yet they have a promising future post collapse.\n\nModern ID is the one ring of the entire control system. Not easy to unmake, is it?\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nGreg Glaser is a conservative Christian and health freedom lawyer in California.\n\nHe was recently called a ‘human vaccine encyclopedia’ for his work with the litigation team opposing the UC’s mandatory flu shot. He is passionate about organic living and the Constitution.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines Are Terrible, But If We’re Being Honest… - The Tenpenny Report", "description": "By Greg Glaser, JD, Vaxxter Contributor Vaccines are the worst of course, but have you ever noticed that exposing vaccine danger actually creates a much larger health benefit? For example, did your awareness of vaccine...", "url": "https://vaxxter.com/vaccines-are-terrible-but-if-were-being-honest/", "site_name": "The Tenpenny Report", "article:published_time": "2023-02-18T01:33:18+00:00", "article:modified_time": "2023-02-19T02:19:03+00:00", "image": "https://vaxxter.com/wp-content/uploads/2023/02/Vaxxter-Glaser.jpg", "image:width": "1732", "image:height": "1732"}, "tags": ["vaccine awareness", "Artificial Intelligence", "vaccine dangers", "vaccines", "transhumanism", "spiritual warfare", "Spiritual Battle"], "tweets": [], "movies": [], "links": ["https://www.amazon.com/Blame-Game-Recover-Worlds-Addiction/dp/1637587546/", "https://youtu.be/cD8zGnT2n_A", "https://www.vaxxter.com", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "/vaccines-are-terrible-but-if-were-being-honest/?login=1", "#", "#"], "authors": [], "publish_date": "2023-02-18T01:33:18+00:00"}