{"result_id": "332041", "URL": "https://vaxxter.com/your-healthcare-and-your-life-to-be-handed-over-to-who/", "timestamp": "2023-04-25 17:53:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/your-healthcare-and-your-life-to-be-handed-over-to-who/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Your Healthcare - and Your Life - To Be Handed Over to WHO", "cleaned_text": "On June 13, 2019, conveniently right before the Planedemic launched, The World Economic Forum (WEF) and the United Nations signed a Strategic Partnership Framework outlining areas of deeper institutional engagement and acceleration of Agenda 2030. The framework will enable a more ‘strategic and coordinated approach towards the intended impact.’ The memorandum of understanding between the WEF and UN marked the beginning of Klaus Schwab’s new world order where the top 1% of corporate global elites will exert control over 99% of the world population. It’s the darkest version of the globalist dream.\n\nRoll forward to November 2020. The President of the European Council, Charles Michel, at the Paris Peace Forum introduced a proposal for an international treaty on pandemics. He was later joined by the Director-General of the WHO, Dr. Tedros Adhanom Ghebreyesus, in an open call for an international treaty on pandemics, drawing from the lessons learned during the COVID-19 pandemic.\n\nThe G7 leaders were quick to jump on board and released a statement of cooperation at their February 19, 2021 meeting. The full statement is here, but this is a synopsis:\n• May 2021 – All 194 WHA members adopt the decision to write the treaty\n• Nov. 2021 – Special Session of WHA; agreement to form an intergovernmental negotiating body for the treaty\n• Aug. 2, 2022 – Second meeting to discuss the draft of the treaty\n• 2024 – aim to full adopt all elements of the International Pandemic Treaty\n\nTreaties are legally binding between two or several countries. The agreement supersedes the country’s constitution and legal system. If this treaty is enacted, the WHO would be given the power to financially, politically, and legally declare world health crises at any time the Globalists want to flair a crisis. Individual governments would be forced to go along, no matter the conditions in their local environment.\n\nIn the US, the WHO pronouncement would override state and national laws and set-aside US Constitution. WHO got a taste of power in 2020 and 2021 and now WHO is being used by the UN to grab power and finalized the One World Government predicted and planned for literally hundreds of years. With this power, they could even declare a climate lockdown and implement a global carbon tax on your breathing, all in the name of a ‘health emergency.’\n\nBiden Administration: Spearheading the Demise of US sovereignty\n\nOn the surface, the May 22 agenda has noble-sounding goals including ways to improve. maternal and infant nutrition and to eliminate iodine deficiency disorders. However, digging a little deeper, one uncovers their sinister agenda. Of particular interest is ‘Provisional Agenda Item 16.2.’ The provision calls for a vote to implement the health regulations set forth through the creation of the International Pandemic Treaty.\n\nAstonishingly, Biden’s handlers wrote the 13 amendments that would cede US power to the WHO. On January 18, 2022, with no public awareness, officials from the Biden Administration sent the WHO extensive amendments to strengthen WHO’s ability to unilaterally intervene in the affairs of nations merely suspected of having a ‘health emergency’ of possible concern to other nations.\n\nAlthough sponsored by an American administration, WHO’s most significant arbitrary use of this authority will be used against the United States. The power-hungry globalists want to be sure our government will never again take an anti-globalist stand as it did under the Trump administration.\n\nThe Left’s Retaliation against Trump…and against the people of our country\n\nTrump gave notice in July 2020 the US was going to leave the WHO; he then stopped paying annual fees. He repeatedly stated that the US ‘should not send another taxpayer dime to the WHO’ until there is a full investigation of their botched response to the deadly pandemic. He criticized WHO for praising Chinese transparency over the COVID matter and ignoring Taiwan’s warnings about the virus.\n\nBiden Administration is a big fan of the WHO. He rejoined the WHO immediately after the January 2021 inauguration. This was no doubt a response to President Trump’s withdrawal from WHO in 2020.\n\nSo, with a flick of the pen, America once again became the largest funder of the agency’s $2.4 billion budget. The US provides about $420 million, or 20 percent, of the WHO budget. The Left applauded Biden’s move to use US funds given to the WHO’s budget. Biden also approved US participation in the COVID-19 Vaccine Global Access (COVAX) program, joining 190 nations who committed to donate any surplus vaccines to an effort to vaccinate the world’s low and middle-income countries, the ‘most vulnerable.’ Hmm.\n\nBiden then appointed Anthony Fauci to represent the US on the WHO Executive Council. Fauci reaffirmed his commitment to vaccinate ALL people across the globe against ALL emerging biological threats.\n\nWith these moves, Biden fulfilled one of his campaign promises. In the run-up to the 2020 election, Biden vowed to continue funding the WHO, practically an admission that he was willing to do whatever was needed to protect his Chinese interests. WHO was harshly criticized for not being tougher on China and accepted its word when China tried to assure the world that the virus could not spread from human to human. University of Southampton researchers estimated in a recent study that if the WHO had pressed Chinese authorities to come clean, the world’s coronavirus cases could have been reduced by a whopping 95 percent.\n\nOn March 1, 2022, Paul Alexander, Ph.D. was interviewed for The Tenpenny Files Premium podcast. Dr. Alexander had previously worked at WHO. Here is our interview – which was recorded exclusively for Premium Podcast Members. Below is a small transcribed snip of the interview, focusing on his experience and opinion of that WHO (with some light editing to make comments readable):\n\nDr. Tenpenny: I want to ask you a question about the WHO by reading you this announcement.\n\n“On December 1, 2021, the 194 members of the World Health Organization reached a consensus, to kick start the process to draft and negotiate an agreement under the Constitution of the World Health Organization, to strengthen pandemic prevention, preparedness and response. This intergovernmental negotiating body will now have its first meeting on March 1 to put together a legally binding agreement and a treaty under international law, so that all 194 members of the World Health Organization will agree to walk in lockstep when there will be the next round of pandemics.\n\nSo if they implement a legally binding international treaty, doesn’t that compound the power of the WHO?\n\nDr. Alexander: I think the World Health Organization has zero credibility. I worked there. When you come out from grad school, you think that a job at the CDC would be great and a job at the WHO would be the Nirvana. But when you get there, you find out that positions within the organization are not based on merit. It’s more like a Club. A lot of people get into positions of power or influence, where they can design policy and make policy. But they were not given those positions based on technical competence on merit. Look at their responses to COVID. The decisions were not based on science. I think that if [a treaty] gets that far, it will be a very dangerous situation. I’ll be honest with you, I think, WHO has become like the word dinosaur. I don’t even think describes it. I don’t even think there’s a role for it. The WHO made such a disaster even with each pandemic, I don’t see a role for WHO anymore. And if it is to play a part, it has to be taken down to the studs, revamped and rebuilt. The same can be said for the CDC and the NIH. They should be just totally stripped down starting at the top and down through the first 20 levels. All those people need to go. They need to be replaced with people with proper training, and all of the politics needs to be removed. The work they do now is based on donors and grants; they are not based on science. I actually shudder when I think about the WHO being in global control. These are people who are making the decisions and don’t seem to understand what’s going on. What you just read me is not a good report at all.\n\nThe World Health Assembly (WHA) will meet on May 22 to 28 in Geneva, Switzerland for its 75th annual meeting. According to its website, the World Health Assembly is the decision-making body of the World Health Organization (WHO). All WHO members will send delegates to vote on the next steps of an international treaty on pandemics, moving us one step closer to One World Government within the New World Order.\n\n(1) State of the Nation wrote a thorough and extremely well-documented article on this entire topic. The article can be found here. This is HIGHLY recommended reading.\n\nLike what you’re reading here at The Tenpenny Report? Share this article with your friends. Help us grow.\n\nDr. Sherri Tenpenny is an osteopathic medical doctor, board-certified in three specialties. She is the founder of Tenpenny Integrative Medical Center, a medical clinic located near Cleveland, Ohio. Her company, Courses4Mastery.com provides online education and training regarding all aspects of vaccines and vaccination. Her company, Choonadi, LLC, provides all writing, speaking and blogs and interviews can be found at https://www.drtenpenny.com/\n\nDr. Tenpenny has invested more than 20 years and more than 50,000 hours of personal time, documenting and exposing the problems associated with vaccines. As an internationally known speaker and author, her many articles have been translated into at least 18 languages. She is a frequent guest on radio, podcasts and TV interviews to share her knowledge and educate parents on why they should Just.Say.No. to vaccines. ALL of them.", "opengraph": {"locale": "en_US", "type": "article", "title": "Your Healthcare - and Your Life - To Be Handed Over to WHO - The Tenpenny Report", "description": "by Dr. Sherri Tenpenny, DO, AOBNMM, ABIHM On June 13, 2019, conveniently right before the Planedemic launched, The World Economic Forum (WEF) and the United Nations signed a Strategic Partnership Framework outlining areas of deeper...", "url": "https://vaxxter.com/your-healthcare-and-your-life-to-be-handed-over-to-who/", "site_name": "The Tenpenny Report", "article:author": "www.Facebook.com/vaxxterinfo", "article:published_time": "2022-05-12T16:12:11+00:00", "article:modified_time": "2022-05-13T03:40:49+00:00", "image": "https://vaxxter.com/wp-content/uploads/2022/05/who-4984801-scaled.jpg", "image:width": "2560", "image:height": "1440"}, "tags": ["Pandemic Treaty", "WHO", "WEF"], "tweets": [], "movies": [], "links": ["https://www.youtube.com/watch?v=PeDJbe9WOk4&t=16s", "https://www.the-sun.com/news/3040674/g7-countries-members-summits-held-group/", "https://www.consilium.europa.eu/en/press/press-releases/2021/02/19/g7-february-leaders-statement/", "https://www.consilium.europa.eu/en/policies/coronavirus/pandemic-treaty/", "https://apps.who.int/gb/ebwha/pdf_files/EB144/B144_41Rev1-en.pdf", "https://www.consilium.europa.eu/en/policies/coronavirus/pandemic-treaty/", "https://www.theguardian.com/world/2020/apr/15/world-health-organization-why-has-trump-suspended-funding", "https://www.usatoday.com/story/news/health/2021/01/22/scientists-applaud-biden-decision-rejoin-world-health-organization/4243377001/", "https://www.globalcitizen.org/en/content/us-rejoins-who-and-joins-covax/", "https://thehill.com/opinion/campaign/496041-joe-biden-makes-mistake-with-new-world-health-organization-pledge/", "https://www.southampton.ac.uk/news/2020/03/covid-19-china.page", "https://www.drtenpenny.com/special-events-vip", "https://www.consilium.europa.eu/en/policies/coronavirus/pandemic-treaty/", "https://apps.who.int/gb/e/e_wha75.html", "https://stateofthenation.co/?p=115779", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "http://www.tenpennyimc.com/", "http://www.courses4mastery.com/", "https://www.drtenpenny.com/", "/your-healthcare-and-your-life-to-be-handed-over-to-who/?login=1", "#", "#"], "authors": [], "publish_date": "2022-05-12T16:12:11+00:00"}