{"result_id": "332005", "URL": "https://vaxxter.com/coronavirus-vaccine-a-year-away/", "timestamp": "2023-04-25 17:52:33 CEST+0200", "meta": {"description": "With the experts on record stating it will take more than a year to develop test, and confirm a coronavirus vaccine, how can we prevent infection?", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/coronavirus-vaccine-a-year-away/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Coronavirus Vaccine: A Year Away", "cleaned_text": "The first big mistake in the coronavirus pandemic emerged when the Chinese Communist Party (CCP) tried, but failed, to contain the outbreak in a cloak of silence. The second (and worst) mistake fell at the feet of the World Health Organization (WHO), the Centers for Disease Control and Prevention (CDC), and other institutions that have long promoted the empty marketing point of “global health security.”\n\nWe are quickly learning there is no such thing.\n\nIn the latter miscalculation, we now know their wont be enough time develop a vaccine in time to slow down, let alone contain, the novel 2019-nCoV virus. Leading vaccine experts, from Novartis’ CEO Vas Narasimhan to Jeremy Farrar, the director of the Wellcome Trust, a UK-based health foundation with more than $34 billion in assets to support research, have stated as much in recent interviews with CNBC News and Der Spiegel International, respectively.\n\nWith the experts on record stating it will take more than a year to develop, test and confirm or adjust a coronavirus vaccine formulation, mass-produce it, and then mass-distribute it, what is occuring to stop the transmission of the virus?\n\nSince the 2014 Ebola epidemic in West Africa, the WHO and CDC have insisted that the only way to “save lives” is by preventing disease and not treating the host. That myopic, tunnel vision has cost thousands of lives for people who died unnecessarily due to the Ebola virus.\n\nI interviewed Dr. David S. Fedson, a pharmaceutical executive and clinician for much of his 50-year career. He and other scientists published studies and wrote papers and op-eds that were published or quoted by the mainstream press, from the New York Times to the Washington Post. In short, Fedson stated that “treating the host” with off-the-shelf antivirals and other drugs in combination resulted in a high probability of survival. The idea was simple: Give the dying a fighting chance to block the replication of the virus, while boosting their immune system long enough to survive and recover. This sane, logical, and ethical remedy has long been ignored.\n\nIn another example of institutional arrogance was the 2016 Zika global emergency. This crisis was again declared by the WHO without an investigation into the true cause of the birth defects in northeast Brazil.\n\nThat spring, the CDC and National Institute of Health (NIH) conducted a roadshow, claiming Zika was going to create identical clusters of birth defects in the United States. That short-term hysteria extracted more than $1.5 billion for a Zika vaccine that was abandoned in 2017 by both Sanofi and the US Army. Before Congress handed over their large share of the loot, Florida State University discovered an existing tapeworm remedy could stop Zika cold. To no avail. Neither the Obama Administration nor US health agencies had any interest in an inexpensive existing remedy that worked. It was “create a vaccine or bust.”\n\nSimilarly, in the past week, the WHO published a statement that it’s seeking $675 million to “combat coronavirus.” Mind you, this large sum of money is a stealth form of wealth redistribution. Its statement read, in part:\n\n“WHO issued a call to the global community to come forward with US$675 million in funding to help some 60 low- and middle-income countries that are at significant risk of infection with the novel coronavirus that originated in Wuhan China prepare for possible outbreaks.”\n\nFor the WHO, it’s about ramping up capacity to deliver testing, masks, respirators, and medical supplies and equipment. But their declarations were not about research to repurpose treatments to help the victims.\n\n“We are launching a strategic preparedness plan to support countries to detect and respond to cases,” said Dr. Tedros [the WHO director]. “We are requesting US$ 675 million to fund the plan for the next three months, including US$ 60 million to fund WHO operations. The rest is for countries at risk.”\n\nThis author has long been critical of the WHO’s glad-handing and covering up for China’s failed response and secrecy to the outbreak. Worst, the Chinese Communist Party (CCP) has refused to share the raw metadata about the genomic code of the disease, as of this writing.\n\nBut China has published a baseline code of the virus so that scientists can see what makes the 2019-nCoV tick and whether it comes from a bat reservoir or from a biological lab, as many have suspected. The close proximity between the Wuhan Institute of Virology at the Wuhan City “wet market” only heightens that suspicion.\n\nThat is why the Trump Administration announced that it has deployed the National Academy of Science to investigate whether the virus was bioengineered.\n\nLike global health security, “pandemic preparedness” is just another talking point used by the WHO to market, and then hide, its inept bureaucracy and divert attention away from how truly unprepared the global health agency is and why their “vaccine-only” solution is finally being exposed to fail.\n\nIn a startling headline, one health expert stated: “It’s definitely too late to contain (the coronavirus) due to the millions of people who have now fled the hot zone crisis.”\n\nWhile the leaders at the WHO continue to peddle everything from masks to hope of a coronavirus vaccine to save the day, they continue to refuse to look at the stark, geometric nature of the pandemic and deal with that threat. China’s opacity and the WHO’s slow, unprepared response have left these agencies holding a bag of CCP propaganda points. Now the heavy-handed response has led to the lockdown of dozens of cities in China’s mainland, the quarantine of cruises ships, snatching people off the streets and welding the doors shut of apartment quarantine centers and the interruption of air travel to and from China.\n\nAll of this in a mere six weeks.\n\nAt the other end of the spectrum, and to China’s credit, officials began testing the effectiveness of numerous available antiviral drugs on the infected in mid-January. Chinese researchers applied for a patent on an antiviral drug candidate called Remdesivir that was owned by Gilead Sciences, Inc. Medscape reported that a randomized control trial of the antiviral drug is underway in China. They didn’t wait. Didn’t hope for a vaccine. They took decisive action. The results from the antivirals are mixed, but recovery from the virus is happening.\n\nThis patent application may be outright theft of the intellectual property of the drug. This could be very damaging to a pharmaceutical industry that has relied heavily on China for its cheap labor. All four major vaccine manufacturers—Pfizer, Merck, GSK, Sanofi—have built plants in China over the past decade. The patent theft to address the pandemic represents an existential threat to Big Pharma’s global supply chain.\n\nIn the West, countrues will soon feel the economic shocks of supply chain disruption across all industries. This includes automotive, shipping, energy, aerospace, mobile phone, electronics and many others. It’s only a matter of time before the drug industry feels the same slow down since China provides more than 9% of the US generic drugs and many of the “life-saving” vaccines.\n\nIt’s time for the US and other democracies in the Western world to break their dependency on China as a global supplier. It’s also time for the world to stop pushing for pharmaceuticals and vaccines to be the only solutions for outbreaks of infections. Governments need to recognize a failed trial and move on, as the US did when it finally canceled the trial of an HIV/AIDS vaccine when it failed to protect.\n\nThe coronavirus crisis has exposed two truths in 2020:\n• China, under the Xi Jinping regime, shows its callous disdain and lack of humanity towards its citizens when they become ill. How much more aggressive will they be in an act of war?\n• The WHO, the self-proclaimed health agency to the world, offers neither security nor preparedness during an epidemic. Thus, the US should defund the WHO and ignore its pleas for coronavirus money.\n\nThe WHO’s ties to Big Pharma and socialist leanings toward the CCP have failed to execute a full-scale plan to protect the world. Back to the drawing board. This time, hopefully, more intelligent and thoughtful minds will prevail.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nJames Grundvig has written and published as a freelance journalist and columnist, covering subjects from autism, its cause and treatments, clean technology, green energy, and the BP Oil Spill, to business and Wall Street, and completed investigative reports on a wide range of topics since 2005. He is the founder of the cloud-based software startup in 2011 to integrate supply chain logistics in the Construction IT space. James has 25 years of consulting engineering and construction management experience on projects of scale and complexity in the New York City area. He is the author of Master Manipulator: The Explosive True Story of Fraud, Embezzlement and the Government Betrayal at the CDC.", "opengraph": {"locale": "en_US", "type": "article", "title": "Coronavirus Vaccine: A Year Away - The Tenpenny Report", "description": "With the experts on record stating it will take more than a year to develop test, and confirm a coronavirus vaccine, how can we prevent infection?", "url": "https://vaxxter.com/coronavirus-vaccine-a-year-away/", "site_name": "The Tenpenny Report", "article:published_time": "2020-02-11T10:29:23+00:00", "article:modified_time": "2020-05-21T22:02:58+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/02/Screen-Shot-2020-02-11-at-4.48.41-AM.png", "image:width": "1015", "image:height": "912"}, "tags": ["ebola", "supply chain disruption", "Coronavirus", "anti-viral medication", "Remdesivir"], "tweets": [], "movies": [], "links": ["https://www.novartis.com/our-company/executive-committee/vasant-narasimhan", "https://wellcome.ac.uk/about-us/executive-leadership-team", "https://www.cnbc.com/2020/01/29/novartis-ceo-warns-finding-a-coronavirus-vaccine-will-take-over-a-year.html", "https://www.spiegel.de/international/a-vaccine-would-come-too-late-for-this-a-e5862b8e-e144-4356-939b-2871ff3b87b0", "https://www.kff.org/news-summary/editorials-opinion-pieces-discuss-issues-surrounding-ebola-outbreak/", "https://vaxxter.com/are-we-overhyping-zika-to-market-a-new-vaccine/", "https://www.theepochtimes.com/the-zika-breach-of-public-trust-the-wealth-transfer-model-from-us-taxpayers-to-big-pharma_2097548.html", "https://today.mims.com/sanofi-calls-it-quits-on-zika-vaccine-collaboration-with-us-army", "https://news.fsu.edu/news/science-technology/2016/08/29/fsu-research-team-makes-zika-drug-breakthrough/", "https://www.healthpolicy-watch.org/who-calls-for-us-675-million-to-combat-coronavirus-china-experiences-largest-24-hour-increase-in-cases-since-outbreak-began/", "https://www.theepochtimes.com/the-who-fumbles-pandemic-preparedness-for-coronavirus_3222221.html", "https://yournews.com/2020/02/09/1443284/white-house-asks-scientists-to-investigate-whether-2019-ncov-was-bio-engineered/", "https://nypost.com/2020/02/09/definitely-too-late-to-stop-spread-of-coronavirus-expert-says/", "https://apnews.com/aa099ef56f5d5adb0fb85c07e13e6ba2", "https://nypost.com/2020/02/09/inside-the-coronavirus-quarantined-cruise-ship-docked-in-japan/", "https://www.youtube.com/watch?v=Yz-mht7iz8M", "https://www.businessinsider.com/quarantine-history-following-china-wuhan-coronavirus-lockdowns-2020-1?op=1", "https://www.youtube.com/watch?v=meRUCxlleUc", "https://www.usatoday.com/story/travel/2020/01/31/coronavirus-china-flight-ban-delta-cuts-all-flights-white-house/4620989002/", "https://finance.yahoo.com/news/china-drug-patent-grab-makes-171955356.html", "https://www.medscape.com/viewarticle/924964", "https://americanmilitarynews.com/2019/11/china-has-an-emerging-stranglehold-on-the-us-generic-drug-supply/", "https://www.biopharmadive.com/news/nih-stop-hiv-vaccine-study-uhambo/571594/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://amzn.to/2Bmxe5K", "/coronavirus-vaccine-a-year-away/?login=1", "#", "#"], "authors": [], "publish_date": "2020-02-11T10:29:23+00:00"}