{"result_id": "332008", "URL": "https://vaxxter.com/part-2-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "timestamp": "2023-04-25 17:52:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/part-2-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Part 2: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Known As The COVID-19 \" Vaccines\"", "cleaned_text": "Fast forward to year two of this plandemic. On October 13, 2021, a study out of Sweden reported several findings:\n\n“The SARS–CoV–2 spike protein significantly inhibits DNA damage repair, which is required for effective V(D)J recombination in adaptive immunity.”\n\n“Our findings reveal a potential molecular mechanism by which the spike protein might impede adaptive immunity and underscore the potential side effects of full-length spike-based vaccines.”\n\n“Mechanistically, we found that the spike protein localizes in the nucleus and inhibits DNA damage repair by impeding key DNA repair protein BRCA1 and 53BP1 recruitment to the damage site.”\n\n“If DNA damage cannot be properly repaired, it will contribute to the amplification of viral infection-induced pathology.”\n\nAdaptive immunity means we have the ability to make antibodies whenever we need to. This allows the transformation of undifferentiated immune cells into the active B or T cell types that are ready to make antibodies (B-cells) or fight infection (T-cells). Lack of DNA repair is a problem because DNA changes can lead to cancer or mitochondrial conditions, which can include Parkinson’s disease.\n\nViral infections trigger the body’s inflammation response, which leads to oxidative stress and more DNA damage. Adequate nutrients can help correct the oxidative stress chemical imbalance before damage occurs. But once DNA damage occurs, it may be too late.\n\nIn contrast, data provides valuable details on the involvement of spike protein subunits in DNA damage repair, indicating that full–length spike-based injections may inhibit the recombination of V(D)J in B cells, which is also consistent with a recent study that a full–length spike-based jab-induced lower antibody titers compared to the RBD–based jab.\n\nThis suggests that the use of antigenic epitopes of the spike as SARS–CoV–2 injections might be safer and more efficacious than the full–length spike. (Epitopes also known as antigenic determinants, are the immunologically active discrete sites on the antigen molecule that physically bind to antibodies, B-cell receptors, or T-cell receptors.)\n\n…We identified one of the potentially important mechanisms of SARS–CoV–2 suppression of the host adaptive immune machinery. Furthermore, our findings also imply a potential side effect of the full–length spike-based vaccine.”\n\nThe spike protein binds to a site on the exterior of a red blood cell, called an outfection, as opposed to an infection. Spike proteins are attaching to the exterior or bonding to the exterior of the erythrocyte, thus disturbing their surface appearance and probably their function.\n\nIs the truth unclear or is it simply hidden?\n\nAt The Truth About Cancer event in Nashville, Del BigTree, who gave an epic presentation, revealed that in 2005, doctors Drew Weissman and Katalin Karikó discovered a way to protect foreign mRNA from the body’s immune system, which would normally break down any mRNA found outside of a cell.\n\nWeissman and Kariko modified the gene sequence of the mRNA where the nucleoside uridine (the motivation molecule) was present. The modification helps the foreign mRNA bypass part of the body’s first line of defense — the innate immune system. This discovery was incorporated into the mRNA technology used in Covid injections, including the Pfizer mRNA code, so that the foreign mRNA could enter cells without being destroyed. (The pseudo lipid helps make that happen. We will dive into this in later parts of this primer).\n\nThis scientific milestone is the key to the advancement of mRNA injections in 2020.\n\nAs Del explained, the simple removal of one letter of code from the terminal mRNA, and the substitution of a similar but different chemical called pseudouridine resulted in eliminating the KEY, alarm system of our innate immune system: the ablation of toll-like receptors 4, 7 and 8.\n\nThe body possesses two broad parts to its immune system: innate and adaptive. The innate is the first to go into action against foreign invaders, including foreign mRNA from a Covid injection.\n\nWhat are the consequences of switching off our important early warning system? Are the mechanisms by which SARS–CoV–2 suppresses adaptive immunity truly unclear? Or are they just not being discussed?\n\nThe S-proteins are the crown or corona of spike proteins that look like “small mushrooms” on the surface of the virus. The spike proteins allow coronaviruses to invade human cells by attaching to the ACE2 receptor. Cell receptors perform functions for the cell and may allow entry of chemicals once activated, or may cause an action to occur on the interior of the cell.\n\nThese “spear-like appendages” attach to and completely surround the central core of the COVID virus, giving a “porcupine-like appearance.” Upon binding to the angiotensin-converting enzyme 2 (ACE2) receptors on the cell membranes of the target cells, enzymes are released that dissolves part of the cell membrane, allowing entry of the complete COVID virus into the cytoplasm of the cell’s interior. Here is where protein replication occurs, which is where the virus hijacks for the purpose of replicating itself. To reiterate, the spike glycoprotein (S protein), allows virus entry with its ability to cleave or change its shape so it can fit into the ACE2 or other receptors, and it is a primary determinant of cell tropism and pathogenesis of human cells.\n\nAccording to many experts, it is the altered S-spike, not the virus, that is the concern.\n\nA paper titled “Mechanisms of Coronavirus Cell Entry Mediated by the Viral Spike Protein” addresses cell entry strategies of standard coronaviruses and how these mechanisms are related to host tropism, which is the reason certain pathogens can only infect certain types of host species and cause illness.\n\nPhysicist-nuclear cardiologist-biologist-chemist-psychologist Dr. Richard Fleming, whom I first interviewed in August 2020, also explains that the spike is the delivery system, but that real harm may also result from prion-like parts of the spike protein. These prion-like areas of the gene sequence are unknown on any other coronavirus spike – they are only found on SARS-COV2. They were retained in the modified version of the chimeric spike sequence that is being used in all of the CoV injections thus far.\n\nMisfolded proteins caused by prions are involved in Alzheimer’s dementia and autism and are a similar issue to prion diseases. Mad cow disease has become the most recognized name for one type of prion condition. The prion-like areas of the spike protein may cause a similar misfolding or tangling in other proteins. The tangled protein causes an inflammatory reaction which can lead to fibrotic scarring and eventual cell death.\n\nPrions are pathogenic agents that are able to cause abnormal folding of specific normal cellular proteins in the brain. Prion protein damage, once it reaches the inflammatory scarring stage, causes tiny holes to form in brain tissue, making it appear sponge-like under a microscope. Prion disease is usually rapid and always fatal.\n\nViral replication causes the host cell to burst open, releasing viruses which then use part of the host cell membrane as their outer membrane. The cellular fluid and other organelles leak into surrounding tissue and cause further inflammatory damage. The prion-like risk of the spike, whether on the bio-weaponized virus or on the cells of injected people, would be the same.\n\nThe spike protein can cause some of the proteins to change shape, misfold, and lose their function. In prion disease, the misfolded human protein can then cause other similar proteins to also misfold, which leads to an exponentially increasing problem. The misfolded protein tangle and the clump can disrupt function further; eventually scarring and cell death in the region leads to loss of function of the area. Brain cell death can cause physical movement or difficulty with cognitive skills, concentration, decision making, or speech and sense perception.\n\nPrion protein is transmissible. Exosomes containing spike protein and possibly the mRNA gene sequence may also be exhaled or released in sweat or other body fluids by the recently CoV injected. Because we are in unchartered territory, we do not really know about peak risk. With that said, many, including myself have gotten ill after being in close proximity to people who have been freshly vaccinated and/or boosted. Immune-compromised people are more likely to produce spikes for a longer amount of time than people with a healthier immune system that is better able to detox the body.\n\nA frightening study published by the Human Microbiology Institute revealed the outer shell of the SARS-CoV-2 spike protein contains “prion-like regions” that give the virus a 10-to20-fold higher affinity for ACE2, to be exact. The key region of the spike protein that studs SARS-CoV-2’s outer surface is called “receptor binding domain (RBD).”\n\nIn 2017, Johns Hopkins published “The SPARS Pandemic 2025-2028,” a report about a communications drill for a jab that could “accidentally” cause bovine spongiform encephalopathy aka “mad cow” prion disease.\n\nIt has rather conclusively been determined that the mRNA-produced S-spike protein is NOT QUITE THE SAME as in the SARS-CoV-2 virus. The produced protein is similar but misshaped in 3D. It is a chiral-mirrored or “stereoisomer” – a mirror image misfolded protein which can lead to similar problems as prion disease.\n\nAnd yet on January 21, 2020, a paper published by researchers in the Key Laboratory of Molecular Virology and Immunity of the Shanghai Pasteur Institute of Chinese Academy of Sciences mentioned that the sequence of a key part of the S protein of the virus is highly homologous to the SARS virus. (6) Furthermore, there are studies that show that the mRNA COVID-19 jabs may progressively degenerate the brain from prion disease.\n\nHere is another Sept 2021 study that illustrates COVID-19 mRNA injection leads to CNS inflammation. And here are anecdotal reports from the NIH suggesting that the jabs may be associated with the brain, spinal cord, peripheral nervous system, and cardiac inflammation.\n\nThe CoV jabs hijack your body’s cells and cause them to churn out proteins modeled after the spike proteins in the SARS-CoV-2 coronavirus. Thus, it could be described as causing mRNA jab recipients to churn out prion-like toxins in their brains, as Dr. Sherri Tenpenny explains.\n\nIt doesn’t help the risk to health that prions tend to bond with heavy metals like lead, mercury, cadmium, and arsenic – all of which can be a risk for brain-damaging effects. Heavy metals are difficult for the body to remove and tend to accumulate as we age. Some trace nutrients can also be damaging in excess quantities in the body or can cause a deficiency in other trace minerals. We need minerals like manganese, chromium, and copper in very tiny amounts, but these may be contaminants found in water supplies and can be dangerous in excess. Lead and arsenic are also common water contaminants.\n\nMeanwhile, it is unclear whether the Covid shots contain heavy metals like mercury or aluminum. Consider, however, that toxic exposures to heavy metals can impair taste and smell. Nasal toxicity can impact the olfactory senses. I speak more about heavy metals later in this primer when covering the impact of nanoparticles in these jabs.\n\nIn Parts 1 and 2 of this primer, I have covered the genesis of the SARS-Cov-2 and explained why the S Protein in these injections is so damaging to the human body. Stay tuned. There are several more parts of this primer to comprehensively cover these injections.\n\nLike what you’re reading on The Tenpenny Report? Share this article with your friends. Help us grow.\n\nMaryam Henein is an investigative journalist, and founder, and editor-in-chief of the health magazine and marketplace HoneyColony. She is also a functional medicine consultant/coach, and the director of the award-winning documentary film Vanishing of the Bees, narrated by Elliot Page. Follow her on Gab: @ladybee. Email her: maryam @ honeycolony.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Part 2: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Known As The COVID-19 \" Vaccines\" - The Tenpenny Report", "description": "by Maryam Henein Spike protein inhibits the repair of damaged DNA.  Fast forward to year two of this plandemic. On October 13, 2021, a study out of Sweden reported several findings: “The SARS–CoV–2 spike protein significantly...", "url": "https://vaxxter.com/part-2-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/", "site_name": "The Tenpenny Report", "article:published_time": "2022-03-14T23:05:35+00:00", "article:modified_time": "2022-03-14T23:45:54+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/12/53e7d34b4c50a414f1dc8460962a3f7f1d37d8f852577140722e7edd974d_640_covid-vaccine.jpg", "image:width": "640", "image:height": "391"}, "tags": ["Prion Disease", "DNA damage repair", "SARS-CoV-2", "Spike protein"], "tweets": [], "movies": [], "links": ["https://www.mdpi.com/1999-4915/13/10/2056/htm", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC5882770/", "https://www.mdpi.com/1999-4915/13/10/2056/htm#B22-viruses-13-02056", "https://www.mdpi.com/1999-4915/13/10/2056/htm#B22-viruses-13-02056", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8145845/", "https://microbeonline.com/epitope/", "https://www.mdpi.com/1999-4915/13/10/2056/htm", "https://rumble.com/vo9mp4-mandates-no-more-del-bigtree-must-watch-speech-at-ttac.html", "https://linkinghub.elsevier.com/retrieve/pii/S1074-7613(05)00211-6", "https://pubchem.ncbi.nlm.nih.gov/compound/uridine", "https://linkinghub.elsevier.com/retrieve/pii/S1074-7613(05)00211-6", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8071766/", "https://www.ukcolumn.org/index.php/article/stabilising-the-code", "https://rumble.com/vo9mp4-mandates-no-more-del-bigtree-must-watch-speech-at-ttac.html", "https://linkinghub.elsevier.com/retrieve/pii/S1074-7613(05)00211-6", "https://pubchem.ncbi.nlm.nih.gov/pathway/Reactome:R-HSA-168181", "http://orthomolecular.org/resources/omns/v17n15.shtml", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC7988450/", "http://orthomolecular.org/resources/omns/v17n15.shtml", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC3397359/", "https://www.bitchute.com/video/kGHOvA5SLtMB/", "https://www.bitchute.com/video/lCcYq9gsfvrk/", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC3397359/", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC7988450/", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC7988450/", "https://www.bitchute.com/video/D7WkbTVvRt4O/", "https://deeprootsathome.com/is-there-an-antidote-for-prion-protein-damage-from-the-spike-protein/", "https://www.cdc.gov/prions/index.html", "https://archive.vn/k7PZa#selection-667.0-671.38", "https://www.beyondpesticides.org/assets/media/documents/infoservices/pesticidesandyou/Summer%2003/mad_cow.pdf", "https://alz-journals.onlinelibrary.wiley.com/doi/full/10.1002/alz.043847", "https://pubmed.ncbi.nlm.nih.gov/34100279/", "https://pubmed.ncbi.nlm.nih.gov/34654691/", "https://www.chop.edu/news/feature-article-viral-shedding-and-covid-19-what-can-and-can-t-happen", "http://hmi-us.com/publications/sars-cov-2-prion-like-domains-in-spike-proteins-enable-higher-affinity-to-ace2.html", "https://archive.vn/0I4g8", "https://www.preprints.org/manuscript/202003.0422/v1", "https://archive.vn/P64qg", "https://pubmed.ncbi.nlm.nih.gov/32009228/", "https://pubmed.ncbi.nlm.nih.gov/32009228/", "https://dundasvalley.files.wordpress.com/2021/03/covid19-rna-based-vaccines-and-the-risk-of-prion-disease-1503.pdf", "https://greatgameindia.com/mrna-vaccines-degenerate-brain-prion/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8417681/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8417681/", "https://www.brighteon.com/fb2bcfa1-988e-40f1-bada-4c1e1780a58e", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC4427717/", "https://www.brlabsinc.com/the-top-5-heavy-metals-you-should-be-testing-your-water-for/", "http://www.annclinlabsci.org/content/31/1/3.full", "https://pubmed.ncbi.nlm.nih.gov/31604559/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://t.me/truthavengers", "http://voyagela.com/interview/meet-maryam-henein-honeycolony-beachwood/?fbclid=IwAR0kT-yHZsay2AaWvYuM1qLOkbiftoD4xG0yFeC5JDF_ysT5ZVqKbpH03_U", "http://www.honeycolony.com/", "http://www.vanishingbees.com/", "https://gab.com/LadyBee", "/part-2-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-known-as-the-covid-19-vaccines/?login=1", "#", "#"], "authors": [], "publish_date": "2022-03-14T23:05:35+00:00"}