{"result_id": "332024", "URL": "https://vaxxter.com/part-5-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "timestamp": "2023-04-25 17:53:05 CEST+0200", "meta": {"description": "Covid-19 shots are all risk and zero benefit to anyone, in any age group. % Maryam Henein", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/part-5-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Part 5: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Referred to As COVID-19 ” Vaccines”", "cleaned_text": "Rather than staying localized at the injection site to provoke the immune response and nothing more, spike proteins have been detected throughout the body of vaccinated individuals.\n\n“The peripheral blood smear in vaccinated patients and those “diagnosed with COVID-19 shows agglutination of RBCs, probably a result of innate neutrophils producing extracellular neutrophil traps (NETS) of DNA and protein that RBCs, platelets, white cells, coagulation, and complement factors all get stuck in, writes Gregory H Jones, MD, DABOHN, DABIM, DABPN, DNBPNS, DAIHM.\n\nJones says that the RBC agglutination, “leads to elevated D-dimer, also a product of Disseminated Intravascular Coagulation (DIC), a consumptive coagulopathy. The consumption of these cells and factors causes widespread hypoxemia (from red cell destruction, anemia, and decreased O2 delivery), organ ischemia (in the brain, lungs, heart, kidney, gonads, limbs, etc.), clotting, and spontaneous bleeding because of systemic platelet and coagulation factor deficiencies.\n\nBecause of the mRNA gene therapy “vaccine”, the spike proteins are being mass-produced by all cells, and specifically placed on their membranes, especially (vascular lining) cells and others rich in ACE-2 receptors (brain, heart, lungs, kidneys, ovaries/testes, vasculature). The spike proteins protrude out of the endothelial cell membrane and into the lumens of all blood vessels like a mace, and along with the NETS and graphene oxide, cause the following conditions: reduced endothelial cell nitric oxide production (decreased endothelial function), vascular smooth muscle dilation, increased arterial spasm, platelet aggregation, wall thickening and plaques, inflammation, clotting, and ultimately organ ischemia and destruction. The result is encephalopathies, degenerative neurologic diseases like Alzheimer’s and Parkinson’s disease, MODS, SIRS, SARS/ARDS, ARI, infertility (gonadal insufficiency), and death.\n\nThe clinical pictures for both chronic COVID-19 and post-vaccine toxicity appear very similar, and both are likely due to this continued presence and body-wide dissemination of the spike protein. (Aucott and Rebman).\n\nMeanwhile, it appears that some of the circulating spike proteins bind to the ACE2 receptors without entering the cell, inducing an autoimmune response to the entire cell-spike protein entity. Depending on the cell type that binds the spike protein, any number of autoimmune medical conditions can result.\n\nClearly, there are at least 40 mechanisms of injury caused by the covid shots. The thrombotic tendencies are related to the spike protein of the synthetically made coronavirus. There are reports that the spike protein can continue to be produced indefinitely after the initial binding to the ACE2 receptors and entry into the cells that it initially targets.\n\nNote that ACE2 receptors exist on many different types of cells throughout the body, including the epithelial cells lining the airways, which conveniently are the first targets of the COVID-19 virus upon initial encounter when inhaled.\n\nFurthermore, the concentration of these receptors is especially high on lung alveolar epithelial cells, further causing the lung tissue to be disproportionately targeted by the virus. Unchecked, this avid receptor binding and subsequent viral replication inside the lung cells leads directly to low blood oxygen levels and adult respiratory distress syndrome [ARDS]. Eventually, there is a surge of intracellular oxidation known as the cytokine storm, and death results from respiratory failure.\n\nA potent toxin is bad enough, but one that can replicate and increase its quantity inside the body after the initial encounter represents unique among toxins. In addition to the mechanisms already discussed, it appears the spike protein itself is significantly toxic, both vascular and prionic).\n\nA recent analysis “indicate[d] that Pfizer’s RNA-based vaccine contains many of the RNA sequences shown to have the potential to induce degenerative neurological diseases.”\n\nPfizer has confirmed that COVID-injected people can shed spike proteins and harm the unvaccinated.\n\nAs the document states, one can be “exposed to [the] study intervention due to environmental exposure,” including “by inhalation or skin contact” with someone involved in the study, or with another who has been exposed in the same way.\n\nAccording to the latest issue brief titled “Identifying Post-Vaccination Complications & Their Causes: An Analysis of Covid-19 Patient Data,” America’s Frontline Doctors (AFLDS) warned that the spike proteins from the experimental COVID-19 gene therapy injections contain lipid nanoparticles that can cross the blood-brain barrier and damage to the brain. LNPs have shown the unique ability to deliver nucleic acids into the DNA of cells, including brain cells.\n\n“The mRNA-induced spike protein can bind to brain tissue up to 20 times stronger than spike proteins located on natural coronaviruses.” writes Vaccine Safety.\n\nIn a study published in the journal of Neurobiology of Disease, it was shown that SARS-CoV-2 spike proteins can cause the blood-brain barrier to become ‘leaky,’ leading to disruption of the delicate neural networks within the brain.\n\nMeanwhile, consider that the vaccines themselves have been called ‘leaky.’\n\nDr. Peter McCullough, a highly published cardiologist and former Vice Chief of Internal Medicine at Baylor University Medical Center, confirmed recently that the spike protein goes everywhere and, based upon autopsies, can persist and continue to be produced for at least 15 months.\n\n“After each injection, the spike protein can persist for more than a year. It’s a permanent install in the body. No wonder people are suffering from Long COVID-19,” says McCullough.\n\nThe bottom line: Covid-19 injections are all risk with zero benefits in any age group or population. Avoid these shots at all cost. They have been released as an all-out assault on humanity, from pregnant women to children to the elderly.\n\nLike what you’re reading on The Tenpenny Report? Share this article with your friends. Help us grow.\n\nMaryam Henein is an investigative journalist, and founder, and editor-in-chief of the health magazine and marketplace HoneyColony. She is also a functional medicine consultant/coach, and the director of the award-winning documentary film Vanishing of the Bees, narrated by Elliot Page. Follow her on Gab: @ladybee. Email her: maryam @ honeycolony.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Part 5: A Primer: Understanding The Mechanisms Of The Experimental Genetic Technology Referred to As COVID-19 ” Vaccines” - The Tenpenny Report", "description": "Covid-19 shots are all risk and zero benefit to anyone, in any age group. % Maryam Henein", "url": "https://vaxxter.com/part-5-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/", "site_name": "The Tenpenny Report", "article:published_time": "2022-05-12T03:04:09+00:00", "article:modified_time": "2022-12-24T01:47:12+00:00", "image": "https://vaxxter.com/wp-content/uploads/2022/05/blood-1813410-scaled.jpg", "image:width": "2560", "image:height": "1280"}, "tags": ["spike proteins", "blood-brain barrier", "blood clots"], "tweets": [], "movies": [], "links": ["https://pubmed.ncbi.nlm.nih.gov/34100279/", "https://pubmed.ncbi.nlm.nih.gov/33466589/", "https://www.naturalnews.com/2021-07-13-doctor-says-mrna-vaccines-kill-most-people.html", "https://www.merckmanuals.com/home/blood-disorders/bleeding-due-to-clotting-disorders/disseminated-intravascular-coagulation-dic", "https://cdn.the-scientist.com/assets/articleNo/67404/hImg/37168/virus-1800x720-x.webp", "https://dailyexpose.co.uk/2021/07/19/vaers-whistleblower-45000-dead-from-covid-19-vaccines-within-3-days-sparks-lawsuit-against-federal-government/", "https://duckduckgo.com/?q=Multiorgan+dysfunction+Syndrome&atb=v213-1&ia=web", "https://duckduckgo.com/?q=systemic+inflammatory+response+syndrome&atb=v213-1&ia=web", "https://duckduckgo.com/?q=Severe+acute+respiratory+syndrome&atb=v213-1&ia=web", "https://duckduckgo.com/?q=acute+respiratory+distress+syndrome&atb=v213-1&ia=web", "https://duckduckgo.com/?q=acute+renal+insufficiency&atb=v213-1&ia=web", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8126694/", "https://journals.co.za/doi/pdf/10.7196/SAMJ.2021.v111i1.15433", "https://pubmed.ncbi.nlm.nih.gov/33684352/", "https://www.lewrockwell.com/2021/10/no_author/canceling-the-spike-protein/", "https://www.drtenpenny.com/2-ebook-collection-20-moi", "http://orthomolecular.org/resources/omns/v17n24.shtml", "https://www.biorxiv.org/content/10.1101/2020.01.31.929042v1.abstract", "https://www.biorxiv.org/content/10.1101/2020.04.23.057042v1.abstract", "https://www.biorxiv.org/content/10.1101/2021.09.30.462449v1.full#ref-28", "https://pubmed.ncbi.nlm.nih.gov/32364961/", "http://orthomolecular.org/resources/omns/v17n24.shtml#RefB", "https://archive.vn/k7PZa#selection-421.0-433.1", "https://stateofthenation.co/?p=60339", "http://82.221.129.208/pfizervax.pdf", "https://americasfrontlinedoctors.org/2/action_alerts/identifying-post-vaccination-complications-their-causes-an-analysis-of-covid-19-patient-data/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5006671/", "https://vaccinesafety.info/2021/10/27/pfizer-confirms-covid-vaccinated-people-can-shed-spike-proteins-and-harm-the-unvaccinated/", "https://pubmed.ncbi.nlm.nih.gov/33053430/", "https://twitter.com/VigilantFox/status/1474954968562118658?s=20", "https://www.rwmalonemd.com/", "https://www.bitchute.com/video/JVHhIpGwknoe/", "https://www.americaoutloud.com/natural-immunity-science-for-the-intellectually-honest/", "https://vaxxter.com/part-6-understanding-the-mechanisms-of-the-covid-19-vaccines/", "https://www.vaxxter.com/", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "https://t.me/truthavengers", "http://voyagela.com/interview/meet-maryam-henein-honeycolony-beachwood/?fbclid=IwAR0kT-yHZsay2AaWvYuM1qLOkbiftoD4xG0yFeC5JDF_ysT5ZVqKbpH03_U", "http://www.honeycolony.com/", "http://www.vanishingbees.com/", "https://gab.com/LadyBee", "http://wpinject.com/", "http://www.flickr.com/photos/160349367@N08/48712413302", "http://creativecommons.org/licenses/by-nd/2.0/", "/part-5-a-primer-understanding-the-mechanisms-of-the-experimental-genetic-technology-referred-to-as-covid-19-vaccines/?login=1", "#", "#"], "authors": [], "publish_date": "2022-05-12T03:04:09+00:00"}