{"result_id": "332003", "URL": "https://vaxxter.com/vaccine-illusion-book-review/", "timestamp": "2023-04-25 17:52:30 CEST+0200", "meta": {"description": "Review: Vaccine Illusion is a call to action for parents’ to consider how vaccines achieve their effects and if those benefit to their children.", "lang": "en", "keywords": "", "favicon": "https://vaxxter.com/wp-content/uploads/2022/02/cropped-tenpennyReportSiteIcon-32x32.png", "canonical": "https://vaxxter.com/vaccine-illusion-book-review/", "encoding": "UTF-8"}, "image": null, "domain": "vaxxter.com", "title": "Vaccine Illusion - Book Review", "cleaned_text": "A short book that reads more like a lengthy article, Vaccine Illusion is a call to action for parents’ to consider how vaccines achieve their effects, and if those effects are a benefit to their children. Vaccine Illusion also seeks to raise awareness about the importance of changing the current methods of immunologic research.\n\nBy reading this concise and well-referenced book, one can begin to dismantle many of the vaccine myths that we are fed every day through our public health system agencies, politicians, media, and the poorly-trained health professionals who administer them.\n\nThe first chapter of Vaccine Illusion offers a brief history of vaccination and the process of variolation, an injection of pus from a pustule of smallpox. It usually involved extracting the pus from a sick person and injecting it into a healthy one. The theory for this folksy practice was to give a milder form of the disease to the person whose immune system would then be programmed to recognize the disease and to fight it off. There was no way to prove efficacy (protection exists), and the procedure was risky.\n\nEdward Jenner, called the Father of Vaccination, tried to make variolation safer by using a cowpox pustule after observing milkmaids who came in contact with cowpox appeared immune to smallpox. He called his process vaccination to distinguish it from variolation. However, Jenner only tested his subjects for their resistance to smallpox via variolation. He didn’t test against their natural resistance to smallpox. This illustrates that the entire premise for vaccination was faulty and shortsighted right from the beginning.\n\nChapter 2 discusses the next breakthrough in immunologic research with the use of horse anti-serum for treating diphtheria and tetanus. Today, both are rare infections. The toxins the bacteria secrete under specific conditions are the cause of the illness, not the bacteria itself. The animal serum was incompatible with human physiology, causing serious side effects in humans, which necessitated the development of a human anti-serum. In 1924, an immunologist discovered that treating the toxins with formaldehyde would eliminate the disease symptoms even when large doses were injected. There is no placebo-controlled trial procedure to validate this practice.\n\nImmunologists generally believe that antibodies can neutralize bacteria, viruses, and other toxins, preventing them from causing symptoms. The biggest take-away is that at best, this is only an assumption. There is a total lack of experimental proof throughout the entire history of immunologic research regarding vaccination.\n\nObukhanych takes a closer look at tetanus and discovers how easy it is to acquire natural immunity, even when the C. tetani bacteria lives in the intestines of an organism. The bacteria cannot function in the presence of oxygen. It requires an anaerobic environment to be active. Wounds must have oxygen exposure. Additionally, blood flow to deactivates the spores. Once the spores come in contact with the air, they can no longer produce any toxin due to deactivation. The greatest risk for developing the infection comes from deep puncture and crush wounds that have C. tetani spores or bacteria contamination. Additionally, an inability to adequately clean a wound adds to the risk.\n\nIn Chapter 4, Obukhanych states that since the tetanus vaccine has never gone through randomized controlled trials (RCT), we have no way of knowing if this vaccine can prevent tetanus. The lowered rates of tetanus in soldiers during WWI and WWII was due to a lower risk of exposure and better wound hygiene. Obukhanych discusses and refutes the assumption that the vaccine is often claimed to be solely responsible for disease-prevention.\n\nChapter 5 discusses one of the most interesting aspects of Vaccine Illusion, the concept of immunologic dogma, the equating of immunity with immunologic memory. Obukhanych states that without this dogma, the entire field of vaccination would implode and vaccination would not be used as a primary strategy for disease prevention. The fatal flaw is that antibody production in no way guarantees disease prevention or herd immunity. Antibody production is the only requirement to pro-vaccine advocates use to deem a vaccine as effective.\n\nThese three chapters discuss the complex process of allergies, the lack of a clear definition for vaccine safety, and vaccines’ lack of proof of immunity. These three chapters are critical for informed consent and for making decisions on whether or not to vaccinate.\n\nObukhanych briefly explains the use of vaccine adjuvants in boosting the effects of vaccines beginning with aluminum whose adjuvant properties were discovered in the 1920s. Since no overt gross reactions were noted initially, aluminum was considered inert and safe for human use. Since that time, we know this to be untrue, yet aluminum continues to be present in several vaccines today.\n\nThe author moves to an explanation of the inconsistent and error-prone process of attenuation and a brief explanation about the waning effect of vaccination over time. This can occur through the imperfect design of serological testing, which cannot tell when vaccine-derived antibodies are no longer present. We have already discovered that vaccines do not protect over a lifetime as once believed. Obukhanych compares choosing vaccination over natural immunity from a risk-benefit analysis.\n\nObukhanych offers facts about the outright refusal to conduct adequate scientific studies and the “sell-your-soul” approach that the scientists in her field must take if they are to continue working. She admits that many of the old myths surrounding vaccination are no longer valid through this lens of modern immunology.\n\nObukhanych reminds us that vaccines alone are not enough to eradicate infections. We are seeing more and more evidence today with fully vaccinated individuals spreading infections to others in public settings. The unvaccinated are almost always receive the blame for this, but no one can spread an infection they do not have. Unless these individuals consistently receive a test by exposure to wild strains, this fallacy will continue.\n\nIn chapter 10, Obukhanych introduces the concepts of antibody-mediated enhancement and antibody-mediated suppression when receiving an annual flu shot that can lead to original antigenic sin. This occurs when pre-existing antibodies cross-react with, but do not perfectly match, the pathogen.\n\nChapter 11 covers the need to change our relationship to germs and to reexamine our unfounded fear of viral infections. The author differentiates between viral and bacterial infections and singles out the bacterial infections that we should learn to avoid. She questions whether vaccination is the best solution since they only cover a small fraction of the millions of bacterial types and subtypes of any infectious illness. Also, vaccination itself can be the driving mechanism for which more dangerous viral and bacterial strains can present. Messing with nature is always a bad idea.\n\nChapter 13 discusses the trouble with Tylenol, a popular remedy for vaccine-induced inflammation, and often a pediatrician’s go-to for childhood fevers. Obukhanych offers some alternative treatments to priming the immune system and ensuring health. It is important to weigh the risks of vaccine-targeted organisms versus the risk of vaccine injury. Taking this one step will likely have a huge impact on preventing vaccine injury.\n\nThe final chapter of Vaccine Illusion encourages parents and caregivers to examine each so-called “vaccine-preventable” illness. Additionally, parents should weigh the risks versus benefits of each vaccine by formulating a list of pertinent questions. The concept of herd immunity and how frequently it is unwarranted regarding vaccination is discussed. This is one of the most important concepts for parents and caregivers to understand.\n\nThe author’s immunologic perspective focuses on the facts regarding acquired immunity and what it entails to build a healthy body. The use of vaccines was never to be a proxy for natural immunity. She points out that immunology does not study immunity but rather the artificial process of immunization. Therefore, immunology does not understand natural infections and the lifelong immunity provided by them. Natural immunity receives an override by injections from foreign substances that are an artificial mechanism which goes against nature. Obukhanych states that, though immunity and immunization often are mistaken for the same thing, they are in fact quite different.\n\nVaccine Illusion will offer a basic understanding of immunology and its relationship to vaccination.\n\nLike what you’re reading on Vaxxter.com?\n\nShare this article with your friends. Help us grow.\n\nJoin our list here or text MVI to 555888\n\nMaria Ryan is a freelance content writer. She has contributed to a number of online publications on fitness, nutrition, food, lifestyle, and parenting. She is an avid reader and book reviewer. Her work especially promotes indie authors, getting less-known information into the hands of many. You can find her additional book reviews at her blog, bemisreviewsbooks.com.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccine Illusion - Book Review - The Tenpenny Report", "description": "Review: Vaccine Illusion is a call to action for parents’ to consider how vaccines achieve their effects and if those benefit to their children.", "url": "https://vaxxter.com/vaccine-illusion-book-review/", "site_name": "The Tenpenny Report", "article:published_time": "2020-04-07T19:33:05+00:00", "article:modified_time": "2020-06-11T17:00:25+00:00", "image": "https://vaxxter.com/wp-content/uploads/2020/04/Screen-Shot-2020-04-07-at-11.49.23-AM.png", "image:width": "971", "image:height": "911"}, "tags": ["immunology", "tetanus", "herd immunity", "book review", "vaccine"], "tweets": [], "movies": [], "links": ["https://vaxxter.com/bojo-mumbo-jumbo/", "https://www.britannica.com/science/variolation", "Edward%2520Jenner", "https://www.atsdr.cdc.gov/phs/phs.asp?id=218&tid=39", "https://www.youtube.com/watch?v=hIgomZ06FFQ", "https://vaxxter.com/dr-nancy-tarlow-the-tetanus-shot-and-lies-doctor-tell/", "https://vaxxter.com/the-worst-ingredient-of-all/", "http://vaccinepapers.org/wp-content/uploads/Non-linear-dose-response-of-aluminium-hydroxide-adjuvant-particles-Selective-low-dose-neurotoxicity.pdf", "https://msystems.asm.org/content/3/4/e00046-18", "https://bio.libretexts.org/Bookshelves/Ancillary_Materials/Laboratory_Experiments/Microbiology_Labs/Microbiology_Labs_II/Lab_17%3A_Serology%2C_Direct_and_Indirect_Serologic_Testing", "https://www.the-scientist.com/news-opinion/polio-vaccination-causes-more-infections-than-wild-virus-66778", "https://www.ncbi.nlm.nih.gov/pubmed/28479213", "https://www.quantamagazine.org/how-vaccines-can-drive-pathogens-to-evolve-20180510/", "https://www.bmj.com/content/350/bmj.h1453/rr-12", "https://ascpt.onlinelibrary.wiley.com/doi/abs/10.1038/clpt.1987.50", "https://wcivwisconsin.org/resources/herd-immunity/", "https://www.vaxxter.com", "https://lp.constantcontact.com/su/S86uaFJ/VaxInfo", "http://bemisreviewsbooks.com/", "/vaccine-illusion-book-review/?login=1", "#", "#"], "authors": [], "publish_date": "2020-04-07T19:33:05+00:00"}