{"result_id": "333019", "URL": "https://www.veteranstoday.com/2022/09/13/criminal-fda-and-cdc-ignore-law-and-approve-new-covid-vaccine-boosters-with-zero-testing-on-humans-on-mice-only/", "timestamp": "2023-04-25 17:54:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/09/13/criminal-fda-and-cdc-ignore-law-and-approve-new-covid-vaccine-boosters-with-zero-testing-on-humans-on-mice-only/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Criminal FDA and CDC Ignore Law and Approve New COVID Vaccine Boosters with ZERO Testing on Humans: On Mice Only | VT Foreign Policy", "cleaned_text": "The U.S. Government, via their alphabet “health” agencies the FDA and CDC, part of the Department of Health and Human Services, has done something this month (September, 2022) that has never been done before in the history of this country, and that is to authorize an untested vaccine into the American public, completely ignoring existing laws that prevent them from doing such a heinous criminal act, in order to use the American public as lab rats for a new version of the COVID vaccines.\n\nDr. Meryl Nass has written the best summary of these crimes against humanity, and I am republishing it below.\n\nThis is, first and foremost, a Spiritual War between Satan and his minions, and God Almighty, the Creator of Heaven and Earth.\n\nAs I have previously written numerous times, vaccine products are the most evil products ever developed by the pharmaceutical cartels. They are the only products that are produced NOT to treat diseases, but are patterned after the insurance industry model of trying to sell you something to protect you against something bad that MIGHT happen to you in the future.\n\nTherefore, if you come down with something like the measles, you do not get a vaccine to treat your measles. If you get hepatitis, you do not get a vaccine to treat your hepatitis.\n\nYou get vaccines in the hope that the promises of the pharmaceutical drug peddlers are true, that you will not get those diseases if you take their toxic vaccines, which they admit and the Supreme Court has affirmed, are “unavoidably unsafe,” because all vaccines have dangerous side effects and risks – this is not even a truth that is in dispute.\n\nAs we have documented these past two years, the rushed-to-market COVID vaccines that were given emergency use authorization have resulted in more deaths and injuries than all other vaccines combined that were introduced into the market for the past 30+ years.\n\nThey are evil. They are a mockery to God our Creator, who has promised to protect and heal those who trust and and have faith in him.\n\nA person who takes a vaccine based on the false promises of the criminal pharmaceutical companies, are basically denying their faith in God and his promise to take care of them, and doing the exact opposite: acting in FEAR, being afraid that they will “catch” some deadly disease that God cannot protect them from or heal them from.\n\nThis mockery of God and his promises by promoting vaccines was demonstrated publicly yesterday, by the White House’s COVID advisor Dr. Ashish Jha, who said:\n\nThe White House has ordered 171 million doses of these new, illegal and untested COVID booster shots, 105 million doses from Pfizer and 66 million doses from Moderna. That is enough to inject into half of the American population.\n\nWill you trust your government and the promises of the pharmaceutical industry, or will you say “no thanks, I would rather trust God and put my life in his hands”?\n\nThe High-Speed, Bivalent COVID Boosters are Here\n\nWatch out. There is nothing good about them, and we should be worried about why they are being used\n\nOn Wednesday, August 31, the FDA issued emergency use authorizations for new Pfizer and Moderna mRNA boostervaccines for COVID. The next day, September 1, the CDC’s advisory committee and CDC Director approved the immediate rollout of the new vaccines. They will be administered in the US starting this week.\n\nSurprisingly, more than a month before either agency had given its okay to the entirely new formulation, the federal government ordered 105 million doses from Pfizer and 66 million doses from Moderna.\n\nThe desired composition of the vaccine had only been formally determined by FDA after its advisory committee had met on June 24, 2022. The vaccines contain a mix of the old, original Wuhan strain vaccine mRNA (now also referred to as the ancestral vaccine) and a new omicron BA.4/5 mRNA coding for the omicron spike protein.\n\nThe total amount of mRNA for the Pfizer and Moderna booster vaccines is the same as before: 30 mcg for Pfizer and 50 mcg for Moderna. Each is composed of 50% omicron mRNA and 50% ancestral mRNA, and they are termed bivalent vaccines. The new vials and their boxes do not list the dose, hinting that the decision regarding how much to use was made very recently. Even the members of the CDC’s advisory committee did not know the dosage of the new bivalent vaccines until their September 1 meeting.\n\nThis is the fastest rollout of a new vaccine in world history. How did it happen? Instead of this being a tale of human grit and ingenuity, it is a tale of human weakness and recklessness. Let me ask again: how did such a rapid vaccine rollout occur?\n\nIt occurred the only way it could possibly occur: by bending the rules, creating a new regulatory playbook and failing to obtain any human data for the new vaccines. The manufacturers did not have to go through months-long trials, and FDA did not have to pore over any human trial data, because there weren’t any. Let that sink in: the new BA.4/5 bivalent vaccines have only been tested in mice, not humans.\n\nHere is an amazing fact: On the same day that the CDC gave its approval to start the vaccine program, September 1, health agencies in Canada, Switzerland and the European Union’s FDA (the European Medicines Association) also rolled out new, bivalent booster shot programs. Almost simultaneously, the UK authorized 2 different bivalent boosters on August 15 and September 3.\n\nThe UK has told people to expect the largest rollout in history for the new bivalent boosters. And it has started the program by promising large bonuses to doctors if they manage to vaccinate every single resident of a nursing home by October 23.\n\nThese other countries are using an earlier omicron mRNA as the template for their omicron-ancestral bivalent vaccines, while the US is using the mRNA code for the later omicron variant BA.4/5 spike.\n\nHow can you get complete information on these boosters?\n\nHow are the mainstream media telling this story? With their usual spin, avoiding the sticky parts. Instead of helping you understand what just happened, the New York Times asks, “When should you get yours?” Not should you get it, just when should you get it. The Herald Tribune tells you why you should get it. STAT News says it answers your questions, but it never asks the relevant questions about why such a rapid, unprecedented rollout occurred–especially when we are at practically historic lows for deaths and ICU stays due to COVID.\n\nThe Associated Press did slightly better, at least posing the question of whether you should get a new booster. But then its answers don’t dig any deeper than its fellow media outlets.\n\nIt looks like you won’t be getting the information you need to understand the boosters and the process by which they were ushered in from the major media. So the Defender has reviewed FDA documents, attended the all day CDC advisory committee meeting on September 1, studied a review of the boosters published in the New England Journal of Medicine on August 31, and evaluated a study of omicron boosters that were tested in non-human primates by Dr. Fauci’s Vaccine Research Center. We will provide you real science.\n\nWhat did FDA say about its Emergency Use Authorization for the new boosters?\n\nFDA did not convene its advisory committee before issuing the authorizations, and it is not hard to guess why. Last year, its advisors voted against authorizing the ancestral boosters, because the data they were given indicated the old vaccines were continuing to work well. Two top officials at FDA who disagreed with the 2021 booster rollout resigned, hinting that the decision to issue boosters had been imposed on the FDA.\n\nThis year, FDA’s VRBPAC (Vaccine and Related Biological Products Advisory Committee) members have been complaining about being given less and less data as they are asked to sign off on vaccine programs for younger and younger ages. VRBPAC member Dr. Paul Offit, a professor of pediatric infectious diseases at the University of Pennsylvania and coinventor of a Rotavirus vaccine said last month that “the fix was in,” implying that the committee’s deliberations were a sham, because the White House announced it was purchasing the vaccine right after the meeting ended.\n\nDr. Offit was quoted last week as saying the mouse data were not sufficient to roll out the new boosters. So FDA chose not to give him and the other members a public venue where they would predictably complain about FDA’s laxity–what some might call recklessness, insubordination or even gross malfeasance. After all, according to the FDA’s mission statement, FDA “is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices.” Not rubberstamping untested vaccines.\n\nThe FDA justified its authorizations using language that was probably intended to confuse the public. Here are several examples.\n\n1. Everyone knows the term “safe and effective,” which is an official FDA stamp of approval for licensed drugs and vaccines. However, by law the term cannot be used by FDA to refer to unlicensed, experimental products, which is what all emergency use authorized drugs and vaccines are. So FDA tried to hint at the desired terminology without using it.\n\nIn its press release on the new boosters, FDA used almost, but not quite identical terminology, quoting Dr. Peter Marks, the director of FDA’s vaccine center: “We have worked closely with the vaccine manufacturers to ensure the development of these updated boosters was done safely and efficiently.”\n\n2. Dr. Marks also said, “The public can be assured that a great deal of care has been taken by the FDA to ensure that these bivalent COVID-19 vaccines meet our rigorous safety, effectiveness and manufacturing quality standards for emergency use authorization.” Again, ‘safe and effective’ is implied but not exactly stated.\n\n3. What Dr. Marks expects the public to miss is the fact that there are no quality standards for emergency use authorizations (EUAs). The statute authorizing EUAs simply requires that the known and expected benefits outweigh the known and expected risks of the product. There are no quality requirements at all, and FDA is not even required to inspect the factories where EUA products are manufactured, as it must do for licensed products. Nor is it required to inspect the final product. So the FDA is fooling us when it claims the standards are rigorous. Furthermore, Dr. Marks and the FDA know that all EUA products have been granted an extremely broad waiver of liability that coversDr. Marks, the FDA, CDC, HHS, the manufacturers, distributors, doctors, pharmacists, and everyone involved in the vaccine program. So they can tell us anything, because the public has no recourse to the courts to bring suit when an EUA product is involved.\n\n4. FDA justifies its assessment that the untested vaccines are safe using the following argument: “The safety data accrued with the bivalent vaccine (original and omicron BA.1) and with the monovalent Moderna COVID-19 Vaccine are relevant to the Moderna COVID-19 Vaccine, Bivalent because these vaccines are manufactured using the same process.”\n\nThis is the same as claiming that almond butter is safe, so peanut butter is safe too because it is manufactured using the same process. Is that really the best excuse for failing to perform its regulatory functions that FDA can offer?\n\nWhat happened at the CDC ACIP (Advisory Committee on Immunization Practices) meeting on September 1?\n\nCDC knew that it would have a hard time convincing the public to take these vaccines, since almost everyone has already had COVID, the earlier vaccine benefits were overpromised, the disease has become milder, the vaccines do not prevent infection or transmission and the fearfulness around COVID is mostly gone. Therefore, CDC needed to employ new strategies.\n\nOne strategy was to invoke the ‘bandwagon effect.’ You try to convince the public that everyone else is getting the shot, so they too should jump on the bandwagon. A poll was presented at the ACIP meeting that claimed that 72% of people that were eligible planned to get the new boosters. How likely is that to be true? Only 33% of the population has already gotten a first booster, while 67% have said, ‘No thanks.’ And the interest in COVID jabs is way down. Under 5% of preschoolers have received a COVID vaccine in the 3 months since they were authorized.\n\nCDC implied to the ACIP that 49% of the public had been boosted, while its own statistics in the NY Times say the actual number is 33%. Here is how CDC performed the calculation to make it appear the boosters are more popular than they are: sixty-seven per cent of the public is ‘fully vaccinated’ according to the CDC. Forty-nine percent of those 67% (those who are fully vaccinated) is 33%.\n\nThe federal government allocated a billion dollars to buy advertising and guarantee positive news coverage (and suppress bad news) to push the earlier COVID vaccines. One wonders how much will be spent to push the new boosters.\n\nCDC says that 224 million Americans are ‘fully vaccinated.’ The ACIP members were told that of this number, 210 million are already eligible for the new boosters. The government has bought 171 million bivalent booster doses so far (105 million from Pfizer and 66 million from Moderna) which can be used for those aged 12 and up.\n\nFDA and CDC have yet to allow the rollout of new bivalent boosters for children under twelve, who have in the past received lower dose COVID vaccines than adults. But the agencies said they plan to do so within weeks.\n\nAnother testy issue for the ACIP committee was the question of how long these boosters will work, and how frequently they will be recommended. The ACIP members are responsible for giving advice on all vaccines, and they don’t want the COVID vaccines to sour the public on other vaccines.\n\nAlthough a recommendation to give the bivalent boosters 4 months after an earlier dose had once been floated, the ACIP committee was asked to approve the boosters when at least 2 months had passed since a prior dose. CDC’s Dr. Twentyman said that CDC is no longer counting the total number of doses. She said that even if a person has received 4 or 5 prior COVID vaccinations, a new bivalent booster “should not be denied,” as long as 2 months have passed since the last dose.\n\nHow long will it work?\n\nAccording to this week’s NEJM article,\n\n“increased neutralizing antibody titers, as well as clinical effectiveness, have been shown to wane by four months after a third messenger RNA immunization. After a fourth messenger RNA immunization, protection against infection with SARS-CoV-2 omicron has been reported to wane after just 4 weeks, although protection against severe disease lasts longer. Hybrid immunity from both vaccination and infection provides greater and more durable protection than either alone.”\n\nFour weeks! Antibody titers sink 4 weeks after the 4th dose. No wonder CDC is allowing, and may encourage, such frequent boosters.\n\nThe COVID vaccinators have coined a new term, hybrid immunity, riffing off hybrid electric cars. It refers to the improved immunity a vaccinated person has if they also got the disease! As if being vaccinated but getting the disease anyway is to be normalized as desirable. After CDC spent two years denying that natural immunity–the kind people get after infection–even exists, CDC is now trying to take a lemon vaccine, add natural immunity, call it hybrid immunity and make lemonade!\n\nHow was this rollout justified?\n\nOmicron variants have been present since last November, and it was soon discovered that both vaccine-induced and natural immunity due to earlier variants were very limited for omicron variants, because they are so different from the ancestral strain. The health agencies and manufacturers have been testing omicron vaccine prototypes for up to 9 months. Most of those tests involved BA.1 and BA.2 omicron strains. However, 90% of current cases are caused by omicron BA.5, which is genetically far from BA.1 and BA.2.\n\nBut there was some human data (involving a few hundred subjects each) for several of the earlier omicron vaccine prototypes, so the health agencies decided to simply pretend that mRNA designed for BA.1 and BA.2 was close enough to BA.5 that the data were comparable.\n\nSince 50% of the vaccine contents would be the old vaccine, FDA claimed it had already established the safety and efficacy of that half. Then, to round things out, there were data from mice, which generated comparable antibody levels to the new vaccines as they had to older vaccines. And of course, we can rely on mice to behave exactly like people, right? After all, they have been ‘humanized’ to contain a human ACE-2 receptor.\n\nNo, we cannot rely on mice. We cannot even rely on nonhuman primates as a model for vaccines, as every species reacts uniquely and unpredictably to infections and to vaccinations. But mice data do bulk up FDA’s authorization ‘package’ so it looks like FDA did a more thorough review.\n\nHaving discussed how long this booster might last, one needs to ask how well it might work\n\nPredictions from Nature magazine and Dr. Fauci’s NIAID Vaccine Research Center (VRC) at the NIH are that the new vaccines will not improve on the old vaccines.\n\nAccording to the VRC, “a study in nonhuman primates showed that an omicron specific messenger RNA vaccine was not better than the original messenger RNA-1273 [ancestral Moderna] vaccine for protection against omicron challenge.”\n\nNature notes, “an analysis [posted August 26] suggests that updated boosters seem to offer much the same protection as an extra dose of the older vaccines — particularly when it comes to keeping people out of hospital.”\n\nNeither of these studies was discussed at the ACIP meeting. No discussion was provided regarding why and how the bivalent vaccines were chosen.\n\nThe reason why the omicron vaccines won’t stimulate a good omicron response is attributed by the NIAID VRC authors to antigenic priming, also known as original antigenic sin. This means that the immune system has been programmed to respond over and over again to the first coronavirus infection or vaccine it encountered, even when it encounters different coronavirus antigens later.\n\nHow well did the old vaccine work? The CDC slide below, presented by CDC’s Dr. Link-Gelles, is not well labeled, but it shows that whether you got two or three doses of the old vaccine, during the omicron period efficacy in all age groups was under 40% at three months. By six months it hovered around zero efficacy (no benefit), and after that it was negative (harmful) for most ages.\n\nNegative efficacy means that the vaccinated are more prone to being infected with COVID than the unvaccinated. This is consistent with what we are seeing from the UK and some other countries: the vaccinated become more likely to get COVID. And it is this effect that the public health agencies are probably trying to stave off, or hide, with perpetual boosters.\n\nIt appears the public here and in many other countries is being misled to receive an untested (or in other countries a BA. 1 or 2 minimally tested) shot on the false promise it will be so much better than the older vaccine. The regulators know it is unlikely to be better, but their public relations engines are revved up to convince us otherwise.\n\nHow safe are the new vaccines?\n\nThat is anybody’s guess, because you cannot assess human safety from animal models, since they don’t predict the human response. What was done to evaluate the safety of the bivalent vaccines?\n\nReactogenicity is a word that refers to short term vaccine adverse reactions, like fever, redness, fatigue or muscle aches. According to the CDC briefers, the degree of reactogenicity from the omicron prototype vaccines was comparable to that from the older, ‘ancestral’ COVID vaccines. There were no data on more serious side effects, and Dr. Shimabukuro of CDC said there was no way to assess the risk of myocarditis due to the small number of subjects who received the prototype vaccines.\n\nHowever, if you look at Pfizer’s chart prepared for the ACIP members below, you will notice that there was greater reactogenicity (more acute side effects) seen after the omicron prototype vaccines than seen after the older vaccines. This may be a signal that more severe reactions will result from the newer vaccines, but there is no way to be sure.\n\nPresenters to the ACIP claimed that myocarditis was less common after booster shots of the old vaccine than after the second dose of the initial series. However, slide 39 shown by Dr. Shimabukuro, which was quickly passed over, showed the opposite. For 16-17 year-old boys and girls, and for men aged 30-39, the chance of myocarditis was increased after a booster. (See below.) So there is no reason to think the boosters will be any safer than the second dose, in terms of myocarditis. That risk, by the way, was about 1 in 2,000 young men aged 18-24 after their second dose in one Kaiser study.\n\nDr. Shimabukuro also said that if you get vaccinated soon after recovering from COVID, increased side effects, at least short-term, are to be expected–but “there is a lack of evidence that it places you at increased risk of myocarditis.” I am not reassured by the lack of evidence. In fact, pediatric cardiologist Dr. Kirk Milhoan last week reviewed all the evidence that Dr. Shimabukuro couldn’t find. Getting vaccinated soon after recovering from COVID is foolhardy, and any officials mandating the shots after recovery are putting those in their charge at even greater risk of adverse reactions, including myocarditis.\n\nSome scientists, including Dr. Dan Barouch in a review in last week’s NEJM, assert that myocarditis is “far more frequent” after a case of COVID than it is after vaccination. But he cited not a single source for this claim.\n\nPediatric cardiologist Kirk Milhoan reviewed all the recent literature on the question of myocarditis rates after infection versus after vaccination. It appears that the vaccine puts you at more risk of myocarditis than a COVID infection does, but there are many different factors that influence risk, including age, gender, whether you already had COVID and how recently, and the type of vaccines received. Moderna vaccines are more likely to cause myocarditis than Pfizer. Receiving a Moderna vaccine after an initial Pfizer vaccine raises the risk even more than getting 2 Moderna vaccines. See Table 2 from an important study of myocarditis in 4 Nordic countries.\n\nFrance, Germany, Sweden, Norway, Finland, Denmark and Iceland have all halted Moderna COVID vaccinations for young males.\n\nAn ACIP member asked whether the Jynneos monkeypox vaccine, which can also induce myocarditis, could be given together with the new bivalent vaccines? Would this increase the myocarditis risk? The surprising response was, “Read the briefing book,” which may have meant that this was not to be discussed in public.\n\nSpeaking of what could be discussed in public, any discussion of pregnancy and COVID vaccination was forbidden at the ACIP meeting. Multiple committee members asked for information on pregnancy, but the briefers steadfastly refused to provide any. Nothing on hospitalizations, deaths, fetal outcomes. The ACIP members were told they would be briefed on this at a future meeting. Dr. Miller, representing Moderna, said they were in the process of enrolling a total of 800 pregnant women in a study. Which would someday be completed. The only conclusion I can draw is that the CDC doesn’t like the results they have now. And they plan to delay providing them to the public for as long as possible.\n\nYet CDC established a pregnancy registry for the COVID vaccines nearly 18 months ago. CDC and FDA must have data on many thousands of pregnancies. Every woman who receives a COVID vaccine dose must provide information on whether she is pregnant before she can be vaccinated, and CDC collects all this information. Furthermore, there are thousands of VAERS reports on adverse pregnancy outcomes.\n\nFDA required Pfizer/BioNTech to study the effect of the vaccine in pregnancy when it issued a license for Comirnaty on August 23, 2021. FDA also required additional vaccine safety studies in children and additional studies of myocarditis at the same time. The problem is that these studies won’t be completed for up to five years, long after billions of doses have been given and the vaccines will be long out of date. It is difficult to justify why FDA would ask for these studies to take so long. Was FDA requesting such long study durations in order to delay its vaccine safety assessment until after the vaccines are no longer in use?\n\nThe only conclusion I can draw is that FDA and CDC don’t like the safety results they already have. And they plan to withhold the bad news for as long as possible.\n\nThe committee was also interested in long COVID. Might the vaccines prevent this dread complication? CDC was mum. The CDC briefer claimed that CDC does not have “systematic data” on long COVID. Nor has CDC developed a case definition for long COVID. Why has CDC delayed investigating this critically important complication?\n\nThe NY Times revealed in February 2022 that CDC conceals the bulk of the public health data it collects. According to the Times, “Much of the withheld information could help state and local health officials better target their efforts to bring the virus under control.”\n\nYou are not going to find a more public indictment from the NY Times of our Centers for Disease Control than that.\n\nDoes vaccination fail to prevent long covid? Does it cause long covid? FLCCC founder and esteemed intensive care physician Dr. Paul Marik has postulated that both long COVID and many COVID vaccine injuries are due to the same thing: the prolonged presence of spike proteins in the circulation. If true, there may be considerable overlap between the symptoms and pathology of long COVID and vaccine injuries, and CDC may be trying to conceal this, or perhaps be seeking a way to claim that all the vaccine injuries are due to COVID.\n\nFDA revoked all Pfizer and Moderna emergency use authorizations for the old boosters on August 31.\n\nThis was sudden and unexpected. Appointments had to be cancelled, because starting on August 31 the old vaccines were limited to use in only young children or for the initial series. The FDA did not withdraw or recall the licensed Comirnaty and Spikevax vaccines, which have also been approved as a booster dose. Is this a tacit acknowledgement that there is no licensed Comirnaty or Spikevax available in the US?\n\nMight the FDA have rolled out the new vaccines so quickly to justify removing most of the old vaccines from use, soon after reports began circulating about their contents containing undisclosed and possibly harmful materials?\n\n1. The FDA and CDC have cooporated to issue emergency use authorizations and rollout new, bivalent Pfizer and Moderna COVID vaccines this week, without any human trials, which is unprecedented.\n\n2. These vaccines continue to enjoy extraordinary protection from liability, while the recipient has no access to the legal system in the case of injury.\n\n3. There is no evidence that the new vaccines are safe, while there is limited evidence that they may be more harmful than earlier COVID vaccines–but in the absence of human testing, there is no way to truly predict their safety. Safety data are being concealed by the federal health agencies. Messaging by them is misleading.\n\n4. There is no evidence the new bivalent vaccines will be more effective than the older vaccines, and existing evidence suggests that any efficacy they provide will persist no longer than 1 to several months.\n\n5. COVID vaccines appear to increase susceptibility to COVID infections, on average starting 6 months after an inoculation.\n\n6. Perpetual boosters briefly stave off the negative efficacy that develops a few months after a COVID vaccination. This may be why frequent boosters are being pushed. But frequent boosters may also weaken overall immunity and may even contribute to rising mortality rates in the US and UK.\n\n7. There is international coordination regarding bivalent boosters, and a major effort will be undertaken to get them into arms, despite historically low levels of severe COVID. Why?", "opengraph": {}, "tags": ["COVID_19", "COVID-19 vaccines"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/en/2021/09/26/vaccines-in-2021-killed-more-than-in-the-past-10-years-alert-to-fda-by-us-virologist/", "https://www.gospanews.net/en/2021/09/26/vaccines-in-2021-killed-more-than-in-the-past-10-years-alert-to-fda-by-us-virologist/", "https://merylnass.substack.com/p/the-high-speed-bivalent-covid-boosters", "https://www.gospanews.net/en/2022/09/13/new-covid-boosters-look-a-lot-like-the-old-ones-doctors-worry-that-could-lead-to-errors/", "https://www.hhs.gov/about/news/2022/07/29/biden-harris-administration-secures-66-million-doses-modernas-variant-specific-covid-19-vaccine-booster-for-potential-use-in-fall-winter-2022.html", "https://www.gospanews.net/en/2022/09/13/new-covid-boosters-look-a-lot-like-the-old-ones-doctors-worry-that-could-lead-to-errors/", "https://merylnass.substack.com/p/if-you-dont-think-there-is-worldwide", "https://www.gov.uk/government/publications/covid-19-vaccines-for-autumn-2022-jcvi-advice-15-august-2022", "https://www.pulsetoday.co.uk/wp-json/cogora_apd_api/init/d0MrW4AdfPDsQ9TyFKubej8G1LgZJIIjiyaxxQYTKgzE6xfjJ4FWhrKhJnSo22bl", "https://www.nytimes.com/2022/08/31/well/covid-booster-shots-variants.html%20When%20should%20you%20get%20yours", "https://www.statnews.com/2022/09/01/your-questions-on-the-new-covid-vaccine-boosters-answered/", "https://apnews.com/article/covid-science-health-90175dd9277dc4bec6b6699c8f14e6f0", "https://www.gospanews.net/en/2021/11/21/documents-show-bill-gates-vaccines-big-pharmas-partner-has-given-319-million-to-media-outlets-earlier-funded-sars-dangerous-tests/", "https://www.gospanews.net/en/2021/11/21/documents-show-bill-gates-vaccines-big-pharmas-partner-has-given-319-million-to-media-outlets-earlier-funded-sars-dangerous-tests/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-moderna-pfizer-biontech-bivalent-covid-19-vaccines-use", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8947944/pdf/main.pdf", "https://www.wsj.com/articles/fda-panel-to-weigh-covid-19-booster-shots-as-health-officials-debate-need-11631871003", "https://www.nytimes.com/2021/08/31/us/politics/fda-vaccine-regulators-booster-shots.html", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.youtube.com/watch?v=PLo2Wwa3NNA", "https://www.fda.gov/about-fda/what-we-do#:~:text=FDA%20Basics-,FDA%20Mission,and%20products%20that%20emit%20radiation.", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-moderna-pfizer-biontech-bivalent-covid-19-vaccines-use", "https://www.gospanews.net/en/2022/08/17/us-cdc-hid-data-on-vaccines-dangerous-spike-protein-persistence-in-body-disrupting-discover-by-virologist-jessica-rose/", "https://www.gospanews.net/en/2022/08/17/us-cdc-hid-data-on-vaccines-dangerous-spike-protein-persistence-in-body-disrupting-discover-by-virologist-jessica-rose/", "https://www.law.cornell.edu/uscode/text/21/360bbb-3", "https://www.gospanews.net/en/2022/09/09/judge-orders-fauci-to-cough-up-emails-after-the-concerns-of-censoring-pandemic-news/", "https://www.nytimes.com/2022/08/18/opinion/covid-vaccination-children-toddlers.html", "https://www.gospanews.net/en/2022/09/09/judge-orders-fauci-to-cough-up-emails-after-the-concerns-of-censoring-pandemic-news/", "https://www.nytimes.com/interactive/2021/us/covid-cases.html", "https://www.theblaze.com/news/review-the-federal-government-paid-media-companies-to-advertise-for-the-vaccines", "https://www.gospanews.net/en/2022/07/13/pfizer-crimes-against-our-children-cardiac-arrest-of-two-month-old-baby-an-hour-after-experimental-vaccine/", "https://www.gospanews.net/en/2022/07/13/pfizer-crimes-against-our-children-cardiac-arrest-of-two-month-old-baby-an-hour-after-experimental-vaccine/", "https://www.gospanews.net/en/2022/09/02/wuhan-gates-54-too-many-secrets-on-manmade-sars-between-chinese-biolab-daszaks-eha-of-ny-funded-by-gates-nih-stops-the-grant/", "https://www.gospanews.net/en/2022/09/02/wuhan-gates-54-too-many-secrets-on-manmade-sars-between-chinese-biolab-daszaks-eha-of-ny-funded-by-gates-nih-stops-the-grant/", "https://www.gospanews.net/en/2022/08/15/wuhan-gates-52-getting-an-hiv-vaccine-may-be-the-real-goal-behind-sars-cov-2-manmade/", "https://www.gospanews.net/en/2022/08/15/wuhan-gates-52-getting-an-hiv-vaccine-may-be-the-real-goal-behind-sars-cov-2-manmade/", "https://www.nature.com/articles/d41586-022-02806-5?error=cookies_not_supported&code=f6ef857c-6d3c-4ca6-91f9-367c7001f955", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8947944/pdf/main.pdf", "https://www.nature.com/articles/d41586-022-02806-5?error=cookies_not_supported&code=f6ef857c-6d3c-4ca6-91f9-367c7001f955", "https://www.gospanews.net/en/2021/08/24/british-medical-journal-contested-fda-for-political-decision-on-full-approval-of-pfizer-vaccine-without-public-discussion-of-data/", "https://www.gospanews.net/en/2021/08/24/british-medical-journal-contested-fda-for-political-decision-on-full-approval-of-pfizer-vaccine-without-public-discussion-of-data/", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-09-01/07-COVID-Swanson-508.pdf", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-09-01/05-COVID-Shimabukuro-508.pdf", "https://pubmed.ncbi.nlm.nih.gov/35404496/", "https://rumble.com/v1i4e7n-myocarditis-in-the-setting-of-sars-cov-2-infections-and-covid-19-vaccinatio.html", "https://www.gospanews.net/en/2022/04/01/664-reports-of-myocarditis-in-5-to-17-year-olds-after-covid-shots-vaers-data-show-in-the-us/", "https://www.gospanews.net/en/2022/04/01/664-reports-of-myocarditis-in-5-to-17-year-olds-after-covid-shots-vaers-data-show-in-the-us/", "https://rumble.com/v1i4e7n-myocarditis-in-the-setting-of-sars-cov-2-infections-and-covid-19-vaccinatio.html", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2791253", "https://jamanetwork.com/journals/jamacardiology/fullarticle/2791253", "https://www.forbes.com/sites/roberthart/2021/11/10/germany-france-restrict-modernas-covid-vaccine-for-under-30s-over-rare-heart-risk-despite-surging-cases/", "https://www.bloomberg.com/news/articles/2021-10-08/iceland-joins-nordic-peers-in-halting-moderna-covid-vaccinations", "https://medicalxpress.com/news/2021-10-iceland-halts-moderna-jabs-heart-inflammation.html", "https://www.gospanews.net/en/2022/02/14/3573-fetal-deaths-in-vaers-following-covid-19-vaccines-1867-increase-over-non-covid-vaccines/", "https://stacks.cdc.gov/view/cdc/110034", "https://www.gospanews.net/en/2022/02/14/3573-fetal-deaths-in-vaers-following-covid-19-vaccines-1867-increase-over-non-covid-vaccines/", "https://www.fda.gov/media/151710/download", "https://www.nytimes.com/2022/02/20/health/covid-cdc-data.html", "https://www.gospanews.net/en/2022/06/04/vaccines-graphene-1-dangerous-mysterious-nanoparticles-inside-mrna-serum-toxicology-not-thoroughly-investigated-pfizer-wrote/", "https://www.gospanews.net/en/2022/06/04/vaccines-graphene-1-dangerous-mysterious-nanoparticles-inside-mrna-serum-toxicology-not-thoroughly-investigated-pfizer-wrote/", "https://www.gospanews.net/en/2022/06/15/fda-risk-benefit-analysis-hides-bad-data-on-moderna-shots-for-kids/", "https://www.gospanews.net/en/2022/06/15/fda-risk-benefit-analysis-hides-bad-data-on-moderna-shots-for-kids/", "https://www.gospanews.net/en/2022/07/29/neurological-long-covid-as-sars-2-bio-weapon-27-millions-infected-without-smell-and-taste-for-months-analysis-therapies-by-bmj/", "https://www.gospanews.net/en/2022/07/29/neurological-long-covid-as-sars-2-bio-weapon-27-millions-infected-without-smell-and-taste-for-months-analysis-therapies-by-bmj/", "https://www.healthline.com/health-news/why-a-4th-covid-19-shot-likely-wont-provide-more-protection", "https://www.statnews.com/2022/08/31/u-s-life-expectancy-drops-sharply-the-second-consecutive-decline/", "https://merylnass.substack.com/p/excess-deaths-are-on-the-rise-but", "https://merylnass.substack.com/p/the-high-speed-bivalent-covid-boosters", "https://healthimpactnews.com/2022/corrupt-fda-and-cdc-ignore-law-and-approve-new-covid-vaccine-boosters-with-zero-testing-on-humans/", "https://www.gospanews.net/en/category/corona-virus/", "https://www.gospanews.net/en/category/wuhan-gates/"], "authors": [""], "publish_date": "September 13, 2022"}