{"result_id": "333046", "URL": "https://www.veteranstoday.com/2023/01/24/covid-vaccines-holocaust-british-mp-launched-the-alarm-and-was-soon-suspended-and-censored-by-tory-nazi-mainstream/", "timestamp": "2023-04-25 17:54:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/01/24/covid-vaccines-holocaust-british-mp-launched-the-alarm-and-was-soon-suspended-and-censored-by-tory-nazi-mainstream/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "“COVID Vaccines HOLOCAUST”. British MP Launched the Alarm and was Soon Suspended and Censored by Tory Nazi-Mainstream | VT Foreign Policy", "cleaned_text": "All the linked articles in Italian version ca be read in English with simultaneous machine translation available\n\n“As one consultant cardiologist said to me, this is the biggest crime against humanity since the holocaust.”\n\nThis sentence was enough for the British Tory MP Andrew Bridge to run into Nazi censorship in the health field as happened to those who tried to defend persecuted Jews during Adolf Hitler’s rule. He was in fact suspended by the party and placed under investigation. Therefore he will be able to continue to exercise his mandate only as an independent politician.\n\nHolocaust is exactly the word that Gospa News has repeatedly used to mention the numbers of reports on anti-Covid vaccines collected by the pharmacovigilance databases in the European Union (EudraVigilance) and in the USA (VAERS).\n\nThe latest count a few weeks ago in EU countries reported 49,000 deaths from suspected side effects and 2 million from serious adverse reactions. In the United States of America, our latest figure for August was 29,000 deaths.\n\nWe are sorry not to provide updates but the complexity of calculating total deaths, in the platform of the European Medicines Agency (EMA), the EU drug regulator, and that of accessing the VAERS database of the CDC (Centers of Diseases Control) make it difficult for us to do so timely.\n\nBut we believe that the total 78,000 deaths reported to the pharmacovigilance bodies so far can already be defined as a holocaust. For two reasons.\n\nThe deniers of the vaccine massacre, defined as a “state homicide” by German magistrates when they are mandatory as happened in Italy for health and school workers, for the armed forces and law enforcement agencies, are scrambling to minimize the alarm.\n\nIn other words, they climb the skyscrapers, as the ones destroyed with explosive devices in another avoidable massacre (WTC, 9-11-2001) which was allowed by the same US military intelligence that supervised the creation of the artificial viruses SARS (from which SARS-Cov-2 was allegedly born in the laboratory in a deal with the EU and China) and participated in the study of messenger RNA gene serums (DARPA agency of the Pentagon with Moderna).\n\nThe alibi of vaccine holocaust deniers is based on a circumstance produced by the governments themselves: reporting does not mean certain correlation. To establish it, autopsies are needed so much by the director of the Institute of Pathology of Heidelberg (Germany) that out of 25 corpses of people who died after the Covid vaccine he ascertained 5, or a fifth equal to 20%, related to heart disorders (of which 4 certain myocarditis).\n\nHere is therefore widely confirmed, also by a French and a Japanese medical study, the alarm for heart inflammation raised by the British parliamentarian.\n\nBut as Gospa News has repeatedly reported, the number of fatal reports after the experimental gene serums is certainly greatly underestimated as not all doctors, the main authors of the reports to the pharmacovigilance databases, send the form when the patient had multiple pathologies which, as in the increasingly alarming case of tumors, they could have been aggravated precisely by the inoculation of the mysterious anti-Covid nanoparticles with the toxic Spike protein capable of remaining even 6 months in the blood and in human organs.\n\nAndrew Bridgen, MP for North West Leicestershire, who has made a number of disputed claims about the safety and efficacy of the vaccines in recent months, including in the House of Commons,1 has had the whip removed by his party over his latest comments on social media.\n\nIn a now deleted tweet linking to an article that questioned the safety of the vaccines, Bridgen had said, “As one consultant cardiologist said to me, this is the biggest crime against humanity since the holocaust.”\n\nThe Conservative chief whip, Simon Hart, said, “Andrew Bridgen has crossed a line, causing great offence in the process. Misinformation about the vaccine causes harm and costs lives. I am therefore removing the whip from Andrew Bridgen with immediate effect, pending a formal investigation.\n\nThe prime minister, Rishi Sunak, also condemned Bridgen’s remarks, describing them as “utterly unacceptable.” The loss of the party whip means that Bridgen will sit as an independent MP while the formal investigation into his conduct is carried out.\n\nSunak probably ignores that the alarm about serious adverse reactions to vaccines has been raised by tens of thousands of Western doctors and has also been confirmed by the data revealed in the USA, after months of concealment, by the Food and Drug Administration and the CDC.\n\nThe FDA’s maxi-active pharmacovigilance study (i.e. with patient follow-up) highlighted an alarming statistic after the BNT162b2 vaccination (Comirnaty by Pfizer-Biontech), due to the frequent cases of pulmonary embolism, acute myocardial infarction, disseminated intravascular coagulation and immune thrombocytopenia.\n\nThe CDC’s analysis of the side effects of mRNA gene serums in relation to those of all other vaccines administered in the USA since 2009 confirmed that there are 5 times more serious reactions: or 73,000 in just two years against 13,000 in 13 years .\n\nCommenting on Bridgen’s suspension, Kent Woods, emeritus professor of therapeutics at the University of Leicester, said that there was “overwhelming evidence” from trials and epidemiological data that “the benefits of covid vaccines for the population as a whole far outweigh potential harms.”\n\nBut we do not know that the British drug agency MHRA (Medicines and Healthcare products Regulatory Agency) has so far responded to the letter sent by 73 British doctors, and relaunched on social media by the South African scientist Michael Levitt, Nobel Prize in Chemistry in 2013, in reference to a disproportionate increase in deaths among vaccinated young males.\n\nInstead Wood added, “Freedom of speech, particularly on such a public platform as the House of Commons, carries a responsibility not to mislead the public by alarmist statements which misrepresent the scientific evidence. The MMR-autism fiasco demonstrated clearly that groundless assertions of vaccine hazards can cause real harm. I am pleased to see that his party is taking action.”\n\nThe Italian oncologist Patrizia Gentilini has a very different opinion, who correlated the boom in new cases of cancer in Italy, an increase of 14 thousand in two years, precisely with the mRNA gene serums.\n\nA risk foreseen by the late French virologist expert in vaccines Luc Montagnier, due to the probable damage to the immune system of mRNA gene serums especially if repeated, reiterated by the Milanese surgeon Andrea Stramezzi in an interview with Gospa News director and even reported in a sentence of the Court of Florence sent to the Public Prosecutor’s Office of Rome to investigate the deaths that occurred after the vaccinations.\n\nIf he doesn’t know these people, Professor Kent Wood should at least know his colleague Angus Dalgleish, professor of Oncology at St. George’s University of London, who confirmed the danger that anti-Covid vaccines could trigger metastases.\n\nWhile other authoritative American doctors have highlighted a flood of risks granted to inoculations such as to induce the Governor of Florida to open a formal investigation into the safety of vaccines.\n\nTheir ineffectiveness, on the other hand, was demonstrated by the deaths from the so-called Covid-breakthrough, i.e. the infections shortly after vaccination. More than 3,000 in Washington State alone.\n\nVery few in the EU and in Italy because they are not registered as “adverse reactions”: in the USA there is also the suspicion that the lethal infection is caused precisely by the toxic Spike carried by the gene serum, however modified and attenuated in the laboratory.\n\nFinally, the numbers of deaths from neurological and neurocerebral syndromes after vaccines are already almost 4 thousand. But well for 88 thousand reports to the Eudravigilance platform, the course is not known. In other words, it is not known whether those who have had these ailments have recovered, are still ill or have gone to increase the statistics of this real vaccine holocaust.", "opengraph": {}, "tags": ["adverse reactions", "mRNA", "COVID-19 vaccines"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/en/2022/11/18/48817-dead-and-5107883-injured-following-covid-19-vaccines-in-european-database-of-adverse-reactions/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://www.gospanews.net/2022/05/12/giudici-tedeschi-vaccini-anti-covid-omicidi-di-stato-draghi-li-dona-al-piano-covax-di-gates-e2-miliardi-di-costi-per-gli-italiani/", "https://www.gospanews.net/en/2021/09/12/9-11-the-avoidable-massacre-allowed-by-cia-helped-al-qaeda-in-balcans-obstructed-fbi-investigations-tribute-to-john-oneill-killed-in-the-towers/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://www.gospanews.net/2022/12/14/autopsie-shock-in-germania-5-morti-su-25-uccisi-da-miocarditi-da-sieri-mrna-dal-bundestag-appello-a-fare-piu-indagini-sui-vaccinati-deceduti/", "https://www.gospanews.net/2022/12/14/autopsie-shock-in-germania-5-morti-su-25-uccisi-da-miocarditi-da-sieri-mrna-dal-bundestag-appello-a-fare-piu-indagini-sui-vaccinati-deceduti/", "https://www.gospanews.net/en/2022/12/07/recent-studies-suggest-covid-19-vaccinated-people-are-infecting-unvaccinated-people-transmitting-graphene-too/", "https://www.gospanews.net/2022/12/23/vaccino-covid-quadruplica-rischi-miocarditi-letali-in-giovani-e-anziani-pauroso-studio-giapponese-ma-governi-criminali-occultano-sos-dei-medici/", "https://www.gospanews.net/en/2023/01/11/covid-boosters-trigger-metastasis-uk-oncologist-and-us-medical-doctor-confirmed-the-montagniers-warning/", "https://www.gospanews.net/en/2022/08/17/us-cdc-hid-data-on-vaccines-dangerous-spike-protein-persistence-in-body-disrupting-discover-by-virologist-jessica-rose/", "https://www.gospanews.net/en/2022/12/31/florida-governor-desantis-investigations-on-adverse-events-of-the-mrna-covid-19-vaccines/", "https://www.bmj.com/content/380/bmj.p81?=&utm_source=adestra&utm_medium=email&utm_campaign=usage&utm_content=daily&utm_term=text#ref-1", "https://www.gospanews.net/en/2022/12/07/recent-studies-suggest-covid-19-vaccinated-people-are-infecting-unvaccinated-people-transmitting-graphene-too/", "https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.gospanews.net/en/2023/01/12/vital-cdc-data-serious-adverse-events-by-mrna-covid-vaccines-5-5-times-higher-than-all-others-in-the-us-since-2009/", "https://www.gospanews.net/en/2023/01/12/vital-cdc-data-serious-adverse-events-by-mrna-covid-vaccines-5-5-times-higher-than-all-others-in-the-us-since-2009/", "https://www.gospanews.net/en/2022/02/03/vaccines-kill-above-all-young-males-chilling-letter-by-73-british-doctors-tweeted-by-nobel-prize-m-lewitt/", "https://www.gospanews.net/en/2022/02/03/vaccines-kill-above-all-young-males-chilling-letter-by-73-british-doctors-tweeted-by-nobel-prize-m-lewitt/", "https://www.gospanews.net/2023/01/07/incubi-vaccini-covid-tumori-pure-sui-quotidiani-famosa-oncologa-rilancia-gli-allarmi-delle-inchieste-di-gospa-news/", "https://www.gospanews.net/en/2022/12/04/serious-injuries-and-deaths-due-to-vaccines-adverse-reactions-italian-judge-urged-rome-prosecutor-to-investigate/", "https://www.gospanews.net/en/2023/01/11/covid-boosters-trigger-metastasis-uk-oncologist-and-us-medical-doctor-confirmed-the-montagniers-warning/", "https://www.gospanews.net/en/2022/12/04/serious-injuries-and-deaths-due-to-vaccines-adverse-reactions-italian-judge-urged-rome-prosecutor-to-investigate/", "https://www.gospanews.net/en/2022/12/22/higher-risk-of-covid-19-infection-among-vaccinated-cleveland-paper-explains-covid-breakthrough-killer-warning-by-cdc-deaths-data-and-israel-study/", "https://www.gospanews.net/en/2022/12/22/higher-risk-of-covid-19-infection-among-vaccinated-cleveland-paper-explains-covid-breakthrough-killer-warning-by-cdc-deaths-data-and-israel-study/", "https://www.gospanews.net/2023/01/15/booster-covid-bivalenti-danneggiano-il-cervello-allarme-fda-cdc-conferma-inchieste-gospa-news-sui-rischi-neurocerebrali/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/corona-virus/", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.bmj.com/content/380/bmj.p81?=&utm_source=adestra&utm_medium=email&utm_campaign=usage&utm_content=daily&utm_term=text", "https://www.gospanews.net/2023/01/15/booster-covid-bivalenti-danneggiano-il-cervello-allarme-fda-cdc-conferma-inchieste-gospa-news-sui-rischi-neurocerebrali/", "https://www.gospanews.net/en/2023/01/11/covid-boosters-trigger-metastasis-uk-oncologist-and-us-medical-doctor-confirmed-the-montagniers-warning/", "https://www.gospanews.net/2023/01/07/incubi-vaccini-covid-tumori-pure-sui-quotidiani-famosa-oncologa-rilancia-gli-allarmi-delle-inchieste-di-gospa-news/", "https://www.gospanews.net/2022/12/23/vaccino-covid-quadruplica-rischi-miocarditi-letali-in-giovani-e-anziani-pauroso-studio-giapponese-ma-governi-criminali-occultano-sos-dei-medici/", "https://www.gospanews.net/en/2021/09/12/9-11-the-avoidable-massacre-allowed-by-cia-helped-al-qaeda-in-balcans-obstructed-fbi-investigations-tribute-to-john-oneill-killed-in-the-towers/", "https://www.gospanews.net/2022/05/12/giudici-tedeschi-vaccini-anti-covid-omicidi-di-stato-draghi-li-dona-al-piano-covax-di-gates-e2-miliardi-di-costi-per-gli-italiani/", "https://www.gospanews.net/en/2022/08/17/us-cdc-hid-data-on-vaccines-dangerous-spike-protein-persistence-in-body-disrupting-discover-by-virologist-jessica-rose/"], "authors": [""], "publish_date": "January 24, 2023"}