{"result_id": "333028", "URL": "https://www.veteranstoday.com/2020/05/25/the-harm-of-the-anti-vaccination-movement/", "timestamp": "2023-04-25 17:54:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2020/05/25/the-harm-of-the-anti-vaccination-movement/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "The Harm of the Anti-Vaccination Movement | VT Foreign Policy", "cleaned_text": "The World Health Organization (WHO) has just listed the anti-vaccination movement as one of the top health threats for 2019. This article addresses the major public health concern regarding misinformation, confusion and outright hoax involving recommended childhood vaccinations and resultant anti-vaccination attitudes of large segments of the general population. Recent studies show an alarming number of adults are not getting the flu shot and not getting their children vaccinated for the measles, a highly contagious and dangerous disease once considered eliminated by Public Health officials.\n\nAs a small child in 1962, I distinctly remember standing in line in the school gym with all the other kids in my neighbourhood to get my polio vaccination. We all got a sugar cube that contained the vaccine. Every kid in the neighborhood was in the same line; not one parent kept their child home.\n\nEven at that young age, I understood what was happening. I remember being happy to be receiving the vaccine, because I knew that polio was a horrible disease that put little children in iron lungs and left them crippled. I knew people in my community who had been afflicted with polio, and I knew that by getting my “sugar cube,” it would prevent me and all the other kids from getting the disease.\n\nThe polio vaccine program was one of the greatest public health success stories in history and the disease has since been virtually wiped out in America. In 2017, the WHO reported only 22 cases worldwide (3). And yet, today there are anti-polio vaccination researchers who deny that the polio vaccine works and claim the success is essentially due to improved hygiene, manipulation of data and under-reporting of cases.\n\nThe anti-vaccination movement and its false beliefs are killing both children and adults. In 2018, 80,000 Americans died from complications of seasonal influenza (5), and yet only 57% of adults have received or planned to receive the flu shot for the 2018-19 season (2). Moreover, some American parents are rejecting the American Pediatric Association (APA) and the Centers for Disease Control (CDC) recommendations for childhood vaccinations.\n\nThe current anti-vaccination movement is most strongly fueled by the publication of a paper in The Lancet by a former doctor and researcher, Andrew Wakefield, which suggested a connection between the measles, mumps, and rubella (MMR) vaccine and development of autism in young children. Even though the study has been discredited and Wakefield has been disgraced over his fraudulent findings, the study had done its damage by striking the fear of a vaccination-autism link in parents. This led to an historic low rate of children receiving the MMR vaccine. The hoax has been called the most damaging medical hoax in 100 years and is credited with bringing about outbreaks of diseases that had otherwise eradicated (4).\n\nWhile overall MMR vaccination rates remain high in the United States, there are some anti-vaccination “hotspots” where vaccination rates are well below the levels needed to protect the population (13). As a result, measles, which once killed tens of thousands every year and had been eliminated due to childhood vaccinations, is once again causing illness (8).\n\nAs of late December 2018, in New Jersey, an ongoing measles outbreak has spread from Ocean County to Passaic County, bringing the number of confirmed cases of this extremely dangerous and contagious disease to 24. According to NJ Department of Health, the first case involved a person who contracted the disease overseas in Israel. In a related incident, eighty Ocean County residents were exposed to the measles at a private event. The NJ Department of Health stated most of the people infected were those that “were not age-appropriately up-to-date with the Measles, Mumps and Rubella (MMR) vaccine (13).\n\nPertussis, also known as whooping cough, was once virtually eliminated due to childhood vaccination programs in the 1940’s, but now is making a major comeback. This is a potentially life-threatening disease for children and especially infants. In 2012, there were over 48,000 cases with over 20 deaths, mostly in infants. According to the CDC, this was the most cases seen in over 50 years (12).\n\nAlthough anti-vaccination rates are not solely to blame for the resurgence of pertussis, regions where the vaccination rate among children is lower than the national average were 2.5 times more likely to see a high number of pertussis cases than other areas (3).\n\nThe pertussis vaccine, unlike other vaccines like those for polio and measles, does not provide lifetime immunity, so researchers expect a slow rise in whooping cough cases, especially among older people who have lost their immunity known as “the end of the honeymoon period.” Researchers today are always working on better and more effective vaccines and currently looking into whether people who have received vaccinations for whooping cough should be getting more frequent booster shots. Children who have not received all five of the recommended doses of DTaP are eight times more likely to get the whooping cough than children who did. The CDC recommends that all children be vaccinated and that parents follow the guidelines for scheduled and maternal vaccinations (12).\n\nThe annual influenza vaccination has perhaps the worst rate of compliance with CDC and APA recommendations. The confusion, mistrust and misinformation among the public led to an historic, record-breaking year for hospitalizations and deaths among children in the U.S. in the 2017-18 season, when fewer than half of Americans got the flu shot (6).\n\nMany people do not think the influenza (“the flu”) is dangerous and do not understand the benefits of the vaccination that they should receive every year. The flu should not be taken lightly and is a huge public health concern. Influenza is very dangerous to adults with pneumonia and other illnesses related to the flu and to small children with immune and other serious medical conditions. The CDC recommends everyone 6 months or older get vaccinated against the flu every year (7). Adults are five times more likely to die from complications of the flu if they do not get vaccinated and the flu shot has been found to prevent deaths by up to 65% for otherwise healthy children (8). Otherwise healthy school age children are a prime target for influenza, and vaccination can prevent the spread to other children, their families and communities. Last year 185 children in the U.S. died from complications of the flu (9). The CDC estimates that 80% of the children who died did not get a flu shot (9). CDC research from previous flu seasons shows that 85% of children who die from the flu each year were not vaccinated (7, 8). The CDC estimated that in the 2016-2017 flu season the flu shot prevented 5.3 million illnesses, 2.4 million medical visits and 85,000 hospitalizations. It is not just young children at risk; in the last flu season 58% of the people hospitalized in the U.S. due to complications from the flu were over 65 years old (7, 8).\n\nIn the digital age, false information can spread rapidly; this has certainly contributed to an increase in anti-vaccination sentiments in the United States and other developed countries. In addition, the near-eradication of many of the diseases prevented by vaccinations has led to a casual attitude toward the seriousness of these diseases. Despite overwhelming medical research and documented scientific evidence, many people still believe in dangerous myths and outright false information about vaccination programs such as the annual flu shot and the MMR vaccine. This is very troublesome and a major public health threat to the rest of us. With the declaration of the WHO naming vaccine hesitancy as a top ten health threat of 2019, perhaps more light will be shed on the misinformation campaigns and more effort will be made by governments and Public Health departments to correct the record.\n\nAcknowledgements: The author would like to thank Chandler Berke for their research assistance.\n• Does polio still exist? Is it curable? (2018, March 14). Retrieved from https://www.who.int/features/qa/07/en/\n• Growing number of U.S. children not vaccinated against any disease. (2018, October 12). Retrieved from https://www.cbsnews.com/news/more-us-children-not-vaccinated-against-any-disease/\n• Helft, L., & Willingham, E. (2014, September 24). Why is Whooping Cough Back? Retrieved from https://www.pbs.org/wgbh/nova/article/whooping-cough/\n• Hussain, Ali, Ahmed, & S, H. (2018, July 03). The Anti-vaccination Movement: A Regression in Modern Medicine. Retrieved from https://www.cureus.com/articles/13250-the-anti-vaccination-movement-a-regression-in-modern-medicine\n• Olive, J. K., Hotez, P. J., Damania, A., & Nolan, M. S. (2018, June 12). The state of the antivaccine movement in the United States: A focused examination of nonmedical exemptions in states and counties. Retrieved from https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1002578\n• Sheldon, C., & NJ Advance Media. (2018, December 21). More Ocean County residents sickened in continuing measles outbreak. Retrieved from https://www.nj.com/news/2018/12/more-ocean-county-residents-sickened-in-continuing-measles-outbreak.html", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://infectioncontrol.tips/author/dmiller/", "https://infectioncontrol.tips/author/duongstyle/", "https://www.cbsnews.com/news/more-us-children-not-vaccinated-against-any-disease/", "https://www.pbs.org/wgbh/nova/article/whooping-cough/", "https://www.cureus.com/articles/13250-the-anti-vaccination-movement-a-regression-in-modern-medicine", "https://www.cdc.gov/flu/weekly/fluviewinteractive.htm", "https://www.cdc.gov/flu/about/burden/2017-2018.htm", "https://www.cdc.gov/measles/about/history.html", "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.1002578", "https://www.cdc.gov/pertussis/surv-reporting.html", "https://www.nj.com/news/2018/12/more-ocean-county-residents-sickened-in-continuing-measles-outbreak.html"], "authors": [""], "publish_date": "May 25, 2020"}