{"result_id": "333044", "URL": "https://www.veteranstoday.com/2022/11/01/inflammatory-nanoparticles-of-mrna-vaccine-change-the-immune-system-in-sons-too-warning-by-a-thomas-jefferson-university-study/", "timestamp": "2023-04-25 17:54:42 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/11/01/inflammatory-nanoparticles-of-mrna-vaccine-change-the-immune-system-in-sons-too-warning-by-a-thomas-jefferson-university-study/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Inflammatory Nanoparticles of mRNA Vaccine Change the Immune System (in Sons too). Warning by a Thomas Jefferson University Study | VT Foreign Policy", "cleaned_text": "LNPs are lipid shells that surround mRNA to evade degradation and detection by our immune system. LNPs are not mRNA; they are merely a covering for the mRNA cargo.\n\nThe mRNA COVID-19 vaccines from Pfizer and Moderna utilise LNPs to introduce mRNA spike protein sequences into human cells. Human cells will produce spike proteins after receiving the mRNA sequences, which will then cause an immunological response.\n\nInitially, it was planned for the LNPs to covertly introduce mRNA sequences that would cause the cells to create spike proteins and therefore develop immunity to the COVID-19 virus.\n\nHowever, numerous researches in mice have now discovered that the LNPs, despite being advertised as harmless and non-toxic, are instead very inflammatory.\n\nThese nanoparticles are extremely long-lasting and can stay in the body for 20 to 30 days. They are likely to stay in the body and continue to stimulate the immune system, which will eventually wear out and become non-responsive.\n\nSimilar conclusions were also reached by the Thomas Jefferson research. By injecting animals with the identical LNPs found in Pfizer’s vaccines—some mice even received two doses—researchers examined how LNPs influence the immune system.\n\nImmune responses and inflammation in mice are not absolute indicators of what will occur in people.Nevertheless, mice have long been used to assess the efficacy and safety of medications intended for human use; symptoms of immunological dysfunction are a hint of potential health hazards in people.\n\nThe researchers discovered that mice given two doses had a weaker immunological response to their second injection than mice given only one dosage.\n\n“The mRNA-LNP (nanoparticle) vaccine platform induces long-term unexpected immunological changes affecting both adaptive immune responses and heterologous protection against infections,” the authors wrote.\n\nMice that received two doses of LNP injections had less innate immune cells, which are the primary immune cells.\n\nBy injecting mice with various LNP variants, the authors hoped to learn how the mRNA-sealing LNPs affected the mice.\n\nThe mice were divided into three groups, each of which received two injections with various substances. Most mice received an injection of LNP as the initial injection. The second half received empty LNPs with no mRNA while the first half received LNPs having mRNA sequences.\n\nAn injection of salty water was given to the leftover mice. Since injections of salted water are not meant to cause any alterations to the body, these mice serve as the baseline to compare.\n\nApproximately two weeks later, all 3 groups received the same LNP injection carrying influenza protein mRNA sequences (HA). The second injection stimulated their cells to produce HA proteins, resulting in an immunological response. It was hoped that the immunological response would render the mice immune to the influenza virus.\n\nAfter the second injection, the researchers discovered that all mice had established immunological defenses against the influenza virus.\n\nThe researchers found that mice who received two doses of LNPs lost less weight and were more resistant to an influenza illness. Oddly enough, the same mice also responded to the flu vaccine with a less potent immunological response and less activation of immune cells.\n\nAccording to the authors’ assumption, their “resistance” likely results from an alternate pathway that LNPs have activated rather than from a boosted immune system. This “resistance” may only be applicable to influenza and is not yet known if it will apply to other illnesses.\n\nThis is due to the study’s discovery that mice who appeared to be more “resistant” to the flu were in fact more prone to fungus infections.\n\nWhen the mice were given two doses of the Candida albicans infection, the mice lost more weight and had less success fighting the illness, indicating a change in the innate immune response. Additional research revealed that these mice had less neutrophils, the most prevalent type of first-responder immune cell.\n\nNeutrophils are responsible for patrolling the body and indiscriminately attacking anything foreign they come across, thus having less of them increases the risk of infection.\n\nThe scientists hypothesized that decreased neutrophil counts may have contributed to the fungal outbreak since an unchecked fungal infection, particularly C. albicans, is frequently a symptom of compromised innate or first responder immune response.\n\nLNPs trigger inflammation, and specific inflammatory pathways limit blood cell formation. The scientists hypothesized that the two dosages of LNPs given to these mice induced increased inflammation, resulting in a decrease in blood cell formation and low neutrophil numbers.\n\nThough this is speculative, and it is unknown if the effects in mice would translate to humans, there have been instancesof vaccinated people developing severe aplastic anemia, a condition in which the body can no longer produce enough blood cells, especially red blood cells.\n\nThere have also been instances of COVID-19 vaccine recipients acquiring rare fungal infections or aggravating pre-existing fungal disorders.\n\nThough major fungal disease does not always indicate a weakened immune system, serious fungal infections “are most common among people with weak immune systems,” according to the Centers for Disease Control and Prevention (CDC).\n\nThere are two types of immune cells: first responders (innate immune cells) and second responders (adaptive immune cells). When they come upon something strange, the first responders launch an immediate assault. However, their attacks are generic and frequently fail to completely remove illnesses.\n\nAs a result, adaptive immune cells, also known as T and B cells, act as our second line of defense. They become active about a week into the infection and clear infections by launching powerful and targeted attacks.\n\nT and B cells must be supplied with pathogen information in order to activate adaptive immune cells. It could be a portion of the spike protein in the case of Sars-Cov-2.\n\nAPCs (antigen-presenting cells), a kind of first-responding cell, deliver virus, bacterium, or infectious particle fragments to adaptive T or B cells. This activates T or B cells, resulting in an adaptive immunological response.\n\nA dendritic cell (APC) activates a T cell by presenting it with an antigen, a harmful or foreign substance.\n\nHowever, the researchers discovered that mice that received two doses of mRNA LNPs displayed less antigen than mice that received just one dose.\n\nThis suggests that less adaptive immune cell activation against influenza proteins was produced.\n\nThe T and B cell responses to the flu mRNA vaccination were shown to be less robust in mice that had received two injections of LNP compared to those who had only received one. T and B cells are essential for our immune system’s capacity to eradicate infections since they are the last line of defense.\n\nHowever, reduced T and B cell activation was observed in mice who received two doses of LNP.\n\nThe quantities of antibodies (B cells produce antibodies) against the influenza protein were likewise lower in the double-dosed groups.\n\nThe decreased adaptive immune response was systemic, impacting all organs and areas. According to the scientists, this reduction was considerably greater at the injection site, particularly if the mice were administered injections at the same location for both shots.\n\nThe group that received only one injection of LNP, on the other hand, exhibited stronger T and B cell responses, as well as more antibodies generated.\n\nThe authors discovered that LNP exposure reduced T progenitor cells. Because T progenitor cells mature into activated T cells, fewer progenitors imply fewer T cells and a lower response.\n\nThe scientists discovered that removing T progenitor cells before immunization and then reintroducing them after vaccination did not diminish the number of activated T cells. This shows that the LNP lowers the amount of T progenitor cells and, as a result, the T cell response.\n\n“Pre-exposure to mRNA-LNP inhibits T cell responses,” the authors wrote. The authors speculated that the lowered immunity ought not to be permanent.\n\nThey discovered that if an 8-week gap was introduced between the first and second dosages, B cell responses mostly rebounded.\n\nNonetheless, the authors did not confirm the time required for complete recovery, nor did they confirm whether the mice’s B cell response ever restored.\n\nHowever, treating mice with adjuvants such aluminum salts or AddaVax reversed the suppressive effects of LNP injections on mice immune cells.\n\n“Inhibition of the adaptive immune responses by pre-exposure to mRNA-LNPs is long-lasting but it is likely to wane with time.”\n\nImmunity Changes from LNPs Can Be Inherited\n\nAs previously stated, mice given two doses of LNPs were more resistant to an influenza infection than mice given only one dosage of LNPs.\n\nThis was confirmed by the mice’s greater weight maintenance throughout infection, albeit it is unclear if the resistance was due to an immunological response or another mechanism initiated by the LNPs.\n\nSurprisingly, this enhanced defensiveness may be handed down to their kids.\n\nThe inheritance of influenza resistance is stronger when both parents are vaccinated, and less so when only one parent is inoculated, especially if only the male father is immunized.\n\nThe study did not address whether the kids also inherit immunological deficiency, such as a loss in immunity against C. albicans, which was observed in mice given two LNPs dosages.\n\nImplication of the Study and Pressing Questions\n\nThe results of the mice study indicate that T and B cell functions temporarily decline in mice, which begs the issue of whether this also happens in people.\n\nClearing infections and preventing chronic illnesses like cancer depend on the adaptive immune response. According to the study, mice are more susceptible to infections and cancer for a few weeks following two vaccines with the mRNA LNPs.\n\nAlthough there has not been a study conclusively proving a correlation, similar findings have also been made regarding human observations.\n\nHowever, an increased prevalence of sickness reported to the Vaccine Adverse Event Reporting System (VAERS) following COVID-19 vaccination implies that patients have less immunity after vaccination.\n\nThere have been numerous cases of cancers developing as a result of COVID-19 vaccines. In the VAERS database, 284 incidences of breast cancer were recorded following COVID-19 immunization, although only 350 cases had been reported in the VAERS database’s whole history.\n\nThere were 269 cases of leukemia reported following COVID-19 vaccination, compared to 432 cases throughout VAERS’s whole history.\n\nFurthermore, there have been instances of new onset and recurring shingles following COVID-19 vaccinations. VAERS data shows that 7,559 incidences of shingles have been reported following COVID-19 vaccination.\n\nThroughout the lifetime of VAERS, 28,180 cases of shingles have been documented following any immunization, implying that COVID-19 vaccination accounted for around a quarter of all shingles cases.\n\nAccording to the CDC, a new diagnosis or recurrence of shingles occurs largely in patients with compromised immune systems and is a symptom of decreased immunity.\n\nThough the mice study shows significant human health consequences, it is unknown whether all of the symptoms and effects reported in mice would occur in humans.\n\nNonetheless, mounting evidence of severe health effects in humans following COVID-19 vaccination warrants additional investigation. It is also necessary to investigate the overlaps between the health consequences for mice and people.\n\n“Considering the broad exposure of a large proportion of human populations to vaccines based on this novel (mRNA) technology, more studies are warranted to fully understand its overall immunological and physiological effects. Determining this platform’s short and long-term impact on human health would help optimize it to decrease its potentially harmful effects,” the authors concluded.\n\nTHOMAS JEFFERSON UNIVERSITY – BIORXIV – Pre-exposure to mRNA-LNP inhibits adaptive immune responses and alters innate immune fitness in an inheritable fashion", "opengraph": {}, "tags": ["Covid Vaccine", "COVID_19", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2022/06/04/vaccines-graphene-1-dangerous-mysterious-nanoparticles-inside-mrna-serum-toxicology-not-thoroughly-investigated-pfizer-wrote/", "https://www.sciencedirect.com/science/article/pii/S2589004221014504", "https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/2022/06/15/vaccini-covid-studio-terrificante-dal-mit-di-cambridge-alterazione-dna-non-vaccinati-a-rischio-contagio-da-spike-tossica-dei-sieri-mrna/", "https://www.gospanews.net/en/2022/03/11/who-confusion-on-peoples-immunity-and-effectiveness-of-covid-vaccines-contradictory-document-by-technical-advisors/", "https://www.gospanews.net/en/2022/03/11/who-confusion-on-peoples-immunity-and-effectiveness-of-covid-vaccines-contradictory-document-by-technical-advisors/", "https://www.gospanews.net/2022/08/28/allarme-di-nature-sui-coaguli-di-sangue-long-covid-ma-ignora-studi-sulle-correlazioni-letali-coi-vaccini/", "https://www.gospanews.net/2022/08/28/allarme-di-nature-sui-coaguli-di-sangue-long-covid-ma-ignora-studi-sulle-correlazioni-letali-coi-vaccini/", "https://www.sciencedirect.com/science/article/pii/S0896841121001906?via%3Dihub", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8233544/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8917097/", "https://www.cdc.gov/fungal/infections/index.html", "https://www.gospanews.net/en/2021/02/14/with-covid-vaccines-risks-of-pulmonarys-serious-damnages-shocking-research-on-nature-journal-ignored-by-scientific-community-big-pharma-and-media/", "https://www.gospanews.net/en/2021/02/14/with-covid-vaccines-risks-of-pulmonarys-serious-damnages-shocking-research-on-nature-journal-ignored-by-scientific-community-big-pharma-and-media/", "https://www.gospanews.net/en/2022/08/17/us-cdc-hid-data-on-vaccines-dangerous-spike-protein-persistence-in-body-disrupting-discover-by-virologist-jessica-rose/", "https://www.gospanews.net/en/2022/07/29/neurological-long-covid-as-sars-2-bio-weapon-27-millions-infected-without-smell-and-taste-for-months-analysis-therapies-by-bmj/", "https://www.gospanews.net/en/2022/07/29/neurological-long-covid-as-sars-2-bio-weapon-27-millions-infected-without-smell-and-taste-for-months-analysis-therapies-by-bmj/", "https://www.gospanews.net/en/2022/01/01/covid-natural-immunity-more-effective-than-vaccines-studies-in-israel-and-the-uk-pro-vax-experts-in-italy-and-the-usa/", "https://www.gospanews.net/en/2022/01/01/covid-natural-immunity-more-effective-than-vaccines-studies-in-israel-and-the-uk-pro-vax-experts-in-italy-and-the-usa/", "https://www.gospanews.net/en/2022/08/07/monkeypox-outbreak-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "https://www.gospanews.net/en/2022/08/07/monkeypox-outbreak-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "https://www.gospanews.net/2022/06/26/i-vaccini-covid-riattivano-la-forma-grave-di-herpes-studio-sulla-rivista-rheumatology/", "https://www.gospanews.net/2022/06/26/i-vaccini-covid-riattivano-la-forma-grave-di-herpes-studio-sulla-rivista-rheumatology/", "https://www.cdc.gov/shingles/hcp/clinical-overview.html", "https://www.gospanews.net/en/2022/08/26/toxic-metallic-compounds-found-in-all-covid-vaccine-samples-analyzed-by-german-scientists/", "https://www.gospanews.net/en/2022/08/26/toxic-metallic-compounds-found-in-all-covid-vaccine-samples-analyzed-by-german-scientists/", "https://www.biorxiv.org/content/10.1101/2022.03.16.484616v2.full", "https://greatgameindia.com/nanoparticles-vaccines-change-immune-system/"], "authors": [""], "publish_date": "November 1, 2022"}