{"result_id": "333011", "URL": "https://www.veteranstoday.com/2023/01/02/shock-warnings-by-physicians-inside-the-florida-governor-desantis-investigation-on-adverse-events-of-the-mrna-covid-19-vaccines/", "timestamp": "2023-04-25 17:53:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/01/06/shock-warnings-by-physicians-inside-the-florida-governor-desantis-investigation-on-adverse-events-of-the-mrna-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Shock Warnings by Physicians inside the Florida Governor DeSantis’ Investigation on Adverse Events of the mRNA Covid-19 Vaccines | VT Foreign Policy", "cleaned_text": "Below the full official statement of 46th governor of Florida Ron DeSantis on the Public Health Integrity Committee. All links to Gospa News investigations have been added aftermath for the multiple correlations with the topics covered.\n\nAll articles in Italian linked are available in English with simultaneous machine translation\n\nToday, Governor Ron DeSantis held a roundtable discussion joined by Surgeon General Dr. Joseph Ladapo and world-renowned physicians, researchers, and public health experts to discuss adverse events of the mRNA COVID-19 vaccines and announce new, aggressive actions to hold the federal government and Big Pharma accountable, including:\n• Establishing the Public Health Integrity Committee. The Committee will be overseen by the Surgeon General to assess federal public health recommendations and guidance to ensure that Florida’s public health policies are tailored for Florida’s communities and priorities.\n• Filing a petition for a Statewide Grand Jury to investigate crimes and wrongdoing committed against Floridians related to the COVID-19 vaccine.\n• Leading further surveillance into sudden deaths of individuals that received the COVID-19 vaccine in Florida, based on autopsy results. The state will collaborate with the University of Florida to compare research with studies done in other countries.\n\nFor more information, click here.\n\nThe Biden Administration and pharmaceutical corporations continue to push widespread distribution of mRNA vaccines on the public, including children as young as 6 months old, through relentless propaganda while ignoring real-life adverse events. At today’s roundtable the Governor and health experts discussed data covering serious adverse events. These risks include coagulation disorders, acute cardiac injuries, Bell’s palsy, encephalitis, appendicitis, and shingles.\n\n“Health care professionals should always communicate the risks of a medical intervention to their patients in a manner that is clinically appropriate and meets standards of ethical practice. President Biden and Big Pharma have completely prevented that from happening – it is wrong,” said Surgeon General Dr. Joseph Ladapo. “With these new actions, we will shed light on the forces that have obscured truthful communication about the COVID-19 vaccines.”\n\nThe Surgeon General will oversee the Public Health Integrity Committee, a committee of expert researchers charged with assessing federal decisions, recommendations, and guidance related to public health and health care. The Surgeon General would then receive input from the committee to ensure public health policies are tailored for Florida’s communities and aligned with state priorities. Members will include:\n\nThe pharmaceutical industry and the FDA have refused to release patient-level data for independent researchers. Meanwhile, the COVID-19 vaccines produced by Pfizer and Moderna have received FDA approval for pediatric and adult patients and continue to be marketed as safe and effective, even though the vaccines do not prevent transmission and adverse events have been minimized and disregarded by the Biden Administration and Big Pharma. In response, Governor DeSantis has filed a petition to impanel a statewide grand jury to investigate crimes and wrongs in Florida related to the COVID-19 vaccines and further recommend enforcement methods.\n\nThe petition can be found here.\n\nLast month, researchers uncovered alarming facts surrounding the COVID-19 vaccine in Germany. Among autopsies performed on 25 people who died unexpectedly within 20 days after COVID-19 vaccination, four indicated deaths due to acute arrhythmogenic cardiac failure. This study concluded that “myocarditis can be a potentially lethal complication following mRNA-based anti-SARS-CoV-2 vaccination.”\n\nTo further investigate this phenomenon in Florida, Dr. Ladapo will conduct research through the University of Florida to assess sudden deaths of individuals in good health who received a COVID-19 vaccine. The Department of Health will also utilize disease surveillance and vital statistics to assess such deaths.\n\n“This has been a tremendously difficult time for everybody, but we are near the tail end of it and it is time to start taking stock of what went wrong and make reforms so this doesn’t happen again,” Dr. Jay Bhattacharya, M.D., Ph.D., Professor of Health Policy, Stanford University Medical School. “I think the centrally important issue that caused the problems is that we silenced qualified people from expressing their thinking, and as a result the decision making at the top of the country was absolutely abysmal. When you have censorship, the kinds of suppression of voices that is essentially a social credit system demeaning people who disagree with the CDC, you’re going to get bad decisions that don’t get checked. I am looking forward to working in coming years to reform American public health so that when there is another pandemic we do a much better job than we did during this one.”\n\n“Our group’s research has revealed that vaccines can affect the risk of non-targeted infections,” said Dr. Christine Benn, M.D., Ph.D., Chair of Health Sciences, Department of Clinical Research, University of Southern Denmark. “The new COVID-19 vaccines have not yet been investigated for their potential effects on the risk of other infections.”\n\n“Our study took a magnifying glass to the original Pfizer and Moderna clinical trials that got the vaccines on the market in late 2020. In the original trials, mRNA vaccines increased serious adverse events at a rate considerably higher than initially realized,” said Dr. Joseph Fraiman, M.D., Emergency Medicine Physician, Thibodaux Regional Medical Center. “Our peer-reviewed study which was published this August in one of the field’s leading journals — indicates that the mRNA COVID vaccines should be urgently re-evaluated. I believe unless further studies can clearly demonstrate a favorable harm benefit profile, mRNA vaccine use should not be recommended in healthy adults and children. Independent of what our Federal agencies recommend it is their ethical duty to inform the public of these results to allow for informed consent from those who chose to take COVID vaccines.”\n\n“It it clear we urgently need updated and fully transparent vaccines risk-benefit analyses for all age groups for physicians to make informed recommendations and patients to make informed decisions,” said Dr. Tracey Høeg , M.D., Ph.D., Physician Epidemiologist and Clinical Researcher at Department of Epidemiology & Biostatistics, University of California San Francisco, Acumen, LLC. “Blanket mandates or requirements for COVID-19 vaccines are both unscientific and unethical given the vaccines’ ineffectiveness at providing lasting protection from infection or transmission and the uncertainty surrounding the current vaccines’ benefits and risks.”\n\n“It is always important to balance benefits and risks. For older high-risk people who have not vet had Covid, vaccine benefits outweigh potential risks for an adverse reaction,” said Dr. Martin Kulldorf, Ph.D., Scientific Director, Brownstone Institute; Fellow, Hillsdale College’s Academy for Science & Freedom. “For children, young adults and those who have had COVID, the risk of dying from COVID is miniscule, so even a small risk of a serious vaccine adverse reaction, such as myocarditis, will tip the balance against the vaccine.”\n\n“There has been a tremendous loss of trust in public health and I think you can see that in decreased uptake of vaccines that have been traditionally used,” Steve Templeton, Ph.D., Associate Professor of Microbiology and Immunology, Indiana University School of Medicine-Terre Haute. “This isn’t just anti-vaxx people; this is people who have really lost trust in the system, and I think you have to restore that trust to get people to believe in the efficacy of vaccines that have been used for decades without problem and have been very effective.”\n\n“The decision making surrounding covid amounts to the largest blunder in human history,” Bret Weinstein, Ph.D., Former Professor of Evolutionary Biology, Evergreen State College. “The censorship is creating a phony sense that there is agreement amongst all of the responsible doctors about what to do and the few doctors who say otherwise are fringe cranks. And this couldn’t be farther from the truth. The message that was given to us from public health authorities was not just inept. It actually went well beyond that. It was really the inverse of everything we should have done. Because it was forced on us with this strong form of coercion, it was widely accepted because people didn’t have a choice. Because the vaccine was so targeted, we effectively drove this pathogen to diversify.”\n\n“It’s a terrible crime that this vaccine has been pushed in the media as long as it has been and has prevented any news of horrible side effects in the main stream media from being communicated,” said Steven Ordonia, victim of adverse events from mRNA vaccines. “This vaccine has nearly ruined my life and severely altered it.”\n\n“Before my vaccine I was active, I worked out and ran Spartan races,” said Michelle Utter,Healthcare Professional and victim of adverse events from mRNA vaccines. “Working in healthcare during the pandemic, we were sent emails telling us the importance of the vaccine and that they were safe and effective. After my first vaccine, an hour later I was experiencing flu like symptoms. Before I got my next shot, I asked if I should get it because I was afraid of having a reaction…I had the pharmacist and other employees coming over to reassure me that I wouldn’t have the same reaction again. Against my gut I took it…45 minutes later I was in the parking lot sick in my car, my hips hurt so bad I couldn’t move, and I had inflammation everywhere. Working in health care you would think that you would get the best care and the best resources available to you but I was ignored, gaslit and abandoned.”\n\nGovernor Ron DeSantis Petitions Florida Supreme Court for Statewide Grand Jury on COVID-19 Vaccines and Announces Creation of the Public Health Integrity Committee\n\nOn December 13, 2022, in News Releases, by Staff", "opengraph": {}, "tags": ["Pfizer COVID-19 vaccine", "adverse reactions", "Covid Vaccine", "DeSantis", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2022/11/20/the-covid-jabs-mechanisms-of-injury-sudden-death-blood-cloths-autoimmune-and-human-mad-cow-disease/", "https://www.gospanews.net/en/2022/11/20/the-covid-jabs-mechanisms-of-injury-sudden-death-blood-cloths-autoimmune-and-human-mad-cow-disease/", "https://www.flgov.com/wp-content/uploads/2022/12/PHIC-One-Pager.pdf", "https://www.gospanews.net/en/2022/12/09/very-dangerous-covid-boosters-authorized-by-fda-for-babies-as-6-months-despite-a-disturbing-study-on-bivalents/", "https://www.gospanews.net/en/2022/12/09/very-dangerous-covid-boosters-authorized-by-fda-for-babies-as-6-months-despite-a-disturbing-study-on-bivalents/", "https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.sciencedirect.com/science/article/pii/S0264410X22010283", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8427535/pdf/NEJMoa2110475.pdf", "https://www.gospanews.net/2022/12/07/esclusivo-epidemia-di-herpes-dopo-i-vaccini-covid-27mila-casi-nellue-31-morti-da-zoster-lo-studio-per-danni-al-sistema-immunitario/", "https://www.gospanews.net/2022/12/07/esclusivo-epidemia-di-herpes-dopo-i-vaccini-covid-27mila-casi-nellue-31-morti-da-zoster-lo-studio-per-danni-al-sistema-immunitario/", "https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.gospanews.net/en/2022/12/07/recent-studies-suggest-covid-19-vaccinated-people-are-infecting-unvaccinated-people-transmitting-graphene-too/", "https://www.flgov.com/wp-content/uploads/2022/12/Vaccine-Grand-Jury-Petition.pdf", "https://www.gospanews.net/en/2022/12/07/recent-studies-suggest-covid-19-vaccinated-people-are-infecting-unvaccinated-people-transmitting-graphene-too/", "https://link.springer.com/article/10.1007/s00392-022-02129-5?error=cookies_not_supported&code=d9370847-3702-42fa-8751-00f5234163f7", "https://www.gospanews.net/2022/12/14/autopsie-shock-in-germania-5-morti-su-25-uccisi-da-miocarditi-da-sieri-mrna-dal-bundestag-appello-a-fare-piu-indagini-sui-vaccinati-deceduti/", "https://www.gospanews.net/2022/12/14/autopsie-shock-in-germania-5-morti-su-25-uccisi-da-miocarditi-da-sieri-mrna-dal-bundestag-appello-a-fare-piu-indagini-sui-vaccinati-deceduti/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2022/12/22/higher-risk-of-covid-19-infection-among-vaccinated-cleveland-paper-explains-covid-breakthrough-killer-warning-by-cdc-deaths-data-and-israel-study/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2022/12/22/higher-risk-of-covid-19-infection-among-vaccinated-cleveland-paper-explains-covid-breakthrough-killer-warning-by-cdc-deaths-data-and-israel-study/", "https://www.gospanews.net/2022/12/23/vaccino-covid-quadruplica-rischi-miocarditi-letali-in-giovani-e-anziani-pauroso-studio-giapponese-ma-governi-criminali-occultano-sos-dei-medici/", "https://www.gospanews.net/2022/12/23/vaccino-covid-quadruplica-rischi-miocarditi-letali-in-giovani-e-anziani-pauroso-studio-giapponese-ma-governi-criminali-occultano-sos-dei-medici/", "https://www.gospanews.net/en/2022/12/20/us-mothers-tragedy-so-my-newborn-alexander-died-days-after-receiving-unauthorized-vaxxed-blood-in-a-transfusion/", "https://www.gospanews.net/en/2022/12/20/us-mothers-tragedy-so-my-newborn-alexander-died-days-after-receiving-unauthorized-vaxxed-blood-in-a-transfusion/", "https://www.flgov.com/2022/12/13/governor-ron-desantis-petitions-florida-supreme-court-for-statewide-grand-jury-on-covid-19-vaccines-and-announces-creation-of-the-public-health-integrity-committee/", "https://www.flgov.com/category/news-releases/", "https://www.gospanews.net/en/2022/12/29/wuhan-gates-61-the-huge-nwo-plot-to-control-brains-sars-cov-2-by-fauci-graphene-by-darpa-obama-vaccines-by-gates-biden-eu/"], "authors": [""], "publish_date": "January 6, 2023"}