{"result_id": "333014", "URL": "https://www.veteranstoday.com/2023/01/11/breaking-pentagon-rescinds-covid-vaccine-mandate-for-all-us-troops/", "timestamp": "2023-04-25 17:54:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/01/11/breaking-pentagon-rescinds-covid-vaccine-mandate-for-all-us-troops/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Breaking! Pentagon Rescinds COVID-Vaccine Mandate for All US Troops | VT Foreign Policy", "cleaned_text": "A few days after the disturbing pharmacovigilance data released by the American drug regulator (Food and Drug Administration) on the serious adverse reactions triggered by Covid-19 mRNA gene serums, an expected but historic decision from the US State Department arrives.\n\nby Bradley Peniston – Originally published by Defense One\n\nAll the links to Gospa News investigations have been added aftermath for the multiple correlations with the topics covered.\n\nU.S. troops are no longer required to get vaccinated against the COVID-19 virus. On Tuesday, Defense Secretary Lloyd Austin issued a memo rescinding the pair of 2021 memos that required active-duty and reservists to get vaccinated.\n\n“The Department will continue to promote and encourage COVID-19 vaccination for all Service members,” Austin wrote.\n\n“The Department has made COVID-19 vaccination as easy and convenient as possible, resulting in vaccines administered to over two million Service members and 96 percent of the Force—Active and Reserve—being fully vaccinated. Vaccination enhances operational readiness and protects the Force.”\n\nAustin added that no current troops “shall be separated solely on the basis of their refusal to receive the COVID-19 vaccination if they sought an accommodation on religious, administrative, or medical grounds.”\n\nThe services “will update the records of such individuals to remove any adverse actions solely associated with denials of such requests, including letters of reprimand.”\n\nAs well, Austin wrote, “Service members administratively discharged on the sole basis that the Service member failed to obey a lawful order to receive a vaccine for COVID-19, the Department is precluded by law from awarding any characterization less than a general (under honorable conditions) discharge. Former Service members may petition their Military Department’s Discharge Review Boards and Boards for Correction of Military or Naval Records to individually request a correction to their personnel records, including records regarding the characterization of their discharge.”\n\nAustin also wrote that other standing departmental policies, procedures, and processes regarding immunizations remain in effect.", "opengraph": {}, "tags": ["Military", "Pentagon"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.gospanews.net/en/2021/10/13/no-one-should-be-forced-to-receive-a-covid-19-vaccine-archbishop-for-the-us-military-services-stated-against-vaticans-hard-route/", "https://media.defense.gov/2023/Jan/10/2003143118/-1/-1/1/SECRETARY-OF-DEFENSE-MEMO-ON-RESCISSION-OF-CORONAVIRUS-DISEASE-2019-VACCINATION-REQUIREMENTS-FOR-MEMBERS-OF-THE-ARMED-FORCES.PDF", "https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.gospanews.net/en/2022/12/20/pfizer-mrna-vaccine-risks-of-pulmonary-embolism-myocarditis-blood-clots-immune-thrombosis-finally-released-the-fda-surveillance-data/", "https://www.gospanews.net/en/2022/01/04/us-judge-rules-in-favor-of-navy-seals-refusing-vaccination-on-religious-grounds/", "https://www.gospanews.net/en/2021/10/13/no-one-should-be-forced-to-receive-a-covid-19-vaccine-archbishop-for-the-us-military-services-stated-against-vaticans-hard-route/", "https://www.gospanews.net/en/2022/01/04/us-judge-rules-in-favor-of-navy-seals-refusing-vaccination-on-religious-grounds/"], "authors": [""], "publish_date": "January 11, 2023"}