{"result_id": "333041", "URL": "https://www.veteranstoday.com/2022/12/11/top-oncologist-cancer-in-patients-exploding-after-covid-shots/", "timestamp": "2023-04-25 17:54:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/12/11/top-oncologist-cancer-in-patients-exploding-after-covid-shots/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Top Oncologist: Cancer in Patients Exploding After COVID Shots | VT Foreign Policy", "cleaned_text": "The well-established link between the COVID-19 mRNA shots and blood clots, myocarditis, heart attacks and strokes is reason enough to stop the vaccine program, argues a London oncologist.\n\nAnd further, the average age of death from COVID-19 in the United Kingdom is 82, which is higher than the age for all other causes, 81.\n\nBut there is another reason enough to halt the shots, wrote Dr. Angus Dalgleish, professor of Oncology at St. George’s University of London, in a letter to the British Medical Journal.\n\n“As a practising oncologist I am seeing people with stable disease rapidly progress after being forced to have a booster, usually so they can travel,” he wrote to the BMJ’s editor in chief, Dr. Kamran Abbasi.\n\n“Even within my own personal contacts I am seeing B cell-based disease after the boosters,” he wrote. “They describe being distinctly unwell a few days to weeks after the booster – one developing leukaemia, two work colleagues Non-Hodgkin’s lymphoma, and an old friend who has felt like he has had Long Covid since receiving his booster and who, after getting severe bone pain, has been diagnosed as having multiple metastases from a rare B cell disorder.”\n\nDalgleish said he has enough experience in the field “to know that these are not the coincidental anecdotes that many suggest, especially as the same pattern is being seen in Germany, Australia and the USA.”\n\nHe said his observations fit the pattern observed around the world of innate immune suppression for several weeks after mRNA vaccination.\n\n“All these patients to date have melanoma or B cell based cancers, which are very susceptible to immune control – and that is before the reports of suppressor gene suppression by mRNA in laboratory experiments.”\n\n“This must be aired and debated immediately.”\n\nA recent study found a sharp rise in cancer in people under 50.\n\nResearchers at Brigham and Women’s Hospital cited increases worldwide in cancer of the breast, colon, esophagus, kidney, liver and pancreas.\n\nOne of the nation’s most prolific pathologists, Dr. Ryan Cole, has reported a significant rise in cancer cases in his Boise, Idaho, lab.\n\nHe has received data from oncologists indicating the mRNA vaccines disrupt the immune system. He said in an interview that physicians report “seeing the weirdest cancers, and cancers that we have been able to keep in check and treat, taking off like wildfire – going stage 2, stage 3, stage 4, just like that.”\n\nMeanwhile, a professor at MIT has coauthored a paper that found a 25% increase in heart attack emergency calls among young Israelis after the country’s mRNA vaccine rollout.", "opengraph": {}, "tags": ["Corona Virus", "vaccine", "Diseases"], "tweets": [], "movies": [], "links": ["https://dailysceptic.org/2022/11/26/as-an-oncologist-i-am-seeing-people-with-stable-cancer-rapidly-progress-after-being-forced-to-have-a-booster/", "https://news.harvard.edu/gazette/story/2022/09/researchers-report-dramatic-rise-in-early-onset-cancers/", "https://www.nature.com/articles/s41598-022-10928-z?ref=tjournal.ru&error=cookies_not_supported&code=9d4d04e1-10e0-450c-b4f2-e450efc00b64"], "authors": [""], "publish_date": "December 11, 2022"}