{"result_id": "333029", "URL": "https://www.veteranstoday.com/2023/03/18/manmade-sars-cov-2-for-golden-vaccines-metabiota-cia-biden-gates-rockefeller-intrigued-in-ukraine-china-and-italy/", "timestamp": "2023-04-25 17:54:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/03/18/manmade-sars-cov-2-for-golden-vaccines-metabiota-cia-biden-gates-rockefeller-intrigued-in-ukraine-china-and-italy/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Manmade SARS-Cov-2 for Golden VACCINES: Metabiota, CIA, Biden, Gates, Rockefeller Intrigued in Ukraine, China and Italy | VT Foreign Policy", "cleaned_text": "5 – METABIOTA FROM THE CIA TO UKRAINE WITH BIDEN JR\n\n6 – A CHINESE SCIENTIST IN THE INTRIGUE BETWEEN WUHAN AND ROCKEFELLER\n\n7 – CHINESE CDC DIRECTOR AND ENHANCED VIRUS EXPERIMENTS IN THE EU\n\nOn the cover image Joe Biden beside his son Hunter alongside the intrigues of entity tied with Bill Gates\n\nAll Italian articles linked in this inquiry can be read in English with machine translation available\n\nThe mystery that hovers around Villa Serbelloni, previously also known as Castello di Bellagio (Como, Lombardy) begins with the death of the American Ella Walker, widowed princess Della Torre e Tasso, which occurred on June 20, 1959, only a week after the signing of the documents for the donation of the ancient manor to the Rockefeller Foundation…\n\nThe estate has become famous for its historical memories and its vast park, extended on the steep promontory that separates the two branches of Lake Como, where, according to tradition, Pliny the Younger owned a villa called Tragoedia. The original layout of the villa dates back to the 1400s and was built at the behest of Marchesino Stanga, feudal lord of the place.\n\nIn 1788 it passed to Count Alessandro Serbelloni, a member of one of the noblest and richest Lombard families, who devoted himself body and soul to it, concentrating above all on the creation of the immense external park, where he had carriageways, avenues and paths built for a total length of about 18 km. Upon the count’s death, the villa changed hands and, at the end of the 19th century, was transformed into a hotel after the purchase by the billionaire Walker in 1932.\n\nFor decades, Villa Serbelloni has become the center of exclusive conferences hosted by the Rockefeller Foundation. But also a harbinger of misfortunes given that US President John Fitzgerald Kennedy also passed through it 4 months before his assassination, which took place on November 23, 1963 in Dallas.\n\nIn this spectacular naturalistic and architectural context, was launched the conspiracy of the New World Order which, starting from the project on golden vaccines, ended with the SARS-Cov-2 created in the laboratory which made them necessary.\n\nIn two different moments, in March 1999 and in August 2016, in fact, the main protagonists of the Covid-19 pandemic met to concoct a global immunization plan, which quickly became functional to a health and social dictatorship that therecent G20 Bali put it in writing.\n\n1 – FROM GAVI ALLIANCE TO THE GLOBAL VIROME PROJECT\n\nIt started with the presentation of the GAVI Alliance funded by the Bill & Melinda Gates Foundation in 1999.\n\n«Resolution WHA44.4 requests the Director-General inter alia to keep the Executive Board informed of progress relating to the Children’s Vaccine Initiative. The Children’s Vaccine Initiative was established by a group of cosponsors including WHO, UNICEF, the World Bank, UNDP and the Rockefeller Foundation after the World Summit for Children (NewYork, 1990). The Initiative was an international, collective effort, designed to harness new scientific developments in order to increase protection from infectious diseases and to simplify vaccine delivery» wrote the WHO in a document dated January 25, 2000, following the meeting on Lake Como.\n\n«The Global Alliance for Vaccines and Immunization (GAVI) has been established after a series of meetings (World Bank, Washington, March 1998; Bellagio, Italy, March 1999; Seattle, United States of America, July 1999) and a one-year, in-depth review of immunization-related activities undertaken by major interested partners» including primarily The Rockefeller Foundation and the Bill & Melinda Gates Foundation.\n\n«It is expected that the Alliance will be publicly launched at the same time as the Global Fund for Children’s Vaccines at the end of January 2000, possibly during the World Economic Forum» reads the WHO document which already evokes the future commitment of the WEF by Klaus Schwab, theorist of the Great Reset but also financier of Event 201 in New York, alongside the Melinda and Bill Gates Foundation, which simulated an exercise for a coronavirus pandemic a few weeks after the its real outbreak.\n\nBut before arriving at the 2020 emergency, in the same manor of Bellagio, between 8 and 11 August 2016, a forum of the Global Virome Project (GVP) was held in which some of the main entities suspected of having had a significant role in the construction of the laboratory coronavirus that has induced Western governments to indulge in the strategies of the Big Pharma vaccines in one of the most serious mystifications and financial speculations in the history of humanity.\n\nGuests of the Rockefeller Foundation included representatives of the WHO, of the government agency USAID, believed to be a financial instrument of the Central Intelligence Agency (the US counterintelligence CIA), of the Chinese CDC and of METABIOTA, a biochemical research company that ended up in the eye of the storm for the bacteriological laboratories of the Pentagon in Ukraine with the complicity of Biden junior, but also partners of the CIA itself and of the PREDICT project that the Obama-Biden administration developed in the Wuhan Institute of Virology.\n\nHowever, the EcoHealthAlliance of zoologist Paul Daszak could not be missing, even crucified by the medical journal The Lancet for having tried to sidetrack scientific investigations into the artificial origin of SARS-Cov-2 after receiving funding from the Bill & Melinda Gates Foundation and the NIAID (the National Institute of Infectious Diseases directed by Anthony Fauci), due to he was also present at the Global Virome Project meeting.\n\nFinally, took part in te event a representative from Columbia University and the National Institute of Health, both involved in the Predict project on coronaviruses.\n\n«The Global Virome Project (GVP) was conceived in response to repeated and unpredictable emergence and re-emergence of high impact viral epidemics and pandemics compromising global health security and well-being of the peoples of the world» we can read in the official website.\n\n«Between 8 and 11 August 2016, representatives from across the globe – high level policy and decision makers, thought leaders, subject matter experts, researchers, and representatives from international organizations (including those involved with human, animal, and environmental health), academia, donors, foundations, and the private sector – gathered at the Rockefeller Foundation’s Bellagio Conference Center to develop a vision on the importance and feasibility of the GVP in building a world safe from the threat of emerging viral diseases» Bellagio Initiative on the Global Virome Project (GVP) adds.\n\n«The Global Virome Project (GVP) Bellagio forum attendees (see list below) support the development of a global alliance to carry forward the GVP, an international effort to identify and characterize, within a decade, 99% of all zoonotic viruses with epidemic/pandemic potential in order to better predict, prevent, and respond to future viral pandemic threats and to protect us all from their worst consequences».\n\n2 – THE DANGEROUS EXPERIMENTS FOR SARS-COV-2 MANMADE IN LABORATORY\n\nJudging by the 6,782,460 deaths attributed to Covid-19 by the WHO worldwide (update on February, 13, 2023) and by the massacre due to adverse reactions to anti-Covid vaccines quantified in over 76,000 reports with a fatal outcome from pharmacovigilance platforms (just in the European Union and in the US), not only they don’t seem to have managed to protect everyone.\n\nBut the macroscopic conflicts of interest between some of the scientists in the very dangerous experiments of construction of enhanced viruses, with Dual Use purposes, i.e. vaccine but also military bacteriological weapon, lead us to consider that very summit extremely suspicious.\n\nLet us immediately make some fundamental reminders to explain the importance of this symposium at that precise moment.\n\n«In short, the U.S. Department of Health and Human Services was involved in the funding of amplifying the infectious nature of coronavirus between 1999 and 2002 before SARS was ever detected in humans» demonstrated the American doctor David Martin showing the patents related to the research in his The Fauci Dossier,indirectly confirmed by the discoveries of some burning emails from the NIAID director.\n\n«By October 2013, the Wuhan Institute of Virology 1 coronavirus S1 spike protein was described in NIAID’s funded work in China. This work involved NIAID, USAID, and Peter Daszak, the head of EcoHealth Alliance.This work, funded under R01AI079231, was pivotal in isolating and manipulating viral fragments selected from sites across China which contained high risk for severe human response» remembered Martin.\n\nIn 2016 the National Institute of Health, the Scripps Institute and Dartmouth College filed the patent application WO 2018081318A1 “Prefusion Coronavirus Spike Proteins and their Use” which reveals mRNA technology that overlaps (and is used in tandem with) the Moderna technology.\n\nWe will go into the merits of Pfizer and Moderna’s pharmaceutical patents and Fauci’s earnings in conflict of interest with his role in the next WuhanGates reports.\n\nThe United States Department of Defense (DOD) then awarded a contract on November 12, 2019 to Labyrinth Global Health INC. for “COVID-19 research”, at least one month before the alleged appearance of the new coronavirus andthree months before it was officially dubbed Covid-19.\n\nThe contract awarded in November 2019 for “COVID-19 Research” not only involved the research taking place in Ukraine, but was part of a much larger contract for a “Biothreat Reduction Program in Ukraine”.\n\nPart of the funding went to “Black & Veatch Special Projects Corp”, a partner of METABIOTA which instead in October 2016 had already held a Trilateral meeting on bacteriological safety with the government representatives of Ukraine, Poland and the United States of America in Lviv, in the city where the Pentagon (US Department of Defense) had financed the opening of two biological laboratories in 2012 by the will of the then undersecretary Leon Panetta, former director of the CIA.\n\nIn light of this extreme synthesis, it may come as a surprise that in 2018 METABIOTA itself, financed by the financial company Seneca Rosemont owned by Hunter Biden, son of US President Joseph, and of the young partner linked to John Kerry, former Secretary of State in the Obama administration , predicted a pandemic from SARS as did Bill Gates and lawyer Avril Haines, former deputy director of the CIA under Obama and then head of all US intelligence under Biden?\n\nWe will return in the next investigations to the broad topic of intrigues between Metabiota, Ukraine, Biden jr and China. Now let’s see the financial scenario.\n\nFor now it is enough to remember that Metabiota not only predicted the event but was among the first global security consultants to promote the project that the Swiss Re insurance multinational developed the Pandemic Emergency Financing Facility (PEF) with the World Bank, an innovative initiative that it will use both reinsurance and capital markets tools to help mobilize funds during an epidemic.\n\nThis “insurance fund” to prevent damage from “business interruption (BI) policies” was launched by Swiss Re in May 2016, a few months before the Villa Serbelloni summit…\n\n«This year marks 100 years since once of the most deadly ever outbreaks first reared its head: the 1918 Influenza Pandemic. Also known as the Spanish Flu outbreak of 1918 – a name that is in fact something of a misnomer – the pandemic infected as many as 500 million people around the world at a time when the global population was approximately 1.8 billion» Metabiota wrote in a “prophetic” article published on July 31, 2018 as he continued to work with Ukraine’s bacteriological laboratories on viruses that, according to Russian experts, were boosted by the Pentagon to favor the American Big Pharma vaccine business.\n\n«With today’s medical advancements and 24 hour media coverage, would a similar pandemic even be possible? And what does this mean for the re/insurance industry? Unfortunately, there remains the significant possibility that a highly virulent illness could break out, and the re/insurance industry would indeed be impacted».\n\n«As Jen Bruursema, vice president of marketing and sales at Metabiota, explained, the life insurance industry has obvious exposures to worry about in the event of a pandemic, but the property and casualty industry can also be hit through the aforementioned BI protection. Metabiota is now working with Marsh to develop a platform that will help corporates get a better understanding of the threat posed to their businesses from pandemic» is highlighted in the article.\n\n«While Metabiota is working with Marsh to develop this new pandemic BI market, last year saw Swiss Re’s dedicated insurance linked securities arm team up with the World Bank to create the world’s first ever catastrophe bonds to combat such outbreaks. The World Bank sponsored catastrophe bonds support the Pandemic Emergency Financing Facility (PEF). This facility provides first-response surge funding to developing countries facing the risk of a pandemic outbreak».\n\nThus, the elite of world finance was amply prepared to absorb the shock wave of a pandemic and the consequent strategy of the Great Reset, aimed at allowing the global economic monopoly to the companies of the Big Economy which, in the meantime, had already started partnership with the Big Pharma of anti-Covid vaccines such as Pfizer: among them the New York bank Goldman Sachs, Coca-Cola, the World Economic Forum and the London pharmaceutical giant GSK (controlled by Gates).\n\nWith the Covid-19 pandemic, declared with extreme promptness by the director of the WHO, Tedros Adhanom Gebreyesus, political leader of an Ethiopian paramilitary terrorist movement promoted in this role by Gates, the COVAX Plan was launched, entrusted to the Gavi Alliance of which was director Jens Stoltenberg, now NATO secretary general, and administered by a former GSK manager.\n\nThe COVAX Plan for the anti-Covid vaccination in Third World countries, partly unsuccessful due to the refusal of nations to accept experimental gene serums sometimes delivered after the expiry date, was however supported with a 4 billion dollar funding from the Biden administration, however bound to the purchase of 500 million doses of Pfizer vaccines which sponsored the Democrats in the 2020 presidential elections.\n\n4 – THE GAVI ALLIANCE PROJECT WITH ITALY IN THE FRONT ROW\n\nTherefore, it cannot come as a surprise that the Rockefeller Foundation already in June 2020 financed the GAVI Alliance with 5 million dollars which it had inaugurated in March 1999 at its Villa Serbelloni Congress Center, marking Italy’s destiny in the project.\n\nAll of this emerges from the report on the site of the Permanent Representation of Italy to the UN in Geneva, where Dr. Ranieri Guerra, scientific adviser to the Italian embassy who promoted the Italy-USA-Gates agreement, became famous as deputy director of the WHO pilot project of the 10 mandatory vaccines imposed by the Lorenzin Decree in 2017.\n\nThis law was defended by the sentence of the constitutional judge Marta Cartabia who later became the inspiration for the Covid vaccination obligation for healthcare workers as Minister of Justice of the Draghi government.\n\nDr. Guerra, on the other hand, later ended up under investigation for false statements to magistrates, in relation to the pandemic emergency plan scandal, and was in fact induced to resign from the prestigious position in the World Health Organization.\n\n«The GAVI Alliance is a public-private partnership born in 2000 with the aim of guaranteeing a better level of health for children and the population, mainly through the implementation of vaccination campaigns in developing countries. It includes countries and the private sector, such as the Bill & Melinda Gates Foundation, vaccine manufacturers from both developed and developing countries, specialized research institutes, civil society and international organizations such as WHO, UNICEF and the World Bank» can be read on the UN site in Geneva of Italy.\n\nItaly has contributed to GAVI since its establishment in 2006, as a founding member of the International Finance facility for Immunization (Iffim). Among the first ever donors of the Alliance, Italy contributed 100 million euros in direct contributions in the 2016-2020 strategic cycle, in addition to the resources allocated by the Ministry of Economy and Finance to support of innovative finance (IFFIm and AMC).\n\n«At the refinancing summit in June 2020, the “Global Vaccine Summit” in London, our country announced a multi-year contribution of 120 million euros for the financial cycle (2021-2025), which includes the contribution for the distribution of vaccines anti-COVID-19 already announced at the previous Brussels Conference (4 May 2020) and an additional €150 million to the IFFIm instrument (for the period 2026-2030), in addition to the $635 million already committed» it was specified.\n\n«In the context of the fight against COVID-19, GAVI is playing a leading role. Together with WHO and CEPI, the Alliance co-leads the COVAX Facility, the vaccine pillar of the Access to COVID-19 Tools (ACT) accelerator, launched in April 2020.\n\nObviously, the Italian government website does not refer to the lobbying scandal perpetrated by Gates’ NGO against European and US politicians and two of the great protagonists of the Gavi NGO do not appear: the aforementioned Jens Stoltenberg who favored the outbreak of the war in Ukraine with the continuous NATO provocations against Russia, and Vittorio Colao, former Minister for Technological Innovation and Digital Transition in the Draghi government, who made an agreement on global immunization with GAVI when he was CEO of Vodafone.\n\nHis role is strategically important because he promoted the bankrupt APP Immuni but also the forms of digital control during the pandemic emergency which materialized in the Super Green Pass only for the vaccinated (or recovered from Covid-19) causing enormous social inequalities and restrictions.\n\nHis conflict of interest also emerged in relation to the management prospectus of the Next Generation European Funds prepared by the multinational McKinsey, of which he was manager, which led to the drafting of the PNRR (National Recovery and Resilience Plan) within which 320 million euros have been allocated to a National Center for Research on mRNA gene therapies developed by the Big Pharma vaccines together with the Ministry of University and some Italian universities, including the University of Rome Tor Vergata of which the new Minister of Health Orazio Schillaci.\n\nSo here is a short circuit of macroscopic conflicts of interest between governments, public institutions and private pharmaceutical companies with a license to speculate on the Covid-19 emergency and on possible new pandemics or even on vaccines to limit the adverse reactions caused by anti-Covid gene serums, as in the case of the one against Herpes Zoster.\n\n5 – METABIOTA FROM THE CIA TO UKRAINE WITH BIDEN JR\n\nMetabiota, a San Francisco-based company focused on epidemic risk analytics, launched its first commercial risk modeling platform and preparedness index in 2017 to help insurance or reinsurance companies and ILS funds o investors to understand and subscribe to the epidemic risk.\n\n«In announcing the launch today Metabiota said that it has signed strategic agreements with reinsurance giant Munich Re and In-Q-Tel, Inc. a not-for-profit venture capital firm partly funded by the CIA that aims to speed development of technologies of interest to the U.S. intelligence community».\n\nThis is what the American site Artemis reported in 2017. And it is enough for us to confirm the shady links with the Central Intelligence Agency which, a few days after the “prophecy” about a global pandemic made in July 2018, also extended to one of the most strategic military agencies of the Pentagon.\n\n«Today, Metabiota, the pioneer in epidemic risk modeling, announced it has been awarded a subcontract from Black & Veatch (B&V) to support the U.S. Defense Threat Reduction Agency’s (DTRA) Cooperative Biological Engagement Program (CBEP) in Iraq under the Biological Threat Reduction Integrating Contract (BTRIC). Metabiota has also partnered with B&V on DTRA’s recently awarded Cooperative Threat Reduction Integrating Contract (CTRIC) III with an Indefinite Delivery/Indefinite Quantity (ID/IQ) contract ceiling of $970M» reads the San Francisco company website on August 8, 2018, two weeks after the article on the imminent pandemic alert.\n\nThe emails show that Rosemont Seneca Technology Partners invested $500,000 in the San Francisco pathogen research firm and raised millions more through companies like Goldman Sachs (Pfizer partner).\n\nHunter introduced Metabiota to the top management of Burisma, the Ukrainian gas company of which he was a board member, for a “science project” related to biolaboratories in Ukraine.\n\nIn an email exchange, Metabiota vice president Mary Guttieri wrote to Hunter in April 2014, two months after Russia annexed Crimea following the NATO coup in Kiev.\n\n“As promised, I’ve prepared the attached memo, which provides an overview of Metabiota, our engagement in Ukraine, and how we can potentially leverage our team, networks, and concept to assert Ukraine’s cultural and economic independence from Russia and the Continuing Integration into Western Society”.\n\nCuriously, Dr. Guttieri also mentions Lake Como… She was thinking of Rockefeller’s Villa Serbelloni where Metabiota took part in the 2016’s Global Virome Project (GVP) meeting?\n\n6 – THE CHINESE SCIENTIST IN THE INTRIGUE BETWEEN WUHAN AND ROCKEFELLER\n\nBut the Canadian and American Catholic site LIfeSiteNews went further in a recent investigation in the light of which the meeting hosted by the Rockefeller Foundation takes on a disturbing relevance.\n\n«Jack Maxey, former co-host of Steve Bannon’s War Room and current member of LifeSite’s Faith & Reason, has revealed a connection between Hunter Biden, the research company Metabiota – which is involved with biolabs in Ukraine – as well as the Wuhan Chinese lab that is responsible for the coronavirus outbreak» we can read in the article.\n\n«Hunter had a secretary in Beijing, named Xiaoyang, her last name is Zeng, spelled Z E N G, and her husband is a guy named Fu Gao, or George Gao, senior, top guy in the Chinese CDC. And Hunter hooks this guy up with Metabiota, and they essentially run the gain of function experiments inside the Wuhan lab that gave us COVID!» argues Maxey who then produces some very convincing probative evidence that also involves the USA.\n\nTwo different studies are cited carried out under the aegis of the PREDICT project launched by the US government agency USAID during the Obama-Biden administration and then interrupted by President Donald Trump also in relation to the unclear roles of Anthony Fauci’s NIAID, who had financed Daszak’s EcoHealhtAlliance together with Gates, and which was rejected by the Pentagon’s DARPA military agency a search for the enhancement of the SARS virus with the Gain of Function deemed too dangerous… (continues here)\n\nWHOLE INVESTIGATION CONTINUES HERE WITH ALL SOURCES", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/2022/11/21/wuhang-gates-62-vaccini-doro-sars-cov-2-da-laboratorio-complotto-nwo-gates-cia-nel-covo-dei-rockefeller-a-bellagio/", "https://www.gospanews.net/en/2022/12/18/the-rockefellers-unpunished-holocausts-atomic-bombs-abortions-depopulation-with-manmade-sars-cov-2-pandemic-and-gates-vaccines/", "https://www.gospanews.net/en/2021/10/28/biden-hides-secrets-on-jfk-assassination-rfk-jr-outrage-against-american-democracy/", "https://www.gospanews.net/en/2022/11/21/green-pass-forever-and-more-vaccines-with-dangerous-mrna-technology-white-house-impose-health-dictatorship-with-the-g20-bali-declaration/", "https://www.gospanews.net/en/2022/11/21/green-pass-forever-and-more-vaccines-with-dangerous-mrna-technology-white-house-impose-health-dictatorship-with-the-g20-bali-declaration/", "https://www.gospanews.net/en/2021/06/15/eu-green-pass-under-skin-microchip-and-gates-666-mark-of-the-beast-transhumanist-plot-by-klaus-schwab-great-reset-nwo-against-christianity/", "https://www.gospanews.net/en/2021/06/15/eu-green-pass-under-skin-microchip-and-gates-666-mark-of-the-beast-transhumanist-plot-by-klaus-schwab-great-reset-nwo-against-christianity/", "https://www.gospanews.net/en/2022/09/02/wuhan-gates-54-too-many-secrets-on-manmade-sars-between-chinese-biolab-daszaks-eha-of-ny-funded-by-gates-nih-stops-the-grant/", "https://www.gospanews.net/en/2022/09/02/wuhan-gates-54-too-many-secrets-on-manmade-sars-between-chinese-biolab-daszaks-eha-of-ny-funded-by-gates-nih-stops-the-grant/", "https://www.gospanews.net/2022/07/06/wuhan-gates-54-sars-2-bio-arma-per-il-capo-covid-della-rivista-the-lancet-e-virus-artificiale-accusa-gli-usa-ma-non-lo-sponsor-gates/", "https://www.gospanews.net/en/2022/11/27/wuhan-gates-59-sars-lab-experiments-enhanced-with-gof-without-risk-assessment-stop-them-alert-by-5-us-senators-russia-blames-last-boston-research/", "https://www.gospanews.net/en/2022/11/27/wuhan-gates-59-sars-lab-experiments-enhanced-with-gof-without-risk-assessment-stop-them-alert-by-5-us-senators-russia-blames-last-boston-research/", "https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/en/2022/01/21/wuhan-gates-45-study-on-sars-2-manmade-hidden-by-fauci-hot-e-mail-at-congress-us-microbiologist-had-forthwith-discovered-artificial-spike-alterations/", "https://www.gospanews.net/en/2022/01/21/wuhan-gates-45-study-on-sars-2-manmade-hidden-by-fauci-hot-e-mail-at-congress-us-microbiologist-had-forthwith-discovered-artificial-spike-alterations/", "https://www.gospanews.net/en/2021/02/10/wuhan-gates-31-sars-2-lies-ties-among-scientists-in-gates-shade-disclosed-by-daily-mail-die-welt/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://www.gospanews.net/en/2022/03/18/russia-presents-new-evidence-from-us-funded-ukraine-biolabs-16-million-on-coronavirus-research-before-sars-2/", "https://www.gospanews.net/en/2022/06/02/wuhan-gates-50-the-italian-boss-of-obamas-coronavirus-ukraine-laboratories-funded-by-former-cia-director-leon-panetta/", "https://www.gospanews.net/en/2022/06/02/wuhan-gates-50-the-italian-boss-of-obamas-coronavirus-ukraine-laboratories-funded-by-former-cia-director-leon-panetta/", "https://www.gospanews.net/en/2019/10/06/ukrainegate-an-investigative-memo-blames-joe-biden-and-john-kerry-too/", "https://www.gospanews.net/en/2022/12/29/wuhan-gates-61-the-huge-nwo-plot-to-control-brains-sars-cov-2-by-fauci-graphene-by-darpa-obama-vaccines-by-gates-biden-eu/", "https://www.gospanews.net/en/2022/08/11/wuhan-gates-51-sars-2003-and-2019-american-bioweapons-russian-genomic-and-chemical-experts-said/", "https://www.gospanews.net/en/2022/08/11/wuhan-gates-51-sars-2003-and-2019-american-bioweapons-russian-genomic-and-chemical-experts-said/", "https://www.gospanews.net/2021/12/13/pfizer-affari-e-intrighi-con-goldman-sachs-degli-ex-manager-draghi-monti-prodi-nel-cda-big-pharma-anche-lex-vicepresidente-della-banca/", "https://www.gospanews.net/2022/01/10/vaccini-covid-pure-coca-cola-nella-grande-abbuffata-nel-cda-pfizer-manager-di-gates-facebook-reuters-world-economic-forum-goldman-sachs-adobe/", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.gospanews.net/2021/12/13/pfizer-affari-e-intrighi-con-goldman-sachs-degli-ex-manager-draghi-monti-prodi-nel-cda-big-pharma-anche-lex-vicepresidente-della-banca/", "https://www.gospanews.net/en/2020/11/18/wuhan-gates-24-who-pandemic-in-gates-chinas-puppets-hands-dr-tedros-leader-of-tplf-islamic-communist-rebels-blamed-of-last-massacre-in-ethiopia-by-amnesty/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.gospanews.net/en/2020/11/18/wuhan-gates-24-who-pandemic-in-gates-chinas-puppets-hands-dr-tedros-leader-of-tplf-islamic-communist-rebels-blamed-of-last-massacre-in-ethiopia-by-amnesty/", "https://www.gospanews.net/en/2021/04/01/nwo-against-italy-xfile-6-mandatory-vaccines-for-health-workers-dictated-by-minister-close-to-soros/", "https://www.gospanews.net/en/2021/04/01/nwo-against-italy-xfile-6-mandatory-vaccines-for-health-workers-dictated-by-minister-close-to-soros/", "https://www.gospanews.net/en/2021/09/09/pandemic-emergency-storm-in-who-mysterious-farewell-of-the-deputy-director-under-investigation-in-italy/", "https://www.gospanews.net/en/2021/09/09/pandemic-emergency-storm-in-who-mysterious-farewell-of-the-deputy-director-under-investigation-in-italy/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.gospanews.net/en/2022/03/04/stoltenberg-natos-puppet-for-gates-nwo-in-pandemic-as-in-ukrainian-war-gavi-vaccines-norges-bank-weapons-affairs-on-yemens-bombs/", "https://www.gospanews.net/en/2021/02/18/nwos-plot-against-italy-x-file-2-new-it-minister-among-bilderberg-mckinsey-gates-cia-for-artificial-intelligence/", "https://www.gospanews.net/en/2021/02/18/nwos-plot-against-italy-x-file-2-new-it-minister-among-bilderberg-mckinsey-gates-cia-for-artificial-intelligence/", "https://www.gospanews.net/2022/10/15/pnrr-italia-e320-milioni-dirottati-da-gates-alle-big-pharma-ricerche-su-vaccini-mrna-nellateneo-di-crisanti-pd-con-pfizer-astrazeneca-e-la-farmaceutica-del-marito-di-von-der-l/", "https://www.gospanews.net/2022/10/15/pnrr-italia-e320-milioni-dirottati-da-gates-alle-big-pharma-ricerche-su-vaccini-mrna-nellateneo-di-crisanti-pd-con-pfizer-astrazeneca-e-la-farmaceutica-del-marito-di-von-der-l/", "https://www.gospanews.net/2022/12/07/esclusivo-epidemia-di-herpes-dopo-i-vaccini-covid-27mila-casi-nellue-31-morti-da-zoster-lo-studio-per-danni-al-sistema-immunitario/", "https://www.gospanews.net/2022/08/10/ukraine-biolabs-8-virus-studiati-dal-pentagono-resi-pandemici-per-affari-dem-big-pharma-generale-russo-su-covid-19-e-vaiolo-scimmie/", "https://www.gospanews.net/2022/08/10/ukraine-biolabs-8-virus-studiati-dal-pentagono-resi-pandemici-per-affari-dem-big-pharma-generale-russo-su-covid-19-e-vaiolo-scimmie/", "https://www.gospanews.net/2021/12/13/pfizer-affari-e-intrighi-con-goldman-sachs-degli-ex-manager-draghi-monti-prodi-nel-cda-big-pharma-anche-lex-vicepresidente-della-banca/", "https://www.gospanews.net/en/2022/10/07/nobel-peace-prize-2022-to-kiev-ngo-created-by-soros-us-for-ukrainian-coup-funded-also-by-eu-commission-which-bought-arms-for-zelensky/", "https://www.gospanews.net/en/2022/10/07/nobel-peace-prize-2022-to-kiev-ngo-created-by-soros-us-for-ukrainian-coup-funded-also-by-eu-commission-which-bought-arms-for-zelensky/", "https://www.gospanews.net/en/2021/02/10/wuhan-gates-31-sars-2-lies-ties-among-scientists-in-gates-shade-disclosed-by-daily-mail-die-welt/", "https://www.gospanews.net/en/2021/02/10/wuhan-gates-31-sars-2-lies-ties-among-scientists-in-gates-shade-disclosed-by-daily-mail-die-welt/", "https://www.gospanews.net/en/2023/01/19/darpa-gates-1-echo-program-human-dna-hunting-by-pentagon-military-agency-bto/", "https://www.gospanews.net/en/2023/02/13/wuhan-gates-62-manmade-sars-cov-2-for-golden-vaccines-metabiota-cia-biden-gates-rockefeller-intrigued-in-ukraine-china-and-italy/", "https://www.gospanews.net/en/2023/02/13/wuhan-gates-62-manmade-sars-cov-2-for-golden-vaccines-metabiota-cia-biden-gates-rockefeller-intrigued-in-ukraine-china-and-italy/", "https://t.me/gospanews"], "authors": [""], "publish_date": "March 18, 2023"}