{"result_id": "333015", "URL": "https://www.veteranstoday.com/2023/01/26/monster-virus-alert-by-canadian-immunologist-pfizers-plan-to-mutate-sars-cov-2-for-new-vaccines-video/", "timestamp": "2023-04-25 17:54:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/01/26/monster-virus-alert-by-canadian-immunologist-pfizers-plan-to-mutate-sars-cov-2-for-new-vaccines-video/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Monster Virus Alert by Canadian Immunologist. “Pfizer’s Plan to Mutate SARS-CoV-2 for New Vaccines” (video) | VT Foreign Policy", "cleaned_text": "«This video footage (link below) reveals plans (that might already be in action) to mutate SARS-CoV-2 so they can predict what future variants might appear, so they can have customized shots sitting on the shelf, ready to disseminate to the public. This directed evolution of a pathogenic virus has the potential to unleash a genuine ‘monster virus’. Plus, it sounds like the work they are doing with individual proteins is a full-on form of gain-of-function research that may be occurring in parallel».\n\nThis is the alert launched by Dr Byram W. Bridle on his substack ‘COVID Chronicles”. Bridle is an Associate Professor of Viral Immunology in the Department of Pathobiology at the University of Guelph (Ontario, Canada).\n\nHe was the first to highlight the Spike protein’s toxicity and to point out the many miscarriage after mRNA vaccination with Comirnaty.\n\nThe video was released by Project Veritas that obtained Pfizer documents confirming the identify of Jordon Walker (the executive in the video; not a junior employee).\n\nYesterday, Project Veritas released a new video in which it exposes a Pfizer official, Jordon Trishton Walker, who claims that his business is looking into a means to “mutate” COVID using “Directed Evolution” in order to foresee the development of future vaccines.\n\nDirected Evolution, according to Walker, differs from Gain-of-Function, which is described as “a mutation that confers new or enhanced activity on a protein.” In other words, it suggests that a virus like COVID can grow more potent as a result of a mutation or scientific experiment.\n\nThe Pfizer executive told a Veritas journalist about his company’s COVID vaccine plans, while knowing that the information would be unpopular if it became public.\n\n“One of the things we [Pfizer] are exploring is like, why don’t we just mutate it [COVID] ourselves so we could create — preemptively develop new vaccines, right? So, we have to do that. If we’re gonna do that though, there’s a risk of like, as you could imagine — no one wants to be having a pharma company mutating f**king viruses,” Walker said.\n\nWalker suggested parallels between the present Pfizer research and what might have occurred at China’s Wuhan Institute of Virology.\n\n“You have to be very controlled to make sure that this virus [COVID] that you mutate doesn’t create something that just goes everywhere. Which, I suspect, is the way that the virus started in Wuhan, to be honest. It makes no sense that this virus popped out of nowhere. It’s bullsh*t,” he said.\n\n“You’re not supposed to do Gain-of-Function research with viruses. Regularly not. We can do these selected structure mutations to make them more potent. There is research ongoing about that. I don’t know how that is going to work. There better not be any more outbreaks because Jesus Christ,” he said.\n\nWalker also informed the Veritas journalist that COVID has played a role in Pfizer’s recent financial success.\n\nThe video «confirms that Pfizer is almost certain the original Wuhan variant of SARS-CoV-2 was anything but natural Pfizer is clearly proud of its regulatory capture. In other words, they have substantial control over how health regulatory agencies review their applications» Bridle added.\n\n«Easy’ reviews = high-paying jobs in big pharma. I would like to know how the media relations divisions of regulatory agencies are going to handle this bomb that has been dropped on them. I think it is high time that they start thinking about how they are going to win back the trust of the ‘fully awake’ members of the public (with more joining the ranks daily)» highlighted the Canadian immunologist.\n\n«Pfizer does not seem to have a genuine interest in public health. (What, they haven’t changed how they have conducted their business for many years? What a surprise! [sarcasm]) Legacy media should take note. This video is an example of how investigative journalism is really done; for the greater good of the public. If you hire journalists, you might be able to approach this level of excellence. Please share this video with as many people as you can, especially the so-called ‘narrative pushers’. They might find it difficult to find an easy rebuttal to this one» concluded Bridle.\n\nCOVID CHRONICLES – Pfizer Might Mutate SARS-COV-2 Behind Closed Doors To Make Their Shots Bigger Cash Cows", "opengraph": {}, "tags": ["Covid Vaccine", "#sars-cov-2 manmade", "Pfizer COVID-19 vaccine"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "696", "height": "392", "embed_code": "<iframe title=\"Pfizer Exposed For Exploring &quot;Mutating&quot; COVID-19 Virus For New Vaccines Via 'Directed Evolution'\" width=\"696\" height=\"392\" src=\"https://www.youtube.com/embed/ywlpArNWKxM?start=5&amp;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/ywlpArNWKxM?start=5&feature=oembed"}], "links": ["https://www.gospanews.net/en/2021/06/04/covid-19-spike-toxin-inoculated-through-vaccines-scary-alert-by-canadian-immunologist/", "https://www.gospanews.net/2023/01/23/booster-covid-efficacia-e-sicurezza-ignote-nei-fragili-scheda-aifa-smentisce-il-ministero-sui-bimbi-ma-occulta-rischi-aborti-dati-pfizer-e-tumori/", "https://www.gospanews.net/en/2021/06/04/covid-19-spike-toxin-inoculated-through-vaccines-scary-alert-by-canadian-immunologist/", "https://www.gospanews.net/en/2022/12/29/wuhan-gates-61-the-huge-nwo-plot-to-control-brains-sars-cov-2-by-fauci-graphene-by-darpa-obama-vaccines-by-gates-biden-eu/", "https://www.gospanews.net/en/2022/11/27/wuhan-gates-59-sars-lab-experiments-enhanced-with-gof-without-risk-assessment-stop-them-alert-by-5-us-senators-russia-blames-last-boston-research/", "https://www.gospanews.net/en/2022/11/27/wuhan-gates-59-sars-lab-experiments-enhanced-with-gof-without-risk-assessment-stop-them-alert-by-5-us-senators-russia-blames-last-boston-research/", "https://www.gospanews.net/en/2022/12/29/wuhan-gates-61-the-huge-nwo-plot-to-control-brains-sars-cov-2-by-fauci-graphene-by-darpa-obama-vaccines-by-gates-biden-eu/", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.gospanews.net/en/2022/12/14/wuhan-gates-60-new-scandal-into-who-french-co-chair-of-investigative-group-on-sars-2-worked-in-the-china-bio-lab-with-manmade-coronavirus/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.gospanews.net/en/category/corona-virus/", "https://viralimmunologist.substack.com/?utm_source=substack&utm_medium=email", "https://greatgameindia.com/pfizer-mutating-covid-virus-to-discover-new-vaccines/", "https://www.gospanews.net/en/2022/12/14/wuhan-gates-60-new-scandal-into-who-french-co-chair-of-investigative-group-on-sars-2-worked-in-the-china-bio-lab-with-manmade-coronavirus/", "https://www.gospanews.net/en/2023/01/11/covid-19-omicron-variant-xbb-1-5-more-dominant-in-us-according-to-cdc-is-the-new-fauci-artificial-virus/", "https://www.gospanews.net/2023/01/23/booster-covid-efficacia-e-sicurezza-ignote-nei-fragili-scheda-aifa-smentisce-il-ministero-sui-bimbi-ma-occulta-rischi-aborti-dati-pfizer-e-tumori/"], "authors": [""], "publish_date": "January 26, 2023"}