{"result_id": "333008", "URL": "https://www.veteranstoday.com/2023/02/10/acute-psychosis-after-covid-19-vaccination-croatian-studys-alert-relaunched-by-us-md-mccullough/", "timestamp": "2023-04-25 17:53:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/02/10/acute-psychosis-after-covid-19-vaccination-croatian-studys-alert-relaunched-by-us-md-mccullough/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "“Acute Psychosis after COVID-19 Vaccination”. Croatian Study’s Alert relaunched by US MD McCullough | VT Foreign Policy", "cleaned_text": "All articles in Italian linked into this post can be read in English thanks to the available simultaneous translation in English\n\n«Unvaccinated patients have mentioned half-jokingly that COVID-19 vaccination in friends and family makes some of them “crazy.” While I have always brushed this off as fear driven vaccine ideology taking over common sense in some zealots, the building literature on neuropsychiatric symptoms is alarming. There are now ~10 papers describing headache, fever, and a range of acute neuropsychiatric symptoms after both mRNA and adenoviral COVID-19 vaccination. The strong bias among editors and publishers has kept countless papers out of the mainstream medical media, hence one has to look far and wide to find information on the topic of vaccine safety. Borovina et al, from Croatia described three cases of acute headache followed by psychosis».\n\nThis is the beginning of a very interesting articles wrote in his substack Courage Discourse by the famous American medical doctor Peter McCullough who reported many evidences of dangerous mRNA sera against Covid and summarized these in a scientific paper together the the biophysical scientist Stephanie Seneff, for several years researcher in the MIT (Massachusetts Institute of Technology).\n\nNow McCullough quoted Croatian study about neuropsychiatric disorders after other neurologist explained the serious neurocerebral injuries caused by vaccines.\n\nAll three patients required hospitalization with exhaustive diagnostic testing and medical treatment. One of the cases progressed to attempted suicide with a knife stabbing to the abdomen requiring emergency abdominal surgery.\n\n«As a doctor I am disturbed by medical evidence demonstrating gene coded SARS-CoV-2 Wuhan Institute of Virology Spike protein in the human brain after vaccination. I wonder how many subtle changes go clinically unrecognized. Even if a small number are affect, the massive numbers who came forward make any “rare” complication a common issue to face in clinical practice» McCullough remarked.\n\n«We report the case series of three patients who de- veloped psychotic symptoms after the COVID-19 vaccination. Considering the evidence in the literature of an association between altered immune function and psychosis, the negative family and personal psychiatric history of our patients, the clinical presentation, and the close temporal relationship between the COVID-19 vaccination and the presenting symptoms, we hypothesise that the COVID-19 vaccine may play a role in the aetiology of their symptoms» we can read in the conclusions of Borovina et al. study.\n\n«Since the COVID-19 vaccine has been shown to be safe and effective (Sultana et al. 2022), and the development of psychosis after vaccination is very rare (Reinfeld et al. 2021), we firmly believe that this case series should not discourage the use of the COVID-19 vaccine. Rather, future systematic studies should be conducted with adequate control of confounding variables to establish coincidence, association or causality between reported psychotic symptoms and the COVID-19 vaccine» the Croatian researchers highlighted.\n\n«In conclusion, we should not downplay or attempt to normalize neuropsychiatric symptoms after COVID-19 shots. Every case should be taken seriously. Suicides after December 10, 2020 should be investigated and the brand, doses, and dates of vaccination should be recorded by healthcare personnel and noted by family members» McCullough added.\n\nHe quoted also the results of the autopsies of the German medical specialist Michael Mörz of the Dresden Institute of Pathology, published in preview by Gospa News, which revealed the presence of the pathogenic Spike protein in the brain of a dead vaccinated person.\n\n«If you find “Courageous Discourse” enjoyable and useful to your endeavors, please subscribe as a paying or founder member to support our efforts in helping you engage in these discussions with family, friends, and your extended circles» concluded the physician.\n\nThe possible neurocerebral injuries that might have been caused by Covid vaccines was highlighted by a recent alert launched by US authorities. Data indicates Pfizer’s new COVID-19 vaccine could cause a type of stroke in elderly people, two U.S. health agencies said on Jan. 13.\n\nBorovina T, Popović J, Mastelić T, Sučević Ercegovac M, Kustura L, Uglešić B, Glavina T. First Episode of Psychosis Following the COVID-19 Vaccination – A Case Series. Psychiatr Danub. 2022 Summer;34(2):377-380. doi: 10.24869/psyd.2022.377. PMID: 35772162.\n\nMörz M. A Case Report: Multifocal Necrotizing Encephalitis and Myocarditis after BNT162b2 mRNA Vaccination against COVID-19. Vaccines (Basel). 2022 Oct 1;10(10):1651. doi: 10.3390/vaccines10101651. PMID: 36298516; PMCID: PMC9611676.", "opengraph": {}, "tags": ["adverse reactions", "mRNA", "COVID-19 vaccines"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2021/11/20/dr-mccullough-sues-medical-journal-for-refusing-to-publish-study-highlighting-risks-of-covid-19-vaccine-in-children/", "https://www.gospanews.net/en/2022/11/20/the-covid-jabs-mechanisms-of-injury-sudden-death-blood-cloths-autoimmune-and-human-mad-cow-disease/", "https://www.gospanews.net/en/2022/11/20/the-covid-jabs-mechanisms-of-injury-sudden-death-blood-cloths-autoimmune-and-human-mad-cow-disease/", "https://www.gospanews.net/2022/11/29/neurologo-tedesco-conferma-danni-cerebrali-da-vaccini-covid-gia-segnalati-da-gospa-news-boom-di-reazioni-avverse-gravi-in-svizzera/", "https://www.gospanews.net/2023/02/03/covid-basta-vaccini-mrna-causano-miocarditi-danni-immunitari-e-tumori-tremendo-studio-dallistituto-superiore-della-sanita/", "https://www.gospanews.net/2022/10/11/vaccini-covid-stragi-da-danni-neurologici-e-cerebrali-in-ue-usa-spike-patogena-come-bio-arma-nel-cervello-di-trivaccinato-studi-e-dati-shock/", "https://www.gospanews.net/2022/10/11/vaccini-covid-stragi-da-danni-neurologici-e-cerebrali-in-ue-usa-spike-patogena-come-bio-arma-nel-cervello-di-trivaccinato-studi-e-dati-shock/", "https://www.theepochtimes.com/t-pfizer", "https://www.theepochtimes.com/t-covid-19", "https://www.gospanews.net/2023/01/15/booster-covid-bivalenti-danneggiano-il-cervello-allarme-fda-cdc-conferma-inchieste-gospa-news-sui-rischi-neurocerebrali/", "https://www.gospanews.net/2023/01/15/booster-covid-bivalenti-danneggiano-il-cervello-allarme-fda-cdc-conferma-inchieste-gospa-news-sui-rischi-neurocerebrali/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/bivalent-boosters.html", "https://t.me/gospanews", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.gospanews.net/en/category/corona-virus/", "https://petermcculloughmd.substack.com/p/acute-psychosis-after-covid-19-vaccination?r=1ri1dn&utm_campaign=post&utm_medium=web", "https://www.psychiatria-danubina.com/UserDocsImages/pdf/dnb_vol34_no2/dnb_vol34_no2_377.pdf", "https://www.mdpi.com/2076-393X/10/10/1651", "https://www.gospanews.net/en/2023/01/12/vital-cdc-data-serious-adverse-events-by-mrna-covid-vaccines-5-5-times-higher-than-all-others-in-the-us-since-2009/", "https://www.gospanews.net/2022/11/29/neurologo-tedesco-conferma-danni-cerebrali-da-vaccini-covid-gia-segnalati-da-gospa-news-boom-di-reazioni-avverse-gravi-in-svizzera/", "https://www.gospanews.net/en/2021/11/20/dr-mccullough-sues-medical-journal-for-refusing-to-publish-study-highlighting-risks-of-covid-19-vaccine-in-children/"], "authors": [""], "publish_date": "February 10, 2023"}