{"result_id": "333040", "URL": "https://www.veteranstoday.com/2022/08/07/monkeypox-outbreaks-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "timestamp": "2023-04-25 17:54:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/08/07/monkeypox-outbreaks-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "“Monkeypox Outbreaks Connected to mRNA Covid Vaccines”. Israeli Physician-Scientist Injured by Pfizer said | VT Foreign Policy", "cleaned_text": "An Israeli scientist injured by Pfizer’s Covid vaccine, Professor Shmuel C. Shapira (on the cover image), has correlated the Monkeypox outbreak with dysfunction to the immune system caused by mRNA gene sera.\n\nBefore reading the interesting article published by Kanekoa’s Newsletter and taken from The Defender website managed by the Children’s Health Defense association of the lawyer Robert F. Kennedy jr., it is necessary to make some premises on the widespread outbreaks of Monkeypox virus that have induced the director of the WHO has proclaiming a global emergency, despite the contrast between members of the risk assessment.\n\nThe U.S. Department of Health and Human Services on Thursday declared monkeypox a public health emergency. The U.S. Food and Drug Administration said it will offer monkeypox vaccines to children on a “case-by-case” basis, despite no clinical trials for kids under 18.\n\nIt should be remembered that the US Secretary of Health is Xavier Becerra, a supporter of anti-Covid vaccines despite testing positive for SARS-Cov-2 infection after the third dose of the gene sera.\n\nBut Becerra is also the transgender chosen by President Joseph Biden to represent the LGBT Lobby. And he is therefore very alarmed by this new viral threat that affects mainly males but especially those who have gay sex, as ascertained by the WHO in relation to monkeypox.\n\nThe alarm about this new contagious and potentially lethal epidemic has spread rapidly worldwide, inducing many governments in the West to stock up on vaccines (already approved by the FDA in the US and in recent days by the EMA in the European Union) and to recommend them. to the population that is still facing the fourth dose of the antiCovid one.\n\nBoth the late virologist Luc Montagnier, winner of the Nobel Prize for Medicine in 2008 but above all a great expert in vaccines, and his other colleagues, such as the head of the immunization plan of the European Medicines Agency Marco Cavaleri, had highlighted that the repeated boosters could have caused dysfunction to the immune system, given that the actual danger (and effectiveness) of RNA or messenger DNA-based gene serums that can alter human DNA is still unknown, as now supported by a judge ruling in Italy and from various scientific researches.\n\nThat is why the statements of Professor Shapira who correlates the outbreaks of Monkeypox with the probable damage to the immune system caused by anti-Covid vaccines are of considerable importance.\n\nIt should also not be forgotten that the Monkeypox epidemic was predicted, in a very suspicious exercise, by some of the same subjects financed by Bill & Melinda Gates who had predicted the Coronavirus pandemic: just happened after China had carried out experiments on this pathogen precisely in the Wuhan Institute of Virology and after very dangerous research on smallpox was conducted in the bacteriological laboratories of Ukraine thanks to funding from the Pentagon, the US Department of Defense.\n\nThis is why the analyzes of the Israeli scientist do nothing but close a circle already drawn in the previous Gospa News inquiries.\n\nTwitter last week censored Shmuel Shapira, M.D., MPH, for suggesting a connection between the monkeypox outbreakand mRNA COVID-19 vaccines, according to a Kanekoa’s Newsletter Substack post published Wednesday.\n\nShapira, who said he was injured after receiving his third dose of the Pfizer COVID-19 vaccine, said Twitter demanded he remove a tweet that said:\n\n“Monkey pox cases were rare for years. During the last years a single case was documented in Israel. It is well established the mRNA vaccines affect the natural immune system. A monkey pox outbreak following massive covid vaccination: *Is not a coincidence.”\n\nShapira is a full professor of medical administration at Hebrew University and served as director of Israel’s Institute for Biological Research from 2013-2021.\n\nAccording to the author of the Kanekoa Newsletter, Shapira might be “the most senior ranking medical-scientist in the world to openly criticize the COVID vaccines.”\n\nShapira also is the founder and head of the military medicine department at the Hebrew University and Israeli Defense Forces Medical Corps, and a senior research fellow at the International Institute for Counter-Terrorism at Reichman University in Israel.\n\nHe has published more than 110 peer-reviewed scientific articles and is the editor of three academic journals.\n\nAs director of Israel’s Institute for Biological Research, Shapira initially was the “driving force behind the efforts to develop an Israeli COVID-19 vaccine” until he “unexpectedly” stepped down in May 2021, The Times of Israel reported.\n\nAccording to Kanekoa, Shapira started his Twitter account in January 2022 and has grown increasingly vocal in his criticism of mRNA vaccines since he first denounced the Israeli Genesis Award for giving the award to Pfizer CEO Albert Bourla.\n• On Jan. 18, 2022, Shapira said (translated from Hebrew by Google): “The Israeli Genesis Award was given to the CEO of Pfizer, so wretched. Instead of giving it to an Israeli scientist, and all this for a mediocre, short-acting vaccine that yielded Pfizer a profit of billions, a wretched and exiled one. Bourla will be appointed the King of Israel now. Let me remind you that vaccinated Israel is the fourth-leading in the number of corona patients in the world. There is a championship!”\n• On Feb. 6, 2022, Shapira asked: “What grade would you give to a vaccine that people are vaccinated with three times and get sick twice (as of today)? Not to mention significant side effects …”\n• On April 9, 2022, Shapira said: “The CEO of the company, millions of whose vaccines were used in Israel for vaccination, stated in an interview with NBC that Israel serves as the world’s laboratory. To the best of my knowledge, this is the first case in history where experimental guinea pigs paid an exorbitant rate for their participation.”\n• On May 13, 2022, Shapira said: “I received 3 vaccinations, I was physically injured in a very significant way as many others were injured … And in addition, my trust in the nature of the decisions and in the processes of making them has been severely eroded. No one asked and checked. I will fight with all my might so that truthful answers regarding all decisions and not just regarding the vaccine are given …”\n• On June 7, 2022, Shapira said: “We are talking about vaccine five in two and a half years. When the vaccine is planned for the sequence from January 2020 (the great-grandfather of the great-grandfather of the current variants). A vaccine that does not prevent infection does not prevent morbidity. And it is allegedly attributed to significant side effects to say the least. Why? What is the logic? Which authority approved? And don’t say that it prevents a serious illness, no one has proven it.”\n• On June 8, 2022, Shapira said: “I will continue and ask why give an outdated fifth vaccine that does not prevent disease and apparently causes many significant common side effects.”\n• On July 5, 2022, Shapira discussed the “son of a 36-year-old Australian friend” who developed “severe ventricular arrhythmias and went into heart failure” only “days after the second Pfizer vaccine.” “The compensation is automatic by the Australian government,” he said. “Despite the behavior of their government they admit to the connection and the phrase ‘no connection’ does not appear in the lexicon.”\n• On July 15, 2022, Shapira shared a chart of New South Wales COVID-19 rates showing an increased risk of COVID-19 infection with every new dose of the mRNA vaccine on which he commented: “According to official data from Australia the more you are injected the more likely you are to get sick as the fourth injection jumps the chance dramatically. According to this study it is supposedly an anti-vaccine at least according to what I have been taught.”\n• On July 18, 2022, Shapira said: “I am not anti-vaccine, I am anti-stupidity, anti-fake science, and anti-incompetent management.”\n• On July 28, 2022, Shapira said: “T [Twitter] warned me to remove the T [tweet] connecting MP [monkeypox] to C [COVID-19]. Each day I understand better where we live and in which year.”\n• On July 31, 2022, Shapira shared a link to the OpenVAERS COVID-19 Vaccine Adverse Event Reporting System that showed a total of 1,357,937 reports including 170,151 hospitalizations and 29,790 deaths, above which he simply commented: “Safe & Efficient.”\n\n“In a post-lockdown world,” Kanekoa said, “where governments increasingly coordinate with Twitter, Facebook, and YouTube to censor criticism of COVID vaccines, even senior ranking medical-scientist are being silenced for speaking about the science that counters the pharmaceutical industry’s narrative.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/2022/07/25/nuovo-complotto-del-terrorista-di-gates-direttore-oms-vaiolo-delle-scimmie-emergenza-globale-per-vaccini-e-dittatura/", "https://www.gospanews.net/2022/07/25/nuovo-complotto-del-terrorista-di-gates-direttore-oms-vaiolo-delle-scimmie-emergenza-globale-per-vaccini-e-dittatura/", "https://childrenshealthdefense.org/defender/monkeypox-health-emergency-fda-kids-vaccines/?utm_source=salsa&eType=EmailBlastContent&eId=5104a086-5222-4870-aea4-ce130e895e5f", "https://www.gospanews.net/2022/06/16/ministri-della-salute-italia-usa-trivaccinati-ma-positivi-al-covid-i-casi-di-speranza-e-becerra-spiegabili-da-studio-italiano/", "https://www.gospanews.net/en/2021/01/28/catho-dem-biden-transgenders-lover-in-masonic-cult-us-president-wants-them-in-govt-army-and-females-sports/", "https://www.gospanews.net/2022/07/25/nuovo-complotto-del-terrorista-di-gates-direttore-oms-vaiolo-delle-scimmie-emergenza-globale-per-vaccini-e-dittatura/", "https://www.gospanews.net/en/2021/01/28/catho-dem-biden-transgenders-lover-in-masonic-cult-us-president-wants-them-in-govt-army-and-females-sports/", "https://www.gospanews.net/2022/01/18/dai-booster-danni-al-sistema-immanitario-dietrofront-di-esperto-ema-e-crisanti-parlano-come-montagnier-4a-dose-flop-in-israele/", "https://www.gospanews.net/2022/07/13/vaccini-anti-covid-alterano-il-dna-giudice-italiano-conferma-2-ricerche-scientifiche-anticipate-da-gospa-news/", "https://www.gospanews.net/2022/01/18/dai-booster-danni-al-sistema-immanitario-dietrofront-di-esperto-ema-e-crisanti-parlano-come-montagnier-4a-dose-flop-in-israele/", "https://www.gospanews.net/2022/07/13/vaccini-anti-covid-alterano-il-dna-giudice-italiano-conferma-2-ricerche-scientifiche-anticipate-da-gospa-news/", "https://www.gospanews.net/en/2022/05/25/breaking-a-contagious-monkeypox-genome-assembled-again-in-wuhan-institute-of-virology-before-the-outbreak-plot-or-false-flag/", "https://www.gospanews.net/en/2022/05/22/ukraine-biolabs-7-key-russian-lawmaker-reveals-illicit-ebola-and-smallpox-searches-run-by-us/", "https://www.gospanews.net/en/2022/06/02/wuhan-gates-50-the-italian-boss-of-obamas-coronavirus-ukraine-laboratories-funded-by-former-cia-director-leon-panetta/", "https://www.gospanews.net/en/2022/05/22/ukraine-biolabs-7-key-russian-lawmaker-reveals-illicit-ebola-and-smallpox-searches-run-by-us/", "https://www.hamartzim.com/lecturers/prof-shmuel-shapira/", "https://childrenshealthdefense.org/defender/covid-nw-discovery-separate-monkeypox-strain-two-outbreaks/", "https://kanekoa.substack.com/p/twitter-censors-pfizer-injured-israeli", "https://childrenshealthdefense.org/defender_category/covid/", "https://www.gospanews.net/en/2022/05/30/report-shows-gates-foundation-who-pharma-execs-took-part-in-monkeypox-pandemic-simulation/", "https://www.gospanews.net/en/2022/05/30/report-shows-gates-foundation-who-pharma-execs-took-part-in-monkeypox-pandemic-simulation/", "https://www.gospanews.net/en/2022/07/16/former-pfizer-exec-said-leaky-vaccine-was-intentional-to-exert-control-over-society/", "https://www.jewishvirtuallibrary.org/idf-medical-corps", "https://www.gospanews.net/en/2022/07/16/former-pfizer-exec-said-leaky-vaccine-was-intentional-to-exert-control-over-society/", "https://www.timesofisrael.com/liveblog_entry/shmuel-shapira-leader-of-embattled-homegrown-israeli-vaccine-effort-to-step-down/", "https://www.allisrael.com/pfizer-ceo-albert-bourla-awarded-usd1-million-genesis-prize-dubbed-the-jewish-nobel-prize", "https://www.gospanews.net/en/2022/05/25/breaking-a-contagious-monkeypox-genome-assembled-again-in-wuhan-institute-of-virology-before-the-outbreak-plot-or-false-flag/", "https://kanekoa.substack.com/p/twitter-censors-pfizer-injured-israeli", "https://twitter.com/shmuelcshapira/status/1483664103830863876", "https://twitter.com/shmuelcshapira/status/1490580586892869634", "https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://www.gospanews.net/en/2022/07/25/76253-dead-6033218-injured-recorded-in-europe-and-usa-following-covid-vaccines-with-4358-fetal-deaths-in-u-s/", "https://twitter.com/shmuelcshapira/status/1513060714356772864", "https://twitter.com/shmuelcshapira/status/1525377945551904768", "https://www.gospanews.net/en/2021/08/24/british-medical-journal-contested-fda-for-political-decision-on-full-approval-of-pfizer-vaccine-without-public-discussion-of-data/", "https://www.gospanews.net/en/2021/08/24/british-medical-journal-contested-fda-for-political-decision-on-full-approval-of-pfizer-vaccine-without-public-discussion-of-data/", "https://twitter.com/shmuelcshapira/status/1534409890084532224", "https://twitter.com/shmuelcshapira/status/1534475572495122432", "https://www.gospanews.net/2022/04/01/vaccini-nel-regno-unito-delle-big-pharma-parte-la-quinta-dose-esperimento-globale-nonostante-morti-e-rischi-immunitari/", "https://www.gospanews.net/2022/04/01/vaccini-nel-regno-unito-delle-big-pharma-parte-la-quinta-dose-esperimento-globale-nonostante-morti-e-rischi-immunitari/", "https://twitter.com/shmuelcshapira/status/1544327996013682690", "https://app.powerbi.com/view?r=eyJrIjoiODQ4NTg4OGUtNWU5ZS00MjQ3LWJmODgtNzI1N2RmOWY3N2Y3IiwidCI6IjZmMGU5YzQyLTk2Y2UtNDU1MS05NzAxLWJhMzFkMGQ2ZDE5ZSJ9&pageName=ReportSection1c3fdc161d4008c845a6", "https://www.gospanews.net/en/2022/06/23/covid-jabs-increase-risk-of-infection-according-to-new-england-journal-of-medicine/", "https://twitter.com/shmuelcshapira/status/1548215766654148608", "https://www.gospanews.net/en/2022/06/23/covid-jabs-increase-risk-of-infection-according-to-new-england-journal-of-medicine/", "https://twitter.com/shmuelcshapira/status/1549029219937787905", "https://twitter.com/shmuelcshapira/status/1552607961024962560", "https://openvaers.com/covid-data", "https://twitter.com/shmuelcshapira/status/1553979369504342018", "https://freebeacon.com/biden-administration/how-the-cdc-coordinated-with-big-tech-to-censor-americans/"], "authors": [""], "publish_date": "August 7, 2022"}