{"result_id": "333017", "URL": "https://www.veteranstoday.com/2022/12/06/serious-injuries-and-deaths-due-to-vaccines-adverse-reactions-italian-judge-urged-rome-prosecutor-to-investigate/", "timestamp": "2023-04-25 17:54:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/12/06/serious-injuries-and-deaths-due-to-vaccines-adverse-reactions-italian-judge-urged-rome-prosecutor-to-investigate/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Serious Injuries and Deaths due to Vaccines’ Adverse Reactions: Italian Judge urged Rome Prosecutor to Investigate | VT Foreign Policy", "cleaned_text": "All the linked articles in Italian are available in simultaneous machine translation in English\n\nSome months ago a German association of judges and lawyers issued a sentence of moral and legal condemnation of the anti-Covid vaccines and above all the mandatory rules to impose them.\n\nTheir judgment was expressed in a letter to the Bundestag (German parliament) to block the law on mandatory vaccines for all over 60s and obtained the desired result. The bill, supported by the three-party coalition of Scholz’s government, was rejected by 378 deputies, with only 296 in support and 9 abstaining.\n\n«The statement shows that the compulsory vaccination planned in the above-mentioned draft laws or in the application – be it general or in reserve or limited to certain age groups – is not compatible with the Basic Law and binding international law. In the case of the violation of the Basic Law, the focus of the presentation is placed on a problem that has received little attention up to now, namely the fact that the state deliberately kills people with a vaccination requirement – albeit in small numbers in relation to the total number of vaccinations. This is incompatible with the basic law’s guarantee of human dignity (I.). In the area of international law, violations of the European Convention on Human Rights and the International Covenant on Civil and Political Rights are shown (II.)».\n\nThis was written by KRiStA – Network Critical Judges and Public Prosecutors e.V. and reported in a previous Gospa News article (in Italian only but with machine translation in English available).\n\nNow the mortal danger of experimental gene serums based on messenger RNA (or DNA) is highlighted in a “historical” sentence by an Italian judge who, in relation to any crimes of criminal relevance, has sent the documents to the judiciary, specifically to the Public Prosecutor’s Office of Rome.\n\nDr. Susanna Zanda, ordinary judge of the Civil Court of Florence, has become very famous among human rights organizations who fought against the mandatory Green Passes to access to work and the vaccination obligation imposed by the Italian government on many professional and social categories (health and school workers, law enforcement, armed forces, rescue volunteers, over 50).\n\nIn fact, in July, accepting the appeal of a psychologist who had been suspended from activity by her professional order because she was not vaccinated, she confirmed two revolutionary theses: there is no proof that anti-Covid vaccines avoid infecting other people with whom you can meet at work; gene serums against Covid are dangerous because they are experimental and among the many adverse reactions they can also alter human DNA.\n\nThat pronouncement of hers was the subject of debate in the Italian media for weeks. I myself, as a journalist, was called to comment on it on Radio24, the broadcaster of the economic newspaper Il Sole 24Ore owned by the confederation of industrialists, because I had previously published a scientific study which supported this thesis.\n\nThe Cologne geneticist Walter Doerfler indeed had stated: «The currently administered vaccines depend on adenovirus DNA vectors or on SARS-CoV-2 mRNA that might become reverse transcribed into DNA, however infrequently. These mechanisms of basic biology have to be considered in the context of mass vaccination programs of humans around the globe. Whether and how these mechanisms will play a predominant role in medicine in the future will have to be followed by critical meta-analyses».\n\n«There is at present no viable alternative to the vaccination of billions of humans. The human population presently partakes in the exposure to foreign DNA in a huge experiment. After the completion of worldwide vaccinations, a post-vaccination sentinel program should be set up to monitor the exacerbation of unexpected, possibly novel, human ailments in vaccinated individuals» the geneticist added.\n\nSo the German scientist admitted that all the people of the world would become human guinea pigs (unpaid – ed) for the new experimental gene serums that many doctors believe are more dangerous and less effective than anti-Covid home treatments, ignored by the health authorities to favor the Big Pharma business with increasingly evident complicity pointed out by journalistic and judicial investigations.\n\nIn fact, it should be remembered that the President of the EU Commission Ursula von Der Leyen is at the center of an investigation by the European Public Prosecutor’s Office for the suspicious and secret purchase of over a billion doses of the Comirnaty vaccine produced by the German pharmaceutical company Biontech with the New York company Pfizer.\n\nWhile Politico’s investigative reporters found that Bill Gates’ NGOs, including the famed Gavi Alliance, spent $8.3 million lobbying politicians and public officials in the European Union and the United States.\n\nThe risk that vaccines could cause irreversible alteration of human DNA has also been highlighted in research published by the famous American biophysicist Stephanie Seneff, Ph.D., a senior scientist for over five decades at Mit, Massachusetts Institute of Technology in Cambridge, US.\n\nTHE PSYCHOLOGIST WITHOUT VACCINATION MUST RESUME WORKING\n\nFor all these reasons, the sentence of the Court of Florence on the dangers deriving from the anti-Covid vaccines is a milestone in the challenge for the search for the truth.\n\nAnd its report to the Public Prosecutor’s Office of Rome for injuries es and deaths resulting from adverse reactions to gene serums is a very courageous act that assumes international importance.\n\nIn the decree of last October 31, the same Florentine magistrate rejected the appeal of the Order of Psychologists and reconfirmed the decree of July 6, 2022 with which he “ordered that the psychologist resume working in any way without differences from vaccinated colleagues, arranging the prohibition of discrimination”.\n\nFor the sake of brevity, we summarize in a nutshell the technical reasons for the sentence with which Judge Zanza annulled the suspension from work (all the essential parts are readable in the original article in Italian with automatic translation in English).\n\nThe sentence was based on article 3 of the Nice Charter which refers to the Oviedo Convention of the Council of Europe on human rights and biomedicine in which the principle of free informed consent is recognized.\n\nThe judge notes in this regard:\n\n«Therefore, from reading these sources of primary rank, which are not incompatible but rather consistent with the provisions of the Italian Constitution, the conclusion can be drawn that the decree law 44/21 and subsequent conversion law, as well as the decree law 172/21 and law of subsequent conversion, are in conflict with the Charter of Nice, because although the health professionals in whose category Dr. M. (the plaintiff – ed) falls are not physically forced to vaccinate, there is still the “coercion” factor incompatible with the freedom of treatment in the field doctor; in fact, by not getting vaccinated they suffer the unquestionably serious and negative consequence of being suspended from the Orders to which they belong, leaving the world of work without a real reason, despite being healthy, and for periods that have been exceptionally long given the extensions applied, not being able to support themselves and practice the profession, expressive of intangible personal freedoms (Articles 2 and 13 of the Constitution)».\n\n«The second reason for conflict with the Charter of Nice lies in the fact that these vaccination treatments imposed by ordinary Italian laws are experimental and their effects are not known, because they were authorized on the basis of European regulation n. 507/2006, i.e. in a conditioned form, without adequate and complete studies of efficacy and safety, and have not been tested for the prevention of the virus but only of the disease»\n\nThe decree of the Court of Florence therefore cites as reliable sources the scientific studies highlighted by the psychologist in her appeal, which correspond to those on the risks of adverse reactions to vaccines largely published in recent months by Gospa News.\n\nAmong these is the «study by Thomas Jefferson University conducted on laboratory guinea pigs and which highlighted the stable deregulation of the human genome on guinea pigs, transmissible to offspring».\n\nAnd the the «Swedish one from Lund University, Malmo, Sweden published on 2.25.22, in Current Issues Molecular Biology which exposes the in vitro study performed however on human liver cells, signaling the alarming fact that with the RNA of the Pfizer Biontech covid 19 vaccines has a reverse transcriptase, with therefore negative efficacy of the MNRA vaccines, which could imply, if confirmed in vivo, a greater exposure of the vaccinated to risks of infections and tumor neoformations».\n\n«There is therefore the danger signaled by independent university researchers from various states, of an alteration of the codes of life, prohibited by the aforementioned international standards, and which could permanently expose the vaccinated person to the inability to give an effective adaptive immune response not only for Covid 19, but also for other pathogens and for the same physiological formation of cancer cells» the judge wrote recalling the study in New Medical life Science dated 10.5.2021.\n\nThe psychologist «refusal of this vaccine treatment is therefore motivated because no European citizen can be forced into experimental pharmacological treatments, especially when, as in this case, there was scientific evidence on the efficacy of anti-inflammatories from the early stages of the disease».\n\nThe judge Zanda then highlights two fundamental points of the vaccination campaign: she notes the ascertained ineffectiveness of gene serums in protecting against contagion and the servile media propaganda on it.\n\n«The premise contained in the laws in question, in order to give a justification to the unequal treatment of health professionals, i.e. the prevention of infections, has turned out to be weak, because infections have never been prevented by vaccination treatment, and this has never been tested and affirmed by the manufacturers, who, however, have recommended them in multiple doses and boosters (see doc. on therapeutic indications); doubts therefore also arise about the correctness in the pharmacological characterization of these serums, whose denomination of “vaccine” could have been misleading in the manifestation of the consent of the inoculated, in addition to the lack of scientific information pluralism of the media, to which they were also obliged according to the art.6 of the code of ethics for journalists updated to 2021 (the studies mentioned above, in fact, are not commented on by the majority of TV and press journalists)».\n\n«In conclusion, the suspension provision annotated and then approved by the Order with which Dr. M. is suspended from the register until she is vaccinated, is in contrast with the Charter of Nice in Articles 1, 3 and also 21 because Dr. M. is discriminated against for her personal opinions, for exercising her freedom of choice in the medical field, as she cannot express herself in the working world and cannot support herself, despite being in the same condition as vaccinated colleagues, who can be infected despite the experimental sera not having immunizing efficacy».\n\nAVERSE EVENTS AND DEATHS SHOULD BE INVESTIGATE BY ROME PROSECUTOR\n\n«Just as, therefore, the unvaccinated person will be able to move freely within the Union and take means of transport without limitations like those who have been vaccinated, similarly they will be able to have free access to face-to-face work, like those who are vaccinated, without the possibility of discrimination which are to be considered completely unjustified, in the case of choosing not to get vaccinated».\n\nThe judge «having regard to art. 361 criminal code send this provision to the Public Prosecutor’s Office of Rome as far as possible».\n\nFor this reason: «The unheard-of decree already issued must therefore be confirmed, by sending the documents to the Rome Public Prosecutor’s Office for the adverse events and deaths and the numerous critical issues highlighted and for the fact that the vaccination campaign continues and has recently even been extended to newborns from six months up, without any experimentation».\n\nBut the international scientific community, completely conditioned on health and vaccination policies by powerful gurus of the New World Order such as Bill Gates and the Rockefeller Foundation, has remained totally deaf the judge’s sentence and the quoted researches, as to many others perhaps even more disturbing.", "opengraph": {}, "tags": ["adverse reactions", "Covid Vaccine", "Pfizer/BioNTech COVID-19 vaccine", "#sars-cov-2 manmade", "Italy", "SARS-CoV-2", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/2022/05/12/giudici-tedeschi-vaccini-anti-covid-omicidi-di-stato-draghi-li-dona-al-piano-covax-di-gates-e2-miliardi-di-costi-per-gli-italiani/", "https://www.gospanews.net/2022/05/12/giudici-tedeschi-vaccini-anti-covid-omicidi-di-stato-draghi-li-dona-al-piano-covax-di-gates-e2-miliardi-di-costi-per-gli-italiani/", "https://www.gospanews.net/en/2020/03/20/bio-weapon-coronavirus-prophecy-on-pandemic-and-nwo-by-cias-queen-of-obama-biden/", "https://www.gospanews.net/2022/07/13/vaccini-anti-covid-alterano-il-dna-giudice-italiano-conferma-2-ricerche-scientifiche-anticipate-da-gospa-news/", "https://www.gospanews.net/2022/07/13/vaccini-anti-covid-alterano-il-dna-giudice-italiano-conferma-2-ricerche-scientifiche-anticipate-da-gospa-news/", "https://www.gospanews.net/2021/10/14/sars-cov-2-e-vaccini-modificano-il-dna-umano-enorme-esperimento-sulla-popolazione-studio-incubo-di-genetista-tedesco-su-science-direct/", "https://www.gospanews.net/2021/10/14/sars-cov-2-e-vaccini-modificano-il-dna-umano-enorme-esperimento-sulla-popolazione-studio-incubo-di-genetista-tedesco-su-science-direct/", "https://www.gospanews.net/en/2022/10/18/european-prosecutors-eppo-investigating-eu-vaccine-deal-after-chat-between-von-der-leyen-and-pfizers-ceo-an-gates-ngo-lobbying/", "https://www.gospanews.net/en/2021/08/27/ignored-therapy-anti-sars-drug-financed-by-eu-not-used-in-covid-pandemic-splitting-complaint-by-italian-biologist-and-lawyer/", "https://www.gospanews.net/en/2022/10/18/european-prosecutors-eppo-investigating-eu-vaccine-deal-after-chat-between-von-der-leyen-and-pfizers-ceo-an-gates-ngo-lobbying/", "https://www.gospanews.net/en/2022/09/23/wuhang-gates-54-how-bill-iii-vaccines-emperor-alongside-his-ngo-lobbied-us-eu-politicians-with-8-3-million/", "https://www.gospanews.net/en/2022/09/23/wuhang-gates-54-how-bill-iii-vaccines-emperor-alongside-his-ngo-lobbied-us-eu-politicians-with-8-3-million/", "https://www.gospanews.net/2022/06/15/vaccini-covid-studio-terrificante-dal-mit-di-cambridge-alterazione-dna-non-vaccinati-a-rischio-contagio-da-spike-tossica-dei-sieri-mrna/", "https://www.gospanews.net/2022/06/15/vaccini-covid-studio-terrificante-dal-mit-di-cambridge-alterazione-dna-non-vaccinati-a-rischio-contagio-da-spike-tossica-dei-sieri-mrna/", "https://www.gospanews.net/en/2022/11/18/48817-dead-and-5107883-injured-following-covid-19-vaccines-in-european-database-of-adverse-reactions/", "https://www.gospanews.net/en/2022/11/18/48817-dead-and-5107883-injured-following-covid-19-vaccines-in-european-database-of-adverse-reactions/", "https://www.gospanews.net/2022/11/23/sentenza-bomba-morti-dopo-i-vaccini-tribunale-manda-gli-atti-in-procura-per-rischi-di-tumori-e-danni-al-sistema-immunitario/", "https://www.gospanews.net/en/2021/08/27/ignored-therapy-anti-sars-drug-financed-by-eu-not-used-in-covid-pandemic-splitting-complaint-by-italian-biologist-and-lawyer/", "https://www.gospanews.net/en/2021/04/01/nwo-against-italy-xfile-6-mandatory-vaccines-for-health-workers-dictated-by-minister-close-to-soros/", "https://www.gospanews.net/en/2021/04/01/nwo-against-italy-xfile-6-mandatory-vaccines-for-health-workers-dictated-by-minister-close-to-soros/", "https://www.gospanews.net/en/2022/11/01/british-medical-journals-bomb-us-fda-hides-data-on-serious-adverse-events-after-covid-vaccines/", "https://www.gospanews.net/en/2022/09/17/inflammatory-nanoparticles-of-mrna-vaccine-change-the-immune-system-in-sons-too-warning-by-a-thomas-jefferson-university-study/", "https://www.gospanews.net/en/2022/09/17/inflammatory-nanoparticles-of-mrna-vaccine-change-the-immune-system-in-sons-too-warning-by-a-thomas-jefferson-university-study/", "https://www.gospanews.net/en/2022/11/30/the-study-that-changed-covid-vaccines-history-pfizer-mrna-serum-fast-enter-in-cells-through-liver-and-can-alter-human-dna/", "https://www.gospanews.net/en/2022/11/30/the-study-that-changed-covid-vaccines-history-pfizer-mrna-serum-fast-enter-in-cells-through-liver-and-can-alter-human-dna/", "https://www.gospanews.net/en/2022/11/20/the-covid-jabs-mechanisms-of-injury-sudden-death-blood-cloths-autoimmune-and-human-mad-cow-disease/", "https://www.gospanews.net/2022/09/08/migliaia-di-morti-covid-per-tachipirina-e-vigile-attesa-la-virologa-gismondo-contro-il-procollo-speranza-sulla-pandemia/", "https://www.gospanews.net/en/2022/11/01/british-medical-journals-bomb-us-fda-hides-data-on-serious-adverse-events-after-covid-vaccines/", "https://www.gospanews.net/en/2022/10/13/covid-the-huge-lie-pfizer-director-admits-vaccine-was-never-tested-on-preventing-transmission-during-eu-hearing/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2022/11/20/the-covid-jabs-mechanisms-of-injury-sudden-death-blood-cloths-autoimmune-and-human-mad-cow-disease/", "https://www.gospanews.net/en/2022/10/13/covid-the-huge-lie-pfizer-director-admits-vaccine-was-never-tested-on-preventing-transmission-during-eu-hearing/", "https://www.gospanews.net/en/2022/07/13/pfizer-crimes-against-our-children-cardiac-arrest-of-two-month-old-baby-an-hour-after-experimental-vaccine/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2022/07/13/pfizer-crimes-against-our-children-cardiac-arrest-of-two-month-old-baby-an-hour-after-experimental-vaccine/", "https://www.gospanews.net/en/2021/11/19/exclusive-pfizer-paper-confirmed-genetic-experiments-on-5yo-kids-myocarditis-risks-by-vaccines-little-data-well-study-after-fda-authorization/", "https://www.gospanews.net/2022/11/21/wuhang-gates-62-vaccini-doro-sars-cov-2-da-laboratorio-complotto-nwo-gates-cia-nel-covo-dei-rockefeller-a-bellagio/", "https://www.gospanews.net/en/2022/11/10/covid-update-logic-reasoning-and-scientific-evidence-disappeared-us-retired-neurosurgeon-on-pubmed-blames-fauci-gates-dangerous-vaccines/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/corona-virus/", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.gospanews.net/2022/11/23/sentenza-bomba-morti-dopo-i-vaccini-tribunale-manda-gli-atti-in-procura-per-rischi-di-tumori-e-danni-al-sistema-immunitario/", "https://www.gospanews.net/2022/11/21/wuhang-gates-62-vaccini-doro-sars-cov-2-da-laboratorio-complotto-nwo-gates-cia-nel-covo-dei-rockefeller-a-bellagio/", "https://www.gospanews.net/en/2022/11/10/covid-update-logic-reasoning-and-scientific-evidence-disappeared-us-retired-neurosurgeon-on-pubmed-blames-fauci-gates-dangerous-vaccines/", "https://www.gospanews.net/en/2022/11/27/wuhan-gates-59-sars-lab-experiments-enhanced-with-gof-without-risk-assessment-stop-them-alert-by-5-us-senators-russia-blames-last-boston-research/", "https://www.gospanews.net/2022/09/08/migliaia-di-morti-covid-per-tachipirina-e-vigile-attesa-la-virologa-gismondo-contro-il-procollo-speranza-sulla-pandemia/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2021/11/19/exclusive-pfizer-paper-confirmed-genetic-experiments-on-5yo-kids-myocarditis-risks-by-vaccines-little-data-well-study-after-fda-authorization/", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/"], "authors": [""], "publish_date": "December 6, 2022"}