{"result_id": "333021", "URL": "https://www.veteranstoday.com/2021/04/07/nwos-plot-against-italy-xfile-6-mandatory-vaccines-for-health-workers-dictated-by-minister-close-to-soros/", "timestamp": "2023-04-25 17:54:12 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2021/04/07/nwos-plot-against-italy-xfile-6-mandatory-vaccines-for-health-workers-dictated-by-minister-close-to-soros/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "NWO’s Plot against Italy (XFile 6). Mandatory Vaccines for Health Workers Dictated by Minister close to Soros | VT Foreign Policy", "cleaned_text": "In the photo, in the center, the Minister of Grace and Justice of the Draghi Government, Marta Cartabia, former judge of the Italian Constitutional Court, in the middle of the past Republic President Napolitano (left above), the current President Mattarella (left below), the plutarch Soros (right above) and the current Italian PM Draghi (right below).\n\n\n\nWe were about to publish the dossier n. 6 of the “NWO against Italy” cycle but someone almost stole the investigation from us. He is not a counter-information reporter investigating the New World Order plots behind the SARS-Cov-2 pandemic but a politician enriched by globalism. It is the Italian Prime Minister Mario Draghi who on Friday 26 March, from Palazzo Chigi (PM seat), held a long press conference at the end of which he revealed who would help him to make vaccines mandatory, for now only for some categories: health workers.\n\nThe news was reported with emphasis by serving agencies and newspapers that now possessed by the idolatrous fanaticism of anti-Covid serums explained the government’s reasons: to prevent unvaccinated nurses and doctors from coming into contact with the sick.\n\nThis will come at the cost of inoculating them with still experimental vaccines of which many experts have denounced the health risks both for those with messenger RNA (Pfizer and Moderna) and for those with AstraZeneca chimpanzee Adenovirus vector. The Anglo-Dutch pharmaceutical company from Cambridge, after suspensions in Europe and Canada for mysterious deaths, was forced to change its name in order to include rare cases of thrombosis among the undesirable effects of the package leaflet. Some of which were also fatal, as ascertained in Germany where a suspected correlation between the drug and 31 new deaths was identified, such as to impose a stop to the administration for the under 60s, while the Italian doctors of the health facilities continue to deny any causal link also in vaccinated young people who died of sudden cerebral haemorrhages …\n\nPM Draghi announced who would have the task of studying a coercive diktat worthy of the Chinese Communist Party in order not to go back too far in the memory to the Nazi pharmacological impositions such as to evoke a Nuremberg 2, in reference to the famous trial of SS officers.\n\nDuring a curtain that seemed to be artfully constructed with a journalist from the newspaper Il Riformista (owned by the entrepreneur Alfredo Romeo arrested and on trial in Naples for alleged bribes in the Consip healthcare contracts) Dicastery of Grace and Justice, was working on the decree on the obligation to vaccinate health personnel.\n\nBut she claimed to ignore what the journalist recalled about the role of Cartabia itself as a judge of the Constitutional Court which, as drafter, confirmed the legitimacy of the Lorenzin Decree of the 12 compulsory vaccines for school-age children. “I did not know – declared the premier even too bewildered – But this accelerates the measure even more, which I imagine will be a decree. You won’t need to read a lot… ».\n\nThe Italian Council of Ministers of March 31, together with the extension of the lockdown until April 30, then effectively prepared an ad hoc decree which provides for the following: “anyone who works in a health facility, doctors, nurses, social and health workers, pharmacists, employees also administrative staff of Rsa (Residences for the elderly) and private offices will have to get vaccinated. For those who refuse, their salary will be suspended for a time appropriate to the progress of the pandemic. When mass immunization is achieved or there is a significant decline in the spread of the virus, the sanction would be lifted. The suspension will last until 31 December 2021 at the latest. A ‘criminal shield’ is also provided for administrators who follow the rules, limiting the punishment only to cases of gross negligence.\n\nTherefore, what was feared by the magistrate Angelo Giorgianni who as Secretary General of the World Life Organization (OMV) and president of the Heretical association had correlated the lockdowns, based on tampons deemed unreliable as confirmed by the very high number of Covid-19 positive asymptomatics, and the imposition of vaccines, as part of his complaint for crimes against humanity to the International Criminal Court of The Hague.\n\n“Declaring lockdowns and all related measures a crime against humanity will also serve to prevent governments from introducing forced vaccination, either directly or indirectly, through the implementation of vaccination passports or similar certificates aimed at limiting the fundamental freedoms of those who decide not to get vaccinated against covid-19, given the low lethality of the disease, the experimental nature of the vaccines themselves or for any other personal reason. The Council of Europe has already issued a resolution against any form of vaccination obligation. However, several European governments, including the Italian one, are evaluating the idea of ​​vaccine passports to travel freely on the continent, “reports the complaint to the Attorney General of the Dutch Court filed on Wednesday 24 March 2021.\n\n“Furthermore, the political and public discourse on vaccines is marked by a violent stigmatization of those who refuse the injection. All this suggests a future scenario of possible persecution or exclusion from public life of the unvaccinated. History teaches that passports or identity cards that discriminate the “good” from the “bad” and the public ostracism of the “bad” ones can herald enormous atrocities” Giorgianni highlighted, demonstrating farsightedness on the issue.\n\nAccording to some rumors, the magistrate’s organization is working on a further act to challenge the legitimacy of the vaccination obligation imposed on health professionals for anti-Covid serums that have been authorized by international and national drug agencies only on a completely experimental basis. It should be remembered, unlike the 12 vaccines imposed on children in 2017 by the Lorenzin Decree for the US-funded pilot project of the Obama-Biden administration of the American Dems in agreement with the leaders of the Italian Democratic Party (Matteo Renzi first and Paolo Gentiloni later) in the ‘scope of the Global Health Security Agenda.\n\nIt would be dispersive to discuss in the jurisprudential field on the fact that the “demotion” of No-Vax health workers, many of whom are refractory to unification not by ideological choice but by perplexity about these new vaccines against the pandemic virus and the risk-benefit ratio for a disease that is now treated with Cortisone, whether or not it represents an imposition, given that the sanction of the suspension of the salary is triggered only in the event that another role for the employee cannot be identified. We will therefore talk about it on other occasions.\n\nToday I am anxious to see why the vaccination obligation, which could extend in the future to any public and social category as already happened in the Vatican State, does not need constitutional legitimation because, as if we were faced with a health plot planned for years as claimed by attorney Robert F. Kennedy (son of the US Attorney General of the same name and nephew of President JFK, both murdered in the shadow of the Deep State), it has in fact already been written in a sentence of the Constitutional Court of January 2018 in which , pursuant to article 32 of the Charter, the right of the Italian State to impose compulsory immunization on its subjects against a simple decree-law had already been established.\n\nTo write it was a judge of the Consulta (another name of Constitutional Court in Italy) appointed by the former president of the Republic Giorgio Napolitano who after the drafting of that sentence was elevated to president of the same Constitutional Court during the presidency of Sergio Mattarella, in perfect continuity in the shadow of two heads of state matured politically in the Democratic Party.\n\nThis is precisely the illustrious professor Marta Cartabia who became a professor at the famous Bocconi University of Milan in September 2020, at the end of her nine-year term in the Consulta, already engaged in academic initiatives and European agencies supported by the plutarch most loved by the Democrats of the Old and the New Continent: the financial speculator and self-styled human rights philanthropist George Soros.\n\nINTRIGUES AMONG POLITICS, WHO, EU AND BIG PHARMA\n\nObviously this is just another curious coincidence in the marshy maze of intrigues between politics, international immunization plans and vaccine-producing Big Pharma.\n\nBy virtue of his high academic and juristic stature it would be exaggerated to suspect that the then judge Catarbia had been conditioned even only psychologically by his mentor Napolitano in drafting the sentence with which he rejected the appeal for constitutional illegitimacy of the so-called Lorenzin Decree which in 2017 had imposed the 12 compulsory vaccines in school age during the government of Paolo Gentiloni (and from parliament thanks to the votes of the majority party PD) right after a visit by Soros to Palazzo Chigi, seat of the Presidency of the Council of Ministers, flaunted by the premier himself amid vibrant controversies on media and social.\n\nBefore seeing in detail this curious sequence of episodes, partly already narrated in the previous WuhanGates 10, 26 and 28 reportages, it is necessary to note how prodigiously useful the previous sentence of the Consulta to the rulers of the Democratic Party that from 2014 to 2018, as in the February 2020, they would have been unable to even prepare a pandemic emergency plan. The conditional is mandatory only because it will be up to the judiciary to rule on the matter.\n\nToday, in fact, they must trust in the silence imposed by the WHO on its officials through diplomatic immunity in order to hope to get away with it in front of the Bergamo Public Prosecutor’s Office, which investigates a culpable and false epidemic without the many reverential prudence with which the investigation continues. ‘current Prime Minister Giuseppe Conte (and some ministers including Roberto Speranza, reconfirmed as head of the Health Department at the suggestion of Mattarella) of the Roman judiciary, already intending to dismiss the case despite the perplexities expressed by the acrimonious Judge of the Preliminary Investigations.\n\nIt is no coincidence that I mention these judicial investigations because during the same, Dr. Raniero Guerra was questioned as a person informed on the facts (and therefore not as a suspect), who went from being an official of the Ministry of Health in Rome to assistant to the WHO Director General in Geneva in a short time a few years after his post as health ambassador in New York during Matteo Renzi’s PD government, when in 2014 he defined together with the then minister Beatrice Lorenzin the pilot project for 12 compulsory school-age vaccines supported by the Global Health Security Agenda of Barack Obama in an agreement between the Italian and American Dems.\n\nNot only did Dr. Guerra, as a WHO executive, ask a Venetian researcher from the UN health agency to cover up a dossier in which it was revealed that the Ministry of Health for which he had worked had never prepared an updated national pandemic plan, but his role was the subject of a Codacons complaint to the National Anti-Corruption Authority (ANAC) because, as revealed in WuhanGates 28, it was considered an embarrassing link with Big Pharma GlaxoSmithKline (GSK) which then actually started making money on vaccines in Italy after the Lorenzin Decree, which made them mandatory, and the ruling of the Council, which considered the law in line with the provisions of the Constitutional Charter.\n\nTHE DOUBLE PRONUNCIATION OF THE CONSULTA\n\nThe Maxim no. 39686 of the Constitutional Court bears the following Title: “Vaccinations against the risk of infectious diseases for minors up to the age of 16 – Obligation – Provision of administrative pecuniary sanctions and the prohibition of access to educational services for children in the event of non-compliance – Appeal of the Veneto Region – Complained lack of conditions for the emergency decree – Non-existence – Unfounded issues». (read more…).", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.gospanews.net/2021/04/01/nwo-contro-litalia-5-il-ministro-dei-vaccini-obbligatori-ai-sanitari-ne-impose-12-ai-bimbi-da-giudice-allombra-di-napolitano-soros/", "https://www.gospanews.net/en/2021/03/23/mrna-vaccines-cancer-risks-wlo-crimes-against-humanity/", "https://www.gospanews.net/en/2021/03/23/mrna-vaccines-cancer-risks-wlo-crimes-against-humanity/", "https://www.gospanews.net/en/2021/03/30/vaccine-suspended-in-canada-too-astrazeneca-admitted-tombosiss-risks-so-changed-serums-name/", "https://www.gospanews.net/en/2021/03/30/vaccine-suspended-in-canada-too-astrazeneca-admitted-tombosiss-risks-so-changed-serums-name/", "https://www.worldlifeo.com/", "https://www.gospanews.net/en/2021/03/26/exclusive-eu-hard-lockdowns-are-crimes-against-humanity-italian-magistrates-complaint-to-hague-court/", "https://www.gospanews.net/en/2021/03/26/exclusive-eu-hard-lockdowns-are-crimes-against-humanity-italian-magistrates-complaint-to-hague-court/", "https://www.gospanews.net/en/2020/05/19/wuhan-gates-10-shady-plot-eu-summit-with-4-gates-ngo-big-pharma-fb-before-sars-2-built-with-hiv/", "https://www.gospanews.net/en/2020/05/19/wuhan-gates-10-shady-plot-eu-summit-with-4-gates-ngo-big-pharma-fb-before-sars-2-built-with-hiv/", "https://www.gospanews.net/en/2020/05/19/wuhan-gates-10-shady-plot-eu-summit-with-4-gates-ngo-big-pharma-fb-before-sars-2-built-with-hiv/", "https://www.gospanews.net/en/2020/12/17/consumers-association-asked-arrest-for-who-italian-boss-tied-with-gates-vaccines-gsk-obama/", "https://www.gospanews.net/en/2020/12/22/pandemic-massacre-in-italy-who-concealed-truth-inviting-physicians-to-refuse-deposition-before-magistrates/", "https://www.gospanews.net/en/2020/12/22/pandemic-massacre-in-italy-who-concealed-truth-inviting-physicians-to-refuse-deposition-before-magistrates/", "https://www.gospanews.net/en/2020/12/17/consumers-association-asked-arrest-for-who-italian-boss-tied-with-gates-vaccines-gsk-obama/", "https://www.gospanews.net/en/2020/12/17/consumers-association-asked-arrest-for-who-italian-boss-tied-with-gates-vaccines-gsk-obama/", "http://www.gospanews.net/2021/04/01/nwo-contro-litalia-5-il-ministro-dei-vaccini-obbligatori-ai-sanitari-ne-impose-12-ai-bimbi-da-giudice-allombra-di-napolitano-soros/", "http://www.gospanews.net/2021/04/01/nwo-contro-litalia-5-il-ministro-dei-vaccini-obbligatori-ai-sanitari-ne-impose-12-ai-bimbi-da-giudice-allombra-di-napolitano-soros/"], "authors": [""], "publish_date": "April 7, 2021"}