{"result_id": "333022", "URL": "https://www.veteranstoday.com/2022/11/13/the-oligarchs-are-losing-the-covid-jab-war/", "timestamp": "2023-04-25 17:54:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/11/13/the-oligarchs-are-losing-the-covid-jab-war/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "The Oligarchs are losing the covid jab war | VT Foreign Policy", "cleaned_text": "The statistics in the Vaccine Adverse Event Reporting System (VAERS) on MedAlerts, which has been operating since 2003 … has logged in over 1.4 million adverse events associated with the COVID-19 shots and over 30,000 deaths. About 15,000 of those death reports are from the United States, because the VAER system also accepts reports from foreign countries that use U.S. vaccines.\n\nWhile the harms are undeniable, based on the statistics, health authorities are still doing what they can to deny the risks associated with the COVID shots. For example, the U.S. Centers for Disease Control and Prevention fought for 15 months to avoid releasing V-Safe data.1,2 They eventually lost the fight and the data confirm what we’re seeing in VAERS.\n\nThe U.S. Food and Drug Administration is also refusing to release autopsy reports,3 even though those reports can be de-identified. They also will not release de-identified information on myocarditis, which is strongly associated with the COVID shots.\n\nObedient Self-Sacrifice Is the New Virtue\n\nFisher cites The Lancet Commission’s report on “Lessons for the Future of the COVID-19 Pandemic,”4 and an accompanying editorial, “COVID-19: The Case for Prosociality,”5 both of which are published in the October 8, 2022, issue of The Lancet. The Commission’s report politicizes the COVID pandemic response and both it and the editorial try to make a case for what the authors call “prosociality.”\n\nSurveys now show trust in public health officials is on the decline, which should come as no surprise considering how they’ve flip-flopped on their policies and denied easily provable facts. One of the biggest lies perpetuated was that the COVID shots would prevent infection and transmission.\n\nEverybody assumed this was the case, as all other vaccines have been promoted as a way to prevent infection and transmission. Only those who actually read the FDA briefing document issued at the very beginning, like Fisher and I did, saw that manufacturers were only required to prove a 50% efficacy in preventing severe COVID disease — not in preventing infection and transmission.\n\n“Only if you looked at that would you realize, from the get-go, that they knew the vaccines were not going to prevent infection and transmission,” Fisher says.\n\nThey never tested it, and without testing, no claims can be made whatsoever. And yet that’s what they did. They claimed the shots would stop COVID, that you wouldn’t get sick or spread it to others. This was the sole premise behind the vaccine passports. Vaccination was supposed to be a way to make you “safe” to be around. They pushed this lie for all it was worth, knowing they didn’t have a scientific leg to stand on.\n\nAnother way by which health authorities deceived the public into thinking the shots would work like a traditional vaccine was by changing the very definition of a vaccine. No longer is a “vaccine” something that actually prevents infection and transmission of disease. Rather, it’s now defined as something that triggers an “immune response,” which may or may not prevent disease.\n\nClearly, they knew what they were doing and they developed a strategy to deceive the public in a variety of different ways.\n\nThey also misled people into thinking the shots were far more effective than they were by conflating relative and absolute risk. While the relative risk reduction was around 95%, the absolute risk reduction was below 1%.6 As noted by Fisher, the idea of vaccine-induced herd immunity is also terribly flawed, and we’ve certainly seen that with the COVID shots.\n\nThe U.S. is one of the few countries in the world that has pushed these lethal and completely useless COVID shots on young children. Fortunately, uptake in this age group has been low. As of July 20, 2022, only 2.8% of children under 5 had received at least one dose.7\n\nThat may soon change, however, as the CDC’s Advisory Committee on Immunization Practices (ACIP) unanimously voted, October 20, 2022, to add the COVID shot to the recommended CDC’s vaccination schedules for both children and adults.8\n\nThe day before that, October 19, ACIP also recommended the shots become part of the CDC’s Vaccines for Children Program (VFC),9 a federal entitlement program that pays for vaccines for children who don’t have insurance. So, clearly, the FDA and CDC have no intention of coming clean about the dangers of these shots.\n\nThey may have miscalculated their ability to keep people brainwashed, however. Fisher estimates that about half of the American population now question vaccination, and not just the COVID shots. The distrust is also spilling over into other vaccines.\n\nThe truth would be even more widespread were it not for Big Tech censoring public conversations about COVID and COVID shots that criticize government public health policies and laws. Yes, it’s illegal and unconstitutional for government officials to violate freedom of speech and censor by proxy, using private companies to do their dirty work, but they’re doing it anyway. Fisher continues:\n\nAround the World People Are Standing Up for Health Freedom\n\nBut despite the heavy-handed censorship, people around the world are still waking up to what’s happening. More and more people are starting to realize that the COVID pandemic wasn’t so much about responding to infectious disease as it was about manipulating people into accepting a new world order.\n\nThis update is not all doom and gloom, however. Fisher also brings some good news. Throughout the pandemic, the NVIC has been instrumental in alerting people about proposed COVID vaccine-related legislation in the U.S. — both good and bad — through the NVIC Advocacy Portal. When you sign up to the Portal, which is free, you receive information about vaccine-related bills moving in your state.\n\nOften NVIC issues position papers and talking points that you can use when speaking about proposed bills with your state legislators. Since NVIC launched the Advocacy Portal in 2010, their staff and volunteers have been working with families and educating state legislators about the need to protect informed consent rights in public health laws when it comes to vaccination.\n\nIn 2021, not a single state legislature successfully passed a COVID vaccine mandate. “That’s huge. I mean that’s really big considering how many other countries did it,” Fisher says.\n\nFor the 2022 legislative session, NVIC analyzed about 900 vaccine-related bills for the Portal, and the number of bills the NVIC supported were more than twice the number they opposed. That’s a record number of positive, freedom-affirming bills.\n\nThey included bills prohibiting COVID jab mandates for students, employees and patients. Some required exemptions to be available for employer COVID-19 vaccine mandates. Others prohibited discrimination over COVID-19 vaccination status.\n\nThe full “NVIC 2022 Annual Report on U.S. State Vaccine Legislation” will be published Thursday, November 17, 2022, on Mercola.com and NVIC.org during this Vaccine Awareness Week.\n\nSeveral of the negative bills the NVIC opposed this legislative session were bills allowing doctors to persuade minor children as young as 11 years old to give informed consent to vaccination without the knowledge or consent of their parents. Washington, D.C., was the only jurisdiction that managed to pass such a dangerous bill, which is another good sign.", "opengraph": {}, "tags": ["Scientists", "United States", "COVID-19", "lockdown"], "tweets": [], "movies": [], "links": ["https://takecontrol.substack.com/p/cdc-data", "https://takecontrol.substack.com/p/missing-autopsies-of-post-covid-vaccine-deaths"], "authors": [""], "publish_date": "November 13, 2022"}