{"result_id": "333002", "URL": "https://www.veteranstoday.com/2023/01/02/budget-for-vaccine-injury-compensation-programs-set-to-jump-from-1-million-to-5-million-in-2023/", "timestamp": "2023-04-25 17:53:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/01/02/budget-for-vaccine-injury-compensation-programs-set-to-jump-from-1-million-to-5-million-in-2023/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Budget for Vaccine Injury Compensation Programs Set to Jump From $1 Million to $5 Million in 2023 | VT Foreign Policy", "cleaned_text": "A request contained within the bipartisan $1.7 trillion omnibus spending bill for a 15% funding increase for vaccine injuries raised questions among some lawmakers, Newsweek reported today.\n\nBut according to Wayne Rohde, an expert in vaccine injury compensation, the requested 15% increase is routine.\n\nWhat’s more interesting, Rohde told The Defender, is that the Health Resources and Services Administration (HRSA) budget for COVID- 19 vaccine injury compensation will increase in fiscal year 2023 — from approximately $1 million to $5 million — and its budget for staffing and contractors will jump from $5 million to $9.5 million.\n\nRohde, author of “The Vaccine Court 2.0,” co-founder of Vaccine Safety Council of Minnesota and Autism Advocacy Coalition of Minnesota, and national advisory member of Health Choice, said he learned of the increase through information he obtained under the Freedom of Information Act.\n\nHRSA, which operates under the U.S. Department of Health and Human Services, administers two vaccine injury compensation programs: the National Vaccine Injury Compensation Program (VICP) and the Countermeasures Injury Compensation Program (CICP).\n\nThe VICP is a special, no-fault tribunal housed within the U.S. Court of Federal Claims that handles injury claims for 16 common vaccines. To date, it has awarded more than $4 billion to thousands of people for vaccine injuries.\n\nThe VICP does not cover COVID-19 vaccine injuries — those are covered under the Countermeasures Injury Compensation Program (CICP), established under the Public Readiness and Emergency Preparedness (PREP) Act.\n\nHowever, the PREP Act is set to expire in March 2024, at which time COVID-19 vaccine injuries may be covered under the VICP.\n\nOnly about 8% of the people who applied to the CICP with vaccine injuries in the past have ever received payouts and there are no protections from the U.S. legal system.\n\nBetween 2010 and December 2022, 11,431 claims were filed with the CICP — 10,899 of those claims for injuries were for COVID-19 vaccine and countermeasures, including testing and treatment.\n\nOf the 10,899 COVID-19 countermeasure claims, 7,624 allege injuries/deaths from COVID-19 vaccines and 3,275 allege injuries/deaths from other COVID-19 countermeasures.\n\nNone of the 10,899 COVID-19 countermeasure claims has been fully compensated, according to Rohde, who said 10 of the claims were approved for compensation, but upon review were denied.\n\nRep. Dan Bishop (R-N.C.) called out the 15% funding increase contained in the spending bill, Newsweek reported.\n\n“Anticipating a 15% increase in vaccine injuries?” Bishop asked in a series of tweets critiquing the contents of the bill.\n\nBut according to Rohde, the 15% increase appropriated in the bill is not necessarily new money. Rohde said the spending bill provides $15.2 million for administrative expenses for the Vaccine Injury Compensation Program Trust Fund, which funds the VICP.\n\nEach year, Congress appropriates from the trust fund to pay for the administrative expenses of each of the three federal agencies involved with the VICP: HRSA, the U.S. Department of Justice (DOJ) Torts Branch and the federal court system where all petitions are litigated.\n\nEach year, those agencies request an increase in their budget for the upcoming year, Rohde said.\n\nAccording to the vaccine-injured, the VICP has failed miserably as a litigious, broken system that pits them against well-funded government programs, agencies and health officials.\n\nPayouts, including attorneys’ fees, are funded by a 75-cent tax per vaccine and there’s a $250,000 cap on pain and suffering. The proceedings are often turned into drawn-out, contentious expert battles and the backlog of cases is substantial.\n\nThe Senate is expected to vote first to approve the spending bill this week and then send it to the House for approval before government funding runs out on December 23. President Biden is expected to sign it.\n\nThe HRSA budget increase discovered by Rohde anticipates an increase in claims, but it does not come close to what would be necessary to compensate the vaccine-injured, Rohde told The Defender.\n\n“What we haven’t seen, and I’ve been looking for, is whether they are going to create a fund to pay for covid injuries,” he said. “There is no trust fund to pay for COVID-19 vaccine injuries like there is for traditional vaccines, there is no funding mechanism.”\n\nAccording to Rohde, the VICP is already understaffed and underfunded. He estimated that when the PREP Act expires, if COVID-19 vaccines are added to the VICP, they would need an additional appropriation of $30-40 million dollars just to cover the court costs — not including funding necessary for the DOJ and for HRSA.\n\n“This is a mess that is going to be interesting to figure out,” he said.\n\nAccording to the Centers for Disease Control and Prevention, 1,469,237 reports of adverse events following the COVID-19 vaccines were submitted between Dec. 14, 2020, and Dec. 9, 2022, to the Vaccine Adverse Event Reporting System (VAERS).", "opengraph": {}, "tags": ["Covid Vaccine", "United States government", "Diseases", "compensation"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/", "https://childrenshealthdefense.org/defender/truth-americas-vaccine-court/", "https://childrenshealthdefense.org/national-vaccine-injury-compensation-program/", "https://childrenshealthdefense.org/defender/workers-compensation-covid-vaccine-injury-victims/", "https://www.hrsa.gov/vaccine-compensation", "https://www.mctlaw.com/vaccine-injury/vaccinations/coronavirus-covid-19/", "https://childrenshealthdefense.org/defender_category/covid/", "https://childrenshealthdefense.org/defender/workers-compensation-covid-vaccine-injury-victims/", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://www.hrsa.gov/cicp/cicp-data", "https://www.hrsa.gov/cicp/cicp-data#table-1", "https://childrenshealthdefense.org/national-vaccine-injury-compensation-program/", "https://www.reuters.com/legal/government/black-hole-covid-vaccine-injury-claims-2021-06-29/", "https://www.cnn.com/2022/12/20/politics/spending-bill-congress-omnibus/index.html", "https://www.medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=CAT&EVENTS=ON&VAX=COVID19"], "authors": [""], "publish_date": "January 2, 2023"}