{"result_id": "333016", "URL": "https://www.veteranstoday.com/2022/09/23/bill-iii-virus-vaccines-emperor-lobbied-us-eu-govts-with-8-3-million-through-his-ngos/", "timestamp": "2023-04-25 17:54:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/09/23/bill-iii-virus-vaccines-emperor-lobbied-us-eu-govts-with-8-3-million-through-his-ngos/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "BILL III, Virus & Vaccines Emperor, Lobbied US-EU Govts with $8.3 Million Through His NGOs | VT Foreign Policy", "cleaned_text": "«While nations were still debating the seriousness of the pandemic, the groups identified potential vaccine makers and targeted investments in the development of tests, treatments and shots. And they used their clout with the World Health Organization to help create an ambitious worldwide distribution plan for the dissemination of those Covid tools to needy nations, though it would ultimately fail to live up to its original promises».\n\n«The four organizations had worked together in the past, and three of them shared a common history. The largest and most powerful was the Bill & Melinda Gates Foundation, one of the largest philanthropies in the world. Then there was Gavi, the global vaccine organization that Gates helped to found to inoculate people in low-income nations, and the Wellcome Trust, a British research foundation with a multibillion dollar endowment that had worked with the Gates Foundation in previous years. Finally, there was the Coalition for Epidemic Preparedness Innovations, or CEPI, the international vaccine research and development group that Gates and Wellcome both helped to create in 2017».\n\nThus begins the explosive investigation conducted by the American Politico together with the German Welt.\n\nJournalists have discovered that “Bill III, emperor of vaccines” – as we renamed when his Bill & Melinda Gates Foundation (which we will also quote BMGF for short) made a cartel agreement with all the Big Pharma involved in the Covid emergency – together with his partners spent a lot of money to convince the politicians of the United States of America and the European Union of the effectiveness of his immunization plan.\n\n«Civil society organizations active in poorer nations, including Doctors Without Borders, expressed discomfort with the notion that Western-dominated groups, staffed by elite teams of experts, would be helping guide life-and-death decisions affecting people in poorer nations. Those tensions only increased when the Gates Foundation opposed efforts to waive intellectual property rights, a move that critics saw as protecting the interests of pharmaceutical giants over people living poorer nations».\n\n«“What makes Bill Gates qualified to be giving advice and advising the U.S. government on where they should be putting the tremendous resources?” asked Kate Elder, senior vaccines policy adviser for the Doctors Without Borders’ Access Campaign».\n\nThe answer is simple. He is the main financier of the United Nations Organization, he has chosen as director of the WHO Tedros Adhanom Ghebreyesus, Ethiopian biologist and political leader of a terrorist paramilitary party, who declared the pandemic in haste and who set up the COVAX project then entrusted to the NGOs founded by Bill Gates with other powerful people in the world.\n\nBut the BMGF, through the NGO EcoHealthAlliance of New York, also sponsored by some American Big Pharma and by the National Institute of Allergies and Infectious Diseases directed by Anthony Fauci in the USA, has also financed the very dangerous experiments on SARS viruses conducted in Wuhan, at the University of North Carolina but also in Canada and the United Kingdom in an intrigue of contributions that also brings up the Pentagon military agency DARPA.\n\nAccording to now eminent scientists and intelligence experts precisely in the collaboration between China (when the Shanghai Gang reigned), American Democrats and the European Union the SARS-Cov-2 of the pandemic was built.\n\nThis is why the discoveries of the Politico and Welt journalists do nothing but close the shady circle of an emergency created from the beginning to favor the implementation of the New World Order and the beginning of the Great Reset with the undisputed domination of the funds of investment that control vaccine Big Pharma such as the Weapons Lobby corporations.\n\n«Soon, however, governments in the United States and Europe were offering their own crucial support to the four groups. The organizations spent at least $8.3 million lobbying the U.S. and E.U., according to an analysis of lobbying disclosures. When, this past spring, the leaders of CEPI sought to replenish the group’s coffers, it spent $50,000 in part to advocate for $200 million in yearly funding from the U.S. government, according to filings and interviews with Capitol Hill staff» Politico added (whole article below).\n\nThe investigation by American and German journalists is for now only a stone against the pigeon house because it would be interesting to know who, according to their sources, are the American and European officials or politicians who have received part of $8.3 million to support Gates’ plans and of its NGOs.\n\n«Officials from the U.S., EU and representatives from the WHO rotated through these four organizations as employees, helping them solidify their political and financial connections in Washington and Brussels» they wrote.\n\nBut to understand the devastating proportion of this project, I must recall some fundamental passages on the legitimate suspicion that the pandemic was triggered by a SARS-Cov-2 virus built in part in various parts of the world.\n\nA chimeric recombinant recombinant virus was created in the laboratory in 2004 through a 2003 SARS infected with HIV from the Wuhan Institute of Vrology thanks to Episars funding from the European Commission chaired by Romano Prodi.\n\nSimilar experiments were conducted in the National Microbiology Laboratory in Winnipeg (Canada) by Professor Frank Plummer, who died under mysterious circumstances in Africa in 2020, a few days before the official declaration of the pandemic.\n\nIn 2016, the modern pharmaceutical company created an artificial human gene with 18 nucleotides equal to those of SARS-Cov-2 thanks to funding from the Pentagon’s Darpa agency and the supervision of Anthony Fauci and Ralph Baric, microbiologist at the University of North Carolina. who collaborated with Wuhan scientists.\n\nIn 2018, when the military agency DARPA refused to finance a Fauci project due to the serious danger of a SARS viral agent enhanced with Gain-of-Function (a technique similar to the enrichment of uranium for atomic weapons) in an experiment ” dual-use ”vaccine-bioweapon, a very mysterious research was carried out by the Pirbright Institute in the United Kingdom thanks to the contributions of the DARPA itself, the Bill & Melinda Gates Foundation and the Department of Environment, Farming and Rural Affairs (Defra) of the European Union\n\nWell BMGF and Welcome Trust are involved in the investigation of Politico journalists together with two other NGOs founded by Bill Gates such as the Coalition for Epidemic Preparedness Innovations (CEPI) based in London, Oslo and Washington, and the older Gavi Alliance, of which former Norwegian Prime Minister Jens Stoltenberg was formerly director, who later became NATO Secretary General thanks to the excellent references he earned with Bill III.\n\nBut of course it doesn’t end there.\n\nOn 12 September 2019, three months before the discovery of the first cases of Covid-19 in Wuhan, the European Commission organized a summit on the global immunization plan in Brussels which chooses as its image a coronavirus molecule with the lethal hooks of the Spike protein. .\n\nBill Gates’ NGOs participate in the prophetic and suspicious event: his foundation BMGF, Cepi and Gavi.\n\nAs revealed in preview by an investigation by Gospa News, among the speakers, for another anomalous coincidence, only one Big Pharma took part: Pfizer.\n\nThis makes the subsequent operations conducted by the President of the European Commission Ursula Von der Leyen for the purchase of Pfizer vaccines even more ambiguous.\n\nItalia Oggi has put its finger in the sore by reporting a text of the Court of Auditors of the EU detailing the monstrous expenditure of 71 billion incurred by the European Union for the purchase of 4.6 billion doses of anti-Covid gene serums, 10 doses for every citizen as already noted with concern by an Italian parliamentarian…\n\n«In mid-March 2021, the Steering Committee decided to organize a meeting with the scientific advisors of the EU and the Member States, dedicated to the scientific aspects of the vaccine strategy for 2022. Such a meeting would never have taken place. In March 2021, the President of the Commission conducted preliminary negotiations for a Pfizer-Biontech contract, the only contract for which the joint negotiating team did not participate in this phase of the negotiations» wrote the Court.\n\nItalia Oggi comments: «Or: von der Leyen did everything by herself, negotiating in secret with Albert Bourla, CEO of Pfizer, who collected 35 billion of the 71 spent by the EU. Von der Leyen’s secret negotiation with Bourla on vaccines had been known for some time: in January 2022 the EU ombudsman, Emily O’Reilly, had requested access to private messages (sms or whatsapp) between Ursula and Bourla, but without receiving any response. For this, the following month, O’Reilly branded the secret deal as an example of “maladministration”. You accuse the EU commissioner for transparency Vera Jurovà replied on June 30 on behalf of the presidency, saying that the text messages between Von der Leyen and Bourla “had not been found”».\n\n“With Bill Gates we discussed collaboration to improve health surveillance and alarm systems, increase production and technology transfer, especially in Africa, help create an African Medicines Agency, co-invest in innovative climate technologies” wrote on her Twitter the president of the European Commission after meeting with the father of Microsoft.\n\nIn Brussels Gates met also some EU commissioners as Paolo Gentiloni, commissioner for economics, but already Italian premier when the Lorenzin Decree was approved in 2017 which imposed the obligation of 10 vaccines in school age according to an immunization plan wanted by Gates himself, Obama and former premier Matteo Renzi.\n\nThis allowed to do gold deals at London-based Big Pharma GSK, administered by a director of Microsoft and participated by Gates himself, in a macroscopic conflict of interest in which even the Kingdom of Saudi Arabia was involved.\n\nOn that visit to Brussels in July 2021, the Microsoft tycoon also had an interview with health commissioner Stella Kyriakides, who said she was “happy” to have met him to talk about Covid. “The emergency has shown the importance of being ready for future health crises,” she wrote in a social comment. “This cannot be done alone: we need to strengthen preparation with all our partners around the world”.\n\nFor the commissioner, the European preparation plan for biological defense against Covid-19 variants (Hera Incubator) is the space for this partnership. Incidentally, however, Kyriakides herself did not want to deepen the investigations on the origin of SARS-Cov-2 in relation to a question presented by a French MEP …\n\nIn the mid-october 2019, a few weeks before Covid discovery, the same BMGF organized in New York Event 201 together with the World Economic Forum of Klaus Schwab, supporter of the Great Reset like the now King of England Charles III.\n\nThat was an exercise on a possible coronavirus pandemic in which it participates also the lawyer Avril Haines, expert in biological weapons and former deputy director of the Central Intelligence Agency, the American counterintelligence, who became deputy national security adviser in the Obama-Biden administration (2013-2016) and then appointed by the American president Joe Biden Director National Intelligence.\n\nDuring the 2020 election, Biden’s electoral committees were largely funded by Pfizer, which also made contributions to Republican senators but distinguished itself by donating an impressive $ 1 million to California’s Conference of Western Attorneys General (CWAG). most influential association of American prosecutors.\n\nBiden then repaid with Pfizer by donating to the COVAX plan, managed by Gavi and Cepi but administered by a former manager of the London-based pharmaceutical company GSK, financed by Gates and Pfizer’s partner, 4 billion dollars from the US government for the purchase of 500 million. of doses of Comirnaty, the vaccine produced by Pfizer of New York together with Biontech, also funded by Bill III.\n\nIt is a huge international conspiracy in an intrigue of social, economic, geopolitical and military interests aimed in the only direction of imposing a social dictatorship through technocracy and the Great Reset for the absolute dominance of the New World Order.\n\nThe pandemic was in fact the basis for confusing consciences, subjecting them to the imposition of vaccination obligations and various restrictions with lockdowns, especially in the Anglo-Saxon countries and those of the European Union, and therefore preparing the souls already terrified for the war in Ukraine which, at any moment, it could lead to the adoption of military dictatorships even in the Democratic West due to the increasing and unjustified Russophobia.\n\nBut another hidden objective of the massive anti-Covid vaccination campaign, which is creating very serious adverse reactions, sometimes even lethal, especially to the most fragile people, should not be underestimated: the elimination of expensive vulnerable groups from globalized society.\n\nTo this is added an even more subtle objective: the possible experimentation of the very dangerous graphene oxide, as scientific research has identified in the mRNA or mDNA gene sera, for the human neurocerebral control, as the American agencies CIA and DARPA have already experimented successfully in dragonflies.\n\nHow Bill Gates and partners used their clout to control the global Covid response — with little oversight\n\nAll links to Gospa News articles have been added aftermath\n• The four organizations have spent almost $10 billion on Covid since 2020 – the same amount as the leading U.S. agency tasked with fighting Covid abroad.\n• The organizations collectively gave $1.4 billion to the World Health Organization, where they helped create a critical initiative to distribute Covid-19 tools. That program failed to achieve its original benchmarks.\n• The organizations’ leaders had unprecedented access to the highest levels of governments, spending at least $8.3 million to lobby lawmakers and officials in the U.S. and Europe.\n• Officials from the U.S., EU and representatives from the WHO rotated through these four organizations as employees, helping them solidify their political and financial connections in Washington and Brussels.\n• The leaders of the four organizations pledged to bridge the equity gap. However, during the worst waves of the pandemic, low-income countries were left without life-saving vaccines.\n• Leaders of three of the four organizations maintained that lifting intellectual property protections was not needed to increase vaccine supplies – which activists believed would have helped save lives.\n\nWhen Covid-19 struck, the governments of the world weren’t prepared. From America to Europe to Asia, they veered from minimizing the threat to closing their borders in ill-fated attempts to quell a viral spread that soon enveloped the world. While the most powerful nations looked inward, four non-governmental global health organizations began making plans for a life-or-death struggle against a virus that would know no boundaries.\n\nWhat followed was a steady, almost inexorable shift in power from the overwhelmed governments to a group of non-governmental organizations, according to a seven-month investigation by POLITICO journalists based in the U.S. and Europe and the German newspaper WELT.\n\nArmed with expertise, bolstered by contacts at the highest levels of Western nations and empowered by well-grooved relationships with drug makers, the four organizations took on roles often played by governments — but without the accountability of governments.\n\nWhile nations were still debating the seriousness of the pandemic, the groups identified potential vaccine makers and targeted investments in the development of tests, treatments and shots. And they used their clout with the World Health Organization to help create an ambitious worldwide distribution plan for the dissemination of those Covid tools to needy nations, though it would ultimately fail to live up to its original promises.\n\nThe four organizations had worked together in the past, and three of them shared a common history. The largest and most powerful was the Bill & Melinda Gates Foundation, one of the largest philanthropies in the world. Then there was Gavi, the global vaccine organization that Gates helped to found to inoculate people in low-income nations, and the Wellcome Trust, a British research foundation with a multibillion dollar endowment that had worked with the Gates Foundation in previous years. Finally, there was the Coalition for Epidemic Preparedness Innovations, or CEPI, the international vaccine research and development group that Gates and Wellcome both helped to create in 2017.\n\nCivil society organizations active in poorer nations, including Doctors Without Borders, expressed discomfort with the notion that Western-dominated groups, staffed by elite teams of experts, would be helping guide life-and-death decisions affecting people in poorer nations. Those tensions only increased when the Gates Foundation opposed efforts to waive intellectual property rights, a move that critics saw as protecting the interests of pharmaceutical giants over people living poorer nations.\n\n“What makes Bill Gates qualified to be giving advice and advising the U.S. government on where they should be putting the tremendous resources?” asked Kate Elder, senior vaccines policy adviser for the Doctors Without Borders’ Access Campaign.\n\nSoon, however, governments in the United States and Europe were offering their own crucial support to the four groups. The organizations spent at least $8.3 million lobbying the U.S. and E.U., according to an analysis of lobbying disclosures. When, this past spring, the leaders of CEPI sought to replenish the group’s coffers, it spent $50,000 in part to advocate for $200 million in yearly funding from the U.S. government, according to filings and interviews with Capitol Hill staff.\n\nThe overtures worked. While President Joe Biden’s efforts to obtain an additional $5 billion in funding for the administration’s international work combatting the virus were floundering in Congress, he still managed to slip $500 million for CEPI into his budget proposal — $100 million a year for five years.\n\nThe money, which has yet to be approved, would help what most global health experts agree is an important cause, not only in humanitarian terms but in helping prevent poorer nations from becoming breeding grounds for new variants. And most believe that the Gates Foundation and the other groups deserve credit not only for their work to help save lives but for being almost the only game in town with sufficient scope to fight a pandemic.\n\nBut the groups’ extensive politicking and financial might in the U.S. and Europe helped to enable them to direct the international response to the most important health event of the past century at a time when governments were caught flat-footed, according to the investigation.\n\nThe investigation, which relied on more than four dozen interviews with U.S. and European officials and global health specialists, charted the step-by-step journey through which much of the international response to the Covid pandemic passed from governments to a privately overseen global constituency of non-governmental experts.\n\nIt also detailed the significant financial and political connections that enabled them to achieve such clout at the highest levels of the U.S. government, the European Commission and the WHO.\n\nThe officials who spoke to POLITICO and WELT hail from the top tiers of the governments in the U.S. and in Europe, including in the health agencies. They were granted anonymity to speak candidly about how their respective administrations approached the international response to Covid and what missteps occurred during the course of their tenure. Many of them dealt directly with representatives of the four global health agencies, some on a daily basis.\n\nPOLITICO and WELT examined meeting minutes as well as thousands of pages of financial disclosures and tax documents, which revealed that the groups have spent nearly $10 billion since 2020 — the same amount as the leading U.S. agency charged with fighting Covid abroad. It is one of the first comprehensive accountings of expenditures by global health organizations on the global fight against the pandemic.\n\nNow, critics are raising significant questions about the equity and effectiveness of the group’s response to the pandemic — and the serious limitations of outsourcing the pandemic response to unelected, privately-funded groups.\n\n“I think we should be deeply concerned,” said Lawrence Gostin, a Georgetown University professor who specializes in public-health law. “Putting it in a very crass way, money buys influence. And this is the worst kind of influence. Not just because it’s money — although that’s important, because money shouldn’t dictate policy — but also, because it’s preferential access, behind closed doors.”\n\nGostin said that such power, even if propelled by good intentions and expertise, is “anti-democratic, because it’s extraordinarily non-transparent, and opaque” and “leaves behind ordinary people, communities and civil society.”", "opengraph": {}, "tags": ["EU", "COVID-19 vaccine", "Biden", "von der Leyen", "Bill Gates", "Pfizer"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2021/03/09/wuhan-gates-32-bill-iii-vaccines-global-emperor-crowned-by-big-pharmas-cartel-within-gates-foundations-deal/", "https://www.gospanews.net/en/2021/03/09/wuhan-gates-32-bill-iii-vaccines-global-emperor-crowned-by-big-pharmas-cartel-within-gates-foundations-deal/", "https://www.gospanews.net/en/2020/11/18/wuhan-gates-24-who-pandemic-in-gates-chinas-puppets-hands-dr-tedros-leader-of-tplf-islamic-communist-rebels-blamed-of-last-massacre-in-ethiopia-by-amnesty/", "https://www.gospanews.net/en/2020/11/18/wuhan-gates-24-who-pandemic-in-gates-chinas-puppets-hands-dr-tedros-leader-of-tplf-islamic-communist-rebels-blamed-of-last-massacre-in-ethiopia-by-amnesty/", "https://www.gospanews.net/en/2022/08/20/wuhan-gates-53-from-plandemic-by-sars-cov-2-manmade-to-next-step-remote-controlled-brain-communication-by-darpa/", "https://www.gospanews.net/en/2022/08/20/wuhan-gates-53-from-plandemic-by-sars-cov-2-manmade-to-next-step-remote-controlled-brain-communication-by-darpa/", "https://www.gospanews.net/en/2021/12/13/wuhan-gates-43-shady-conspirators-behind-pandemic-by-bioweapon-clinton-chinese-exterminator-of-tiananmen-square/", "https://www.gospanews.net/en/2021/04/16/zionist-lobby-1-singer-elliott-fink-blackrock-within-gates-soros-in-covid-big-pharmas-businessgsk-gilead/", "https://www.gospanews.net/en/2021/12/13/wuhan-gates-43-shady-conspirators-behind-pandemic-by-bioweapon-clinton-chinese-exterminator-of-tiananmen-square/", "https://www.gospanews.net/en/2021/04/16/zionist-lobby-1-singer-elliott-fink-blackrock-within-gates-soros-in-covid-big-pharmas-businessgsk-gilead/", "https://www.gospanews.net/en/2020/05/16/wuhangate-9-hiv-inserted-in-sars-samples-in-2007-pics-thanks-to-australian-eu-commission-prodi-funds/", "https://www.gospanews.net/en/2020/05/30/wuhan-gates-11-hiv-inside-sars-2-as-in-a-bio-weapon-scientists-dead-and-spies-ring-in-canada-china-and-us/", "https://www.gospanews.net/2022/03/10/wuhan-gates-50-sars-2-bio-arma-tormenta-palu-tracce-di-covid-in-brevetto-mrna-2016-moderna-svelate-dal-virologo-n-1-aifa-e-medici-usa/", "https://www.gospanews.net/2022/03/10/wuhan-gates-50-sars-2-bio-arma-tormenta-palu-tracce-di-covid-in-brevetto-mrna-2016-moderna-svelate-dal-virologo-n-1-aifa-e-medici-usa/", "https://www.gospanews.net/en/2022/03/12/wuhan-gates-47-sars-2-bioweapon-pentagons-darpa-stopped-a-risky-test-in-us-but-funded-another-in-uk-with-gates/", "https://www.gospanews.net/en/2022/03/12/wuhan-gates-47-sars-2-bioweapon-pentagons-darpa-stopped-a-risky-test-in-us-but-funded-another-in-uk-with-gates/", "https://www.gospanews.net/en/2022/03/04/stoltenberg-natos-puppet-for-gates-nwo-in-pandemic-as-in-ukrainian-war-gavi-vaccines-norges-bank-weapons-affairs-on-yemens-bombs/", "https://www.gospanews.net/en/2020/05/19/wuhan-gates-10-shady-plot-eu-summit-with-4-gates-ngo-big-pharma-fb-before-sars-2-built-with-hiv/", "https://www.gospanews.net/en/2020/05/19/wuhan-gates-10-shady-plot-eu-summit-with-4-gates-ngo-big-pharma-fb-before-sars-2-built-with-hiv/", "https://www.gospanews.net/2022/02/20/4a-dose-vaccini-covid-in-italia-immunodepressi-prime-cavie-ma-lue-ha-gia-comprato-10-dosi-per-ogni-europeo-il-caso-in-senato/", "https://www.gospanews.net/2022/02/20/4a-dose-vaccini-covid-in-italia-immunodepressi-prime-cavie-ma-lue-ha-gia-comprato-10-dosi-per-ogni-europeo-il-caso-in-senato/", "https://www.gospanews.net/2022/01/05/renzi-sceicco-darabia-dopo-i-vaccini-ai-bambini-consulenza-doro-dai-sauditi-partner-di-gsk-e-sponsor-del-decreto-lorenzin/", "https://www.gospanews.net/2022/01/05/renzi-sceicco-darabia-dopo-i-vaccini-ai-bambini-consulenza-doro-dai-sauditi-partner-di-gsk-e-sponsor-del-decreto-lorenzin/", "https://www.gospanews.net/2022/01/05/renzi-sceicco-darabia-dopo-i-vaccini-ai-bambini-consulenza-doro-dai-sauditi-partner-di-gsk-e-sponsor-del-decreto-lorenzin/", "https://www.gospanews.net/en/2022/05/26/wuhan-gates-49-sars-2-bio-weapon-eu-commission-hides-the-truth-on-experiments-funded-in-china-with-usaid-cia/", "https://www.gospanews.net/en/2022/05/26/wuhan-gates-49-sars-2-bio-weapon-eu-commission-hides-the-truth-on-experiments-funded-in-china-with-usaid-cia/", "https://www.gospanews.net/2022/09/24/ue-finanzia-studi-su-grafene-in-cervello-e-vaccini-e-i-fact-checker-per-celarli-e70-milioni-a-piano-edmo-e-a-media-italiani-di-massoni-bilderberg/", "https://www.gospanews.net/en/2022/09/09/queen-elizabeth-ii-death-for-charles-iii-king-british-imperialism-from-the-nwo-of-big-pharma-weapons-lobby-to-wefs-great-reset/", "https://www.gospanews.net/en/2020/11/26/wuhan-gates-26-from-sars-2-bio-weapon-to-gold-vaccines-from-cia-who-tests-funded-by-gate-to-eu-summit-with-pfizer-bidens-sponsor-before-pandemic/", "https://www.gospanews.net/en/2020/11/26/wuhan-gates-26-from-sars-2-bio-weapon-to-gold-vaccines-from-cia-who-tests-funded-by-gate-to-eu-summit-with-pfizer-bidens-sponsor-before-pandemic/", "https://www.gospanews.net/2021/12/22/pfizer-sponsor-pure-dei-procuratori-usa-lobbying-da-1milione-di-dollari-alla-conference-attorneys-general-altri-8-a-1-842-politici-bipartisan/", "https://www.gospanews.net/2021/12/22/pfizer-sponsor-pure-dei-procuratori-usa-lobbying-da-1milione-di-dollari-alla-conference-attorneys-general-altri-8-a-1-842-politici-bipartisan/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.gospanews.net/en/2022/03/08/archbishop-vigano-war-in-ukraine-to-establish-the-tyranny-of-the-new-world-order-by-globalists/", "https://www.gospanews.net/en/2022/06/03/from-fatima-to-ukraine-the-useless-lesson-of-peace-by-pope-wojtyla-to-christians-that-want-weapons-and-war/", "https://www.gospanews.net/en/2022/06/03/from-fatima-to-ukraine-the-useless-lesson-of-peace-by-pope-wojtyla-to-christians-that-want-weapons-and-war/", "https://www.gospanews.net/en/2022/08/07/monkeypox-outbreak-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "https://www.gospanews.net/en/2022/08/17/us-cdc-hid-data-on-vaccines-dangerous-spike-protein-persistence-in-body-disrupting-discover-by-virologist-jessica-rose/", "https://www.gospanews.net/en/2022/08/20/wuhan-gates-53-from-plandemic-by-sars-cov-2-manmade-to-next-step-remote-controlled-brain-communication-by-darpa/", "https://www.gospanews.net/2022/03/02/wuhan-gates-49-sars-2-fauci-gates-grafene-darpa-obama-vaccini-biden-ue-complotto-nwo-per-controllo-neurocerebrale/", "https://www.gospanews.net/en/2022/08/20/wuhan-gates-53-from-plandemic-by-sars-cov-2-manmade-to-next-step-remote-controlled-brain-communication-by-darpa/", "https://www.gospanews.net/2022/03/02/wuhan-gates-49-sars-2-fauci-gates-grafene-darpa-obama-vaccini-biden-ue-complotto-nwo-per-controllo-neurocerebrale/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.gospanews.net/en/category/investigations-intelligence/weapons-lobby/", "https://www.gospanews.net/en/category/war/ukraine/", "https://www.gospanews.net/en/2022/09/02/wuhan-gates-54-too-many-secrets-on-manmade-sars-between-chinese-biolab-daszaks-eha-of-ny-funded-by-gates-nih-stops-the-grant/", "https://www.gospanews.net/en/2022/09/02/wuhan-gates-54-too-many-secrets-on-manmade-sars-between-chinese-biolab-daszaks-eha-of-ny-funded-by-gates-nih-stops-the-grant/", "https://www.gospanews.net/en/2022/08/07/monkeypox-outbreak-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "https://www.gospanews.net/en/2020/05/16/wuhangate-9-hiv-inserted-in-sars-samples-in-2007-pics-thanks-to-australian-eu-commission-prodi-funds/", "https://www.gospanews.net/en/2020/05/30/wuhan-gates-11-hiv-inside-sars-2-as-in-a-bio-weapon-scientists-dead-and-spies-ring-in-canada-china-and-us/", "https://www.gospanews.net/en/2022/03/04/stoltenberg-natos-puppet-for-gates-nwo-in-pandemic-as-in-ukrainian-war-gavi-vaccines-norges-bank-weapons-affairs-on-yemens-bombs/", "https://www.gospanews.net/en/2022/09/09/queen-elizabeth-ii-death-for-charles-iii-king-british-imperialism-from-the-nwo-of-big-pharma-weapons-lobby-to-wefs-great-reset/", "https://www.gospanews.net/en/2021/01/31/wuhan-gates-30-whos-vaccines-billionaire-plan-in-the-hands-of-gates-big-pharma-ex-gsk-manager-leads-covax-with-gavi/", "https://www.who.int/publications/m/item/act-accelerator-strategic-review", "https://www.gospanews.net/en/2021/05/22/vaccines-in-rome-the-summit-of-global-lies-eu-in-italy-inside-the-gates-big-pharmas-shady-affairs-within-biden/", "https://www.gospanews.net/en/2021/05/22/vaccines-in-rome-the-summit-of-global-lies-eu-in-italy-inside-the-gates-big-pharmas-shady-affairs-within-biden/", "https://www.politico.com/news/2022/09/14/global-covid-pandemic-response-bill-gates-partners-00053969", "https://www.gospanews.net/en/2022/03/08/archbishop-vigano-war-in-ukraine-to-establish-the-tyranny-of-the-new-world-order-by-globalists/"], "authors": [""], "publish_date": "September 23, 2022"}