{"result_id": "333034", "URL": "https://www.veteranstoday.com/2023/03/01/moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "timestamp": "2023-04-25 17:54:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2023/03/01/moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Moderna Vaccine Patented 9 Months Before Pandemic. Thanks to the Fauci-Baric’ Manmade SARS Viruses | VT Foreign Policy", "cleaned_text": "A disturbing document had already emerged proving the existence of an experimental gene serum based on messenger RNA against Covid-19 on 12 December 2019.\n\nBut nothing appears compared to the terrible secrets about the Spikevax vaccine produced by Big Pharma Moderna in Cambridge (Massachusetts, USA) thanks to the money of the Bill & Melinda Gates Foundation, the Pentagon (the American Department of Defense), and the collaboration with the Niaid (Institute Allergy and Infectious Diseases National Park) headed by Anthony Fauci, White House advisor on the SARS-Cov-2 pandemic.\n\nPatent US10702600 for the vaccine candidate mRNA-1273 was in fact registered in its new composition on March 28, 2019.\n\nThat is 9 months before the official outbreak of the Covid-19 pandemic in China and the availability of the official Wuhan sequence MN908947.1, the virus initially called 2019-nCoV and then renamed by the World Health Organization SARS-Cov-2 to the strong genomic identity with SARS of 2003 (Severe Acute Respiratory Syndrome, or Severe Acute Respiratory Syndrome, when virus and disease were called the same).\n\nThis revelation comes from “The Fauci / COVID-19 Dossier” prepared by the American doctor David E. Martin who has developed a colossal study on US government-funded patents in relation to Coronaviruses since 2000, so much so that he suspects that SARS too in 2003 was built in the laboratory by microbiologist Ralph Baric of the Chapel Hill research center of the University of North Carolina (UNC) under the aegis of Fauci himself.\n\nAs we will see after long but inevitable premises, the registration of Moderna’s experimental vaccine on March 28, 2019, is also confirmed by the official history stored in the patent …\n\nThe discovery becomes even more disturbing in light of the fact that such research was conducted by the pharmaceutical company at the same time as Baric’s extremely dangerous experiments on SARS recombinant viruses conducted together with the director of the Infectious Diseases Research Center of the Wuhan Institute of Virology, Shi Zhengli, not randomly dubbed in China “BatWoman” for its coronavirus tests of horseshoe bats.\n\nAs anticipated before the online investigation in the book WuhanGates (December 2020), they would be the godfathers and progenitors of a huge plot of the New World Order of ancient British Masonic origin hatched under the sign of the Chinese Communists and American Democrats.\n\nTo it was also added the peremptory paws of Italy and Saudi Arabia aimed at global immunization projects preparatory to the health dictatorship of the Covid-19 emergency and the promotion of experimental anti-Covid gene serums for the enrichment of Big Pharma and speculation of the same investment funds that control the Weapons Lobby.\n\nTHE THERAPY OF DONNO AFFECTED BY THE MODERN GROUP\n\nBefore briefly summarizing the many information contained in the WuhanGates 40 report on the research of Professor Baric and Doctor Fauci, coordinator of all the riskiest and secret experiments on viruses and bacteriological weapons in the 28 American civil and military laboratories as evidenced by the exclusive investigation by Gospa News, we recall another of the mysteries in the ambiguous fight against Covid-19 revealed only by our online newspaper.\n\nModerna is part of that colossal international Zacks group that became interested in the highly effective therapy against Covid-19 of hyperimmune plasma developed by Professor Giuseppe De Donno and mysteriously vanished in the maze of health policy before his mysterious suicide.\n\nIt should also be remembered that the experimental gene sera were able to obtain emergency authorization in the USA, from the Food and Drug Administration which, however, in recent weeks gave definitive ok to Spikevax after having granted it to Comirnaty of Pizer-Biontech amid a thousand controversies for not having subjected the clinical data to the scrutiny of the independent Advisory Committee, and in the European Union by the European Medicines Agency (where they remain with a conditional marketing authorization as still experimental) only by virtue of two factors.\n\nThe pandemic has resulted in millions of deaths in the world with Covid-19 (in the minority died from Covid-19 and the majority from complications of other diseases), in Italy and in other countries mainly due to inadequate home and hospital care such as betrayal. use of cortisone or the disputed hydroxychloroquine (adopted by the protocols of the Piedmont Region) and the absence of drugs recognized as effective.\n\nTherefore, the stop of the De Donno therapy, successfully carried out in over one hundred American university hospitals as recalled by the Johns Hopkins University in its defense, represented one of the obstacles in alternative treatments functional to the promotion of Moderna and other Big Pharma’s anti-Covid vaccines.\n\n«The National Institute of Health’s grant AI23946-08 issued to Dr. Ralph Baric at the University of North Carolina at Chapel Hill (officially classified as affiliated with Dr. Anthony Fauci’s NIAID by at least 2003) began the work on synthetically altering the Coronaviridae (the coronavirus family) for the express purpose of general research, pathogenic enhancement, detection, manipulation, and potential therapeutic interventions targeting the same. As early as May 21, 2000, Dr. Baric and UNC sought to patent critical sections of the coronavirus family for their commercial benefit».\n\nAs Martin’s dossier reports, in one of several articles derived from the work sponsored by this grant, «Baric published what he reported to be the SARS CoV full-length cDNA in which it was clearly stated that SAR CoV was based on a compound. of DNA segments».\n\nHaines, subsequently, not only 2018 prophesied a coronavirus epidemic that could only be faced with a new “World Order” but will be one of the main protagonists of the Event 201 exercise held in mid-October in New York thanks to funding from the World Economic Forum by Klaus Schwab (Great Reset) and the Bill & Melinda Gates Foundation.\n\nOn the recommendation of American President Joseph Biden (her longtime political friend) on 21 January 2021 she was appointed by the Senate National Director of Intelligence from where she coordinates all 17 military and civil intelligence agencies and from where she searched, without success. for a rift between 007, to refute the thesis of the artificial origin of SARS-Cov-2.\n\nMODERN STUDIES IN THE SAME YEARS\n\n«By March 2015, both the virulence of the S1 spike protein and the ACE II receptor was known to present a considerable risk to human health. NIAID, EcoHealth Alliance, and numerous researchers lamented the fact that the public was not sufficiently concerned about coronavirus to adequately fund their desired research» the dossier still reads in reference to the experiments conducted in a “China-US affair” as Montagnier claimed on the origin of laboratory SARS-Cov-2.\n\nIn 2013, the Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program awarded grant funding to Moderna Therapeutics for the development of a new type of vaccine based on messenger RNA. The initial DARPA grant was W911NF-13-1-0417» reveals Dr. Martin.\n\nIn 2015 Moderna signed an agreement for the development of vaccines with NIAID and executes it with the head of the developer and main inventor mRNA-1273 Giuseppe Ciaramella, says Dr. Martin referring to the “prototype” of the experimental antiCovid gene serum named in 2020 Spikevax.\n\nON 2016 NIH through Scripps Institute and Dartmouth College file patent application WO 2018081318A1 “Prefusion Coronavirus Spike Proteins and their Use” disclosing mRNA technology that overlaps (and is used in tandem with) Moderna’s technology. Lead Inventor Barney Scott Graham was well known to Moderna as he’s the person at NIH that Moderna “e-mailed” to get the sequence for SARS CoV-2 according to Moderna’s report. In addition, co-inventor Jason McLellan worked with Graham on a vaccine patent jointly owned by the Chinese government filed in Australia in 2013,\n\nmRNA-1273 – the experimental vaccine developed by Moderna for COVID-19 – uses the LNP technology that Moderna thought it had licensed from Acuitas Therapeutics Inc., a firm developed by a former principal of Arbutus’ prior company Tekmira. That license did not authorize Moderna to use the technology for the COVID-19 vaccine.\n\nM · CAM and Knowledge Ecology International (Martin’s reference bodies – ed) have independently confirmed that Moderna has violated U.S. law in failing to disclose the U.S. government’s funding interest in their patents and patent applications» reads in The Fauci / Covid-19 Dossier.\n\nWhile this negligence impacts all of Moderna’s over 130 granted U.S. patents, it is particularly problematic for U.S. Patent 10,702,600 (‘600) which is the patent relating to, “a messenger ribonucleic acid (mRNA) comprising an open reading frame encoding a beta coronavirus (BetaCoV) S protein or S protein subunit formulated in a lipid nanoparticle».\n\nWe have dedicated a long investigation to the mysterious and dangerous biotechnologies with lipid nanoparticles with extensive scientific documentation in relation to the Comirnaty messenger RNA gene serum (“heterozygous twin” of Spikevax), produced by the New Yorker Pfizer with the German Biotech: the first partner of the London-based GSK run by a Microsoft director, the second funded by the same IT tycoon Gates.\n\nTHE VACCINE WAS PATENTED 9 MONTHS BEFORE THE PANDEMIC\n\nIn addition to the patents cited by the USPTO in their examination of ‘600, M·CAM has identified fourteen other issued patents preceding the ‘600 patent which were used by patent examiners to limit patents arising from the same funded research including patents sought by CureVac.\n\n«In short, while Moderna enjoys hundreds of millions of dollars of funding allegiance and advocacy from Anthony Fauci and his NIAID, since its inception, it has been engaged in the illegal patent activity and demonstrated contempt for U.S. Patent law. To make matters worse, the U.S. Government has given it financial backing in the face of undisclosed infringement risks potentially contributing to the very infringement for which they are indemnified» concludes the medical author of The Fauci / Covid-19 Dossier.\n\nBut now comes the explosive statement: «The specific claims addressing the pivot to the SARS Coronavirus were patented on March 28, 2019 – 9 months before the SARS CoV-2 outbreak! Both the patent and the DARPA funding for the technology were disclosed in a scientific publications (New England Journal of Medicine) but the government funds were not acknowledged in the patent» is Dr. Martin’s shocking revelation.\n\nThe patent is updated on 7 July 2020 but was registered for the first time on 28 February 2020 but in continuation of the previous registration of 28 March 2019: the only one not to have changed the patent number (Pat. No.) as is seen in the historical extract of the vaccine.\n\n“Continuation of aplication No. 16 / 368,270, filed on Mar.28,2019, which is a continuation of aplication No. 16 / 040,981, filed on Jul.20,2018, now Pat.No. 10,272,150, which is a continuation of aplication No. 15 / 674,599, filed on Aug.1,2017, now Pat.No.10,064,934, which is a continuation of aplication No.PCT / US2016 / 058327, filed on Oct.21,2016 “.\n\nTHE EXCHANGE OF DOCUMENTS IN DECEMBER 2019\n\nAnalogs were suspected of the existence of an experimental gene serum from Moderna before the official discovery of the Wuhan-Hu-1 virus, later identified as a new coronavirus initially named 2019-nCoV because the first cases were recorded in the populated city of Hubei precisely in that year, which was isolated and sequenced as Wuhan MN908947.1 on January 5, 2020.\n\nThe first to report the macroscopic anomaly was the British online investigative newspaper The Daily Exposé: «The first to report the macroscopic anomaly was the British online investigative newspaper The Daily Exposé. “A confidentiality agreement shows that potential coronavirus vaccine candidates were transferred from Moderna to the University of North Carolina in 2019, nineteen days before the emergence of the alleged virus causing Covid-19 in Wuhan, China wrote the British media on June 18, 2021.\n\nThe confidential agreement (like at the bottom of the page) states that providers ‘Moderna’ alongside the ‘National Institute of Allergy and Infectious Diseases (NIAID) agreed to transfer ‘mRNA coronavirus vaccine candidates’ developed and jointly-owned by NIAID and Moderna to recipients ‘The University of North Carolina at Chapel Hill’ on the 12th December 2019 wrote the editorial staff of Exposé publishing the extracts on pages 105 and 108.\n\nThe material transfer agreement was signed the December 12th, 2019 by Ralph Baric, Ph.D., at the University of North Carolina at Chapel Hill (the microbiologist of the laboratory chimeric SARS virus experiments – ed), and then signed by Jacqueline Quay, Director of Licensing and Innovation Support at the University of North Carolina on December 16th, 2019» adds the online newspaper, then asking inevitable questions…\n\nSo why was an mRNA coronavirus vaccine candidate developed by Moderna being transferred to the University of North Carolina on December 12th, 2019? Perhaps Moderna and the National Institute of Allergy and Infectious Diseases would like to explain themselves in a court of law?.\n\nQuestions similar to those I asked myself in an interview with TG6 journalist Anna Turletti in which I asked myself: “When will Bill Gates, the great director of dangerous research on laboratory SARS viruses in Wuhan and financier of Big Pharma, be arrested for the consequent vaccines? Is there only one magistrate on earth, only one, willing to do so in the face of this serious, precise, and consistent evidence of a diabolical plan?”.\n\nThis pandemic has been “planned for decades by Fauci and Gates”, also according to the lawyer Robert F. Kennedy jr, engaged through his association Children’s Health Defense in the fight against vaccines without adequate testing also inoculated to minors, as shamelessly admitted by the Pfizer itself in relation to the lack of data on myocardial risks for children under the age of 5.\n\nBut the manipulation of the viral load in the toxic protein Spike, as revealed by Colonel Lawrence Sellin, a former researcher in the bacteriological laboratories of the US Army of Fort Detrick Frederick (Maryland), could be the cause of similar toxicity of vaccines suitable to explain the reactions. serious or even fatal adverse events.\n\nThis pandemic was also functional to the world health dictatorship and therefore strategically preparatory to the Dictatorship of the New World Order and the imposition of the economic Great Reset, concretely feasible only through a real famine in the rich West and a Third World War such as the one that could derive from the conflict in Ukraine.\n\nCertainly the last Great War on planet earth: before the Apocalypse!", "opengraph": {}, "tags": ["COVID-19 vaccine"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/2021/08/07/wuhan-gates-40-fauci-apprendisti-stregoni-virus-sars-da-laboratorio-fin-dal-2000/", "https://www.gospanews.net/en/2022/04/11/salmonella-epidemic-from-kinder-chocolate-just-as-gates-fauci-finance-gsk-vaccine-against-this-bacterium/", "https://www.gospanews.net/2022/01/05/renzi-sceicco-darabia-dopo-i-vaccini-ai-bambini-consulenza-doro-dai-sauditi-partner-di-gsk-e-sponsor-del-decreto-lorenzin/", "https://www.gospanews.net/en/2021/12/13/wuhan-gates-43-shady-conspirators-behind-pandemic-by-bioweapon-clinton-chinese-exterminator-of-tiananmen-square/", "https://www.gospanews.net/2022/01/05/renzi-sceicco-darabia-dopo-i-vaccini-ai-bambini-consulenza-doro-dai-sauditi-partner-di-gsk-e-sponsor-del-decreto-lorenzin/", "https://www.gospanews.net/en/category/investigations-intelligence/weapons-lobby/", "https://www.gospanews.net/en/2021/12/13/wuhan-gates-43-shady-conspirators-behind-pandemic-by-bioweapon-clinton-chinese-exterminator-of-tiananmen-square/", "https://www.gospanews.net/en/2020/05/08/wuhangate-7-bio-weapons-un-dossier-pentagon-fauci-28-us-labs-secrets/", "https://www.gospanews.net/en/2020/05/21/plasma-therapy-for-sars-2-in-bill-gates-claws-through-italian-israeli-big-pharma/", "https://www.gospanews.net/en/2020/05/08/wuhangate-7-bio-weapons-un-dossier-pentagon-fauci-28-us-labs-secrets/", "https://www.gospanews.net/en/2021/08/04/covid-italian-mds-plasma-therapy-disparaged-by-wikipedia-but-celebrated-in-us-it-healed-95thousands-americans/", "https://www.gospanews.net/en/2021/08/24/british-medical-journal-contested-fda-for-political-decision-on-full-approval-of-pfizer-vaccine-without-public-discussion-of-data/", "https://www.gospanews.net/en/2020/05/21/plasma-therapy-for-sars-2-in-bill-gates-claws-through-italian-israeli-big-pharma/", "https://www.gospanews.net/en/2021/08/04/covid-italian-mds-plasma-therapy-disparaged-by-wikipedia-but-celebrated-in-us-it-healed-95thousands-americans/", "https://www.gospanews.net/en/2021/03/29/wuhan-gates-34-covid-is-scientists-killer-who-discover-sars-viruses-dies/", "https://www.gospanews.net/en/2022/03/18/huge-mystery-after-secret-meeting-with-cops-two-italians-anti-vax-died-both-hit-by-sars-cov-2-bioweapon/", "https://www.gospanews.net/en/2021/08/11/wuhan-gates-40-fauci-sorceres-apprentices-virus-sars-manmade-in-biolab-since-2000-us-china-big-affair/", "https://www.gospanews.net/en/2022/03/18/huge-mystery-after-secret-meeting-with-cops-two-italians-anti-vax-died-both-hit-by-sars-cov-2-bioweapon/", "https://www.gospanews.net/en/2021/03/29/wuhan-gates-34-covid-is-scientists-killer-who-discover-sars-viruses-dies/", "https://www.gospanews.net/en/2021/08/11/wuhan-gates-40-fauci-sorceres-apprentices-virus-sars-manmade-in-biolab-since-2000-us-china-big-affair/", "https://taggs.hhs.gov/Error/Index?aspxerrorpath=/Detail/AwardDetail", "https://www.gospanews.net/en/2020/05/16/wuhangate-9-hiv-inserted-in-sars-samples-in-2007-pics-thanks-to-australian-eu-commission-prodi-funds/", "https://www.gospanews.net/en/2020/05/16/wuhangate-9-hiv-inserted-in-sars-samples-in-2007-pics-thanks-to-australian-eu-commission-prodi-funds/", "https://www.gospanews.net/en/2021/02/10/wuhan-gates-31-sars-2-lies-ties-among-scientists-in-gates-shade-disclosed-by-daily-mail-die-welt/", "https://www.gospanews.net/en/2020/11/24/wuhan-gates-23-at-us-intelligences-top-the-prophet-of-pandemic-nwo-biden-rewards-ex-cia-haines-led-event-201-gates-drill/", "https://www.gospanews.net/en/2021/08/28/wuhan-gates-41-sars-2-is-a-bio-weapon-complaint-to-the-hague-court-with-montagnier-expertise-complaint-to-the-hague-court-with-montagnier-expertise-us-intelligence-spl/", "https://www.gospanews.net/en/2020/11/24/wuhan-gates-23-at-us-intelligences-top-the-prophet-of-pandemic-nwo-biden-rewards-ex-cia-haines-led-event-201-gates-drill/", "https://www.gospanews.net/en/2021/08/28/wuhan-gates-41-sars-2-is-a-bio-weapon-complaint-to-the-hague-court-with-montagnier-expertise-complaint-to-the-hague-court-with-montagnier-expertise-us-intelligence-spl/", "https://www.gospanews.net/en/2022/01/21/wuhan-gates-45-study-on-sars-2-manmade-hidden-by-fauci-hot-e-mail-at-congress-us-microbiologist-had-forthwith-discovered-artificial-spike-alterations/", "https://www.gospanews.net/2021/02/10/wuhan-gates-31-sars-2-bugie-e-intrighi-di-scienziati-allombra-di-gates-svelati-da-daily-mail-e-die-welt-loms-nega-lorigine-da-laboratorio-la-germania-manipolo-studi-sui-ris/", "https://www.gospanews.net/2022/03/18/sars-cov-2-da-laboratorio-presidente-aifa-conferma-ma-depista-i-media-insinua-su-wuhan-occulta-ruolo-moderna-gates/", "https://www.gospanews.net/en/2022/01/21/wuhan-gates-45-study-on-sars-2-manmade-hidden-by-fauci-hot-e-mail-at-congress-us-microbiologist-had-forthwith-discovered-artificial-spike-alterations/", "https://www.gospanews.net/2022/02/02/vaccini-grafene-3-misteriose-e-pericolose-nanoparticelle-nel-siero-mrna-pfizer-tossicologia-non-studiata-a-fondo/", "https://www.gospanews.net/2022/02/02/vaccini-grafene-3-misteriose-e-pericolose-nanoparticelle-nel-siero-mrna-pfizer-tossicologia-non-studiata-a-fondo/", "https://www.gospanews.net/2022/03/21/pericolosi-sieri-covid-gsk-dagli-squali-rischio-narcolessia-con-additivo-della-regina-nera-big-pharma-protetta-da-gates-pentagono-e-pd/", "https://www.gospanews.net/en/2022/03/12/wuhan-gates-47-sars-2-bioweapon-pentagons-darpa-stopped-a-risky-test-in-us-but-funded-another-in-uk-with-gates/", "https://www.gospanews.net/en/2022/03/12/wuhan-gates-47-sars-2-bioweapon-pentagons-darpa-stopped-a-risky-test-in-us-but-funded-another-in-uk-with-gates/", "https://www.gospanews.net/2021/12/30/wuhan-gates-44-cardinali-contro-i-draghi-nwo-pandemia-esperimento-mondiale-per-stato-di-sorveglianza/", "https://www.gospanews.net/2021/12/30/wuhan-gates-44-cardinali-contro-i-draghi-nwo-pandemia-esperimento-mondiale-per-stato-di-sorveglianza/", "https://www.gospanews.net/en/2020/09/26/wuhan-gates-21-pandemic-planned-for-decades-kennedy-blames-fauci-gates-terrible-plot-in-30-investigations-summary-pope-against-big-pharmas-affairs/", "https://www.gospanews.net/en/2022/02/07/covid-19-is-a-designed-bioweapon-with-a-toxic-structure-that-may-be-replicated-in-vaccines-us-army-retired-colonel-said/", "https://www.gospanews.net/en/2022/02/07/covid-19-is-a-designed-bioweapon-with-a-toxic-structure-that-may-be-replicated-in-vaccines-us-army-retired-colonel-said/", "https://www.gospanews.net/en/2022/03/04/stoltenberg-natos-puppet-for-gates-nwo-in-pandemic-as-in-ukrainian-war-gavi-vaccines-norges-bank-weapons-affairs-on-yemens-bombs/", "https://www.gospanews.net/2022/03/08/la-guerra-mondiale-di-zelenski-e-lapocalisse-profetizzata-dal-patriarca-di-mosca/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.gospanews.net/en/category/corona-virus/", "https://www.gospanews.net/en/2022/03/04/stoltenberg-natos-puppet-for-gates-nwo-in-pandemic-as-in-ukrainian-war-gavi-vaccines-norges-bank-weapons-affairs-on-yemens-bombs/", "https://www.gospanews.net/2022/03/08/la-guerra-mondiale-di-zelenski-e-lapocalisse-profetizzata-dal-patriarca-di-mosca/"], "authors": [""], "publish_date": "March 1, 2023"}