{"result_id": "333036", "URL": "https://www.veteranstoday.com/2022/08/14/getting-an-hiv-vaccine-may-be-the-real-goal-behind-sars-cov-2-manmade/", "timestamp": "2023-04-25 17:54:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/08/14/getting-an-hiv-vaccine-may-be-the-real-goal-behind-sars-cov-2-manmade/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Getting an HIV Vaccine to Market: “May be the Real Goal behind SARS-Cov-2 Manmade” | VT Foreign Policy", "cleaned_text": "On the cover image the physician Joseph Mercola and the late biologist Luc Montagnier\n\nDr. Joseph Mercola is the founder of Mercola.com. An osteopathic physician, best-selling author and recipient of multiple awards in the field of natural health, his primary vision is to change the modern health paradigm by providing people with a valuable resource to help them take control of their health.\n\nIn this long scientific article, to be read with attention and patience, it briefly retraces the same discoveries revealed by the WuhanGates investigations of Gospa News. also published on VT, that we added afterwards for any further information.\n\nThe connection between SARS-Cov-2 and HIV has in fact been the subject of numerous inquiries that we have developed on the basis of scientific research published not only by the late biologist Luc Montagnier, obviously quoted by Dr. Mercola, but also by bio-engineer Pierre Bricace, an expert in bacteriological weapons who demonstrated these links in detail.\n\nNot only. Just Bricage, as we highlighted in the WuhanGates 19 investigation published as early as September 2020, was the first to hypothesize that the Covid-19 virus was created in the laboratory precisely to vaccinate the world population against AIDS.\n\nThis, we hypothesized, would have happened according to an urgency of the LGBT Lobby, funded by the Bill & Melinda Gates Foundation as well as Big Pharma and the experiments at the Wuhan Institute of Virology (via Eco Health Alliance in New York also supported by Anthony Fauci’s NIAID ).\n\nIn the WuhanGates 51 investigation we then analyzed the multiple experiments of Moderna: which created in a laboratory a human gene with 19 nucleotides identical to SARS-Cov-2 in 2016 thanks to funding from the US Pentagon (DARPA), in March 2019 he patented his anti-Covid 9 vaccine months before the pandemic and in January 2022 it launched the first trials on the anti-AIDS gene serum.\n\nAre these just disturbing coincidences? Dr. Mercola, like Gospa News, thinks not!\n\nFabio Giuseppe Carlo Carisio\n\n © COPYRIGHT GOSPA NEWS\n\n prohibition of reproduction without authorization \n\n follow Gospa News on Telegram\n• On July 25, Chinese officials granted conditional approval to Azvudine, an HIV drug, to be used as a COVID-19 treatment.\n• Use of the HIV drug has reignited interest in early evidence suggesting SARS-CoV-2 is a bioweapon augmented with parts of the HIV virus.\n• In late January 2020, Indian researchers published a paper claiming segments of the viral RNA appeared more closely related to HIV than other coronaviruses. The researchers even said SARS-CoV-2 responded to HIV medications.\n• The Indian paper was quickly retracted, but not before catching the attention of the late Luc Montagnier, a world-renowned virologist who won the Nobel prize for his discovery of HIV. Montagnier insisted the Indian researchers were correct in their assessment, and had been forced to retract the paper “after enormous pressure.”\n• Several scenarios are now converging to create the suspicion that getting an HIV vaccine to market may be a goal behind COVID-19. The COVID-19 jab is causing AIDS-like immunodepression, which helps create the perception that we have an urgent need for an HIV vaccine.\n\nOn July 25, Chinese officials granted conditional approval to an HIV drug to be used as a COVID treatment.\n\n“The Azvudine tablet, which China approved in July last year to treat certain HIV-1 virus infections, has been given a conditional green light to treat adult patients with ‘normal type’ COVID, the National Medical Products Administration said in a statement.\n\n“‘Normal type’ COVID is a term China uses to refer to coronavirus infections where there are signs of pneumonia, but the patients haven’t reached a severe stage. …\n\n“In a late-stage clinical trial, 40.4% of patients taking Azvudine showed improvement in symptoms seven days after first taking the drug, compared with 10.9% in the control group … ”\n\nUse of the HIV drug has reignited interest in early evidence suggesting SARS-CoV-2 is a bioweapon augmented with parts of HIV.\n\nJan. 31, 2020, ZeroHedge published an article featuring the findings of Indian researchers, who claimed certain segments of the viral RNA appeared more closely related to HIV than other coronaviruses. The researchers even said SARS-CoV-2 responded to HIV medications.\n\nAccording to this paper, titled “Uncanny similarity of unique inserts in the 2019-nCoV spike protein to HIV-1 gp120 and Gag,” the presence of HIV insertions was unlikely to have occurred naturally — the implication being that SARS-CoV-2 might be an escaped bioweapon:\n\n“We found 4 insertions in the spike glycoprotein (S) which are unique to the 2019-nCoV and are not present in other coronaviruses. Importantly, amino acid residues in all the 4 inserts have identity or similarity to those in the HIV-1 gp120 or HIV-1 Gag.\n\n“Interestingly, despite the inserts being discontinuous on the primary amino acid sequence, 3D-modelling of the 2019-nCoV suggests that they converge to constitute the receptor binding site.\n\n“The finding of 4 unique inserts in the 2019-nCoV, all of which have identity /similarity to amino acid residues in key structural proteins of HIV-1 is unlikely to be fortuitous in nature.”\n\nWithin days, ZeroHedge’s article had caught the attention of Jeremy Farrar — director of the Wellcome Trust — who emailed it to Dr. Anthony Fauci.\n\nThe Indian paper was quickly retracted, but not before catching the attention of the late Luc Montagnier, a world-renowned French virologist who won the Nobel prize for his discovery of HIV.\n\nHis belief that SARS-CoV-2 did contain sequences of HIV was in part why AP News named him as one of the top “superspreaders of disinformation” about SARS-CoV-2’s origin in 2021.\n\nMontagnier insisted the Indian researchers were correct in their assessment, and had been forced to retract the paper“after enormous pressure.”\n\nThen, in February, AIDS was suddenly all the rage. Media seemingly abandoned COVID-19overnight, taking aim at AIDS instead, and when all the media start raising an issue at the same time, it’s usually a coordinated campaign directed by a PR company on the behalf of a client.\n\nThere’s a reason for it, and the reason is to sow the desired narrative in the minds of people. They plant ideas so that when something happens, people are already prepped with certain prejudices or assumptions.\n\nSo, what then might be the reason for everyone suddenly talking about AIDS?\n\nIn December 2021, President Biden announced a White House plan to “end the HIV/AIDS epidemic by 2030.” The same exact vow had been announced by the British Health Security Agency a week earlier.\n\nMeanwhile, Prince Harry was out there urging everyone to get an HIV test, and Dutch researchers announced the discovery of a concerning HIV strain.\n\nAccording to researchers, this mutated HIV, dubbed the VB variant, is more infectious and causes more severe illness, twice as fast. As of early February, there were 109 known cases of the VB variant in The Netherlands.\n\nCuriously, scientists also admitted the variant had been circulating for decades. So, how was it “news”?\n\nAll of this was happening at the same time that COVID-19 was starting to fade out. At the time, Off-Guardian warned:\n\n“Just because they’re giving slack on COVID does not mean the agenda behind COVID is gone. Far from it. In fact, even as they seek to dump this pandemic in a shallow grave, they are already prepping the public for the next health scare — AIDS.”\n\nWell, the AIDS scare didn’t last long either. Within a couple of months, COVID-19 variants were again grabbing headlines, and in May, the focus shifted to monkeypox. Here, multiple scenarios, facts, theories, hazards and risks suddenly converge to create some rather disturbing possibilities.\n• The COVID jab may be causing AIDS-like illness by decimating immune function — This is not to imply the shot is causing HIV/AIDS.\n\nRather, it refers to the finding that people who get the COVID-19 jab are — at six months post-jab — at greater risk of symptomatic COVID-19 than their unvaccinated peers. They’re also at increased risk for other infections and chronic diseases, for the same reason.\n\nAmerica’s Frontline Doctors have suggested myocarditis and other chronic health problems associated with the jabs could be the result of vaccine-acquired immunodeficiency syndrome or “VAIDS,” which is similar to AIDS in that it involves immune deficiency. The main difference is the initial trigger.\n• Researchers have warned that Janssen’s and AstraZeneca’s COVID-19 jabs may increase your risk of being infected with HIV — In part because these COVID-19 shots use the same adenovirus vector (Ad5) as a failed trial in which they were trying to create an HIV vaccine.\n\nThe use of Ad5 as a vector to transport the genetic material of HIV actually increased the risk of HIV infection rather than lowered it, and the researchers worried that Ad5 might increase the risk of HIV infection in those who get adenovirus vector COVID-19 shots as well.\n• Scientists have warned that mass vaccination during active outbreaks drives mutations — And, since the rollout of the COVID-19 jabs in December 2020, the SARS-CoV-2 virus has indeed mutated to evade mRNA injection-acquired antibodies, and the last two iterations also evade natural immunity.\n• Human trial for mRNA HIV vaccine is underway — The Moderna HIV vaccine will target a certain subset of B-cells known to loosely bind to HIV. The idea is that by prodding these B-cells with mRNA instructions, delivered through a series of shots, they might develop the capacity to produce neutralizing antibodies against HIV.\n\nThe question is, if the COVID-19 shot can cause immune depletion after repeated doses, what kind of dysfunction might a series of HIV shots trigger? What’s more, HIV, like SARS-CoV-2, is a rapidly mutating virus, so an HIV vaccine is likely to drive mutations and resistance, just as we’ve seen with the COVID-19 shot.\n• Gay and bisexual men are getting a smallpox vaccine that may worsen HIV infection — on July 23, World Health Organization Director-General Tedros Adhanom Ghebreyesus declared monkeypox a “public health emergencyof international concern,” and the U.S. Centers for Disease Control and Prevention is urging those who may be at high risk for monkeypox to get vaccinated.\n• The vaccine used is a smallpox vaccine that may or may not work against monkeypox, as the only study was done in 1988, using a smallpox vaccine that is no longer in use, against a monkeypox virus that has since mutated multiple times.\n\nNew York City started administering the smallpox vaccine in late June, and by July 22, some 18,000 New Yorkers had received their first dose.\n• It’s unclear which of the two smallpox vaccines is being given, but it seems reasonable to assume they’re using the latest one, Jynneos, which can be given to people for whom the older version (ACAM2000) is contraindicated. Jynneos is also licensed specifically to prevent monkeypox, whereas ACAM2000 is not.\n• The key point here is that HIV-positive subjects who participated in Jynneos clinical trials saw a rise in HIV counts. Today, gay men are the primary recipients of this vaccine, and they’re also a group that tends to be more prone to have HIV-AIDS. They also, as a group, have a very high COVID-19 jab rate.\n• Considering both the COVID-19 jab and Jynneos may increase the risk of HIV infection, or worsen existing infection, and that these men are already at increased risk for HIV and AIDS, the overall, compounded risk these men face seems to be remarkably elevated, yet no one is warning them of this.\n• On top of all that, we now have people who have received both the COVID-19 jab — which spawns mutations and suppresses immune function — and the smallpox vaccine. What mutations may the smallpox vaccine trigger in the SARS-CoV-2 virus, if any?\n• Live smallpox vaccine can spread vaccinia virus infection — If ACAM2000 is used, the risk for populations in general starts to skyrocket, as this older smallpox vaccine contains live, replication-capable vaccinia virus.\n\nWhen you get it, you’re infectious for about a month, and must take great care not to spread the infection. If people get ACAM2000 and fail to take such precautions, we could be looking at smallpox outbreaks.\n\nTo be clear, it’s highly unlikely that ACAM2000 is being used, but I include it here as a “what if?” scenario, seeing how the U.S. has a very large stockpile of it (about 100 million doses), while Jynneos is still in short supply.\n• mRNA monkeypox-specific injection is in preclinical study — In March, Moderna announced it is investigating mRNA-based monkeypox vaccines at a preclinical level.\n\nIf the COVID-19 jab compromises your immune function and drives mutations, will a monkeypox mRNA jab work any differently? If an mRNA monkeypox jab is given to people who already got the COVID-19 jab, might they combine to create a Frankenstein-type COVID-pox pathogen?\n\nThe list above raises several questions. Could these circumstances trigger a new epidemic of AIDS or AIDS-like illness?\n\nCould the focus on HIV testing amid the development of an HIV mRNA “vaccine” be an effort to hide the fact that the COVID-19 jabs are destroying people’s immune function (and possibly promoting HIV infection), while simultaneously manufacturing the perception that we have an urgent need for an HIV vaccine?\n\nCoincidentally, Fauci was a key figure during the 1980s AIDS epidemic, which led to hundreds of thousands of gay men dying from the treatment (AZT) that Fauci insisted be used. He’s also been a key figure in the COVID-19 pandemic, in which people have again been killed in large numbers by the very drugs Fauci has a vested interest in.\n\nFauci is also a connecting link between the COVID-19 shots and the HIV jab.\n\nNot only has he been pushing for an HIV vaccine for the better part of his career at the National Institutes of Allergy and Infectious Diseases — some 36 years — but he’s also been an eager proponent for the transition from conventional vaccines to this new mRNA platform.\n\nDespite decades of effort, no HIV vaccine has reached the market. Now that the COVID-19 jabs forced mRNA tech on the masses, Fauci’s goal to launch an HIV vaccine is in reach. But AIDS is not the crisis it once was. An estimated 1.2 million Americans have HIV infection, but HIV infection doesn’t necessarily progress to AIDS unless you have a coinfection.\n\nIs it possible that an HIV vaccine is the end game they’re after, and they’re “stimulating” the emergence of AIDS-like illness with the COVID-19 jabs to justify mass HIV vaccination? I don’t know, but it’s not outside the realm of possibility.\n\nThen again, the immunosuppression of the COVID-19 shot might just be an unforeseen side effect that fortuitously reopened the door for HIV vaccines, using the mRNA platform. Either way, the drug industry has been in the business of creating remedies for the side effects their other drugs caused, and this seems like more of the same.\n\nThe COVID-19 shots create AIDS-like illness and voila, here comes an HIV jab. Aren’t we the lucky ones?!\n\nTo draw the noose around COVID-19 and HIV even tighter, researchers have — since 2006 at the latest — been looking at creating an HIV vaccine using a coronavirus vector.\n\n“Toward a Coronavirus-Based HIV Multigene Vaccine,” published in the Journal of Immunology Research in 2006, describes using a coronavirus (common cold virus) as a backbone to hold two HIV envelope glycoproteins, gp41 and gp120, to create a prototype HlV-1 vaccine.\n\nIf gp120 rings a bell, it’s because I mentioned it at the beginning of this article. The Indian researchers that discovered HIV insertions in SARS-CoV-2 found “Uncanny similarity of unique inserts in the 2019-nCoV spike protein to HIV-1 gp120 …”\n\nSo, to recap, coronavirus has been used in HIV vaccine research, and somehow parts of the HIV envelope ended up in a coronavirus known as SARS-CoV-2.\n\nAnd, while Fauci has denied any link between SARS-CoV-2 and HIV research, there’s clear evidence that not only did he know about the existence of coronavirus-HIV chimeras, his agency invented some of the methods used to make them.\n\nTracking and tracing of HIV/AIDS is also being revamped. The U.S. Centers for Disease Control and Prevention surveils the spread of HIV by monitoring routinely collected blood samples. This surveillance can then be used to perform contact tracing.\n\n“Robert Suttle has seen firsthand the legal risks of having HIV. In 2008, Suttle said, a former partner accused him of not disclosing he was HIV-positive. He was charged under Louisiana law with ‘intentional exposure to AIDS virus.’ …\n\n“Suttle pleaded guilty, received a sentence of six months in state prison, and was required to register as a sex offender. ‘You can be criminalized, certainly, for existing as a person living with HIV,’ he said.\n\n“Suttle … said his experience has him worried about a new tool being promoted by federal officials to monitor the spread of HIV. … Suttle said such data could be used in cases like his.\n\n“‘With this surveillance, you could be connected to many different people or considered to be the source that transmitted to all these other people,’ he said. …\n\n“Molecular surveillance has met considerable opposition since it was rolled out nationally. Service providers, health equity advocates, and people living with HIV worry the risks of the approach outweigh the benefits, and their concerns have gotten louder as awareness of the tool grows.\n\n“Some have called for the practice to stop until federal health officials address concerns about patient consent, data security, and the potential for HIV criminalization.”\n\nThe idea and possibility of HIV criminalization also fit well with what the global biosecurity state has in mind, which is to control people by any and every means possible.\n\nHIV-infected people could even be ordered to abstain from sex, for biosecurity reasons, which would contribute to population reduction — especially if HIV infection were really widespread — and that appears to be a key goal of the technocratic, antihuman cabal.\n\nI hope I’m wrong about the theory that HIV infection and AIDS are being encouraged to justify mass HIV vaccination. But I don’t think it’s outside the realm of possibility, so keep the converging factors in mind as we move forward, and let’s see what happens.", "opengraph": {}, "tags": ["SARS", "#sars-cov-2 manmade", "Anthony Fauci", "Montagnier"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2021/08/28/wuhan-gates-41-sars-2-is-a-bio-weapon-complaint-to-the-hague-court-with-montagnier-expertise-complaint-to-the-hague-court-with-montagnier-expertise-us-intelligence-spl/", "https://www.gospanews.net/en/2021/08/28/wuhan-gates-41-sars-2-is-a-bio-weapon-complaint-to-the-hague-court-with-montagnier-expertise-complaint-to-the-hague-court-with-montagnier-expertise-us-intelligence-spl/", "https://www.gospanews.net/en/2020/05/14/wuhangate-8-sars-2-virus-gmo-built-with-hiv-bio-engineer-ex-nato-lecturer-destroyed-natural-origin-theory/", "https://www.gospanews.net/en/2020/09/04/wuhan-gates-19-sars-2-bio-weapon-to-vaccinate-all-against-aids-bill-gates-supports-vaccines-gay-pride-military-tests-on-hiv-and-coronavirus/", "https://www.gospanews.net/2022/03/10/wuhan-gates-50-sars-2-bio-arma-tormenta-palu-tracce-di-covid-in-brevetto-mrna-2016-moderna-svelate-dal-virologo-n-1-aifa-e-medici-usa/", "https://www.gospanews.net/en/2020/09/04/wuhan-gates-19-sars-2-bio-weapon-to-vaccinate-all-against-aids-bill-gates-supports-vaccines-gay-pride-military-tests-on-hiv-and-coronavirus/", "https://www.gospanews.net/2022/03/10/wuhan-gates-50-sars-2-bio-arma-tormenta-palu-tracce-di-covid-in-brevetto-mrna-2016-moderna-svelate-dal-virologo-n-1-aifa-e-medici-usa/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://www.gospanews.net/2022/04/16/wuhan-gates-50-da-sars-cov-2-con-hiv-al-vaccino-anti-aids-montagnier-accuso-moderna-avvia-i-trials-gates/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.reuters.com/world/china/china-allow-use-genuine-biotechs-hiv-drug-covid-patients-2022-07-25/", "https://web.archive.org/web/20200201002828/https:/www.zerohedge.com/geopolitical/coronavirus-contains-hiv-insertions-stoking-fears-over-artificially-created-bioweapon", "https://web.archive.org/web/20200201020813/https:/www.biorxiv.org/content/10.1101/2020.01.30.927871v1", "https://www.gospanews.net/en/2020/05/14/wuhangate-8-sars-2-virus-gmo-built-with-hiv-bio-engineer-ex-nato-lecturer-destroyed-natural-origin-theory/", "https://childrenshealthdefense.org/defender/vaccine-industry-peter-hotez-funded-wuhan-gain-of-function-study/", "https://web.archive.org/web/20200201020813/https:/www.biorxiv.org/content/10.1101/2020.01.30.927871v1", "https://www.gospanews.net/en/2020/04/18/wuhangate-3-covid-19-created-in-lab-with-hiv-medicine-nobel-confirms-indian-research-disclosed-by-gospa-news/", "https://www.gospanews.net/en/2020/05/16/wuhangate-9-hiv-inserted-in-sars-samples-in-2007-pics-thanks-to-australian-eu-commission-prodi-funds/", "https://www.amazon.com/Real-Anthony-Fauci-Democracy-Childrens/dp/1510766804", "https://www.gospanews.net/en/2020/05/14/wuhangate-8-sars-2-virus-gmo-built-with-hiv-bio-engineer-ex-nato-lecturer-destroyed-natural-origin-theory/", "https://childrenshealthdefense.org/defender/health-freedom-movement-death-dr-luc-montagnier/", "https://www.westernjournal.com/doctor-discovered-hiv-confident-covid-19-created-lab/", "https://apnews.com/article/conspiracy-theories-iran-only-on-ap-media-misinformation-bfca6d5b236a29d61c4dd38702495ffe", "https://www.gospanews.net/en/2020/04/18/wuhangate-3-covid-19-created-in-lab-with-hiv-medicine-nobel-confirms-indian-research-disclosed-by-gospa-news/", "https://www.westernjournal.com/doctor-discovered-hiv-confident-covid-19-created-lab/", "https://off-guardian.org/2022/02/11/is-there-something-more-sinister-behind-the-new-hiv-scare/", "https://childrenshealthdefense.org/defender_category/covid/", "https://takecontrol.substack.com/p/aids-scare", "https://www.verywellhealth.com/biden-hiv-plan-5212634", "https://ukhsa.blog.gov.uk/2021/12/01/charting-a-course-to-end-hiv-transmission-in-england-by-2030/", "https://www.gospanews.net/en/2020/05/16/wuhangate-9-hiv-inserted-in-sars-samples-in-2007-pics-thanks-to-australian-eu-commission-prodi-funds/", "https://off-guardian.org/2022/02/10/as-covid-crumbles-theyre-already-prepping-the-next-pandemic/", "https://childrenshealthdefense.org/defender/who-global-pandemic-treaty-world-bank-vaccine-passports/", "https://www.euronews.com/my-europe/2022/02/10/debunked-covid-19-vaccines-do-not-create-variants-of-hiv-aids", "https://twitter.com/i/events/1492167444323991554", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://www.gospanews.net/en/2020/05/30/wuhan-gates-11-hiv-inside-sars-2-as-in-a-bio-weapon-scientists-dead-and-spies-ring-in-canada-china-and-us/", "https://childrenshealthdefense.org/defender/repeated-covid-vaccines-impair-immune-system/", "https://childrenshealthdefense.org/defender/jack-last-astrazeneca-covid-vaccine-death/", "https://www.forbes.com/sites/roberthart/2020/10/20/researchers-warn-some-covid-19-vaccines-could-increase-risk-of-hiv-infection/?sh=9bb2e6a3740e", "https://www.gospanews.net/en/2020/05/30/wuhan-gates-11-hiv-inside-sars-2-as-in-a-bio-weapon-scientists-dead-and-spies-ring-in-canada-china-and-us/", "https://www.gospanews.net/en/2022/03/11/who-confusion-on-peoples-immunity-and-effectiveness-of-covid-vaccines-contradictory-document-by-technical-advisors/", "https://childrenshealthdefense.org/defender/vaccine-injury-cover-up-covid-vaccination/", "https://www.gospanews.net/en/2022/03/11/who-confusion-on-peoples-immunity-and-effectiveness-of-covid-vaccines-contradictory-document-by-technical-advisors/", "https://archive.ph/0qLej", "https://www.gospanews.net/2022/04/16/wuhan-gates-50-da-sars-cov-2-con-hiv-al-vaccino-anti-aids-montagnier-accuso-moderna-avvia-i-trials-gates/", "https://www.gospanews.net/2022/04/16/wuhan-gates-50-da-sars-cov-2-con-hiv-al-vaccino-anti-aids-montagnier-accuso-moderna-avvia-i-trials-gates/", "https://www.medscape.com/viewarticle/977674", "https://www.statnews.com/2022/07/23/who-declares-monkeypox-outbreak-a-public-health-emergency/", "https://childrenshealthdefense.org/defender/monkeypox-health-emergency-fda-kids-vaccines/", "https://news.yahoo.com/side-effects-monkeypox-vaccine-doctors-181900623.html", "https://www.science.org/action/cookieAbsent", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2491159/", "https://www.gospanews.net/en/2022/08/07/monkeypox-outbreak-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "https://www.gospanews.net/en/2022/08/07/monkeypox-outbreak-connected-to-mrna-covid-vaccines-israeli-physician-scientist-injured-by-pfizer-said/", "https://archive.ph/mjCe5", "https://www.biopharma-reporter.com/Article/2022/06/02/Monkeypox-The-vaccine-landscape", "https://merylnass.substack.com/p/will-you-be-one-of-the-guinea-pigs", "https://childrenshealthdefense.org/defender/fda-eua-jynneos-monkeypox-vaccine-high-risk-children/", "https://www.gospanews.net/en/2020/09/04/wuhan-gates-19-sars-2-bio-weapon-to-vaccinate-all-against-aids-bill-gates-supports-vaccines-gay-pride-military-tests-on-hiv-and-coronavirus/", "https://www.biopharma-reporter.com/Article/2022/06/02/Monkeypox-The-vaccine-landscape", "https://childrenshealthdefense.org/defender/covid-vaccines-aids-destroying-immune-function/", "https://www.gospanews.net/en/2020/09/04/wuhan-gates-19-sars-2-bio-weapon-to-vaccinate-all-against-aids-bill-gates-supports-vaccines-gay-pride-military-tests-on-hiv-and-coronavirus/", "https://childrenshealthdefense.org/defender/media-sen-ron-johnson-fauci-hiv-danger/", "https://childrenshealthdefense.org/defender/john-lauritsen-poison-by-prescription-the-azt-story/", "https://childrenshealthdefense.org/defender/17-year-old-died-myocarditis-pfizer-shot-vaers-data/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://rightsfreedoms.wordpress.com/2021/10/08/fauci-and-others-openly-discuss-their-intent-to-enforce-a-mrna-type-flu-vaccine-in-2019/", "https://www.gospanews.net/en/2022/03/22/wuhan-gates-48-moderna-vaccine-patented-9-months-before-pandemic-thanks-to-the-fauci-baric-manmade-sars-viruses/", "https://childrenshealthdefense.org/defender/dr-robert-malone-mrna-covid-vaccines-fda-cdc-corruption-hooker/", "https://downloads.hindawi.com/journals/jir/2006/856275.pdf", "https://www.gospanews.net/en/2020/04/14/wuhan-gate-2-hiv-inside-coronavirus-bio-weapon-proof-by-indian-research-misteriously-concealed/", "https://www.gospanews.net/en/2020/04/14/wuhan-gate-2-hiv-inside-coronavirus-bio-weapon-proof-by-indian-research-misteriously-concealed/", "https://twitter.com/charlesrixey/status/1542712182181347331", "https://childrenshealthdefense.org/defender/john-lauritsen-aids-epidemic-azt-interview/", "https://www.medscape.com/viewarticle/977674", "https://childrenshealthdefense.org/defender/pandemic-treaty-world-health-organization-cola/", "https://www.mercola.com/", "https://www.gospanews.net/en/2022/06/04/vaccines-graphene-1-dangerous-mysterious-nanoparticles-inside-mrna-serum-toxicology-not-thoroughly-investigated-pfizer-wrote/", "https://www.gospanews.net/en/2022/08/11/wuhan-gates-51-sars-2003-and-2019-american-bioweapons-russian-genomic-and-chemical-experts-said/", "https://www.gospanews.net/en/2022/06/02/wuhan-gates-50-the-italian-boss-of-obamas-coronavirus-ukraine-laboratories-funded-by-former-cia-director-leon-panetta/"], "authors": [""], "publish_date": "August 14, 2022"}