{"result_id": "333043", "URL": "https://www.veteranstoday.com/2022/11/18/worrying-german-study-on-covid-19-vaccination-boosters-pfizer-bivalent-caused-more-serious-adverse-reactions-than-monovalent-one/", "timestamp": "2023-04-25 17:54:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2022/11/18/worrying-german-study-on-covid-19-vaccination-boosters-pfizer-bivalent-caused-more-serious-adverse-reactions-than-monovalent-one/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "Worrying German Study on Covid-19 Vaccination Boosters: “Pfizer Bivalent caused more Serious Adverse Reactions than Monovalent one” | VT Foreign Policy", "cleaned_text": "On the cover image the study of the German University Hospital of Wuerzburg and the first signatory Isabelle Wagenhäuser\n\nAmong the first to enthusiastically welcome the bivalent anti-Covid vaccines in Italy was the Piedmont Region, led by President Alberto Cirio and linked to Bill Gates, the world emperor of Big Pharma of experimental and dangerous gene serums, with multiple projects ranging from promotion of the International Alba White Truffle Fair even to the use of Artificial Intelligence in military technologies in a NATO project located in Turin, the epicenter of the Piedmont Aerospace District.\n\nIn fact, the Piedmontese governor together with the regional Health Councilor Luigi Icardi boasted of having “burned the time” for the start of the administration of the fifth dose to the most fragile, elderly and immunosuppressed patients, although the latest research has revealed that they are precisely those more at risk of lethal “breakthrough infections”, i.e. contagion from Covid-19 following inoculation for still undetermined causes that some studies attribute precisely to vaccines…\n\nNow the Wuerzburg University Hospital, in Germany, is sounding a very worrying alarm: the new bivalent boosters cause more and more serious adverse reactions than those not updated for the two Omicron variants.This is a very serious warning for two reasons.\n\nPrimarily because the real danger of primary doses of messenger RNA gene serums has not yet been ascertainedsince, as denounced by the British Medical Journal and previewed by Gospa News, the Food and Drug Administration has not published data on serious adverse reactions collected with active pharmacovigilance(follo-up controls of cases) while the EudraVigilance platform for passive pharmacovigilance (reports of undesirable effects) in the European Union, for mysterious reasons, has not been updated since September!\n\nIt is self-evident that if the seriousness of the consequences produced by the anti-Covid vaccines of the first two doses and by the monovalent boosters are not known, which cumulatively have already resulted in millions of reports of serious side effects including tens of thousands of lethal ones, the greatest danger detected for that of bivalents is much more worrying but of a totally unknown extent…\n\nSecondly, this research by zealous German university doctors reveals a consequence that the most serious experts in virology and pharmacology, however, expected as the new vaccines for the fourth dose have only been tested on mice and approved without necessary and in-depth clinical studies. as secretly “solicited/imposed” by the American CDC, the Centers of Diseases Control and Prevention, to the Food and Drug Administration which must authorize the use of each new drug in the USA.\n\nAnd since the EMA, the European Medicines Agency, and the AIFA, the Italian Medicines Agency, i.e. the regulatory bodies that are supposed to monitor compliance with the safety standards of medicines, act by “copying and pasting” the FDA by virtue of global pressure, exerted by Gates’ NGOs also with munificent lobbying activity towards politicians and public officials of the various nations, every type of anti-Covid vaccine approved by the USA ends up in the protocols recommended by the European and Italian health authorities without the slightest in-depth counter-verification.\n\nThe most sensational case of this attitude occurred for the authorization to administer the first doses of the anti-Covid gene serum Comirnaty to children under the age of 5, produced by the American pharmaceutical company Pfizer together with the German Biontech.\n\nThanks to an affirmative vote from a doctor in blatant conflicts of interest after receiving funding from Pfizer’s partner GSK of Big Pharma in London, the CDC’s Advisory Committee on Immunization Practices (ACIP) recommended him to the FDA , although the same manufacturer had warned the health authorities that there were no studies on the risks of myocarditis, one of the most terrible adverse reactions widespread among young people as also highlighted in the vaccine leaflets.\n\nWell EMA and AIFA both approved emergency use on minors, concealing this dramatic gap and despite the fact that the number of serious cases of covid in children was very low.\n\nIn the previous investigation we saw how the University Hospital of Nimes revealed a significant increase among young people in cases of myocarditis, an inflammation of the heart that is often even lethal. Now let’s see why Comirnaty’s bivalent booster turns out to be much more dangerous than the monovalent booster produced by the same company.\n\nTHE ALARMING STUDY OF THE WUERZBURG UNIVERSITY HOSPITAL\n\nThe outcome of the new German study therefore immediately appears disturbing, although detailed in a limited number of people, non-randomized (i.e. without double-blind counter-verification with individuals administered placebo) and not yet reviewed by third parties.\n\n«In the light of emerging SARS-CoV-2 variants of concern (VOC), bivalent COVID-19 vaccines combining the wild-type spike mRNA with an Omicron VOC BA.1 or BA.4-5 spike mRNA became available. This non-randomized controlled study examined adverse reactions, PRN (pro re nata) medication intake and inability to work after a fourth COVID-19 vaccination among 76 healthcare workers. As fourth dose either the original, monovalent BNT162b2mRNA (48.7%) or the bivalent BNT162b2mRNA original/Omicron BA.4-5 vaccine (51.3%) was administered».\n\nWe read in the Summary of the research entitled “Bivalent BNT162b2mRNA original/Omicron BA.4-5 booster vaccination: adverse reactions and inability to work compared to the monovalent COVID-19 booster” and published on MedRxiv last November 8 in pre-print ( pending peer review). The pharmacological identification code reported is that of the Comirnaty vaccine produced by Pfizer and Biontech.\n\nIt was conducted by academics Isabell Wagenhäuser (first signatory) and Manuel Krone (corresponding author), from the Infection Control and Antimicrobial Stewardship Unit, University Hospital Wuerzburg, Julia Reusch and Nils Petri, Department of Internal Medicine I, University Hospital Wuerzburg, Lukas B. Krone, Department of Physiology, Anatomy and Genetics, University of Oxford, UK, Oliver Kurzai, Institute for Hygiene and Microbiology, University of Wuerzburg,\n\n«The rate of adverse reactions for the second booster dose was significantly higher among participants receiving the bivalent 84.6% (95% CI 70.3%-92.8%; 33/39) compared to the monovalent 51.4% (95% CI 35.9-66.6%; 19/37) vaccine (p=0.0028). Also, there was a trend towards an increased rate of inability to work and intake of PRN medication following bivalent vaccination».\n\n«In view of preprints reporting inconclusive results in neutralizing antibody levels between the compared vaccines, our results and further studies on safety and reactogenicity of bivalent COVID-19 booster vaccines are highly important to aid clinical decision making in the choice between bivalent and monovalent vaccinations» can even be read in the Abstract.\n\nThis study was funded by the Federal Ministry for Education and Science (BMBF) through a grant provided to the University Hospital of Wuerzburg by the Network University Medicine on COVID-19 (B-FAST, grant-No 01KX2021) as well as by the Free State of Bavaria with COVID-research funds provided to the University of Wuerzburg, Germany. Nils Petri is supported by the German Research Foundation (DFG) funded scholarship UNION CVD.\n\nThis would be enough to immediately trigger an investigation by the EMA and AIFA, assuming that the doctors in charge of pharmacovigilance take the stomach ache of reading the new studies on vaccines as it does in its little Gospa News…\n\nBut one detail makes the research of the German public health structure even more significant: the corresponding author is Manuel Krone, deputy director of the Infection Control and Antimicrobial Management Unit of the German hospital, who had to declare a conflict of interest having received «honoraria from GSK and Pfizer outside the submitted work».\n\nIf a doctor on the payroll of the New York pharmaceutical manufacturer of Comirnaty and a university of German nationality such as Biontech, a partner of the American Big Pharma in the production of this vaccine, manage to make these data public, they can certainly be considered reliable even before the definitive review by the fellow scientists of the medical journal MedRxiv.\n\nThere is only one gap in this study: there is no distinction between mild and severe reactions which can also be guessed from the percentage of vaccinated health workers with incapacity for work. But even in this sense, a further element is missing: the length of the period of incapacity.\n\nThis research confirms all the concerns expressed by authoritative doctors such as the Milanese surgeon Andrea Stramezzi regarding the dangers of the new boosters…\n\nThe alarm bell has been sounded.\n\nBut we fear that the new Italian Minister of Health Orazio Schillaci, involved in a partnership with Pfizer through the University of Rome Tor Vergata of which he is rector, does not dare to flea a bivalent gene serum tested only on mice just as he does not seem to intend to launch a commission of inquiry into adverse reactions from vaccines and deaths caused by early home therapies ignored by the Italian health authorities.\n\nMEDRXIV – Bivalent BNT162b2mRNA original/Omicron BA.4-5 booster vaccination: adverse reactions and inability to work compared to the monovalent COVID-19 booster", "opengraph": {}, "tags": ["Pfizer/BioNTech COVID-19 vaccine", "Covid-19 booster", "mRNA"], "tweets": [], "movies": [], "links": ["https://www.gospanews.net/en/2022/09/23/wuhang-gates-54-how-bill-iii-vaccines-emperor-alongside-his-ngo-lobbied-us-eu-politicians-with-8-3-million/", "https://www.gospanews.net/en/2022/07/28/weapons-lobby-7-nato-gates-international-military-intrigue-in-turin-to-develop-ai-and-aerospace-technologies-in-diana-project/", "https://www.gospanews.net/2022/10/26/trivaccinati-piu-a-rischio-di-contrarre-covid-sintomatico-nuovo-studio-guidato-da-medico-cdc-usa-mentre-il-piemonte-parte-con-la-quinta-dose/", "https://www.gospanews.net/2022/11/29/strage-da-covid-tra-vaccinati-ma-aifa-ed-eudravigilance-celano-i-morti-da-infezioni-breccia-allarmi-e-studi-negli-usa/", "https://www.gospanews.net/2022/10/26/trivaccinati-piu-a-rischio-di-contrarre-covid-sintomatico-nuovo-studio-guidato-da-medico-cdc-usa-mentre-il-piemonte-parte-con-la-quinta-dose/", "https://www.gospanews.net/2022/10/26/trivaccinati-piu-a-rischio-di-contrarre-covid-sintomatico-nuovo-studio-guidato-da-medico-cdc-usa-mentre-il-piemonte-parte-con-la-quinta-dose/", "https://www.gospanews.net/en/2022/11/01/british-medical-journals-bomb-us-fda-hides-data-on-serious-adverse-events-after-covid-vaccines/", "https://www.gospanews.net/2022/11/29/strage-da-covid-tra-vaccinati-ma-aifa-ed-eudravigilance-celano-i-morti-da-infezioni-breccia-allarmi-e-studi-negli-usa/", "https://www.gospanews.net/2022/11/05/strage-da-covid-tra-vaccinati-ma-aifa-ed-eudravigilance-celano-i-morti-da-infezioni-breccia-allarmi-e-studi-negli-usa/", "https://www.gospanews.net/en/2022/07/03/official-data-record-74783-deaths-and-5830235-injuries-following-covid-19-vaccines-in-the-europe-and-us/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2022/11/01/british-medical-journals-bomb-us-fda-hides-data-on-serious-adverse-events-after-covid-vaccines/", "https://www.gospanews.net/en/2022/09/23/wuhang-gates-54-how-bill-iii-vaccines-emperor-alongside-his-ngo-lobbied-us-eu-politicians-with-8-3-million/", "https://www.gospanews.net/en/2021/11/19/exclusive-pfizer-paper-confirmed-genetic-experiments-on-5yo-kids-myocarditis-risks-by-vaccines-little-data-well-study-after-fda-authorization/", "https://www.gospanews.net/en/2021/11/19/exclusive-pfizer-paper-confirmed-genetic-experiments-on-5yo-kids-myocarditis-risks-by-vaccines-little-data-well-study-after-fda-authorization/", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.gospanews.net/en/2021/11/05/scandal-on-vaccines-for-children-gsk-pfizer-partner-funded-with-18thousand-a-member-of-cdc-who-approved-the-jabs-since-5yo/", "https://www.gospanews.net/2022/07/05/bimbi-cavie-dei-sieri-genici-di-gates-in-italia-solo-57-decessi-per-covid-tra-under-19-in-2-anni-ma-231-malori-fatali-dopo-i-vaccini-in-6-mesi/", "https://www.gospanews.net/en/2022/11/10/a-french-university-hospitals-shock-study-myocarditis-in-young-people-and-embolism-in-women-growing-after-vaccination-campaign-alarms-by-an-us-cardiologist-too/", "https://www.gospanews.net/en/2022/11/10/a-french-university-hospitals-shock-study-myocarditis-in-young-people-and-embolism-in-women-growing-after-vaccination-campaign-alarms-by-an-us-cardiologist-too/", "https://www.gospanews.net/en/2022/10/29/cdc-pushed-for-covid-19-boosters-without-clinical-trials-disturbing-emails/", "https://www.gospanews.net/en/2022/09/13/criminal-fda-and-cdc-ignore-law-and-approve-new-covid-vaccine-boosters-with-zero-testing-on-humans-on-mice-only/", "https://www.gospanews.net/2022/11/03/vaccini-covid-inutili-e-molto-pericolosi-per-bambini-e-anziani-il-medico-stramezzi-intervistato-da-un-ex-sindacalista-militare/", "https://www.gospanews.net/2022/10/23/il-ministro-della-salute-schillaci-con-big-pharma-ue-sui-sieri-mrna-rettore-di-universita-partner-di-pfizer-e-del-marito-di-von-der-leyen/", "https://www.gospanews.net/en/2022/09/13/criminal-fda-and-cdc-ignore-law-and-approve-new-covid-vaccine-boosters-with-zero-testing-on-humans-on-mice-only/", "https://www.gospanews.net/2022/10/29/covid-mattarella-ringrazia-le-big-pharma-sotto-inchiesta-e-loda-i-vaccini-finta-commissione-parlamentare-legittimata-a-ignorare-morti-e-danni-da-reazioni-avverse/", "https://www.gospanews.net/en/2022/11/15/100-of-mrna-jab-recipients-suffered-heart-injury-how-to-treat-long-covid/", "https://www.gospanews.net/en/2022/02/07/italian-biologist-no-vax-killed-by-a-very-lethal-and-suspect-covid-after-contacts-with-prosecutors-on-therapies-ignored-by-govt/", "https://t.me/gospanews", "https://www.gospanews.net/en/category/corona-virus/", "https://www.gospanews.net/en/category/wuhan-gates/", "https://www.medrxiv.org/content/10.1101/2022.11.07.22281982v1?%253fcollection=", "https://www.gospanews.net/en/2022/11/15/100-of-mrna-jab-recipients-suffered-heart-injury-how-to-treat-long-covid/", "https://www.gospanews.net/en/2022/09/23/wuhang-gates-54-how-bill-iii-vaccines-emperor-alongside-his-ngo-lobbied-us-eu-politicians-with-8-3-million/", "https://www.gospanews.net/2022/10/23/il-ministro-della-salute-schillaci-con-big-pharma-ue-sui-sieri-mrna-rettore-di-universita-partner-di-pfizer-e-del-marito-di-von-der-leyen/", "https://www.gospanews.net/en/2022/07/28/weapons-lobby-7-nato-gates-international-military-intrigue-in-turin-to-develop-ai-and-aerospace-technologies-in-diana-project/", "https://www.gospanews.net/2022/10/29/covid-mattarella-ringrazia-le-big-pharma-sotto-inchiesta-e-loda-i-vaccini-finta-commissione-parlamentare-legittimata-a-ignorare-morti-e-danni-da-reazioni-avverse/"], "authors": [""], "publish_date": "November 18, 2022"}