{"result_id": "333039", "URL": "https://www.veteranstoday.com/2021/11/18/the-road-to-fascism-paved-with-vaccine-mandates-and-corporate-collusion/", "timestamp": "2023-04-25 17:54:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.veteranstoday.com/wp-content/uploads/2017/10/vt16X16.png", "canonical": "https://www.veteranstoday.com/2021/11/18/the-road-to-fascism-paved-with-vaccine-mandates-and-corporate-collusion/", "encoding": "UTF-8"}, "image": null, "domain": "www.veteranstoday.com", "title": "The Road to Fascism: Paved with Vaccine Mandates and Corporate Collusion | VT Foreign Policy", "cleaned_text": "JEA: The following article by constitutional attorney John W. Whitehead is not a dissertation for or against vaccine. It is simply a reflection of what is happening. Don’t be naïve to believe that the oligarchs aren’t really happy about using the covid pandemic for their own ideological agenda. As the popular saying goes, never let a good crisis go to waste.\n\nThere are serious doctors, academic scientists, and nurses who are genuinely concerned about what is going on, and I would challenge anyone to pick up the resent scholarly study entitled: Corona, False Alarm?: Facts and Figures, written by two academic scientists and Karina Reiss and Sucharit Bhakdi. The book is packed with statistical data. My two sisters are practicing nurses, and one of my late brothers was a pharmacist in Ohio. They all were concerned about what was happening (too much to detail here). In any event, it is always sobering for anyone to use his or her skeptical mind whenever a crisis pops up.\n\nWe are moving fast down the road to fascism.\n\nThis COVID-19 pandemic has shifted us into high gear.\n\nThe heavy-handed collusion between the Techno-Corporate State and the U.S. government over vaccine mandates is merely the latest manifestation of the extent to which fascist forces are working to overthrow our constitutional republic and nullify the rights of the individual.\n\nIn early November 2021, the Biden Administration drew its line in the sand for more than 100 million American workers: get vaccinated against COVID-19 (by Nov. 22 for federal workers, and Jan. 4 for federal contractors and companies with more than 100 employees) or else.\n\nOr else what?\n\nFor many individuals with sincere objections to the vaccine, either based on their religious beliefs or some other medical or philosophical concern, non-compliance with workplace vaccine mandates will mean losing their jobs and the possibility of no unemployment benefits.\n\nOne survey conducted by the Society for Human Resource Management estimated that 28% of employed Americans wouldn’t get a COVID vaccine even if it meant losing their jobs.\n\nAlthough OSHA (the Occupational Safety and Health Administration) is requiring that employees be paid for the time it takes to get vaccinated and recover from any side effects, those who refuse to get vaccinated but keep their jobs will have to test negative for COVID weekly and could be made to shoulder the costs of those weekly tests. Healthcare workers are not being given an option for testing: it’s the vaccine or nothing.\n\nTo give the government’s arm-twisting some added strength, companies that violate the workplace mandate rules “can face fines of up to $13,653 per violation for serious violations and 10 times that for willful or repeated violations.”\n\nIn other words, as Katrina Trinko writes for USA Today, “the government is turning employers—who are not paid by, nor work for, the government—into an army of vaccine enforcers.”\n\nYou know who won’t suffer any harm as a result of these vaccine mandates? The Corporate State (manufacturers, distributors, and health care providers), which were given a blanket “get out of jail” card to insulate them from liability for any injuries or death caused by the vaccines.\n\nWhile this vaccine mandate is being presented as a “targeted” mandate as opposed to a national mandate that impacts the entire population, it effectively leaves those with sincere objections to the COVID vaccine with very little options beyond total compliance or unemployment.\n\nThis has long since ceased to be a debate over how best to protect the populace at large against an unknown pandemic. Rather, it has become a massively intrusive, coercive and authoritarian assault on the right of individual sovereignty over one’s life, self and private property.\n\nAs such, these COVID-19 mandates have become the new battleground in the government’s tug-of-war over bodily autonomy and individual sovereignty.\n\nAlready, the legal challenges to these vaccine mandates are piling up before the courts. Before long, divided circuit court rulings will make their way to the U.S. Supreme Court, which will be asked to decide whether these mandates constitute government overreach or a natural extension of the government’s so-called emergency powers.\n\nWith every new court ruling that empowers corporations and the government to use heavy-handed tactics to bring about vaccine compliance, with every new workplace mandate that forces employees to choose between their right to bodily autonomy and economic livelihood, and with every new piece of legislation that insulates corporations and the government from being held accountability for vaccine injuries and deaths, our property interest in our bodies is diminished.\n\nAt a minimum, our right to individual sovereignty over our lives and our bodies is being usurped by power-hungry authoritarians; greedy, self-serving corporations; egotistical Nanny Staters who think they know what’s best for the rest of the populace; and a short-sighted but well-meaning populace which fails to understand the long-term ramifications of trading their essential freedoms for temporary promises of safety and security.\n\nWe are more vulnerable now than ever before.\n\nThis debate over bodily autonomy, which covers broad territory ranging from forced vaccinations, abortion and euthanasia to forced blood draws, biometric surveillance and basic healthcare, has far-reaching ramifications for who gets to decide what happens to our bodies during an encounter with government officials.\n\nOn a daily basis, Americans are already being made to relinquish the most intimate details of who we are—our biological makeup, our genetic blueprints, and our biometrics (facial characteristics and structure, fingerprints, iris scans, etc.)—in order to clear the nearly insurmountable hurdle that increasingly defines life in the United States: we are now guilty until proven innocent.\n\nThis merely pushes us one step further down that road towards a total control society in which the government in collusion with Corporate America gets to decide who is “worthy” of being allowed to take part in society.\n\nRight now, COVID-19 vaccines are the magic ticket for gaining access to the “privileges” of communal life. Having already conditioned the population to the idea that being part of society is a privilege and not a right, such access could easily be predicated on social credit scores, the worthiness of one’s political views, or the extent to which one is willing to comply with the government’s dictates, no matter what they might be.\n\nThe government is litigating and legislating its way into a new framework where the dictates of petty bureaucrats carry greater weight than the inalienable rights of the citizenry.\n\nWhen all that we own, all that we earn, all that we say and do—our very lives—depends on the benevolence of government agents and corporate shareholders for whom profit and power will always trump principle, we should all be leery and afraid.", "opengraph": {}, "tags": ["vaccine", "New World Order", "ideology"], "tweets": [], "movies": [], "links": ["https://www.npr.org/2021/11/04/1048939858/osha-biden-vaccine-mandate-employers-100-workers", "https://www.cnbc.com/2021/10/07/fired-for-refusing-a-covid-vaccine-you-likely-cant-get-unemployment-benefits.html", "https://www.cnbc.com/2021/10/07/fired-for-refusing-a-covid-vaccine-you-likely-cant-get-unemployment-benefits.html", "https://www.npr.org/2021/11/04/1048939858/osha-biden-vaccine-mandate-employers-100-workers", "https://www.npr.org/2021/11/04/1048939858/osha-biden-vaccine-mandate-employers-100-workers", "https://www.npr.org/2021/11/04/1048939858/osha-biden-vaccine-mandate-employers-100-workers", "https://news.yahoo.com/joe-biden-wants-boss-force-160757001.html", "https://www.forbes.com/sites/adamandrzejewski/2021/11/04/feds-pay-zero-claims-for-covid-19-vaccine-injuriesdeaths/?sh=597506a44a87", "https://www.reuters.com/world/us/federal-appeals-court-affirms-stay-biden-vaccine-mandate-2021-11-12/", "https://www.forbes.com/sites/adamandrzejewski/2021/11/04/feds-pay-zero-claims-for-covid-19-vaccine-injuriesdeaths/"], "authors": [""], "publish_date": "November 18, 2021"}