{"result_id": "335025", "URL": "https://votefraud.news/2022-11-13-covid-plandemic-allowed-democrats-steal-two-elections.html", "timestamp": "2023-04-25 17:55:55 CEST+0200", "meta": {"description": "By now you are probably well aware that the long-hyped midterms “red wave” turned out to be more of a red trickle. Did conservatives just not come out to vote as expected, or was there more voter fraud again? Justin Hart, author of the book Gone Viral: How Covid Drove the World Insane, put together […]", "lang": "en", "keywords": "conspiracy,corruption,COVID,deception,election,election fraud,fraud,midterms,national security,Plandemic,rigged,vote fraud,voting,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-11-13-covid-plandemic-allowed-democrats-steal-two-elections.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "How the covid plandemic allowed Democrats to steal TWO elections (and counting)", "cleaned_text": "How the covid plandemic allowed Democrats to steal TWO elections (and counting)\n\nBy now you are probably well aware that the long-hyped midterms “red wave” turned out to be more of a red trickle. Did conservatives just not come out to vote as expected, or was there more voter fraud again?\n\nJustin Hart, author of the book Gone Viral: How Covid Drove the World Insane, put together a tweet series suggesting that the changes made to voting in response to the Wuhan coronavirus (Covid-19) ensure that every election can now be easily stolen.\n\nIt is a fact that ever since the Chinese Virus appeared, nearly half of the country now accepts mail-in ballots as a valid form of voting. Universal mail-in voting, which was sold to the public as a way to stay protected against Chinese Germs, allows for all sorts of fraud, not the least of which is ballot harvesting.\n\nWhen the scamdemic was at its peak going into the 2020 election cycle, some 17 states allowed for mail-in ballots. Now that the scamdemic is over, only nine of those 17 rolled back to the old voting methods.\n\nThis leaves eight states – a few of them majority liberal but also a few that are not – that are still using drop boxes to collect questionable ballots that are easily forged because they cannot be properly vetted.\n\nHart also explains that following the mail-in voting rollback in those nine states, Democrats appear, based on the numbers, to have quickly and easily adapted. Conservatives? Not so much.\n\n“Dems retained nearly half of the mail-in volume they had from 2020,” Hart tweeted. “GOP dropped 60%. Fetterman has 1.7 million vote for him on Election Day, Oz had 2.2 million pull the lever for him in person. It’s a numbers game.”\n\n“Compare that to Nevada where things went back to normal, GOP topped its 2018 numbers and Laxalt has a chance to win.”\n\nDid Republicans kill the red wave themselves?\n\nThere seem to be many factors contributing to the lack of a red wave, but Hart sums it up with one word: covid.\n\nIt is Hart’s strong belief that Republican leaders are doing a piss-poor job of pushing their voters to play by the new post-covid voting rules. Many conservative voters are just not showing up anymore, and this could also be a factor of their being not-too-thrilled about Republican leadership in general.\n\nThere was very little formidable pushback against covid tyranny by most Republican politicians. Only a select few spoke out against it while the rest just capitulated – are these people really worth voting for if this is the nature of their leadership style?\n\n“Dems embraced the new world of mail-in ballots, early voting, harvesting and the 72-day GOTV plan,” Hart added in another tweet.\n\n“Dems kept nearly 47% of their 2020 homebody voters. GOP, only 40%. 2.2 million voters pulled the lever for Oz in person. Only 1.7 million for Fetterman.”\n\nEven when early voting alone became the norm, Republicans just did not accept it or even attempt to make any changes. This lack of willingness to adapt, in Hart’s view, ended up being a major advantage for Democrats.\n\n“Remember when Guam flipped and it looked like the start of a wave?” wrote someone on Twitter in response to Hart’s tweets. “GOP needs to mimic Dems’ ability to harvest ballots or they’re going to go extinct.”\n\n“Perhaps the GOP will wake up and quit complaining and moaning non-stop about mail-in voting and actually embrace it,” wrote another. “It will only increase because people love it. Do some research on Utah … major GOP state has done it successfully for many election cycles.”\n\nThe latest news about the election fraud can be found at Rigged.news.", "opengraph": {"title": "How the covid plandemic allowed Democrats to steal TWO elections (and counting)", "type": "article", "url": "https://www.votefraud.news/2022-11-13-covid-plandemic-allowed-democrats-steal-two-elections.html", "site_name": "Vote Fraud News", "description": "By now you are probably well aware that the long-hyped midterms “red wave” turned out to be more of a red trickle. Did conservatives just not come out to vote as expected, or was there more voter fraud again? Justin Hart, author of the book Gone Viral: How Covid Drove the World Insane, put together […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/11/2013-11-08-Election_MG_3455-300x200.jpg"}, "tags": ["conspiracy", "vote fraud", "voting", "fraud", "White House", "national security", "rigged", "COVID", "midterms", "deception", "election fraud", "election", "corruption", "Plandemic"], "tweets": [], "movies": [], "links": ["https://threadreaderapp.com/thread/1590265142767677441.html", "https://www.kusi.com/justin-hart-how-covid-killed-the-red-wave/", "http://rigged.news", "https://threadreaderapp.com/thread/1590265142767677441.html", "https://naturalnews.com/2019-03-27-more-scientific-proof-that-google-has-already-stolen-elections.html", "https://www.kusi.com/justin-hart-how-covid-killed-the-red-wave/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-11-13-covid-plandemic-allowed-democrats-steal-two-elections.html&linkname=How%20the%20covid%20plandemic%20allowed%20Democrats%20to%20steal%20TWO%20elections%20%28and%20counting%29", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}