{"result_id": "335023", "URL": "https://votefraud.news/2022-08-30-2020-election-fraud-greatest-coup-against-americans.html", "timestamp": "2023-04-25 17:55:54 CEST+0200", "meta": {"description": "The 2020 United States election fraud is the greatest coup against the American people in the country’s history. “As Mike Lindell said it is the greatest coup against the American people since our foundation and we have got to get moving. Your sheriff needs to get moving and let’s make sure that we preserve the […]", "lang": "en", "keywords": "2020 election,big government,Brighteon.tv,conspiracy,corruption,coup,CSPOA,deception,election fraud,fake ballots,FBI,mike lindell,Moment of Truth Summit,rigged,Sam Bushman,Sheriff Richard Mack,The Sheriff Mack Show", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-08-30-2020-election-fraud-greatest-coup-against-americans.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "The Sheriff Mack Show: 2020 US election fraud is greatest coup against the American people – Brighteon.TV", "cleaned_text": "The Sheriff Mack Show: 2020 US election fraud is greatest coup against the American people – Brighteon.TV\n\nThe 2020 United States election fraud is the greatest coup against the American people in the country’s history.\n\n“As Mike Lindell said it is the greatest coup against the American people since our foundation and we have got to get moving. Your sheriff needs to get moving and let’s make sure that we preserve the evidence that is going to be erased if we don’t do something now,” Sheriff Richard Mack told co-host Sam Bushman during the August 23 episode of “The Sheriff Mack Show” on Brighteon.TV.\n\nLindell, the CEO of MyPillow, recently hosted the Moment of Truth Summit in which the majority of speakers were volunteers with activist groups that analyzed and scrutinized 2020 election results in their state.\n\nMack, who is a former sheriff of Graham County, Arizona, said the evidence from the results of the last presidential election can and will be erased on September 3 unless sheriffs will go to their counties and conduct an investigation.\n\nThe former police enforcer from Provo, Utah added that the sheriffs need to access the election results as soon as they can and preserve it as evidence. (Related: Constitutional sheriffs to hold summit to encourage elected officials to fight ballot fraud ahead of 2022 midterms.)\n\nMack, who is also the founder of the Constitutional Sheriffs and Peace Officers Association (CSPOA), mentioned what happened to former Mesa County clerk and recorder Tina Peters when she tried to preserve the election and the evidence of fraud in her county.\n\nPeters was arrested and Mack noted that this is how the federal government and the Federal Bureau of Investigation (FBI) work against people who speak about election fraud.\n\n“We’ve already seen their subterfuge. They did it to me in 1998 when I was running for Utah County Sheriff; the FBI and IRS raided my office. So you need to get your sheriff moving. You need to get moving on this yourself. But we only have a couple of weeks left to preserve the evidence. And you need to get your sheriff involved to go do that,” said Mack.\n\nPeople responsible for 2020 election fraud must be held accountable\n\nMeanwhile, Bushman stressed that the American people must hold accountable all those responsible for the 2020 election fraud and make sure that the upcoming 2022 midterm elections will become more transparent.\n\nThe host of the “Liberty RoundTable” mentioned that Congress wanted to review the result of the 2020 presidential election, but they got derailed and never looked at it again.\n\n“And this is part of the reason that this is lasting so long, this discussion and this battle over the election in 2020, because Congress won’t even look at it, dig in and build our competence with evidence, facts and transparency, everything. All it does is add fuel to the fire,” Bushman said.\n\nMack, who won a landmark case when he challenged the constitutionality of the Brady Bill in the Supreme Court, stated that the result of the 2020 election was a big lie and Americans have the right to question how their votes are being tabulated and counted and whether they were secure or manipulated.\n\nThe CSPOA founder said one of the conclusions from Lindell’s summit was to get rid of the election computers and establish a safe and effective way to do the election. He added that the accuracy of counting the votes is more important than the speed of counting the votes.\n\nFollow VoteFraud.news for more news related to election fraud.\n\nWatch the August 23 episode of “The Sheriff Mack Show” below. “The Sheriff Mack Show” airs every Tuesday at 10 a.m. on Brighteon.TV.\n\nDROP BOXES were critical for the Biden Regime to steal the 2020 POTUS election, so are there enough new election laws to STOP THE STEAL of the Midterms?\n\nFacebook lays out how it will help Democrats steal future elections with new ‘content guidelines’\n\nBiden regime’s master plan to steal 2022 elections exposed: Repeat of 2020 theft already underway as early voting approaches", "opengraph": {"title": "The Sheriff Mack Show: 2020 US election fraud is greatest coup against the American people – Brighteon.TV", "type": "article", "url": "https://www.votefraud.news/2022-08-30-2020-election-fraud-greatest-coup-against-americans.html", "site_name": "Vote Fraud News", "description": "The 2020 United States election fraud is the greatest coup against the American people in the country’s history. “As Mike Lindell said it is the greatest coup against the American people since our foundation and we have got to get moving. Your sheriff needs to get moving and let’s make sure that we preserve the […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/08/Election-Ballots-Count-Worker.jpg"}, "tags": ["coup", "conspiracy", "mike lindell", "big government", "FBI", "CSPOA", "rigged", "The Sheriff Mack Show", "deception", "Brighteon.tv", "election fraud", "fake ballots", "Moment of Truth Summit", "Sheriff Richard Mack", "Sam Bushman", "corruption", "2020 election"], "tweets": [], "movies": [], "links": ["http://www.brighteon.com/01d783e5-17cc-4408-b876-80c0cbbd9e70", "https://brighteon.tv/", "https://www.news-leader.com/story/news/politics/elections/2022/08/21/marjorie-taylor-greene-my-pillow-ceo-mike-lindell-moment-truth-summit-election-fraud-springfield-mo/10340151002/", "http://cspoa.org/about/sheriff-mack/", "https://naturalnews.com/2022-07-11-constitutional-sheriffs-to-hold-summit-fight-ballot-fraud.html", "http://biggovernment.news", "http://www.sambushman.com/", "https://votefraud.news", "http://www.brighteon.com/01d783e5-17cc-4408-b876-80c0cbbd9e70", "https://brighteon.tv/", "https://naturalnews.com/2021-11-15-sheriff-mack-sam-bushman-discuss-schmaling-revelations.html", "http://fakepolls.news/2022-08-05-prather-lauds-logan-for-exposing-election-fraud.html", "https://votefraud.news/2022-06-19-are-there-enough-new-election-laws-stop-steal-of-midterms.html", "https://rigged.news/2022-08-19-facebook-to-help-democrats-steal-future-elections.html", "https://naturalnews.com/2022-08-02-biden-regimes-master-plan-steal-2022-elections-exposed.html", "https://www.brighteon.com/01d783e5-17cc-4408-b876-80c0cbbd9e70", "https://www.news-leader.com/story/news/politics/elections/2022/08/21/marjorie-taylor-greene-my-pillow-ceo-mike-lindell-moment-truth-summit-election-fraud-springfield-mo/10340151002/", "http://cspoa.org/about/sheriff-mack/", "http://www.sambushman.com/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-08-30-2020-election-fraud-greatest-coup-against-americans.html&linkname=The%20Sheriff%20Mack%20Show%3A%202020%20US%20election%20fraud%20is%20greatest%20coup%20against%20the%20American%20people%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}