{"result_id": "335034", "URL": "https://votefraud.news/2022-11-10-people-who-lied-covid-delivering-election-results.html", "timestamp": "2023-04-25 17:56:01 CEST+0200", "meta": {"description": "Ben Armstrong warned his listeners to be aware as the same people – the government and the mainstream media (MSM) – who colluded and created the Wuhan coronavirus (COVID-19) narrative are the same people manning the midterms and delivering the election results. During his recent show, which aired on November 9 afternoon as the results […]", "lang": "en", "keywords": "biased,big government,conspiracy,corruption,deception,fake polls,faked,Government Slaves,journalism,Konnech,lies,mainstream media,Midterm elections,news cartels,propaganda,rigged,traitors,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-11-10-people-who-lied-covid-delivering-election-results.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "Ben Armstrong warns: People who lied about COVID-19 vaccines are the same ones delivering election results", "cleaned_text": "Ben Armstrong warns: People who lied about COVID-19 vaccines are the same ones delivering election results\n\nBen Armstrong warned his listeners to be aware as the same people – the government and the mainstream media (MSM) – who colluded and created the Wuhan coronavirus (COVID-19) narrative are the same people manning the midterms and delivering the election results.\n\nDuring his recent show, which aired on November 9 afternoon as the results are still coming in, Armstrong said elections in America are not fair and the Democrats are going to steal the elections. He said Republicans will pick up some house seats, but statewide it is going to be rigged and MSM will cover it up.\n\n“Remember, the people that are telling you our elections are perfect and the results are dead accurate, are the exact same people who told you that the COVID-19 vaccine was safe and effective and that you can’t even spread the virus after you get it,” he pointed out. “They are the same ones who told us masks work, you need to distance six feet apart and for the greater good of society, you need to lock yourself in your house and shut businesses down.”\n\nHe added how these people also manipulated the public into believing the need to support the war in Ukraine and that we need to go to nuclear war with Russia. The host also pointed out how the media lied to people and how it took about a billion dollars from the government to promote fear of the coronavirus so they can push for the experimental vaccines to the public.\n\n“So why would I go to them for my election results? Some of the [MSM] hosts were hesitant and some of them are now taking a stand,” highlighting Fox‘s Tucker Carlson and Laura Ingram as brave broadcasters who are putting forward the truth. However, he slammed Fox News Division, NBC, ABC, CBS News and CNN, calling them propagandists for encouraging people to take in “clot shots.”\n\n“We’ve just had an election and my point is you know these people told you flat-out lies that are actually life and death matters in your personal life and they didn’t know that it would be safe and effective but still told you they are,” he said.\n\nThe world is really deceived, he said.\n\nElsewhere in the show, Armstrong recounted how he witnessed a live telecast of allegedly fraudulent results.\n\n“I looked on Fox News, picked Milwaukee County, where Milwaukee is and it says 99 percent reported in. And then I checked where Madison is in Wisconsin and it said it was at 99 percent reported and I was like, it’s an even race,” he narrated. “I saw the live change in Milwaukee County, where Governor Tony Evers expanded his lead. I’m thinking well, that must have been the last one percent and then, I watched the county and thousands more votes come in.\n\nHe emphasized that there is no way there had been six different updates where Evers’ lead increased by thousands and the turn-in status remained to be at 99 percent. Armstrong also noticed how odd it went that in one of the statewide races, the governor’s said 99 percent, while at the Senate race, it said 100 percent reporting.\n\n“I watched it in real-time. There is no doubt in my mind that they were adding in votes. The turn-in was sitting at 99 percent and yet, it keeps reporting more votes and it stays at 99.\n\nMeanwhile, observers and analysts are no longer surprised. Konnech CEO Eugene Yu was earlier arrested in relation to the 2020 elections. They are positive that this arrest could shed more light to the irregularities and ultimately prevent future election fraud. (Related: More proof that ELECTION FRAUD is REAL: Election software CEO arrested.)\n\nKonnech is an East Lansing, Michigan-based company responsible for the software used in managing elections in several states that stored the personal information of over 1.8 million election workers in its database. That database was reportedly left open, putting the lives of those Americans open to scrutiny and possible manipulation. Worse, all information is stored in servers in China.\n\nVisit Rigged.news for more news related to election fraud.\n\nWatch the full November 9 episode of “The Ben Armstrong Show” below.\n\nThis video is from the New American channel on Brighteon.com.\n\nBardsFM host Scott Kesterson: Current US election process is CORRUPTED and BROKEN – Brighteon.TV.\n\nMyriad of problems with election equipment, voting tabulators in key states raise early suspicions about vote fraud in midterms.\n\nGOP lawmakers dispatch scores of election observers to tight races in an effort to guard against Democrat cheating.", "opengraph": {"title": "Ben Armstrong warns: People who lied about COVID-19 vaccines are the same ones delivering election results", "type": "article", "url": "https://www.votefraud.news/2022-11-10-people-who-lied-covid-delivering-election-results.html", "site_name": "Vote Fraud News", "description": "Ben Armstrong warned his listeners to be aware as the same people – the government and the mainstream media (MSM) – who colluded and created the Wuhan coronavirus (COVID-19) narrative are the same people manning the midterms and delivering the election results. During his recent show, which aired on November 9 afternoon as the results […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/11/Election-ballot-Votes-Shredded.jpg"}, "tags": ["conspiracy", "big government", "fake polls", "faked", "vote fraud", "mainstream media", "rigged", "deception", "Midterm elections", "journalism", "Konnech", "news cartels", "traitors", "lies", "corruption", "biased", "propaganda", "Government Slaves"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/3d594886-1ba6-4c62-bb9d-e24fd679561d", "http://lies.news", "https://votefraud.news/", "https://100percentfedup.com/breaking-election-software-ceo-arrested-for-storing-data-in-china-is-deemed-significant-flight-risk-was-caught-with-luggage-in-michigan-left-his-cell-phone-behind-in-his-home-he-has-substan/", "https://naturalnews.com/2022-10-12-konnech-ceo-arrest-proof-election-fraud-real.html", "https://rigged.news/", "https://www.brighteon.com/3d594886-1ba6-4c62-bb9d-e24fd679561d", "https://www.brighteon.com/channels/thenewamerican", "https://naturalnews.com/2022-11-09-nbc-admits-democrats-the-original-election-deniers.html", "https://rigged.news/2022-11-08-bardsfm-current-us-election-process-corrupted-broken.html", "https://votefraud.news/2022-11-08-problems-with-election-equipment-voting-tabulators-midterms.html", "https://fakepolls.news/2022-11-02-gop-lawmakers-dispatch-election-observers-tight-races.html", "https://www.brighteon.com/3d594886-1ba6-4c62-bb9d-e24fd679561d", "https://100percentfedup.com/breaking-election-software-ceo-arrested-for-storing-data-in-china-is-deemed-significant-flight-risk-was-caught-with-luggage-in-michigan-left-his-cell-phone-behind-in-his-home-he-has-substan/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-11-10-people-who-lied-covid-delivering-election-results.html&linkname=Ben%20Armstrong%20warns%3A%20People%20who%20lied%20about%20COVID-19%20vaccines%20are%20the%20same%20ones%20delivering%20election%20results", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}