{"result_id": "335049", "URL": "https://votefraud.news/2020-11-02-project-veritas-infiltrates-ballot-chasing-ring-texas.html", "timestamp": "2023-04-25 17:56:12 CEST+0200", "meta": {"description": "Undercover journalists at Project Veritas infiltrated a ballot chasing ring in Bexar County, Texas, mainly targeting senior citizens. The racket involves operatives who develop personal relationships with senior citizens and convince the elderly to vote for a certain candidate through a mix of gifts and coercion. Once the senior citizen votes for the intended candidate, […]", "lang": "en", "keywords": "absentee ballots,absentee voting,ballot chaser,ballot chasing,ballot fraud,ballot harvesting,Cheating,democrats,elderly voters,election fraud,fraud,left cult,mail in voting,mail-in ballots,November elections,presidential elections,senior citizens,vote coercion,vote fraud,voter fraud,voting assistance", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2020-11-02-project-veritas-infiltrates-ballot-chasing-ring-texas.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "Project Veritas infiltrates “ballot chasing” ring targeting senior citizens in Texas", "cleaned_text": "Undercover journalists at Project Veritas infiltrated a ballot chasing ring in Bexar County, Texas, mainly targeting senior citizens. The racket involves operatives who develop personal relationships with senior citizens and convince the elderly to vote for a certain candidate through a mix of gifts and coercion. Once the senior citizen votes for the intended candidate, the operatives use different post offices to send absentee ballots by the elderly to avoid suspicion.\n\nProject Veritas tailed Raquel Rodriguez, one of the individuals who were part of the scheme. Rodriguez, who was nominally a political consultant for Republican House candidate Mauro Garza, bragged that she brought “at least 7,000 votes” to a certain candidate in this manner.\n\nIn one instance, Rodriguez was recorded on video convincing an elderly female voter to change her pick from Republican John Cornyn to Democrat M.J. Hegar. Both Cornyn and Hegar are running for election to the U.S. Senate. She told the woman: “You can vote for whoever you want, but … you said you were voting for Hegar [because] you were going straight Democrat. That’s what you want to do, correct?”\n\nAfterward, the political consultant examined the woman’s absentee ballot and even guided her in “correcting” her pick. She helped the woman cross out the line for Cornyn and put her initials next to the line so that election officials know the correction “was done accidentally.” Once the elderly woman finished changing her vote, Rodriguez presented her with a shawl as a gift.\n\nRodriguez told the Project Veritas journalist Garza gave her a $2,500 budget for his campaign, noting that she also offers voters rosaries, diabetic socks and wallets aside from the shawls.\n\nIn a later exchange with another Project Veritas journalist, she expressed worry about the instance witnessed by the earlier reporter. Acknowledging what she did was illegal, she said: “I could go to jail. I’m a little apprehensive to tell anybody what I’m doing.”\n\nBallot chasing rackets and other fraudulent practices will become rampant if mail-in voting is pushed\n\nAccording to Jered Ede, Project Veritas chief legal officer, Rodriguez and her associates are liable for violating federal and state election laws.\n\nThe violations – including ballot harvesting and employing ballot harvesters, suggesting the candidates that voters should pick, coercing a voter to change their candidate and giving gifts to voters – are all punishable by imprisonment. Ede remarked that Rodriguez ”bragging about ensuring first-time voters and ex-inmates vote for her candidates” definitely flouted the election laws in place.\n\nHowever, Raquel Rodriguez’s ballot chasing scheme is not the first instance of electoral fraud targeting elderly voters in the Lone Star State. In 2018, four women were indicted on multiple vote fraud charges in Fort Worth amid the 2016 elections.\n\nThe office of Texas Attorney General Ken Paxton said the suspects conducted vote fraud by filling out applications for mail-in ballots with forged signatures. They would then either “assist” the voter with filling out the absentee ballot, or fill it out themselves and trick the voter into signing the ballot’s return envelope.\n\nThe statement from Paxton’s office also mentioned that the four were allegedly paid to target older voters on the north side of Fort Worth “in a scheme to generate a large number of [mail-in] ballots and then harvest those ballots for specific candidates in 2016”, the Star-Telegram reported. (Related: Texas Lt. Gov. Dan Patrick warns the left will steal elections with vote-by-mail.)\n\nTexas has had an issue with ballot harvesting, even until now. A number of Democrats – including Dallas Jones – were recently accused of organizing a ballot harvesting scheme in Harris County, whose county seat is Houston. Jones was named as Democratic presidential candidate Joe Biden’s political director in the state in late August.\n\nRead more stories about various fraudulent schemes that undermine election integrity at VoteFraud.news.", "opengraph": {"title": "Project Veritas infiltrates “ballot chasing” ring targeting senior citizens in Texas", "type": "article", "url": "https://www.votefraud.news/2020-11-02-project-veritas-infiltrates-ballot-chasing-ring-texas.html", "site_name": "Vote Fraud News", "description": "Undercover journalists at Project Veritas infiltrated a ballot chasing ring in Bexar County, Texas, mainly targeting senior citizens. The racket involves operatives who develop personal relationships with senior citizens and convince the elderly to vote for a certain candidate through a mix of gifts and coercion. Once the senior citizen votes for the intended candidate, […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2020/11/ballot-return.jpg"}, "tags": ["vote fraud", "fraud", "left cult", "absentee voting", "Cheating", "senior citizens", "November elections", "voting assistance", "ballot chaser", "vote coercion", "ballot fraud", "voter fraud", "mail-in ballots", "ballot harvesting", "presidential elections", "election fraud", "ballot chasing", "democrats", "absentee ballots", "elderly voters", "mail in voting"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/political/project-veritas-infiltrates-texas-ballot-chasing-ring-targeting-senior-citizens", "https://www.projectveritas.com/news/texas-ballot-chaser-pressures-voter-to-change-vote-from-cornyn-to-hegar/", "https://www.naturalnews.com/2018-10-29-voter-fraud-is-real-and-democrats-are-behind-it.html", "https://www.star-telegram.com/news/local/fort-worth/article219920740.html", "https://www.naturalnews.com/2020-07-01-texas-lt-gov-warns-left-will-steal-elections-vote-by-mail.html", "https://www.naturalnews.com/2020-10-02-bidens-political-director-accused-illegal-ballot-harvesting.html", "https://votefraud.news/", "https://www.zerohedge.com/political/project-veritas-infiltrates-texas-ballot-chasing-ring-targeting-senior-citizens", "https://www.projectveritas.com/news/texas-ballot-chaser-pressures-voter-to-change-vote-from-cornyn-to-hegar/", "https://www.star-telegram.com/news/local/fort-worth/article219920740.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-11-02-project-veritas-infiltrates-ballot-chasing-ring-texas.html&linkname=Project%20Veritas%20infiltrates%20%E2%80%9Cballot%20chasing%E2%80%9D%20ring%20targeting%20senior%20citizens%20in%20Texas", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}