{"result_id": "335003", "URL": "https://www.votefraud.news/2020-12-06-dominion-server-removed-georgia-lawyers-trying-restraining-order.html", "timestamp": "2023-04-25 17:55:40 CEST+0200", "meta": {"description": "Americans who still believe that the 2020 elections were not stolen from President Trump are likely supporters of the election theft beneficiary, Joe Biden, because the evidence is overwhelming. And what’s more, the ‘allegedly’ guilty parties appear to be hard at work trying to cover up their tracks, as evidenced in recent days in the […]", "lang": "en", "keywords": "2020 election,allegations,alter,Atlanta,challenge,change,Dominion Voting Systems,election fraud,Election results,elections,federal judge,Fulton County,Georgia,Joe Biden,lawsuits,outrage,President Trump,rigged,run-off,Senate,server,Sidney Powell,vote fraud,votes", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.votefraud.news/2020-12-06-dominion-server-removed-georgia-lawyers-trying-restraining-order.html", "encoding": "UTF-8"}, "image": null, "domain": "www.votefraud.news", "title": "Sidney Powell says Dominion removed a server from Georgia county as lawyers were trying to get a restraining order", "cleaned_text": "Sidney Powell says Dominion removed a server from Georgia county as lawyers were trying to get a restraining order\n\nAmericans who still believe that the 2020 elections were not stolen from President Trump are likely supporters of the election theft beneficiary, Joe Biden, because the evidence is overwhelming.\n\nAnd what’s more, the ‘allegedly’ guilty parties appear to be hard at work trying to cover up their tracks, as evidenced in recent days in the ‘new battleground’ state of Georgia.\n\nLawyer Sidney Powell, who has filed a massive lawsuit challenging the election results in the Peach State as well as in Michigan, said this week that someone has removed a Dominion Voting Systems server in Fulton County, home to Atlanta, that was housed in a recount center just as attorneys were attempting to get a court to order all election equipment preserved and protected.\n\n“Someone went down to the Fulton center where the votes and Dominion machines were, claimed there was a software glitch and they had to replace the software, and it seems that they removed the server,” Powell told Fox Business Network host Lou Dobbs, adding that her team does not know where the server went.\n\nThat said, Jessica Corbitt, director of external affairs for Fulton County, told The Epoch Times the following day that the server is still on-site at the World Congress Center in Atlanta.\n\nRobb Pitt, the chairman of the Fulton County Board of Commissioners, told reporters on Tuesday that the county was 88 percent through the recount when the Dominion server crashed. The Dominion technician on-site could not resolve the problem so another Dominion representative flew in the day after.\n\nPitt vehemently denied that his county was involved in any “hanky panky” in relation to the 2020 election.\n\nThe voting machine firm’s hardware is a prominent feature in Powell’s lawsuits, which both claim that the software used by the company is designed to be manipulated — and was manipulated in the 2020 elections — in order to altar vote tallies in favor of certain candidates (in this case Joe Biden).\n\nPowell said the alleged removal of the server happened as she and her legal team were attempting to get a restraining order against allowing anyone to reset, ‘wipe,’ or alter any of the Dominion machines. A U.S. district court judge did grant such a temporary order on Sunday night.\n\nThe former federal prosecutor went on to tell Dobbs that her team is making a lot of progress in the Georgia and Michigan cases even as lawsuits are being prepared for other states to challenge their election results as well. (Related: Attorney Lin Wood, patriot group, call on Trump to use wartime executive powers like Lincoln did and order new, fair elections under military authority.)\n\nAs for Georgia, Powell said her suit is meant to halt two U.S. Senate run-off elections in the state in January “because all the machines are infected with the software code that allows Dominion to shave votes from one candidate and give them to another and other features that do the same thing.”\n\n“Different states shaved different amounts of votes. The system was set up to shave and flip different votes in different states. Some people were targeted as individual candidates. It’s really the most massive and historical egregious fraud the world has ever seen,” Powell said.\n\nIt should be noted that Dominion officials have vigorously denied Powell’s allegations, but then, the company would, right, considering the allegations?\n\nIt should also be noted that a Dominion server did, in fact, crash Nov. 29 during a second recount in the state, a spokesman for Fulton County told The Epoch Times.\n\n“A newly purchased Dominion mobile server crashed,” the spokesman told the outlet via email. “Technicians from Dominion have been dispatched to resolve the issue.”\n\nAs for the temporary restraining order, the federal judge in the case will hear arguments from both sides on Dec. 4. It’s not clear who’s going to win the case, but what is clear is that fraud did occur; it’s just a matter of having something done about it at this point.\n\nWill there be enough brave souls in courtrooms to make it happen?\n\nStay current on all of President Trump’s efforts to fight the election theft at Trump.news.", "opengraph": {"title": "Sidney Powell says Dominion removed a server from Georgia county as lawyers were trying to get a restraining order", "type": "article", "url": "https://www.votefraud.news/2020-12-06-dominion-server-removed-georgia-lawyers-trying-restraining-order.html", "site_name": "Vote Fraud News", "description": "Americans who still believe that the 2020 elections were not stolen from President Trump are likely supporters of the election theft beneficiary, Joe Biden, because the evidence is overwhelming. And what’s more, the ‘allegedly’ guilty parties appear to be hard at work trying to cover up their tracks, as evidenced in recent days in the […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2020/12/Sidney-Powell-1.jpg"}, "tags": ["alter", "vote fraud", "elections", "change", "votes", "Election results", "Dominion Voting Systems", "lawsuits", "2020 election", "President Trump", "server", "challenge", "Joe Biden", "federal judge", "Senate", "Fulton County", "run-off", "outrage", "Atlanta", "rigged", "election fraud", "allegations", "Georgia", "Sidney Powell"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/powell-dominion-server-removed-from-fulton-county-while-lawyers-sought-restraining-order_3599859.html", "https://newstarget.com/2020-12-02-patriot-group-trump-wartime-powers-lincoln-fair-elections.html", "http://www.trump.news", "https://www.theepochtimes.com/powell-dominion-server-removed-from-fulton-county-while-lawyers-sought-restraining-order_3599859.html", "https://newstarget.com/2020-12-02-patriot-group-trump-wartime-powers-lincoln-fair-elections.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-12-06-dominion-server-removed-georgia-lawyers-trying-restraining-order.html&linkname=Sidney%20Powell%20says%20Dominion%20removed%20a%20server%20from%20Georgia%20county%20as%20lawyers%20were%20trying%20to%20get%20a%20restraining%20order", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}