{"result_id": "335048", "URL": "https://votefraud.news/2022-10-28-enemies-likely-have-trump-arrested-disrupt-midterms.html", "timestamp": "2023-04-25 17:56:11 CEST+0200", "meta": {"description": "Scott Kesterson warned that the enemies are going to do anything they can to disrupt the upcoming midterm elections – including arresting former President Donald Trump – because they know they’re going to lose. Kesterson issued this warning on the Oct. 20 episode of his Brighteon.TV program “BardsFM.” Given Trump’s possible arrest, the host said America is […]", "lang": "en", "keywords": "barack obama,BardsFM,Biden,big government,Brighteon.tv,chaos,civil war,Collapse,conspiracy,deception,Donald Trump,elections,Joe Biden,left cult,national security,Nazism,propaganda,Scott Kesterson,traitors,WWIII", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-10-28-enemies-likely-have-trump-arrested-disrupt-midterms.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "BardsFM with Scott Kesterson: Enemies are likely to have Trump arrested in desperate attempt to disrupt midterms – Brighteon.TV", "cleaned_text": "BardsFM with Scott Kesterson: Enemies are likely to have Trump arrested in desperate attempt to disrupt midterms – Brighteon.TV\n\nScott Kesterson warned that the enemies are going to do anything they can to disrupt the upcoming midterm elections – including arresting former President Donald Trump – because they know they’re going to lose.\n\nKesterson issued this warning on the Oct. 20 episode of his Brighteon.TV program “BardsFM.” Given Trump’s possible arrest, the host said America is going to witness its darkest days in the coming weeks. Thus, he reiterated the importance of being highly prepared as the country is “going to be seeing an attempt to bring this country into an absolute civil war.”\n\nThe “BardsFM” host remarked that the “other side” has been instilling hatred and tearing America apart. He encouraged listeners not to go down the enemy’s level. Instead, Kesterson called on them to see how the enemy was going to maneuver and let them weaken themselves.\n\nMoreover, he stressed the importance of being prepared for a minimum of six months worth of supplies to sustain one’s lifestyle without the need for going shopping.\n\n“This is not alarmist thinking, but this is practical and pragmatic thinking based on not just what the scenario that could come about,” he explained. “Amid the disruption of supply chains, reduction of food production and energy issues, we have depleting access to oil now that the oil reserves in our own country are being shut down.”\n\nKesterson pointed out the fact that Saudi Arabia and the Organization of the Petroleum Exporting Countries are cutting back their oil exports by two million barrels per day. (Related: OPEC+ set to reduce oil production – a blatant rejection of Biden’s plea.)\n\nHe said the dollar is rapidly collapsing around the globe now that the BRICS nations – Brazil, Russia, India, China and South Africa – have been in their “best effort” to move off of the petrodollar transactions.\n\n“Many countries are literally boycotting the dollar because they don’t want that power in their lives. You’re seeing China and Russia right now coming together on a resolution to charge the U.S. with a violation of the biological treaties, which is justified by what the Russians have been pulling out of Ukraine,” Kesterson added.\n\nKesterson: We’re moving on to the last part of a three-phase war\n\nThe podcaster, who spent some time in Afghanistan as a citizen journalist under the Department of Defense, revealed that we are now in a three-phase war that is pretty much by design. According to him, we are “into the pre-game of phase two.”\n\nKesterson said the first phase started during former President Barack Obama’s regime because so much of this war is about awakening.\n\n“Up until Obama, most people were still pretty heavily asleep,” he said.\n\nKesterson said phase two came with Trump becoming the country’s president. “It’s important to note, Trump got into office because he was selected by a group of senior military folks and he did run successfully,” he said. “President Trump gave us about four years of a golden age.”\n\nHe went on to say that the country is now in the last phase of the war – the Trump-Biden era.\n\n“This is important because the old Jan. 6 event was orchestrated and choreographed with people that were insurgents working for the Federal Bureau of Investigation and intelligence agencies, to make it look symbolically very much like the Weimar issue,” he said, referring to the Weimar Republic, which was officially named the German Reich.\n\n“This is the opposite as the Nazis have control of our nation. We have a government that is a tyranny, which has no intent to release and relinquish its power willfully.”\n\nVisit CivilWar.news for more updates on the developing civil war in the United States.\n\nWatch the full Oct. 20 episode of “BardsFM with Scott Kesterson” below. Catch new episodes of the program every Thursday at 5-6 p.m. on Brighteon.TV.\n\nEnd of petrodollar edges closer as Saudi Arabia looks set to join new China-dominated ‘BRICS’ economic alliance.\n\nBardsFM with Scott Kesterson: Globalists waging war on children, God’s creations via WOKE ideology – Brighteon.TV.\n\nSaudi Arabia fortifies relations with Russia, thumbing its nose to the West.", "opengraph": {"title": "BardsFM with Scott Kesterson: Enemies are likely to have Trump arrested in desperate attempt to disrupt midterms – Brighteon.TV", "type": "article", "url": "https://www.votefraud.news/2022-10-28-enemies-likely-have-trump-arrested-disrupt-midterms.html", "site_name": "Vote Fraud News", "description": "Scott Kesterson warned that the enemies are going to do anything they can to disrupt the upcoming midterm elections – including arresting former President Donald Trump – because they know they’re going to lose. Kesterson issued this warning on the Oct. 20 episode of his Brighteon.TV program “BardsFM.” Given Trump’s possible arrest, the host said America is […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/10/collage-trump-biden-nov-27-1200x720.jpg"}, "tags": ["conspiracy", "big government", "elections", "national security", "left cult", "deception", "barack obama", "civil war", "chaos", "Biden", "Donald Trump", "Brighteon.tv", "propaganda", "Joe Biden", "Scott Kesterson", "WWIII", "Nazism", "Collapse", "traitors", "BardsFM"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/6f621de9-b98f-4a15-b96a-c75b0d24e2a6", "https://brighteon.tv", "https://www.cnbc.com/2022/10/05/oil-opec-imposes-deep-production-cuts-in-a-bid-to-shore-up-prices.html", "https://naturalnews.com/2022-10-10-opec-to-reduce-oil-production-reject-biden.html", "https://theconservativetreehouse.com/blog/2022/10/17/south-africa-confirms-likelihood-of-saudi-arabia-joining-brics-economic-alliance/", "https://civilwar.news", "https://www.brighteon.com/6f621de9-b98f-4a15-b96a-c75b0d24e2a6", "https://brighteon.tv/home/", "https://naturalnews.com/2022-10-20-end-of-petrodollar-saudi-arabia-china-dominated-brics-alliance.html", "https://globalism.news/2022-10-21-globalists-waging-war-children-via-woke-ideology.html", "https://fuelsupply.news/2022-10-07-saudi-arabia-fortifies-relations-with-russia.html", "https://www.brighteon.com/6f621de9-b98f-4a15-b96a-c75b0d24e2a6", "https://www.cnbc.com/2022/10/05/oil-opec-imposes-deep-production-cuts-in-a-bid-to-shore-up-prices.html", "https://theconservativetreehouse.com/blog/2022/10/17/south-africa-confirms-likelihood-of-saudi-arabia-joining-brics-economic-alliance/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-10-28-enemies-likely-have-trump-arrested-disrupt-midterms.html&linkname=BardsFM%20with%20Scott%20Kesterson%3A%20Enemies%20are%20likely%20to%20have%20Trump%20arrested%20in%20desperate%20attempt%20to%20disrupt%20midterms%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}