{"result_id": "335030", "URL": "https://www.votefraud.news/2020-11-24-media-suppression-of-key-stories-stole-election.html", "timestamp": "2023-04-25 17:55:58 CEST+0200", "meta": {"description": "According to an explosive new study the Media Research Center (MRC) released on Tuesday, the legacy media’s suppression of eight key election-related news stories effectively handed the presidential election to Democrat Joe Biden. According to a poll conducted by The Polling Company on behalf of MRC, a whopping 17 percent of Americans who voted for Joe Biden […]", "lang": "en", "keywords": "2020 elections,biased,cheaters,corporate media,Cover-Up,election fraud,elections,Joe Biden,left cult,mainstream media,politics,propaganda,rigged,suppression,voter fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.votefraud.news/2020-11-24-media-suppression-of-key-stories-stole-election.html", "encoding": "UTF-8"}, "image": null, "domain": "www.votefraud.news", "title": "EXPLOSIVE study: Media suppression of 8 key stories ‘stole this election’ for Joe Biden", "cleaned_text": "EXPLOSIVE study: Media suppression of 8 key stories ‘stole this election’ for Joe Biden\n\nAccording to an explosive new study the Media Research Center (MRC) released on Tuesday, the legacy media’s suppression of eight key election-related news stories effectively handed the presidential election to Democrat Joe Biden. According to a poll conducted by The Polling Company on behalf of MRC, a whopping 17 percent of Americans who voted for Joe Biden would not have done so had they been aware of just one of these stories.\n\nHad the legacy media not buried these stories, Trump would have won 311 electoral votes, the study claims.\n\n“The national news media stole this election, as far as I’m concerned, they deliberately stole it from President Trump,” MRC President Brent Bozell said in a call with reporters. “It is absolutely unequivocal” that the biased media coverage “cost Donald Trump the election.”\n\nFreedomWorks President Adam Brandon called the 2020 campaign an “issueless conversation,” noting that “without talking about issues, it basically ended up being a referendum on the president’s personality.”\n\nBrandon said America is a center-right country, but the legacy media suppressed the key issues, subverting the substantive issues that should have decided the 2020 election.\n\nThe Polling Company surveyed 1,750 Biden voters in seven swing states: Arizona, Georgia, Michigan, Nevada, North Carolina, Pennsylvania, and Wisconsin. Six of these states (all except North Carolina) have been called for Biden. The poll found that a whopping 82 percent of Biden voters were unaware of at least one of the news stories, while only five percent said they did not know about all eight.\n\nOne out of every six Biden voters (17 percent) said they would not have voted for the Democrat had they known the facts about one or more of these news stories.\n\nThe poll raised these eight news stories: Tara Reade’s sexual assault allegations against Joe Biden; Joe Biden’s involvement in the Hunter Biden corruption scandal; Sen. Kamala Harris (D-Calif.) getting rated the most leftist senator; 33 percent GDP growth in the third quarter of 2020; 11.1 million jobs created from June 5 to October 2; the Middle East peace deals with Israel that led to three Nobel Peace Prize nominations for Trump; U.S. energy independence; and Trump’s successes with Operation Warp Speed in fighting the Wuhan coronavirus pandemic.\n\nThe legacy media’s decision to bury Biden’s scandals had the strongest impact on the election, according to the poll. More than one-third of Biden voters (35.4 percent) said they were unaware of Tara Reade’s serious allegations that Biden sexually assaulted her in the 1990s, a story the legacy media effectively buried. A full 8.9 percent of Biden voters said they would have changed their vote — either to Trump, to a third-party candidate, not voting for a presidential candidate, or not voting at all, if they had known about the Reade allegations.\n\nAccording to MRC, this would have flipped six states — Arizona, Georgia, Michigan, Nevada, Pennsylvania, and Wisconsin — giving Trump 311 electoral votes.\n\nNearly half of Biden voters (45.1 percent) said they did not know about the financial scandal involving Biden and his son Hunter, which Twitter, Facebook, and the legacy media suppressed or ignored. According to MRC, full awareness of the scandal would have led 9.4 percent of Biden voters to abandon the Democrat, flipping all six of the states to Trump.\n\nThe legacy media also largely ignored the GovTrack analysis finding that Kamala Harris had the most left-wing record of any senator in 2019 — even further left than self-described Democratic Socialist Bernie Sanders. A quarter of Biden voters (25.3 percent) said they did not know about Harris’ record. A critical 4.1 percent said they would have changed their vote had they known. This proportion would have flipped Arizona, Georgia, Nevada, Pennsylvania, and Wisconsin to Trump, giving Trump 295 electoral votes.\n\nMRC also found that legacy media suppression of positive Trump stories impacted the results.\n\nThe five pre-election jobs reports from June 5 to October 2 showed that the economy created a record 11,161,000 jobs in a snapback from the pandemic recession. Yet 39.4 percent of Biden voters said they did not know about this achievement. Knowledge of this issue would have led 5.4 percent of them to change their votes, swinging Arizona, Georgia, Nevada, Pennsylvania, and Wisconsin to Trump, according to MRC.\n\nOn October 29, the government reported that the GDP had grown by an impressive 33.1 percent, double the previous record. Yet almost half of Biden voters (49.0 percent) said they did not know about this achievement. Had they known, 5.6 percent said they would have changed their vote, giving Trump 295 electoral votes.\n\nSimilarly, the legacy media effectively buried the impressive and historic peace agreements between Israel and Arab Muslim countries. These achievements gained Trump three Nobel Prize nominations. Yet 43.5 percent of Biden voters had no idea about these agreements. Five percent of Biden voters said they would have changed their votes had they known, giving Trump 295 electoral votes.\n\nUnder President Trump, America achieved energy independence, thanks in part to Trump’s action on long-stalled pipeline projects and expansion of drilling. America became a net exporter of oil for the first time in September 2019. Yet more than half (50.5 percent) of Biden voters said they did not know about this and 5.8 percent of Biden voters said they would have changed their votes had they known. This would have resulted in the 295-electoral vote win for Trump.\n\nFinally, while the legacy media obsessively covered COVID-19, it effectively buried the positive news about Trump’s achievements with Operation Warp Speed, which was well on track to deliver 300 million doses of a safe vaccine as soon as next year.\n\nA full 36.1 percent of Biden voters said they did not know about the success of Operation Warp Speed, and 5.3 percent said that if they had, they would have abandoned Biden. This alone would have given Trump 295 electoral votes.\n\nOverall, a total of 17 percent of Biden voters said they would have changed their votes had they known about one or more of the important stories. This would have given Trump 311 electoral votes.\n\nThe results in specific states also proved remarkable. In Pennsylvania, 15 percent of Biden voters said they would have defected. In Michigan, 14 percent said so. In Georgia, 15 percent of Biden’s voters would have changed their votes. Another 21 percent of Biden voters in Arizona said so. Another 13 percent of Wisconsin voters would have abandoned Biden while 18 percent of Nevada Biden voters said they would have switched their votes.", "opengraph": {"title": "EXPLOSIVE study: Media suppression of 8 key stories ‘stole this election’ for Joe Biden", "type": "article", "url": "https://www.votefraud.news/2020-11-24-media-suppression-of-key-stories-stole-election.html", "site_name": "Vote Fraud News", "description": "According to an explosive new study the Media Research Center (MRC) released on Tuesday, the legacy media’s suppression of eight key election-related news stories effectively handed the presidential election to Democrat Joe Biden. According to a poll conducted by The Polling Company on behalf of MRC, a whopping 17 percent of Americans who voted for Joe Biden […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2020/11/Joe-Biden-Speech.jpg"}, "tags": ["2020 elections", "Joe Biden", "elections", "voter fraud", "left cult", "cheaters", "mainstream media", "politics", "rigged", "Cover-Up", "election fraud", "suppression", "biased", "propaganda", "corporate media"], "tweets": [], "movies": [], "links": ["https://www.newsbusters.org/blogs/nb/rich-noyes/2020/11/24/special-report-stealing-presidency-2020", "https://pjmedia.com/election/tyler-o-neil/2020/11/24/explosive-study-media-suppression-of-8-key-stories-stole-this-election-for-joe-biden-n1170347", "https://cdn.mrc.org/TPC-MRC+Biden+Voter+Messaging+Survey+Analysis+Nov+2020_final.pdf", "https://pjmedia.com/news-and-politics/tyler-o-neil/2020/10/07/cbs-news-buries-joe-biden-sex-scandal-by-airing-tara-reade-interview-in-australia-n1018091", "https://pjmedia.com/columns/tyler-o-neil/2020/10/23/the-hunter-biden-corruption-scandal-is-a-reckoning-for-the-legacy-media-n1081621", "https://pjmedia.com/news-and-politics/tyler-o-neil/2020/10/23/breaking-trump-announces-another-middle-east-muslim-country-will-recognize-israel-n1081920", "https://pjmedia.com/news-and-politics/tyler-o-neil/2020/09/28/donald-trump-gets-his-third-nobel-prize-nomination-n974963", "https://pjmedia.com/news-and-politics/tyler-o-neil/2020/11/16/another-trump-victory-on-covid-19-moderna-vaccine-is-94-5-percent-effective-n1149822", "https://www.newsbusters.org/blogs/nb/bill-dagostino/2020/06/29/study-tv-news-has-no-time-biden-sex-assault-accuser", "https://www.newsbusters.org/blogs/nb/rich-noyes/2020/10/27/never-more-biased-tv-blasts-trump-92-negative-coverage-66-positive", "https://www.govtrack.us/congress/members/kamala_harris/412678/report-card/2019", "https://www.bls.gov/bls/news-release/empsit.htm#2020", "https://www.newsbusters.org/blogs/nb/nicholas-fondacaro/2020/10/29/gdp-roars-back-ahead-election-day-nets-insist-economy", "https://www.newsbusters.org/blogs/nb/geoffrey-dickens/2020/09/21/trump-brings-peace-mideast-petty-networks-wont-let-him-have", "https://www.investors.com/politics/editorials/energy-independence-trump/", "https://www.newsbusters.org/blogs/nb/rich-noyes/2020/10/27/never-more-biased-tv-blasts-trump-92-negative-coverage-66-positive", "https://www.newsbusters.org/blogs/nb/rich-noyes/2020/11/24/special-report-stealing-presidency-2020", "https://pjmedia.com/election/tyler-o-neil/2020/11/24/explosive-study-media-suppression-of-8-key-stories-stole-this-election-for-joe-biden-n1170347", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-11-24-media-suppression-of-key-stories-stole-election.html&linkname=EXPLOSIVE%20study%3A%20Media%20suppression%20of%208%20key%20stories%20%E2%80%98stole%20this%20election%E2%80%99%20for%20Joe%20Biden", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}