{"result_id": "335002", "URL": "https://votefraud.news/2020-11-12-lawsuits-recounts-voter-fraud.html", "timestamp": "2023-04-25 17:55:39 CEST+0200", "meta": {"description": "This week, the Trump campaign filed a 105-page lawsuit in the U.S. District Court of Pennsylvania alleging that the state carried out an illegal two-tiered voting system in the 2020 general election. The suit seeks to block the state from certifying its count. The defendants are listed as Pennsylvania Secretary of State Kathy Boockvar and […]", "lang": "en", "keywords": "election fraud,elections,Georgia,Joe Biden,Pennsylvania,President Trump,recount,rigged,Rudy Giuliani,vote,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2020-11-12-lawsuits-recounts-voter-fraud.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "Lawsuits and recounts underway in light of massive voter fraud – will Americans get the fair election they deserve?", "cleaned_text": "Lawsuits and recounts underway in light of massive voter fraud – will Americans get the fair election they deserve?\n\nThis week, the Trump campaign filed a 105-page lawsuit in the U.S. District Court of Pennsylvania alleging that the state carried out an illegal two-tiered voting system in the 2020 general election. The suit seeks to block the state from certifying its count. The defendants are listed as Pennsylvania Secretary of State Kathy Boockvar and the boards of elections in Allegheny, Centre, Chester, Delaware, Montgomery, Northampton and Philadelphia counties.\n\nIn addition, the Pennsylvania Supreme Court has agreed to consider a challenge claiming that Republican observers were not allowed to oversee ballot counting, invalidating hundreds of thousands of votes. That news comes as Rudy Giuliani, who now serves as a personal lawyer to President Donald Trump, says that more than 50 witnesses claimed to have been “corralled” by election officials in Philadelphia on Election Day and were not allowed to see a single ballot that was counted behind closed doors. As a result, he claims that roughly 800,000 votes are invalid.\n\nGiuliani pointed out that Philadelphia wasn’t the only place where this happened. A similar situation took place in Pittsburgh, although they were allowed to make some observations. He estimated that the number of unlawful ballots in Philadelphia is around double those in Pittsburgh.\n\nAs if that weren’t bad enough, Project Veritas has released videos showing USPS whistleblowers in both Pennsylvania and Michigan claiming that they were told by supervisors to backdate ballots.\n\nSpeaking to Fox Business’s Lou Dobbs, Giuliani said: “What’s being said in the mass media, that we have no evidence, is a complete, absolute lie, just like they’ve been lying for years.”\n\nIn an interview with Newsmax, he said: “In this lawsuit, we have over 50 witnesses who will say that the vote count, particularly once the election ended that night and President Trump was ahead by 800,000 votes in Pennsylvania, the count thereafter was unlawful.”\n\nHe continued: “It was counted behind closed doors. Republicans were not given an opportunity to see any of the mail-in ballots as required by Pennsylvania law.”\n\nHe added that in order for a mail ballot to be valid, it must be observed by both sides.\n\nGiuliani has also claimed that at least 300,000 ballots were counted outside of the purview of Republican election watchers in Detroit.\n\nFull hand recount will be carried out in Georgia\n\nMeanwhile, Georgia Secretary of State Brad Raffensperger announced yesterday that the state will carry out a full hand recount of the presidential election results. Raffensperger said that the recount will be finished by November 20 and will include an audit, recount and recanvass at once. Citing the close margin between the candidates, he said that a full recount by hand is warranted in each county. In the state, Biden is leading President Trump by 14,111 votes.\n\nThis announcement came after two Republican senators from Georgia called on the state’s Republican Secretary of State to resign over what they say is his failure “to deliver honest and transparent elections.” A joint statement from Senators Kelly Loeffler and David Perdue said that the way Georgia’s elections were managed was “an embarrassment for our state.”\n\nU.S. Attorney General Bill Barr has given federal prosecutors the authorization to pursue “substantial allegations” of voting irregularities before certifying the presidential election. He wrote in a memo that investigations can be carried out in cases where there are clear and apparently credible allegations of irregularities that could have impacted the outcome of the election in a state.\n\nSenate Majority Leader Mitch McConnell and Senator Lindsey Graham have also said they support the election challenges.\n\nThe evidence of wrongdoing is growing too big to ignore, and the American people deserve fair elections and a thorough investigation into whether every person’s vote counted – and assurance that no unauthorized votes changed the results into anything other than the true will of the people.", "opengraph": {"title": "Lawsuits and recounts underway in light of massive voter fraud – will Americans get the fair election they deserve?", "type": "article", "url": "https://www.votefraud.news/2020-11-12-lawsuits-recounts-voter-fraud.html", "site_name": "Vote Fraud News", "description": "This week, the Trump campaign filed a 105-page lawsuit in the U.S. District Court of Pennsylvania alleging that the state carried out an illegal two-tiered voting system in the 2020 general election. The suit seeks to block the state from certifying its count. The defendants are listed as Pennsylvania Secretary of State Kathy Boockvar and […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2020/11/voting-booth-american-flags.jpg"}, "tags": ["Joe Biden", "vote fraud", "elections", "vote", "rigged", "recount", "election fraud", "Rudy Giuliani", "Pennsylvania", "President Trump", "Georgia"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/markets/giuliani-says-over-50-witnesses-600k-unlawful-ballots-pa-nevada-poll-worker-attests", "https://www.theblaze.com/georgia-statewide-hand-recount-presidential-election", "https://votefraud.news/", "https://www.zerohedge.com/markets/giuliani-says-over-50-witnesses-600k-unlawful-ballots-pa-nevada-poll-worker-attests", "https://www.theblaze.com/georgia-statewide-hand-recount-presidential-election", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-11-12-lawsuits-recounts-voter-fraud.html&linkname=Lawsuits%20and%20recounts%20underway%20in%20light%20of%20massive%20voter%20fraud%20%E2%80%93%20will%20Americans%20get%20the%20fair%20election%20they%20deserve%3F", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}