{"result_id": "335012", "URL": "https://votefraud.news/2020-12-31-whistleblower-exposes-biden-campaign-voter-fraud-operation.html", "timestamp": "2023-04-25 17:55:47 CEST+0200", "meta": {"description": "Democrat political strategist Damien Thaddeus Jones, who served as regional political director for Beto O’Rourke’s U.S. Senate campaign, has come forward to blow the whistle on a massive voter fraud ring in Harris County, Texas. The voter fraud ring is overseen by Dallas Jones, who served as Texas Political Director for the Joe Biden presidential […]", "lang": "en", "keywords": "Dallas Jones,deception,democrats,Donald Trump,elections,Joe Biden,politics,Republicans,Texas,vote fraud,whistleblower", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2020-12-31-whistleblower-exposes-biden-campaign-voter-fraud-operation.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "EXCLUSIVE AUDIO: Democrat whistleblower exposes Biden campaign voter fraud operation", "cleaned_text": "Democrat political strategist Damien Thaddeus Jones, who served as regional political director for Beto O’Rourke’s U.S. Senate campaign, has come forward to blow the whistle on a massive voter fraud ring in Harris County, Texas. The voter fraud ring is overseen by Dallas Jones, who served as Texas Political Director for the Joe Biden presidential campaign. In this stunning audio obtained exclusively by NATIONAL FILE, Damien goes into detail about Dallas Jones’ fraudulent activity and work for Biden. On the tape, “Sheila” refers to Sheila Jackson-Lee. This article below delves into the massive evidence of voter fraud — including photographic evidence and sworn affidavits — that emerged in Harris County in 2020, and how its direct link to the Biden campaign provides even more justification for President Donald Trump’s ability to claim victory in the presidential election.\n\nHarris County, Texas conducted 24-hour voting in the 2020 election, even as the county became engulfed in a voter fraud scandal that ensnared the Joe Biden campaign’s recent Texas political director Dallas Jones. A well-placed insider named Constance Stanton tells NATIONAL FILE that Dallas Jones was interrogated by the FBI and fired by the Biden campaign after he was implicated in an illegal Ballot Harvesting operation in sworn affidavits first reported by NATIONAL FILE. This scandal has since been picked up by various news outlets across the nation, including by Fox News. Vote count discrepancies are reported in Harris County.\n\nSources within the FBI told NATIONAL FILE that Dallas Jones was interrogated but was not necessarily “picked up,” implying that Jones voluntarily submitted to FBI interrogation. Multiple sources tell NATIONAL file that Jones was fired by the Biden campaign. (RELATED: Texas Poll Watcher Testifies on 2020 Voter Fraud in Houston).\n\nHere is what Constance Stanton told NATIONAL FILE in October: “Harris County Clerk’s Office in Harris County, Texas is intending to conduct an illegal polling operation on Thursday, October 29th, 2020. Harris County, home to Houston Texas, is the third largest voting county in the country with approximately 2.5 million voters. As Harris County goes, so goes Texas. As Texas goes, so goes the nation. Harris County did not allow the GOP State Conversation to take place this past summer and it seems the socialist Democrats took complete control of Harris county when they won offices in 2018, by a 200,000 vote margin.\n\n20 private investigators have uncovered a great deal. What has been uncovered is a group of masterminds wanting to destroy the Texas voting voice. Some of the masterminds include Democrat County Commissioner Rodney Ellis and Democrat State Senator Boris Miles. They have two captains, Gerald Womack and Dallas Jones.\n\n Jones was hired by the Biden campaign to run the Biden Texas operation. These captains have scores of paid vote harvesters working for them. Vote harvesting is a second-degree felony under the Texas Election Code. This is a criminal operation that these Democrat elected officials are running.\n\nDallas Jones was picked up by the FBI, the weekend before last, for 2 days of interrogation. He was subsequently fired by the Biden campaign.\n\nThey harvest ballots by mail from nursing homes, homeless centers, door to door in poor neighborhoods, often dressed as Census workers. They offer $50 gift cards in front of stores asking people to take ballots by mail, acquired from the above, to sign and mail at a local post office. They hold ballots by mail in several locations where people forge signatures on the collected ballots by mail.\n\nEvidence has been presented to the local DA, Kim Ogg, who received a substantial amount of political contributions from Soros funded organizations in her election in 2018. The evidence included an affidavit and other evidence, including photographs, from a 30 year black police officer who was serving as a poll watcher and saw the election judge use a table full of IDs to vote unregistered people that were voting by drive through.\n\n This is a criminal act according to the Texas Election Code. The district attorney’s office did not even want to entertain our criminal complaint.\n\nThis information along with other affidavits of harassment of poll watchers and alternate election judges was sent to the office of Republican Atty. General Ken Ken Paxton.\n\nThe Democrat County clerk, Chris Hollins, instituted drive-through voting by anyone for any reason which is in violation of the Texas Election Code. A petition for writ of mandamus before the Texas Supreme Court last week to stop this illegal activity and they voted 7 to 1 to deny the petition. The County clerk has now opened up the early voting polling locations until 10 PM for the rest of the week until the last day of early voting, when eight polling places will be open 24 hours. Of the 120 early voting locations, the vast majority are in Democrat areas of the county.\n\nIn violation of the Texas Election Code, Hollins independently mailed ballots by mail to all individuals 65 and older, in violation of Texas Election Code, which requires an individual to request a ballot by mail before it can be sent. Hollins planned on sending every registered voter a ballot by mail, but the Texas Supreme Court granted our petition and stopped this.\n\nThe Harris County voter files have not been purged since 2016 when the Democrats took charge. We can document that dead people have voted in this election and people who have moved out of state. No arrest warrants have been issued and we do not expect them to issue any.\n\nIn the meantime, the Democrats are implementing their massive election voter fraud scheme, mostly in open sight. One arrest would go miles in stopping this election fraud scheme. The drive through locations are located in primarily in Democrat areas. This also violates the 14th Amendment.”\n\nAt Harrisvotes.com, clicking on “Polling Locations” and then the clock icon for “Hours of Operation” show that beginning on Thursday October 29 there were EIGHT polling locations that have 24-hour voting rolling into Friday morning.\n\nTexas poll watcher Raymond T. Stewart, a retired police officer, submitted a sworn affidavit Thursday that was provided to the Harris County District Attorney’s Office. That affidavit, first obtained by NATIONAL FILE, alleges that a Houston precinct judge and staff illegally used a stack of driver’s licenses in their possession to allow people to vote illegally in the 2020 election at a drive-through voting window created by the Coronavirus pandemic. Stewart’s affidavit and photos of the scheme are presented below. The acting precinct judge’s identity has been confirmed by the Harris County Clerk’s Office and insiders identify her as a Democrat.\n\nHarris County, where Houston is located, is also the site where the Joe Biden campaign’s Texas political director Dallas Jones is accused of running an illegal ballot harvesting operation, according to two separate affidavits submitted to the Texas Supreme Court by former law enforcement officials. Here is the GoFundMe page for private investigators who are busting what insiders say is one of the largest voter fraud rings in the United States. Here is a photo from the scene of the stack of driver’s licenses.\n\nHere Is The Sworn Affidavit, Under Oath, of Raymond T. Stewart:\n\n“My name is Raymond T. Stewart. I am above the age of eighteen years and am fully competent to make this affidavit. The facts stated in this affidavit are within my personal knowledge and are true and correct.\n\n“I am a 30+ year veteran Texas Peace Officer. I am a volunteer poll watcher for Candidate Andre Hines. On 10/13/2020, at 8:40am, I arrived at polling location Northeast Multi-Services Center, PRCT ID SRD141C, 9720 Spaulding Street, Houston, Texas 77016.”\n\n“I informed the staff that I was a poll watcher for a candidate and had my paperwork. I asked for the precinct judge to sign my required paperwork so I could start work. The precinct judge is identified as April Elmore (Gibson) and she was there but refused to sign my paperwork and she instead directed me to someone inside named Madonna. Madonna signed the paperwork but not in the designated signature line. I then began my work as a poll watcher.”\n\n“I observed several oddities but the most concerning was a table in-between the sign-in tables One and Three. At that table was a large stack of Texas Driver’s Licenses. Staff would come inside from the drive-through voting booth and scan a driver’s license from someone outside and get a ticket and return outside. But sometimes a staff member would search through the stack of driver’s license on the table, then scan it, receive a ticket and also go outside to the drive-through booth. As a Police Officer, I quickly became suspicious that they were committing a crime by having the unattended D.L.’s just sitting on the table and that possible voting crimes were being committed using these forms of ID. Also during this time-frame an employee of the Harris County Attorney’s Office came by and he conversed with April but nothing changed and he departed. Since I was there as a poll watcher and not there as a Police Officer, I just continued to observe and considered how to deal with this situation. About that time a Precinct 1 Constable (Deputy W. Schultz) arrived at the polling location and he happened to be someone I knew professionally. I spoke with the Deputy outside and informed him of what\n\n I had observed. He was amazed and asked for evidence which I provided to him.”\n\n“Unfortunately our conversation was overheard by a staff member in the parking lot. The Deputy went inside the polling location but at this time the driver’s licenses were removed and hidden from the table. The Deputy departed the area apparently to consult with the election taskforce and supervisors. A spoke with him several times that day via phone and in person regarding my observations. At 1:00pm April commanded me to leave the polling location because I had observed and collected evidence and she informed me that “I couldn’t.”\n\n“I have not received any call from any Federal, County nor State official investigating these serious actions and crimes.”\n\nRead more at: NationalFile.com and VoteFraud.news.", "opengraph": {"title": "EXCLUSIVE AUDIO: Democrat whistleblower exposes Biden campaign voter fraud operation", "type": "article", "url": "https://www.votefraud.news/2020-12-31-whistleblower-exposes-biden-campaign-voter-fraud-operation.html", "site_name": "Vote Fraud News", "description": "Democrat political strategist Damien Thaddeus Jones, who served as regional political director for Beto O’Rourke’s U.S. Senate campaign, has come forward to blow the whistle on a massive voter fraud ring in Harris County, Texas. The voter fraud ring is overseen by Dallas Jones, who served as Texas Political Director for the Joe Biden presidential […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2021/01/Election-Ballots-Count-Worker.jpg"}, "tags": ["Joe Biden", "vote fraud", "elections", "whistleblower", "Donald Trump", "politics", "deception", "Texas", "Dallas Jones", "Republicans", "democrats"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"500\">\n<p lang=\"en\" dir=\"ltr\" xml:lang=\"en\">PRESS RELEASE: Discrepancy in 3 voting counts from Harris County <a href=\"https://twitter.com/CGHollins?ref_src=twsrc%5Etfw\">@CGHollins</a>. Still no answer. Daily Record of EV shows 1,090,445 votes, while the number reported by Clerk to the <a href=\"https://twitter.com/TXsecofstate?ref_src=twsrc%5Etfw\">@TXsecofstate</a> is 1,081,265, &amp; <a href=\"https://twitter.com/HarrisVotes?ref_src=twsrc%5Etfw\">@HarrisVotes</a> roster shows 1,092,521. Which is correct? <a href=\"https://twitter.com/hashtag/txlege?src=hash&amp;ref_src=twsrc%5Etfw\">#txlege</a> <a href=\"https://t.co/lZMXK5XVHB\">pic.twitter.com/lZMXK5XVHB</a></p>\n<p>— Team Bettencourt (@TeamBettencourt) <a href=\"https://twitter.com/TeamBettencourt/status/1320785547296690178?ref_src=twsrc%5Etfw\">October 26, 2020</a></p></blockquote>\n<p></p>\n<p>At <a href=\"https://harrisvotes.com/WaitTimes?lang=en-US\">Harrisvotes.com</a>, clicking on “Polling Locations” and then the clock icon for “Hours of Operation” show that beginning on Thursday October 29 there were EIGHT polling locations that have 24-hour voting rolling into Friday morning.</p>\n<p><img class=\"aligncenter size-full wp-image-485535\" src=\"/wp-content/uploads/2020/12/hoursofoperation.jpg\" alt=\"\" width=\"596\" height=\"412\" /></p>\n<p>Texas poll watcher Raymond T. Stewart, a retired police officer, submitted a sworn affidavit Thursday that was provided to the Harris County District Attorney’s Office. That affidavit, first obtained by NATIONAL FILE, alleges that a Houston precinct judge and staff illegally used a stack of driver’s licenses in their possession to allow people to vote illegally in the 2020 election at a drive-through voting window created by the Coronavirus pandemic. Stewart’s affidavit and photos of the scheme are presented below. The acting precinct judge’s identity has been confirmed by the Harris County Clerk’s Office and insiders identify her as a Democrat.</p>\n<p>Harris County, where Houston is located, is also the site where the Joe Biden campaign’s <a href=\"https://nationalfile.com/bidens-texas-political-director-accused-of-illegal-ballot-harvesting-at-texas-supreme-court/\">Texas political director Dallas Jones is accused of running an illegal ballot harvesting operation, according to two separate affidavits submitted to the Texas Supreme Court</a> by former law enforcement officials. Here is <a href=\"https://www.gofundme.com/f/help-stop-illegal-ballot-harvesting\">the GoFundMe page for private investigators</a> who are busting what insiders say is one of the largest voter fraud rings in the United States. Here is a photo from the scene of the stack of driver’s licenses.</p>\n<p><img class=\"aligncenter size-full wp-image-485537\" src=\"/wp-content/uploads/2020/12/Raymond1-1140x815-e1609207207965.jpg\" alt=\"\" width=\"600\" height=\"429\" /></p>\n<p><iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/BkcS0z7ZKqs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p>\n<p><strong>Here Is The Sworn Affidavit, Under Oath, of Raymond T. Stewart:</strong></p>\n<p>“My name is Raymond T. Stewart. I am above the age of eighteen years and am fully competent to make this affidavit. The facts stated in this affidavit are within my personal knowledge and are true and correct.</p>\n<p>“I am a 30+ year veteran Texas Peace Officer. I am a volunteer poll watcher for Candidate Andre Hines. On 10/13/2020, at 8:40am, I arrived at polling location Northeast Multi-Services Center, PRCT ID SRD141C, 9720 Spaulding Street, Houston, Texas 77016.”</p>\n<p>“I informed the staff that I was a poll watcher for a candidate and had my paperwork. I asked for the precinct judge to sign my required paperwork so I could start work. The precinct judge is identified as April Elmore (Gibson) and she was there but refused to sign my paperwork and she instead directed me to someone inside named Madonna. Madonna signed the paperwork but not in the designated signature line. I then began my work as a poll watcher.”</p>\n<p>“I observed several oddities but the most concerning was a table in-between the sign-in tables One and Three. At that table was a large stack of Texas Driver’s Licenses. Staff would come inside from the drive-through voting booth and scan a driver’s license from someone outside and get a ticket and return outside. But sometimes a staff member would search through the stack of driver’s license on the table, then scan it, receive a ticket and also go outside to the drive-through booth. As a Police Officer, I quickly became suspicious that they were committing a crime by having the unattended D.L.’s just sitting on the table and that possible voting crimes were being committed using these forms of ID. Also during this time-frame an employee of the Harris County Attorney’s Office came by and he conversed with April but nothing changed and he departed. Since I was there as a poll watcher and not there as a Police Officer, I just continued to observe and considered how to deal with this situation. About that time a Precinct 1 Constable (Deputy W. Schultz) arrived at the polling location and he happened to be someone I knew professionally. I spoke with the Deputy outside and informed him of what<br />\nI had observed. He was amazed and asked for evidence which I provided to him.”</p>\n<p>“Unfortunately our conversation was overheard by a staff member in the parking lot. The Deputy went inside the polling location but at this time the driver’s licenses were removed and hidden from the table. The Deputy departed the area apparently to consult with the election taskforce and supervisors. A spoke with him several times that day via phone and in person regarding my observations. At 1:00pm April commanded me to leave the polling location because I had observed and collected evidence and she informed me that “I couldn’t.”</p>\n<p>“I have not received any call from any Federal, County nor State official investigating these serious actions and crimes.”</p>\n<p><strong>Raymond T. Stewart’s Affidavit Concludes</strong></p>\n<p>Read more at: <a href=\"https://nationalfile.com/exclusive-audio-democrat-whistleblower-exposes-biden-campaign-voter-fraud-operation/\">NationalFile.com</a> and <a href=\"https://votefraud.news\">VoteFraud.news</a>.</p>\n<div class=\"addtoany_share_save_container addtoany_content_bottom\"><div class=\"a2a_kit a2a_kit_size_32 addtoany_list\" data-a2a-url=\"2020-12-31-whistleblower-exposes-biden-campaign-voter-fraud-operation.html\" data-a2a-title=\"EXCLUSIVE AUDIO: Democrat whistleblower exposes Biden campaign voter fraud operation\"><a class=\"a2a_button_google_plus\" href=\"https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-12-31-whistleblower-exposes-biden-campaign-voter-fraud-operation.html&amp;linkname=EXCLUSIVE%20AUDIO%3A%20Democrat%20whistleblower%20exposes%20Biden%20campaign%20voter%20fraud%20operation\" title=\"Google+\" rel=\"nofollow\" target=\"_blank\"></a><a class=\"a2a_dd addtoany_share_save\" href=\"https://www.addtoany.com/share\"></a></div></div><br /><a target=\"_new\" href=\"https://support.naturalnews.com/Feedback.html\"><font style=\"font-size:18px\">Submit a correction &gt;&gt;</font></a><p></p></div>&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n&#13;\n &#13;\n&#13;\n<div class=\"Widget\" id=\"Widget15\" gravityScore=\"-10\" gravityNodes=\"1\"><div class=\"Content\" gravityScore=\"-18\" gravityNodes=\"1\"><p class=\"Title\">Get Our Free Email Newsletter</p>&#13;\n<p class=\"Description\">Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more.</p>&#13;\n<iframe src=\"/NT-Include-ReaderRegistration-2019-Subscribe-Form-UnderArticle.html\" frameborder=\"0\" scrolling=\"no\" style=\"max-width:250px;overflow: hidden;height:70px;\"></iframe>&#13;\n<div class=\"Small\">  Subscription confirmation required.<a></a><span>  Subscription confirmation required.<a></a><span><a href=\"/privacypolicy\">Your privacy is protected.</a> Subscription confirmation required.</span></span></div>&#13;\n</div>&#13;\n</div>&#13;\n&#13;\n<hr id=\"Marker5\" class=\"Marker\" />&#13;\n<hr id=\"Marker6\" class=\"Marker\" />&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n</div>&#13;\n</div>&#13;\n&#13;\n &#13;\n&#13;\n<div class=\"Article2\" gravityScore=\"-9\" gravityNodes=\"1\"><div class=\"Sticky2\" gravityScore=\"-12\" gravityNodes=\"1\"><hr id=\"Marker3\" class=\"Marker\" />&#13;\n&#13;\n&#13;\n<div class=\"Widget\" id=\"Widget15\" gravityScore=\"-17\" gravityNodes=\"1\"><div class=\"Content\" gravityScore=\"-29\" gravityNodes=\"1\"><p class=\"Title\">Get Our Free Email Newsletter</p>&#13;\n<p class=\"Description\">Get independent news alerts on natural cures, food lab tests, cannabis medicine, science, robotics, drones, privacy and more.</p>&#13;\n<iframe src=\"/NT-Include-ReaderRegistration-2019-Subscribe-Form-RightColumn.html\" frameborder=\"0\" scrolling=\"no\" style=\"max-width:250px;overflow: hidden;height:70px;\"></iframe>&#13;\n<div class=\"Small\">  Subscription confirmation required.<a></a><span>  Subscription confirmation required.<a></a><span><a href=\"/privacypolicy\">Your privacy is protected.</a> Subscription confirmation required.</span></span></div>&#13;\n</div>&#13;\n</div>&#13;\n&#13;\n<div id=\"rp_widget-2\" class=\"widget widget_rp_widget\"><h2><p class=\"SectionHead\">RECENT NEWS &amp; ARTICLES</p></h2><div class=\"PostsSmall\"><div class=\"Post\"><div class=\"Pic\"><a href=\"2022-09-01-most-dems-would-have-voted-differently-if-knew-about-hunter-bidens-laptop.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/09/Hunter-Biden-Cigarette.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-09-01-most-dems-would-have-voted-differently-if-knew-about-hunter-bidens-laptop.html\">Nearly three-fourths of Democrats would have ‘likely’ voted differently if they knew about Hunter Biden’s laptop</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-31-new-documentary-on-jan6-alleges-crimes-by-police.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Capitol-March-2.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-31-new-documentary-on-jan6-alleges-crimes-by-police.html\">New documentary on Jan. 6 alleges egregious crimes by police, including murder, entrapment</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-30-trump-was-right-pfizer-pressured-announce-covid-vaccine-after-2020-election.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Covid-19-Coronavirus-Pfizer-Syringe-Vaccine-Vial.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-30-trump-was-right-pfizer-pressured-announce-covid-vaccine-after-2020-election.html\">Trump was right: Pfizer was pressured to hold back announcement of new COVID vaccine until after the 2020 election</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-30-zuckerberg-admits-facebook-downgraded-reports-hunter-bidens-laptop.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/zuckerberg-rogan.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-30-zuckerberg-admits-facebook-downgraded-reports-hunter-bidens-laptop.html\">Mark Zuckerberg makes stunning admission, says Facebook downgraded reports about Hunter Biden’s laptop, changing course of 2020 election</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-30-2020-election-fraud-greatest-coup-against-americans.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Election-Ballots-Count-Worker.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-30-2020-election-fraud-greatest-coup-against-americans.html\">The Sheriff Mack Show: 2020 US election fraud is greatest coup against the American people – Brighteon.TV</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/kevinhughes\">By Kevin Hughes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-29-trump-calls-for-new-election-to-be-held.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Biden-vs-Trump-Whitehouse.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-29-trump-calls-for-new-election-to-be-held.html\">Trump calls for new election to be held immediately after more indications surface that 2020 was stolen</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-29-matrixxx-grooove-exposes-chinas-role-us-elections.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Ballot-Counting-Machine-Touch-Screen.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-29-matrixxx-grooove-exposes-chinas-role-us-elections.html\">Matrixxx Grooove: Jeff and Shady EXPOSE China’s role in US elections – Brighteon.TV</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/kevinhughes\">By Kevin Hughes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-29-montana-election-integrity-organization-found-120000-invalid-votes-2020-election.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Trump-White-House-Briefing.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-29-montana-election-integrity-organization-found-120000-invalid-votes-2020-election.html\">Stunning: Montana election integrity organization found more than 120,000 invalid votes cast during 2020 election</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-26-campfield-democrats-playing-dumb-game-against-trump.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Donald-Trump-Border-Wall-Texas.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-26-campfield-democrats-playing-dumb-game-against-trump.html\">Reality Camp with Stacey Campfield: Democrats playing a dumb game against Trump – Brighteon.TV</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/kevinhughes\">By Kevin Hughes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-24-florida-arrests-charges-20-individuals-election-fraud.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Voter-Fraud.png\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-24-florida-arrests-charges-20-individuals-election-fraud.html\">Florida arrests, charges 20 individuals with election fraud</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/maryvillarealdw\">By Mary Villareal</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-24-democrat-operatives-control-voterroll-system-in-31-states.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/America-Illegal-Votes-Election.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-24-democrat-operatives-control-voterroll-system-in-31-states.html\">Democrat operatives control voter-roll system in 31 states</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-23-biden-regime-partners-with-chinas-tiktok-crucial-midterm-elections.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/tiktok-logo.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-23-biden-regime-partners-with-chinas-tiktok-crucial-midterm-elections.html\">Democrats planning to steal midterms: Biden regime partners with communist China-based TikTok ahead of crucial elections</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-23-soros-funded-voter-registration-system-eric-politically-compromised.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/ballot-stuffing.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-23-soros-funded-voter-registration-system-eric-politically-compromised.html\">Soros-funded voter registration system ‘ERIC’ used in dozens of states is politically compromised: Report</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-21-electronic-voter-registration-system-eric-politically-compromised.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Election-Works-Count-Ballots-Boxes-Bags.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-21-electronic-voter-registration-system-eric-politically-compromised.html\">New evidence shows crooked electronic voter registration system ERIC is politically compromised… STUNNING 104% of voting aged population in MI is registered to vote</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-19-facebook-to-help-democrats-steal-future-elections.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Mark-Zuckerberg-Facebook-Senate-Hearing-Close-Up.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-19-facebook-to-help-democrats-steal-future-elections.html\">Facebook lays out how it will help Democrats steal future elections with new ‘content guidelines’</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-19-u-s-postal-service-going-into-election-fraud-business-full-time.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Biden-vs-Trump-Whitehouse.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-19-u-s-postal-service-going-into-election-fraud-business-full-time.html\">U.S. Postal Service now going into the election fraud business full-time with new division that will “handle” all mail-in ballots</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-17-jan-6-attorney-two-dozen-federal-assets-embedded-capitol-during-riot.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Capitol-March-3.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-17-jan-6-attorney-two-dozen-federal-assets-embedded-capitol-during-riot.html\">Knew it: Jan. 6 defense attorney says nearly two dozen federal ‘assets’ were embedded in Capitol during riot</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/jdheyes\">By JD Heyes</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-15-all-they-have-left-is-governance-through-fear.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Democrat-Donkey-Republican-Elephant-Party-Symbol-Vector.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-15-all-they-have-left-is-governance-through-fear.html\">Desperate Democrats! All they have left is governance through fear</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/newseditors\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-12-media-stopped-describing-targeting-trump-as-raid.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Donald-Trump-Departs-for-South-Carolina.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-12-media-stopped-describing-targeting-trump-as-raid.html\">Mainstream media immediately complies with propaganda request: Stopped describing targeting of Trump as “raid” after former FBI agent complained</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/victort1\">By News Editors</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n<div class=\"Post\"><div class=\"Pic\"><a href=\"2022-08-12-vote-fraud-illinois-primary-votes-switched-candidates.html\"><img border=\"0\" src=\"wp-content/uploads/sites/177/2022/08/Voting-Booth-Flags-American.jpg\" /></a>&#13;\n</div>&#13;\n<div class=\"Text\"><div class=\"Title\"><a href=\"2022-08-12-vote-fraud-illinois-primary-votes-switched-candidates.html\">Vote fraud: Illinois primary votes are being switched between different candidates</a></div>&#13;\n<div class=\"Info\"><span class=\"Author\"><a href=\"author/arseniotoledo\">By Arsenio Toledo</a></span></div>&#13;\n</div>&#13;\n</div>&#13;\n</div></div>&#13;\n</div>&#13;\n</div>&#13;\n&#13;\n &#13;\n &#13;\n</div>&#13;\n</div>&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n</div>&#13;\n&#13;\n</div>&#13;\n&#13;\n&#13;\n &#13;\n&#13;\n&#13;\n &#13;\n &#13;\n&#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n &#13;\n&#13;\n</div></div></body>&#13;\n</html>\n"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/nBWtLEXpa9s?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/nBWtLEXpa9s?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/BkcS0z7ZKqs?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/BkcS0z7ZKqs?feature=oembed"}], "links": ["https://nationalfile.com/exclusive-audio-democrat-whistleblower-exposes-biden-campaign-voter-fraud-operation/", "https://nationalfile.com/bidens-texas-political-director-accused-of-illegal-ballot-harvesting-at-texas-supreme-court/", "https://twitter.com/TeamBettencourt/status/1320785547296690178", "https://nationalfile.com/exclusive-texas-poll-watcher-testifies-on-2020-voter-fraud-in-houston-has-photos/", "https://twitter.com/CGHollins?ref_src=twsrc%5Etfw", "https://twitter.com/TXsecofstate?ref_src=twsrc%5Etfw", "https://twitter.com/HarrisVotes?ref_src=twsrc%5Etfw", "https://twitter.com/hashtag/txlege?src=hash&ref_src=twsrc%5Etfw", "https://t.co/lZMXK5XVHB", "https://twitter.com/TeamBettencourt/status/1320785547296690178?ref_src=twsrc%5Etfw", "https://harrisvotes.com/WaitTimes?lang=en-US", "https://nationalfile.com/bidens-texas-political-director-accused-of-illegal-ballot-harvesting-at-texas-supreme-court/", "https://www.gofundme.com/f/help-stop-illegal-ballot-harvesting", "https://nationalfile.com/exclusive-audio-democrat-whistleblower-exposes-biden-campaign-voter-fraud-operation/", "https://votefraud.news", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-12-31-whistleblower-exposes-biden-campaign-voter-fraud-operation.html&linkname=EXCLUSIVE%20AUDIO%3A%20Democrat%20whistleblower%20exposes%20Biden%20campaign%20voter%20fraud%20operation", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}