{"result_id": "335006", "URL": "https://www.votefraud.news/2020-11-28-monkey-werx-cia-rendition-flights-are-continuing-confessions-traitors.html", "timestamp": "2023-04-25 17:55:43 CEST+0200", "meta": {"description": "Code name “Monkey Werx” (monkeywerxus.com) is an aerospace industry analyst who monitors real-time flight data of military aircraft in order to identify geopolitical events that are taking place. In the days following the Nov. 3rd election, he noticed a huge spike in military air traffic, including flights of “black ops” charter planes in an around […]", "lang": "en", "keywords": "CIA,election fraud,Joe Biden,military flights,Monkey Werx,President Trump,rendition flights,rigged,traitors,treason", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.votefraud.news/2020-11-28-monkey-werx-cia-rendition-flights-are-continuing-confessions-traitors.html", "encoding": "UTF-8"}, "image": null, "domain": "www.votefraud.news", "title": "Interview with Monkey Werx: CIA rendition flights are CONTINUING, confessions extracted, traitors turned", "cleaned_text": "Code name “Monkey Werx” (monkeywerxus.com) is an aerospace industry analyst who monitors real-time flight data of military aircraft in order to identify geopolitical events that are taking place. In the days following the Nov. 3rd election, he noticed a huge spike in military air traffic, including flights of “black ops” charter planes in an around GITMO. His analysis concludes that many of these flights are “rendition flights” where deep state traitors are interrogated for their roles in the cyber warfare election rigging attack that the United States just endured.\n\nThis information is consistent with what several other key sources are telling us, and it is further evidence that President Trump is many steps ahead of the Democrat traitors who sloppily tried to rig this election and hand over the United States of America to communist China (via the Biden crime family).\n\nBelow, you can watch the entire Brighteon Conversations interview with Monkey Werx. Here are some of the highlights you’ll discover in the interview:\n• Knows the tail numbers of private charter CIA airplanes used to ferry prisoners and newly-arrested persons who are held for interrogation.\n• Confirms that “rendition flights” are continuing right now at a very rapid pace, indicating many potential traitors are being interrogated either during flights or at black sites services by those flights.\n• Says that the pattern of increased military traffic is largely focused on the East Coast (D.C., GITMO, Florida, Virginia, etc.)\n• Reveals that many military refueling planes with transponders are being spotted on the flight tracking apps, indicating a very large presence of military fighter jets and bombers which require in-air refueling.\n• Anticipates a large military event may be drawing near, as large numbers of military cargo planes are moving around the country, apparently supplying military forces for action readiness.\n• Says that before Epstein was killed, there was a flurry of “rendition flights” activity likely involving people that Epstein was naming, before he “killed himself.”\n• Says that there are many “white hat” CIA people who are working with Trump to defend America and take down its enemies.\n• Believes that HUNDREDS of domestic, treasonous actors are being extracted, put onto flights and interrogated until they turn. This would underscore how Trump’s people are gathering up all the information that matters, enough to expose the entire Democrat crime syndicate.\n\nWatch the full interview here, and share everywhere:\n\nWe find it interesting that the DOJ just amended its federal execution rules, “to allow death by hanging, electric chair, gas chamber & FIRING SQUAD,” reports RT.\n\nVisit the Monkey Werx website, where he focuses on “handcrafted artisan style products made from wood, acrylics and all natural ingredients.” This is in addition to his hobby of monitoring military air traffic patterns.\n\nThis Nov. 21st Situation Update describes how the mass arrests are likely to go down. Expect many thousands of treasonous Americans to be indicted, arrested and subjected to prosecution, most likely via military tribunals:\n\nHear a new Situation Update each day at the Health Ranger Report channel on Brighteon.com:\n\n https://www.brighteon.com/channels/hrreport", "opengraph": {"title": "Interview with Monkey Werx: CIA rendition flights are CONTINUING, confessions extracted, traitors turned", "type": "article", "url": "https://www.votefraud.news/2020-11-28-monkey-werx-cia-rendition-flights-are-continuing-confessions-traitors.html", "site_name": "Vote Fraud News", "description": "Code name “Monkey Werx” (monkeywerxus.com) is an aerospace industry analyst who monitors real-time flight data of military aircraft in order to identify geopolitical events that are taking place. In the days following the Nov. 3rd election, he noticed a huge spike in military air traffic, including flights of “black ops” charter planes in an around […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2020/11/monkey-werx.png"}, "tags": ["Joe Biden", "rendition flights", "rigged", "Monkey Werx", "treason", "CIA", "election fraud", "military flights", "President Trump", "traitors"], "tweets": [], "movies": [], "links": ["http://monkeywerxus.com", "http://Brighteon.com/1448d722-7874-4d50-bdd1-f88dec6eaa5b", "https://www.rt.com/usa/508070-doj-executions-firing-squad/", "https://www.monkeywerxus.com", "https://www.brighteon.com/channels/hrreport", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-11-28-monkey-werx-cia-rendition-flights-are-continuing-confessions-traitors.html&linkname=Interview%20with%20Monkey%20Werx%3A%20CIA%20rendition%20flights%20are%20CONTINUING%2C%20confessions%20extracted%2C%20traitors%20turned", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}