{"result_id": "335041", "URL": "https://votefraud.news/2022-11-14-the-aftermath-and-after-that.html", "timestamp": "2023-04-25 17:56:06 CEST+0200", "meta": {"description": "Let’s get something straight: the Woked-up Jacobin Party of Chaos is not really worried about “mis-and-disinformation” — it’s just afraid of information. Only a tyrannical regime would work so hard and complain so loudly about opposing ideas entering the public arena as to brand them inadmissible. Apparently, that formula also applies to election results, an […]", "lang": "en", "keywords": "ballot harvesting,big government,chaos,Collapse,conspiracy,corruption,deception,democrats,fake polls,politics,Republicans,rigged,traitors,Tyranny,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-11-14-the-aftermath-and-after-that.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "The aftermath and after that", "cleaned_text": "The aftermath and after that\n\nLet’s get something straight: the Woked-up Jacobin Party of Chaos is not really worried about “mis-and-disinformation” — it’s just afraid of information. Only a tyrannical regime would work so hard and complain so loudly about opposing ideas entering the public arena as to brand them inadmissible. Apparently, that formula also applies to election results, an elemental kind of information that’ll determine whether or not censorship continues to be the order-of-the-day.\n\nThe stalling of election results also allows for wholesale correction of results that don’t come in as desired. At a certain threshold, the Marc Elias Lawfare-sponsored ballot-harvesting machinery kicks in and, voila, ten thousand or so mail-in ballots appear courtesy of, say, the Culinary Workers Union in Nevada, and … problem solved! The correct candidates win! My guess is that this happened in other select districts all over the USA. Will it be detected and looked into? Probably not. That would be election denial, a newly-taboo toxic reservoir of “disinformation.”\n\nWhich is why the Arizona governor’s race, where the dynamic Kari Lake (R) ran against the inert and corrupt Katie Hobbs (D), is so interesting. Maricopa County, the second-largest election district in the USA, has dribbled out the results all week to make sure it looked like Ms. Lake was losing, while Democratic Party activists scrambled to generate more early mail-in ballots to make sure that Ms. Lake does lose, if at all possible. Either way, it may not go down so easily. If she wins, Ms. Lake will do everything possible to reform the sketchy Arizona election laws; if she loses, she is prepared to sue the living shit out of Maricopa County election officials and Katie Hobbs — whose position as AZ Secretary of State left her in charge of an election she ran in, and all the janky machinery behind it.\n\nThe post-election mood across America is labile and incendiary. So-called Red America, the opposition to Woke Jacobin tyranny, smolders in fury facing two more years of censorship, war-mongering, FBI-DOJ-IRS persecution, “vaccine” fuckery, economic breakdown, and the WEF-inspired killing-off of Western Civilization. Blue America, personified by the smugly sclerotic “Joe Biden,” ghoulishly salivates over the dying carcass of the country it intends to devour. Between the two factions there is no space for the normal operation of politics — the contest of ideas about running human affairs — especially with the public arena of speech and ideas in Woke lockdown.\n\nYet, other events look like they are out-pacing whatever the mood is on any side. So many crises are already underway threatening to upend everyday life that neither Red or Blue Americans will escape hardship and damage.\n\nThe on-the-ground economy has imploded. Inflation is for-real and is crushing the country’s standard-of-living. Before long, it may shift into deflation, which means instead of having a lot of money losing value, you’ll have no money at all. Rising interest rates killed off the real estate part of the Everything Bubble, and the building, selling, and remodeling of houses has been the locus of the few remaining good-paying jobs. The car industry is dying under several forms of stress: steeply rising unit prices, a strapped middle-class, growing scarcity of capital for lending, broken supply lines for vehicle inventory and parts, and the insane “green” crusade to make all motoring electric. Even fixing things of value — existing houses, cars, machinery in general — becomes increasingly impossible when nobody can get replacement parts to work with.", "opengraph": {"title": "The aftermath and after that", "type": "article", "url": "https://www.votefraud.news/2022-11-14-the-aftermath-and-after-that.html", "site_name": "Vote Fraud News", "description": "Let’s get something straight: the Woked-up Jacobin Party of Chaos is not really worried about “mis-and-disinformation” — it’s just afraid of information. Only a tyrannical regime would work so hard and complain so loudly about opposing ideas entering the public arena as to brand them inadmissible. Apparently, that formula also applies to election results, an […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/11/Election-ballot-Votes-Shredded.jpg"}, "tags": ["chaos", "conspiracy", "ballot harvesting", "big government", "fake polls", "vote fraud", "rigged", "Collapse", "politics", "deception", "Republicans", "democrats", "traitors", "corruption", "Tyranny"], "tweets": [], "movies": [], "links": ["https://kunstler.com/clusterfuck-nation/the-aftermath-and-after-that/", "https://kunstler.com/clusterfuck-nation/the-aftermath-and-after-that/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-11-14-the-aftermath-and-after-that.html&linkname=The%20aftermath%20and%20after%20that", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}