{"result_id": "335037", "URL": "https://votefraud.news/2022-10-28-critical-disclosure-election-integrity-on-the-line.html", "timestamp": "2023-04-25 17:56:04 CEST+0200", "meta": {"description": "Election integrity is on the line in the November 2022 midterms. Host James White talked about this topic with his guests Roy McKenzie and Jane Rectenwald, both from the Montana Election Integrity Project, during the Oct. 17 episode of “Critical Disclosure” on Brighteon.TV. White pointed out that election integrity is one of the important issues […]", "lang": "en", "keywords": "big government,Brighteon.tv,China,computing,conspiracy,corruption,Critical Disclosure,deception,election integrity,Eugene Yu,Glitch,Jane Rectenwald,Jim White,Konnech,Midterm elections,national security,poll worker data,privacy watch,rigged,Roy McKenzie,surveillance,vote fraud,voter integrity", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-10-28-critical-disclosure-election-integrity-on-the-line.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "Critical Disclosure with Jim White: Election integrity on the line in November 2022 midterms – Brighteon.TV", "cleaned_text": "Critical Disclosure with Jim White: Election integrity on the line in November 2022 midterms – Brighteon.TV\n\nElection integrity is on the line in the November 2022 midterms. Host James White talked about this topic with his guests Roy McKenzie and Jane Rectenwald, both from the Montana Election Integrity Project, during the Oct. 17 episode of “Critical Disclosure” on Brighteon.TV.\n\nWhite pointed out that election integrity is one of the important issues facing America based on polls. This is in spite of a certain group urging people to forget, let go and move on from the 2020 elections. According to White, corruption in America is nationwide – and his home state of Montana is not exempt.\n\nMcKenzie cited an example of this corruption in the form of election software company Konnech and its CEO Eugene Yu. Every American ought to know about Konnech and Yu as Montanans use the company’s software for its voting system, he said. According to McKenzie, the Montana State Legislature had already written to the state’s Attorney General Austin Knudsen to look into Konnech’s software.\n\nHe also cited the arrest of Yu in connection with the data of U.S. poll workers being found on servers in China. A grand jury testimony in Los Angeles County led to the Konnech CEO’s arrest in connection with the company’s PollChief software. (Related: Software CEO charged with stealing massive amounts of election data in Los Angeles, sending it to China.)\n\nMcKenzie said Montana is also using another piece of software that was originally developed by Konnech called AB Vote, which serves as the online absentee voting portal software used by the United States uniformed and overseas citizens to vote during elections. The company that currently administers AB Vote software is Votem, which purchased access to the software in 2016. Incidentally, Yu is also a member of the board of advisors for Votem.\n\n“So, he has influence over the decisions of the company. And that should give people pause and this is worthy of investigation. So, going back here, why is this important? With the PollChief software, we saw that poll worker data was sent over to China. What does that mean for this voting portal that Montana uses? It means that the voters’ name, their date of birth, their precinct or county is shared with the system vendor,” McKenzie said.\n\nThe Montana Federal Voting Assistance Program grant proposal submitted by Montana Secretary of State in 2012 has specifically stated that the system vendor can access that information. According to McKenzie, this online voting portal is not a secure portal because it gets a user’s IP address and browser information when they log in.\n\n“Someone who is smart could do a reverse IP lookup on maybe a general ballot submission and see their deployment location. So, this has far-reaching implications even greater in my opinion than just the PollChief software’s election worker data,” he said.\n\nWhite pointed out that enemies of America, namely China, can find out based on looking at the IP address where the vote was made and trace it back from its location. He added that it could expose the location of a high-level military officer, which could put their life in danger from the Chinese Communist Party (CCP) and other enemies.\n\nMcKenzie agreed, mentioning that Yu intentionally sent PollChief’s 1.8 million poll workers’ data to software developers in China. This, in turn, could be used by the CCP to know about troop locations or do clandestine operations. He reiterated that such a concern is definitely a security breach that should not be pooh-poohed.\n\nWatch the Oct. 17 episode of “Critical Disclosure” below. “Critical Disclosure” airs every Monday at 7-8 p.m. on Brighteon.TV.\n\nStunning: Montana election integrity organization found more than 120,000 invalid votes cast during 2020 election.\n\nElection company “Konnech” that illegally stored election data in communist China EXPOSED for contributing all political cash to Biden and other Democrats.\n\nBreaking: Election software CEO arrested for storing data in China is deemed “significant flight risk” caught with luggage on way to MI airport… left his cell phone behind… has “substantial ties to China.”", "opengraph": {"title": "Critical Disclosure with Jim White: Election integrity on the line in November 2022 midterms – Brighteon.TV", "type": "article", "url": "https://www.votefraud.news/2022-10-28-critical-disclosure-election-integrity-on-the-line.html", "site_name": "Vote Fraud News", "description": "Election integrity is on the line in the November 2022 midterms. Host James White talked about this topic with his guests Roy McKenzie and Jane Rectenwald, both from the Montana Election Integrity Project, during the Oct. 17 episode of “Critical Disclosure” on Brighteon.TV. White pointed out that election integrity is one of the important issues […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/10/electronic-voting.jpg"}, "tags": ["conspiracy", "big government", "vote fraud", "Roy McKenzie", "national security", "poll worker data", "Jim White", "voter integrity", "deception", "China", "privacy watch", "corruption", "Jane Rectenwald", "Brighteon.tv", "Critical Disclosure", "computing", "election integrity", "surveillance", "Konnech", "Eugene Yu", "Glitch", "rigged", "Midterm elections"], "tweets": [], "movies": [], "links": ["https://brighteon.tv", "http://nypost.com/2022/10/05/ceo-arrested-for-stealing-us-election-worker-data-storing-it-in-china/", "https://naturalnews.com/2022-10-20-software-ceo-charged-stealing-election-data-sending-to-china.html", "http://privacywatch.news", "http://nationalsecurity.news", "http://www.brighteon.com/0e569ae4-db19-4dc5-83fb-1affadf23121", "https://brighteon.tv/", "https://naturalnews.com/2022-08-29-montana-election-integrity-organization-found-120000-invalid-votes-2020-election.html", "https://naturalnews.com/2022-10-11-konnech-illegal-election-data-china-biden-democrats.html", "https://naturalnews.com/2022-10-09-election-software-ceo-arrested-for-storing-data.html", "https://www.brighteon.com/0e569ae4-db19-4dc5-83fb-1affadf23121", "http://nypost.com/2022/10/05/ceo-arrested-for-stealing-us-election-worker-data-storing-it-in-china/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-10-28-critical-disclosure-election-integrity-on-the-line.html&linkname=Critical%20Disclosure%20with%20Jim%20White%3A%20Election%20integrity%20on%20the%20line%20in%20November%202022%20midterms%20%E2%80%93%20Brighteon.TV", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}