{"result_id": "335032", "URL": "https://www.votefraud.news/2021-01-03-situation-update-jan-3rd-senators-10-day-emergency-investigation.html", "timestamp": "2023-04-25 17:56:00 CEST+0200", "meta": {"description": "A dozen U.S. Senators have signed on to a demand for an emergency 10-day elections investigation commission that would dive into all the known allegations of election fraud and produce a final report. Speculation is swirling that VP Mike Pence will himself invoke this 10-day investigation on January 6th, refusing to open and read the […]", "lang": "en", "keywords": "America,civil war,election fraud,elections,investigations,Joe Biden,President Trump,senators,Situation Update,Trump,uprising", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.votefraud.news/2021-01-03-situation-update-jan-3rd-senators-10-day-emergency-investigation.html", "encoding": "UTF-8"}, "image": null, "domain": "www.votefraud.news", "title": "Situation Update, Jan. 3rd – Senators announce 10-day emergency investigation into election fraud, Pence likely to invoke on the 6th", "cleaned_text": "Situation Update, Jan. 3rd – Senators announce 10-day emergency investigation into election fraud, Pence likely to invoke on the 6th\n\nA dozen U.S. Senators have signed on to a demand for an emergency 10-day elections investigation commission that would dive into all the known allegations of election fraud and produce a final report. Speculation is swirling that VP Mike Pence will himself invoke this 10-day investigation on January 6th, refusing to open and read the electoral votes from swing states until this 10-day investigation is complete.\n\nThere is historical precedent for exactly this sort of investigation, and Pence has plenary power to invoke this himself, needing no approval from anyone else. Should he do so, it would likely push the inauguration day beyond January 20th, which is perfectly fine with the Twelfth Amendment, which states that the inauguration can be as late as March 4th in cases of a contested election.\n\nThe commission would reportedly consist of five members of the House, five from the Senate and five US Supreme Court justices. Unless this group is chosen to include patriots like Sen. Hawley, Sen. Cruz, Justices Thomas and Alito, Rep. Mo Brooks and similar, a group of 5 Representatives + 5 Senators + 5 SCOTUS justices sounds like 15 filthy traitors in a smoke-filled room, ready to betray the republic by burying all the evidence.\n\nSo unless this commission is carefully crafted, it’s going to be obvious from the start that it’s all a ruse. And that will set off the pro-America patriots who have had enough of bogus investigations, waiting for Bill Barr to do something useful, or sitting around hoping that deep state swamp creatures might one day face arrest for their crimes against the United States.\n\nToday’s Situation Update for January 3rd examines this new development and many other stories:\n• Why abortion was the leading cause of death in 2020.\n• Pope Francis is “the entity” and the Vatican covers up pedophilia and child sacrifice.\n• How the D.C. mayor closing local hotels before the Jan 6th Trump rally is yet another act of extreme censorship against conservatives and Trump supporters.\n• Why Leftists are the malicious bullies who deny conservatives any right to speak, or work in corporation America, or practice religion or even get a hotel room.\n• Why patience is running out for many conservatives, and why a day of reckoning is coming for intolerant, fascist Leftists.\n• We need a whole new “Operation Warp Speed” for military tribunals of treasonous deep state actors, Big Tech CEOs, fake news journo-terrorists and all the other evil, malicious actors who are trying to destroy America and enslave humanity.\n• Mitt Romney unhappy with the speed of the mass vaccinations that will kill people. Romney would have no doubt been unhappy with the Nazi regime’s efficiency of mass extermination via Zyklon-B.\n• VP Pence now welcomes GOP senators challenging the election fraud in swing states. (He has flipped back to the pro-Trump side.)\n• Jerome Corsi believes the outcome of this election will go way past January 6th and perhaps take until January 20th to sort out.\n• Wild claims of 220,000 “sealed indictments” are probably nonsense.\n• Trump says more US senators will join the currently list of objectors.\n• Georgia GOP reveals their case filed on Dec. 4th, is still not even assigned to a judge. DELAY, DELAY, DELAY. The criminality of the courts is exposed.\n• If the courts will not hear any election fraud case on its merits and now claim no jurisdiction over any election fraud, it’s that a green light for all future elections to be determined by wholesale ballot printing and stuffing operations? SCOTUS says cheating is fine! District courts, too. Cheat away!\n• Trump tweets in legal language, issuing official declaration that the Georgia general election and runoff elections are both “illegal and invalid.” This is specific legal language, not merely the usual Trump banter.\n• Two foreign spy agencies have proof of massive election fraud in the USA. We believe it’s Israel and Russia. Israel is turning over this evidence to Trump’s team.\n• What will happen when Trump is confirmed the winner: Left-wing cities erupt into mass violence.\n• Special Forces intel says operators are pre-positioned in Dem-controlled cities and will use civilian rental vans to launch targeted extractions and arrests of top Antifa and BLM terrorist leaders.\n• SOF units are already in place in Dem-controlled cities. Dem mayors and governors are also on the arrest list if they interfere. This is why Ted Wheeler in Portland has suddenly flipped against Antifa. He likely got word that his own arrest was imminent.\n• Liberal “journalist” Kurt Eichenwald fantasizes about beating antimaskers to death, but we wonder how exactly he plans to accomplish that when he has first been “ventilated” in self-defense.\n• Fauci the fraud reveals that coronavirus vaccines don’t prevent infections but rather were designed merely to mask symptoms of covid. This is an open admission that the vaccines are a total fraud, and that the vaccine industry’s antibody theory has been completely abandoned by the vaccine propagandists themselves.\n• Prepare for left-wing guerilla warfare in the Untied States with a possible duration of a few months. Expect infrastructure disruptions and spontaneous killings of Trump supporters. Prepare for defense.\n\nHear the full Situation Update here, including a horrible rendition of Mitt Romney speaking German like a crazed Nazi:\n\nA new Situation Update is posted every day, including weekends and holidays, at:", "opengraph": {"title": "Situation Update, Jan. 3rd – Senators announce 10-day emergency investigation into election fraud, Pence likely to invoke on the 6th", "type": "article", "url": "https://www.votefraud.news/2021-01-03-situation-update-jan-3rd-senators-10-day-emergency-investigation.html", "site_name": "Vote Fraud News", "description": "A dozen U.S. Senators have signed on to a demand for an emergency 10-day elections investigation commission that would dive into all the known allegations of election fraud and produce a final report. Speculation is swirling that VP Mike Pence will himself invoke this 10-day investigation on January 6th, refusing to open and read the […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2021/01/Ted-Cruz-Big-Tech-Hearing.jpg"}, "tags": ["investigations", "Joe Biden", "elections", "Trump", "election fraud", "Situation Update", "President Trump", "America", "senators", "uprising", "civil war"], "tweets": [], "movies": [], "links": ["http://Brighteon.com/ad69e36f-8d3e-4c1c-ba16-0bf86ae1a172", "https://www.brighteon.com/channels/hrreport"], "authors": [], "publish_date": null}