{"result_id": "335011", "URL": "https://www.votefraud.news/2023-02-02-the-war-against-us.html", "timestamp": "2023-04-25 17:55:46 CEST+0200", "meta": {"description": "“We now live in a nation where doctors destroy health, lawyers destroy justice, universities destroy knowledge, governments destroy freedom, the press destroys information, religion destroys morals, and our banks destroy our economy ” – Chris Hedges (Article republished from Kunstler.com) The question you might ask these days: how did we weaponize everything in American life […]", "lang": "en", "keywords": "barack obama,Biden crime family,big government,Collapse,conspiracy,corruption,Cover-Up,deception,deep state,DOJ,election fraud,FBI,Joe Biden,politics,rigged,traitors,treason,truth,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.votefraud.news/2023-02-02-the-war-against-us.html", "encoding": "UTF-8"}, "image": null, "domain": "www.votefraud.news", "title": "The war against us", "cleaned_text": "The war against us\n\n“We now live in a nation where doctors destroy health, lawyers destroy justice, universities destroy knowledge, governments destroy freedom, the press destroys information, religion destroys morals, and our banks destroy our economy ” – Chris Hedges\n\nThe question you might ask these days: how did we weaponize everything in American life against ourselves? Can you name an institution that is not at war with the people of this land? The exact mechanisms for all that bad faith stand in plain sight these days, and persons responsible can be easily identified. What’s missing are discernible motives. For now, it just looks like the greatest collective act of ass-covering in history.\n\nIt’s pretty clear, for instance, that all the criminal misconduct in the FBI / DOJ — continuing to this moment — emanates from the years-long effort to cover up the seditious campaign to nullify Donald Trump starting well before Nov. 8, 2016. All the players in the agencies, and their news media accomplices, stand to lose at least their reputations, if the public cared about how dishonestly they acted. Many of those still working would lose their jobs and their livelihoods too, and quite a few would lose their freedom in prison. So, their motive to keep up the skullduggery is simple self-preservation.\n\nThe Covid-19 pandemic looks like a pretty large-scale racketeering operation gone awry with plenty to hide. You have the reckless, symbiotic relations between the US public health bureaucracy and the pharmaceutical companies, and tons of money at stake, plus the colossal ego of hapless Dr. Anthony Fauci wishing to pose as an historic world-saver, another Louis Pasteur or Alexander Fleming. And then you have the amazingly foolish act of imposing an untested, dangerous “vaccine” on the world, and years of lying and covering-up its repercussions of injury and death. And then the opaque and nefarious roles of other actors in the story ranging from the CCP to the WEF to the Bill Gates and George Soros empires of money in what looks like genocide.\n\nIt’s harder to unpack the enigma of the obviously unfit “Joe Biden” getting installed in the White House. My guess: the Obama claque behind him knew that “JB” was easily manipulable, and that his lame rivals, Klobuchar, Buttigieg, Liz Warren, and especially the proud socialist Bernie Sanders, could not be counted on to do exactly what they were told. The Obama claque especially needed a president to appoint agency heads who would cover-up its creation of an Intel Community Frankenstein, and all that monster has inflicted on the American public.\n\nOf course, the main device the claque had for pulling “Joe Biden’s” strings was the flagrant record of his many years of bribery and treason. The major effort to cover-up all that criminality was the DOJ and FBI’s suppression since 2019 of the Hunter Biden laptop, and the most stunning upshot was that the incendiary evidence of bribery and treason came out anyway, because so many copies of the laptop’s hard-drive got distributed. And absolutely nothing was ever done about it, nor about the actual persons — Christopher Wray, William Barr, and Merrick Garland — who worked to squash it, making themselves accomplices to ongoing bribery and treason.\n\nAll this criminal misconduct is connected in a foul matrix of lawbreaking. The fact-patterns are well-established. Dozens of excellent books have catalogued the misdeed of RussiaGate and scores of websites daily dissect the shady intrigues around the “vaccine” crusade. The infamies of gross election interference have been systematically laid-out in the Twitter Files of the past two months. Many books, published essays, and videos substantiate the reality of massive ballot fraud in 2020 and 2022, including the felonious role of Mark Zuckerberg’s front org, the Center for Tech and Civic Life, and the election law manipulations of Lawfare goblin Marc Elias.\n\nThere’s an understandable wish that upcoming hearings in Congress will lead to a reckoning for all of this. To banish consequence from public life, as we have done, is a pretty grave insult to nature, but who can tell whether accountability might restore our institutions at this point. We may be too far gone. The US is visibly collapsing now: our economy, our financial arrangements, our culture, our influence in world affairs, and our basic consensus about reality. We’re entering a phase of disorder and hardship that is likely to moot the further depredations of a government at war with its people. For one thing, it’s becoming impossible to pretend that this vicious leviathan has the money to carry on because the money is only pretending to be money.\n\nIt’s no wonder that the collective ability for sense-making has failed. It will be quickly restored by each of us in the scramble to survive these disorders and hardships. The bewildering hypotheticals of recent years begin to dissolve like mist on the mountain and things come back into focus: your health, your daily bread, your shelter, your associations with other people close to you, your values, and most of all the power of your own choices. Nature, much insulted and maligned, will sort out the rest.", "opengraph": {"title": "The war against us", "type": "article", "url": "https://www.votefraud.news/2023-02-02-the-war-against-us.html", "site_name": "Vote Fraud News", "description": "“We now live in a nation where doctors destroy health, lawyers destroy justice, universities destroy knowledge, governments destroy freedom, the press destroys information, religion destroys morals, and our banks destroy our economy ” – Chris Hedges (Article republished from Kunstler.com) The question you might ask these days: how did we weaponize everything in American life […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2023/02/Deep-State.jpg"}, "tags": ["conspiracy", "big government", "deep state", "deception", "barack obama", "corruption", "White House", "Cover-Up", "truth", "DOJ", "Joe Biden", "FBI", "treason", "politics", "Biden crime family", "rigged", "Collapse", "election fraud", "traitors"], "tweets": [], "movies": [], "links": ["https://kunstler.com/clusterfuck-nation/the-war-against-us/", "https://kunstler.com/clusterfuck-nation/the-war-against-us/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2023-02-02-the-war-against-us.html&linkname=The%20war%20against%20us", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}