{"result_id": "335008", "URL": "https://votefraud.news/2021-09-16-election-fraud-covid19-vaccination-exemptions.html", "timestamp": "2023-04-25 17:55:44 CEST+0200", "meta": {"description": "In the most recent episode of B-alert News, Bishop Leon Benjamin and guest General Flynn talk about election fraud and how COVID-19 helped bury the issue. In recent reports, several people hired to lead a controversial audit of Arizona’s 2020 election results were found to have contracted COVID-19, delaying a widely panned ballot review process. […]", "lang": "en", "keywords": "2020 elections,conspiracy,covid-19,deception,Donald Trump,election fraud,elections,Joe Biden,lies,mandates,politics,rigged,USPS,vaccinations,voter fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2021-09-16-election-fraud-covid19-vaccination-exemptions.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "Leon Benjamin and Gen. Flynn: Election fraud, COVID-19 vaccination exemptions, and more – Brighteon TV", "cleaned_text": "Leon Benjamin and Gen. Flynn: Election fraud, COVID-19 vaccination exemptions, and more – Brighteon TV\n\nIn the most recent episode of B-alert News, Bishop Leon Benjamin and guest General Flynn talk about election fraud and how COVID-19 helped bury the issue.\n\nIn recent reports, several people hired to lead a controversial audit of Arizona’s 2020 election results were found to have contracted COVID-19, delaying a widely panned ballot review process.\n\nThe president of the Arizona State Senate, Senator Karen Fann, said in a statement that three people of the five-member team were “quite sick,” including Doug Logan, who is in charge of the review.\n\nLogan’s company, Cyber Ninjas, started reviewing 2.1 million ballots and election equipment from Maricopa County, which includes Phoenix, in April, following orders of the Republican majority in the State Senate. The review was conducted to address claims of voter fraud by the supporters of former President Donald Trump.\n\nIt is not clear when the final report for the fraudulent claims will be made public, but Fann said that the Senate team will meet again once the full draft of the report is submitted. Once completed, the final report will be presented to the Arizona Senate Judiciary Committee, and the findings will be made public.\n\nThere are people who believe that the COVID-19 pandemic was planned, and issues have been raised since 2020. A five-minute clip posted on Facebook in November claiming that COVID-19 was planned to remove U.S. President Donald Trump from office circulated online. Posted on Facebook in November last year, the five-minute clip showed “The Four Year Plan To Overthrow An Elected President.”\n\nThe video expressed numerous claims and opinions but mostly addressed some of the primary allegations.\n\nMoreover, in the episode of B-alert News, Bishop Leon Benjamin and guest General Flynn also speak about the notion of vaccine mandates being unconstitutional. They discuss, in particular, how the vaccine mandates are sweeping the issue of election fraud under the rug.\n\nRight after the elections, former President Trump offered a new explanation for his claims of voter fraud, saying that his political opponents used COVID to change the outcome of the presidential elections.\n\nThe former president has made frequent claims of widespread voter fraud despite federal and state election officials, assuring him that the votes were secure. He noted that the pandemic allowed his competitors the opportunity to cheat.\n\n“They used COVID in order to cheat. They used COVID in order to rig the election and in order to steal the election. They used COVID. That’s as simple as it gets,” he said. (Related: SHAFFER: Here’s the evidence of widespread election fraud.)\n\nBenjamin and Flynn also speak about how the lockdowns and mandates are restricting people’s rights; however, it is interesting to note that of all the vaccination mandates that the current administration is coming up with, among the exemption include U.S. postal service, which handles parcels on a daily basis.\n\nThe USPS is not subject to Biden’s previous mandate for the federal workforce to either be vaccinated or receive regular tests, so the mailing agency would start from scratch in implementing its testing infrastructure. Moreover, the USPS does not even know who among its workforce, spread across 34,000 facilities, are already vaccinated.\n\nThe American Postal Workers Union (APWU), which represents over 200,000 USPS employees, previously denounced vaccine mandates and said issues related to inoculations or testing must be negotiated with them. “Maintaining the health and safety of our members is of paramount importance. While the APWU leadership continues to encourage postal workers to voluntarily get vaccinated, it is not the role of the federal government to mandate vaccinations for the employees we represent.”\n\nCatch more of Bishop Leon Benjamin’s commentaries at B-alert News, Mondays at 10 a.m. on Brighteon.TV.\n\nRead more news and updates on VoteFraud.news.", "opengraph": {"title": "Leon Benjamin and Gen. Flynn: Election fraud, COVID-19 vaccination exemptions, and more – Brighteon TV", "type": "article", "url": "https://www.votefraud.news/2021-09-16-election-fraud-covid19-vaccination-exemptions.html", "site_name": "Vote Fraud News", "description": "In the most recent episode of B-alert News, Bishop Leon Benjamin and guest General Flynn talk about election fraud and how COVID-19 helped bury the issue. In recent reports, several people hired to lead a controversial audit of Arizona’s 2020 election results were found to have contracted COVID-19, delaying a widely panned ballot review process. […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2021/09/2013-11-08-Election_MG_3455-300x200.jpg"}, "tags": ["2020 elections", "conspiracy", "Joe Biden", "covid-19", "elections", "voter fraud", "vaccinations", "mandates", "Donald Trump", "rigged", "politics", "deception", "election fraud", "lies", "USPS"], "tweets": [], "movies": [], "links": ["https://mediamarg.com/world/arizona-delays-bizarre-gop-election-audit-because-leader-is-quite-sick-with-covid", "https://news.yahoo.com/trump-says-opponents-used-covid-020500671.html", "https://www.naturalnews.com/2020-12-11-shaffer-heres-evidence-of-widespread-election-fraud.html", "https://www.govexec.com/workforce/2021/09/postal-service-takes-wait-and-see-approach-covid-19-vaccine-mandates/185277/", "http://Brighteon.TV", "https://votefraud.news", "https://mediamarg.com/world/arizona-delays-bizarre-gop-election-audit-because-leader-is-quite-sick-with-covid", "https://news.yahoo.com/trump-says-opponents-used-covid-020500671.html", "https://www.govexec.com/workforce/2021/09/postal-service-takes-wait-and-see-approach-covid-19-vaccine-mandates/185277/"], "authors": [], "publish_date": null}