{"result_id": "335043", "URL": "https://votefraud.news/2022-11-15-wayne-root-democrats-just-stole-another-election.html", "timestamp": "2023-04-25 17:56:08 CEST+0200", "meta": {"description": "When something is so obvious, if the outcome makes no sense, if the outcome is literally impossible, then it is what it is. Forget “proof.” You know it. You saw it. You felt it. You experienced it. It happened. It’s real. (Article by Wayne Allyn Root republished from TheGatewayPundit.com) The 2022 midterm was just stolen. […]", "lang": "en", "keywords": "big government,brainwashed,Cheating,conspiracy,corruption,deception,democrats,fake polls,faked,gaslighting,lies,mainstream media,Midterm elections,news cartels,politics,propaganda,Republicans,rigged,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2022-11-15-wayne-root-democrats-just-stole-another-election.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "WAYNE ROOT: You’ve been gaslighted – Democrats just stole another election", "cleaned_text": "WAYNE ROOT: You’ve been gaslighted – Democrats just stole another election\n\nWhen something is so obvious, if the outcome makes no sense, if the outcome is literally impossible, then it is what it is. Forget “proof.” You know it. You saw it. You felt it. You experienced it. It happened. It’s real.\n\nThe 2022 midterm was just stolen. Just like 2020.\n\nIf you disagree, you’re either delusional, or terribly naïve, or brain dead. Or you’re in on the fix.\n\nIt’s time to admit we’re all part of a massive experiment in fraud, theft, brainwashing, and gaslighting to a degree never seen in world history.\n\nThink of all the times in just the past few years you’ve been gaslighted. They lied to you about open borders…they lied about Hillary’s 30,000 deleted emails…they lied about spying on Trump…they lied about Russian Collusion…they lied about a perfectly fine Ukrainian phone call…they lied about massive Biden corruption in Ukraine and China… they lied about the Hunter Biden laptop they lied about the origins of Covid…they lied about the need for lockdowns and masks…they lied about the need for Covid vaccines…they lied about the vaccines being “safe and effective”…they lied and covered up all the deaths and injuries from the vaccine…they lied about the success of miracle drugs Hydroxychloroquine and Ivermectin…they lied about the stolen 2020 election…\n\nYou’ve been the victims of nonstop severe gaslighting for a decade now. You’re all part of a human psychology experiment in the limits that government and media can go in propaganda and brainwashing…while you can see they’re lying right in front of your eyes.\n\nAnd these are the exact same people now telling you Democrats just over-performed, and stopped a GOP red landslide, against all odds, without cheating and stealing the midterm election.\n\nHistorically, every president in history facing his first midterm experiences a tough day with automatically 20 to 30 House seats lost…and 4 or more Senate seats lost…but this terribly unpopular President Biden is brain dead with severe dementia, and can’t put 3 coherent sentences together…Yet Biden defied history?\n\nWhile also facing the worst economy in modern history…and the worst inflation in America’s history…and out of control crime…and open borders…and failing schools…and polls showing 75% of Americans believe the country is going in the wrong direction…Yet Biden beat all of that?\n\nIf you believe Democrats made a miracle happen, without cheating, rigging and stealing…I have a bridge to sell you, over the Atlantic Ocean, in the Vegas desert.\n\nFirst, every poll in the country showed a gigantic GOP landslide victory- ranging from red wave, to red tsunami. Polls even showed women moved 32 points from September to October in favor of the GOP.\n\nBut in the end they all moved back to Biden and Democrats? Does that make sense to you?\n\nSecond, every poll in the country showed the top two issues, by a mile, were inflation and the economy. And crime was in second place, along with open borders.\n\nAnd they all voted for Biden and the Democrats? Does that make sense to you?\n\nCNN’s own exit polls showed the GOP made massive gains among almost every voting group- men, women, white men, white women, blacks, Hispanics, young people. Everyone.\n\nAnd they all voted for Biden and the Democrats? Does that make sense to you?\n\nIn this environment where Americans can’t afford gas…or groceries…or rent…with the economy failing…inflation raging…scared to death of losing their jobs…living in cities plagued by violent crime, mass shoplifting, homeless everywhere, streets lined with poop, pee, drug needles…and failing schools intent on teaching your children to become masked transgenders…\n\nIn this environment, they all voted for Biden and the Democrats? Does that make sense to you?\n\nThat they looked around at the disaster one man has created in only two years, and they defied a century of historic midterm defeats for the party in power…and voted for Democrats? Folks, you’ve been gaslighted.\n\nBut the real proof the midterm was rigged and stolen is…FLORIDA.\n\nIn Florida the GOP won a landslide. DeSantis and Rubio and everyone else in the Florida GOP won in a red tsunami. The same one the polls showed was happening in the entire country.\n\nGuess what Florida has? Florida has strict Voter ID, strict laws against voter fraud, severe prison terms for anyone caught trying to commit voter fraud, no mail-in ballots sent to every voter, no ballot drop boxes, no ballot harvesting, no ballots accepted for days after Election Day, no counting for days until the desired result is achieved by the Democrat Party.\n\nIsn’t it a funny and strange coincidence that in that state, with all of those strict rules against cheating, the GOP red tsunami happened as predicted? But everywhere else, where there are no strict laws against voter fraud, and they allow all that cheating, the red tsunami fizzled.\n\nAnd that under-performance is being blamed on Trump? And on conservative MAGA candidates?\n\nYet in Florida, Governor Ron DeSantis is the most Trump-like, MAGA, America First, anti-woke, anti-trannie, in-your-face, ultra conservative politician in all of America. And with that ultra MAGA message, plus strict voting fraud laws…the GOP swept to a landslide victory.\n\nAnd in most other places, they didn’t. Coincidence?\n\nFolks, we’ve been robbed. Again. This was a repeat of 2020. They’ve fixed, rigged and stolen the election. First, they robbed us of the Presidency. Now they’ve robbed us of a red Republican landslide. And now they’re trying to blame it on Trump.\n\nThis is gaslighting. And we’ve had our election stolen- again.", "opengraph": {"title": "WAYNE ROOT: You’ve been gaslighted – Democrats just stole another election", "type": "article", "url": "https://www.votefraud.news/2022-11-15-wayne-root-democrats-just-stole-another-election.html", "site_name": "Vote Fraud News", "description": "When something is so obvious, if the outcome makes no sense, if the outcome is literally impossible, then it is what it is. Forget “proof.” You know it. You saw it. You felt it. You experienced it. It happened. It’s real. (Article by Wayne Allyn Root republished from TheGatewayPundit.com) The 2022 midterm was just stolen. […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2022/11/Election-Ballots-Count-Worker.jpg"}, "tags": ["conspiracy", "big government", "fake polls", "faked", "vote fraud", "deception", "Cheating", "lies", "news cartels", "corruption", "Republicans", "brainwashed", "propaganda", "mainstream media", "politics", "rigged", "Midterm elections", "democrats", "gaslighting"], "tweets": [], "movies": [], "links": ["https://www.thegatewaypundit.com/2022/11/wayne-root-gaslighted-democrats-just-stole-another-election/", "https://www.thegatewaypundit.com/2022/11/wayne-root-gaslighted-democrats-just-stole-another-election/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2022-11-15-wayne-root-democrats-just-stole-another-election.html&linkname=WAYNE%20ROOT%3A%20You%E2%80%99ve%20been%20gaslighted%20%E2%80%93%20Democrats%20just%20stole%20another%20election", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}