{"result_id": "335039", "URL": "https://votefraud.news/2020-11-12-what-we-learned-from-dominion-voting-system.html", "timestamp": "2023-04-25 17:56:05 CEST+0200", "meta": {"description": "1. Votes can theoretically be ignored for individuals if a straight ticket vote is selected. This setting could very welI enable “Repubiican”-style typo fraud. Many complex rules decide how the “straight ticket” option works. (Article by Ron republished from ThreadReaderApp.com) 2. Network Security is very weak since all software access keys use the same cryptographic […]", "lang": "en", "keywords": "cyber war,Dominion Voting System,election fraud,elections,fraud,Glitch,hacked,information technology,Joe Biden,President Trump,security,vote fraud,voter fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://votefraud.news/2020-11-12-what-we-learned-from-dominion-voting-system.html", "encoding": "UTF-8"}, "image": null, "domain": "votefraud.news", "title": "What we have learned so far from reading the Dominion Voting System manual", "cleaned_text": "What we have learned so far from reading the Dominion Voting System manual\n\n1. Votes can theoretically be ignored for individuals if a straight ticket vote is selected. This setting could very welI enable “Repubiican”-style typo fraud. Many complex rules decide how the “straight ticket” option works.\n\n2. Network Security is very weak since all software access keys use the same cryptographic pair. This gives plausible deniability to whoever potentially decides to mess around with voting settings. It cant be proven who changed a setting since everybody has the same key\n\n3. Digital certificates are not protected by password, and Dominion user manual explicitly says not to enter a password. This enables potential for bad actors to MITM attack data traveling over network between precinct tabulator and central tabulator.\n\n 4. Cryptic “split rotation” function that features the ability to “force a maximum deviation”. There is no definition of a “split rotation”, so we cannot know what “force a maximum deviation” means in this instance.\n\n5. Local IT guys have ultimate power to clandestinely change settings, thus having the ability to potentially alter an entire election. There are no checks and balances or observers of the local IT guy when he accesses machine debug and admin settings. Its unclear if logs exist.\n\n6. Dominion is a black box with votes ultimately tabulated in a central server system. Who has access to the central server and where is the manual and security reviews of that server software?\n\n7. Settings could theoretically have been changed during evening downtime on first night of voting. Much easier to change settings on hundreds of machines than to forge thousands of ballots. A couple of people could have done it quickly.\n\n8. State of Pennsylvania requested semantic changes to the Dominion voting software, possibly to aid in their lawfare efforts. The word “Cast” became “Print”, obfuscating the moment when your vote becomes officially cast. For what reason is currently unknown.\n\n9. There is an option to force the vote scanner to “overrun” a preset amount of ballots EVERY time anybody pauses the scan mid-batch. “Overrun” is undefined. Potential for abuse is high with this function, which was added shortly after 2018 mid-term elections.\n\nMore to come later.\n\n Many people have sent me (completely publicly available) Dominion security audits, documents, manuals, and state contracts. Have a lot of reading to do.\n\nIf there are any potential election fraud settings hiding in plain sight, I will do my best to find it.", "opengraph": {"title": "What we have learned so far from reading the Dominion Voting System manual", "type": "article", "url": "https://www.votefraud.news/2020-11-12-what-we-learned-from-dominion-voting-system.html", "site_name": "Vote Fraud News", "description": "1. Votes can theoretically be ignored for individuals if a straight ticket vote is selected. This setting could very welI enable “Repubiican”-style typo fraud. Many complex rules decide how the “straight ticket” option works. (Article by Ron republished from ThreadReaderApp.com) 2. Network Security is very weak since all software access keys use the same cryptographic […]", "image": "https://www.votefraud.news/wp-content/uploads/sites/177/2020/11/Voter-In-Person-Ballot-Station.jpg"}, "tags": ["Joe Biden", "cyber war", "vote fraud", "elections", "fraud", "voter fraud", "information technology", "hacked", "security", "election fraud", "Dominion Voting System", "President Trump", "Glitch"], "tweets": [], "movies": [], "links": ["https://threadreaderapp.com/thread/1326715838850764802", "https://threadreaderapp.com/thread/1326715838850764802", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fvotefraudnews%2F2020-11-12-what-we-learned-from-dominion-voting-system.html&linkname=What%20we%20have%20learned%20so%20far%20from%20reading%20the%20Dominion%20Voting%20System%20manual", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}