{"result_id": "336013", "URL": "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/", "timestamp": "2023-04-25 17:58:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "Most Published Studies Exaggerated the Effects of Ocean Acidification – and Covid, Etc.", "cleaned_text": "The concept of ocean acidification, and human-caused global warming more generally, could be described as containing a grain of truth embedded in a mountain of nonsense. Indeed, the projected large increase in atmospheric CO2 will at most cause a small reduction in pH – it will not turn the ocean acidic. Yet this is what is implied by the term ocean acidification. True acidification would require average pH to be reduced below 7.0, at which point seashells would indeed begin to dissolve. This is an impossible scenario, however, because of the ocean’s effectively limitless buffering capacity.\n\nThere is a newly published study by Jeff Clements and team that concludes many of the published studies on ocean acidification, especially those studies published in high impact journals and accompanied by sensational media reporting, have turned-out to be wrong, or at least exaggerated.\n\nThis problem with exaggeration of threats applies to many areas of science and has a name: The Decline Effect. The Decline Effect goes like this: an early report, usually attracting huge media interest, predicts some sort of catastrophe. But when follow up work is done, usually with far better experimental procedure and far greater numbers of samples, the original report turns out to be wrong. Jeff Clements’ team included Timothy Clark, Josefin Sundin and Frederik Jutfelt who were involved in a study last year proving that numerous reports by James Cook University’s coral reef centres on reef fish was totally wrong.\n\nI co-authored a book chapter with John Abbot some years ago that explained:\n\nInitial concerns about ocean acidification focused on organisms that construct their shells or skeletons from calcium carbonate. Such organisms are referred to as marine calcifiers and include not only corals, but also crabs, clams and conchs (sea snails).\n\nTheoretically, and according to popular science magazines, all corals are already severely and negatively affected by ocean acidification. But this is not evident from methodologically sound studies undertaken at the Great Barrier Reef. A review of the growth rates of six, hard coral species at Lord Howe Island (Anderson et al. 2015) found marked variation in the growth rates of branching coral, while growth rates of the massive Porites coral were unchanged. The researchers suggested that a decline in the growth rates of the branching species could be attributable to a reduction in the calcium carbonate saturation state as a consequence of higher summer temperatures. A study measuring calcification rates for 41 long-lived Porites corals from seven reefs from the central Great Barrier Reef (D’Olivio et al. 2009), showed good recovery from the major 1998 bleaching event, with no significant trend in calcification rates for the inner reefs. Corals from the mid-shelf central Great Barrier Reef, however, did show a decline of 3.3%.\n\nWhile most ocean acidification research has been focused on physiological processes, in particular calcification, there have also been studies on three common hard corals to look at their fertilisation, embryonic development, larval survivorship, and metamorphosis (Chua et al. 2013a; Chua et al. 2013b). These studies have found the early life-history stages were unaffected by reduced pH; there was no consistent effect of elevated CO2 alone, nor in combination with temperature.\n\nStudies of the effect of very high CO2 levels (up to 2,850 ppm) on molluscs – including oysters, clams, scallops and conchs – have shown that these species will generally build their shells more slowly as CO2 levels increase (Ries et al. 2009). This same study showed that crabs and lobsters respond quite differently to the same elevated CO2 levels, showing a general increase in calcification rates.\n\nThe varied responses among different organisms reflect their differing abilities to regulate pH at the site of calcification, and:\n• the extent to which their outer shell layer is protected by an organic covering\n• the solubility of their shell, or skeletal mineral\n• the extent to which they use photosynthesis (Ries et al. 2009).\n\nOf course, many marine organisms are not calcifiers, and some of these organisms have also been tested for a response to ocean acidification.\n\nWhen seagrasses collected from three locations in the Great Barrier Reef region – Cockle Bay, Magnetic Island, and Green Island – were exposed to four different CO2 concentration levels for two weeks – with water temperature and salinity in the experimental tanks near-constant throughout – all three seagrass species exhibited enhanced photosynthetic responses (Ow et al. 2015). That is growth rates, observed after two weeks of exposure to an enriched CO2 environment in an indoor aquarium, were higher. This suggests that ocean acidification could mean more seagrass, which would be good for large marine mammals like dugongs (dugongs are vulnerable to extinction because of issues unrelated to changing ocean chemistry).\n\nAlso, contrary to expectations, laboratory investigations into the effects of three different CO2 treatments on anemonefish (commonly known as the clownfish) found that higher CO2 levels stimulated breeding activity (Miller et al. 2013). The breeding pairs from the fringing reefs of Orpheus Island on the Great Barrier Reef, where they are exposed to the highest CO2 levels, produced double the number of clutches per breeding pair, and 67% more eggs per clutch than the control. However, young anemonefish that were bred in high CO2 levels and high temperatures showed decreases in their length, weight, condition, and survival (Miller et al. 2012). Though these effects were absent or reversed when their parents also experienced the higher concentrations (Miller et al. 2013).\n\nMost studies have been on single species in contrived laboratory conditions. They have been of short duration, and they have not considered the potential for adaptation. In the few instances where adaptation has been considered, it has been shown to significantly modify the impact of varying pH as a consequence of elevated levels of CO2. All of this needs to be assessed against the reality that along the length and breadth of the Great Barrier Reef there are naturally occurring large daily fluctuations in pH, and that it is unclear as to what extent the current trends of apparent pH decline are part of existing natural cycles. Most of the articles describe the effects of changes of pH on biological organisms; many of the claims are based exclusively on laboratory experiments (Riebesell & Gattuso 2015). However, a problem with laboratory experiments is that they cannot capture the complexities of the real world, not even the tremendous natural variability in ocean pH – which is a measure of ocean acidification.\n\nStatistician John P.A. Ioannidis published a review of medical research back in 2005 entitled ‘Why most published research findings are false’ (Plos Medicine, https://doi.org/10.1371/journal.pmed.0020124 ). It included comment that:\n\nThe review by John Ioannidis is a devastating critic of the sad state of biomedical research. It is this same profession, biomedical research, that concluded we should fear Covid-19 and get vaccinated – with the results from the Pfizer trials withheld while emergency approvals were granted for the mass vaccination of citizens across the world against Covid-19.\n\nWe will no doubt have better insights, when studies like those by Jeff Clements into ocean acidification, are undertaken into the recent Covid-19 vaccine research. We may then be in a position to judge whether the apparent ineffectiveness of these particular Covid-19 vaccines, despite all the promises, can be best explained by corporate greed and mendacity, or simply flaws in the scientific method. Certainly there was pressure on medical researchers to find a quick cure, that could be administered as part of a global public health response, to what appeared in the beginning to be a deadly new virus much worse than the seasonal flu.\n\nThe British Medical Journal in an editorial dated 19thJanuary includes commentary that we don’t know enough about Covid-19 vaccines.\n\n‘Today, despite the global rollout of Covid-19 vaccines and treatments, the anonymised participant-level data underlying the trials for these new products remain inaccessible to doctors, researchers, and the public—and are likely to remain that way for years to come,’ the editorial states. ‘This is morally indefensible for all trials, but especially for those involving major public health interventions.’\n\nThe editorial also accuses pharmaceutical companies of ‘reaping vast profits without adequate independent scrutiny of their scientific claims,’ pointing to Pfizer, whose Covid vaccine trial was ‘funded by the company and designed, run, analysed, and authored by Pfizer employees’.\n\nOf course, Peter Ridd lost his job at James Cook University for speaking truth to power. Those who continue to publish studies on ocean acidification, especially those studies published in high impact journals and accompanied by sensational media reporting, have most recently been rewarded by the Australian government with an additional $1billion in funding. Some of this money will end-up funding more nonsense ocean acidification projects at James Cook University. It is unlikely that any of this grant money will be used to ensure that there is some quality assurance of the same research.\n\nThe feature image, at the very top of this blog post, shows me getting back onto a small boat off Noosa following a free diving session.\n\nScientists once decreed that free divers – men and women who train to dive as deep as they possibly can into the ocean on a single breathe of air – would not be able to dive beyond a depth of about 30 metres. According to these experts there was not only the issue of how long a diver could reasonably hold their breath, but more importantly the effects of pressure on the lungs. Dive to just 10 meters deep and the pressure is doubled relative to sea level – because water is much denser than air, it exerts a much greater compressive force on your body. So how much pressure will be exerted at 131 metres?\n\nThe free divers defied the science. Just a few years ago Russian Alexey Molchanov broke the record for free diving when he dove to a depth of 131 meters on a single breath of air.\n\nScientists often get things wrong when they fail to consider the complexity of the real world, and real people.\n\nFree diving relies on a series of involuntary physiological changes that take place in the body. The mammalian dive response causes a reduction in the heart rate, the narrowing of blood vessels, and the shunting of blood from the extremities into the vital organs and chest resulting in a higher percentage of blood volume in the lungs. This is how fit young men and women manage to dive beyond 40 metres, even beyond 100 metres, on a single breathe without their lungs being crushed.", "opengraph": {"type": "article", "title": "Most Published Studies Exaggerated the Effects of Ocean Acidification – and Covid, Etc.", "url": "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/", "description": "However, a problem with laboratory experiments is that they cannot capture the complexities of the real world, not even the tremendous natural variability in ocean pH – which is a measure of ocean …", "article:published_time": "2022-02-20T06:00:00+00:00", "article:modified_time": "2022-02-20T00:48:12+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2022/02/IMG_1034.jpg?fit=1024%2C512&ssl=1", "image:width": "1024", "image:height": "512", "locale": "en_US"}, "tags": ["Ocean acidification", "Decline Effect"], "tweets": [], "movies": [], "links": ["https://jennifermarohasy.com/2022/02/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/", "https://jennifermarohasy.com/author/jennifer/", "https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3001511", "https://ipa.org.au/ipa-today/ocean-acidification-not-yet-a-catastrophe-for-the-great-barrier-reef", "https://doi.org/10.1371/journal.pmed.0020124", "https://www.nytimes.com/2020/11/26/sports/freediving-womens-world-record.html", "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/#print", "mailto:?subject=%5BShared%20Post%5D%20Most%20Published%20Studies%20Exaggerated%20the%20Effects%20of%20Ocean%20Acidification%20%E2%80%93%20and%20Covid%2C%20Etc.&body=https%3A%2F%2Fwattsupwiththat.com%2F2022%2F02%2F19%2Fmost-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc%2F&share=email", "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/?share=facebook", "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/?share=twitter", "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/?share=custom-1637629091", "https://wattsupwiththat.com/2022/02/19/most-published-studies-exaggerated-the-effects-of-ocean-acidification-and-covid-etc/?share=telegram"], "authors": [], "publish_date": "2022-02-20T06:00:00+00:00"}