{"result_id": "336027", "URL": "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/", "timestamp": "2023-04-25 18:01:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "John Cook, Lewandowsky Claim Psychological Vaccine Against Climate Wrongthink", "cleaned_text": "Cartoonist John Cook has attempted to employ his personal expertise on strange aberrations to help our old friend Stephan Lewandowsky create a psychological “vaccine”, to reduce the influence of climate skeptics.\n\n“Inoculating” people against misinformation may give scientific facts a shot at survival. In the battle between facts and fake news, facts are at a disadvantage. Researchers have found that facts alone rarely dislodge misperceptions, and in some cases even strengthen mistaken beliefs. But two recent, preliminary studies suggest there’s hope for the facts about climate change. Borrowing from the medical lexicon, these studies show that it may be possible to metaphorically “inoculate” people against misinformation about climate change, and by doing so give the facts a boost. What’s more, these researchers suggest, strategic inoculation could create a level of “herd immunity” and undercut the overall effects of fake news. John Cook, a cognitive scientist at the Center for Climate Change Communication at George Mason University in Virginia, recently tested the strength of inoculation messages against the notorious Oregon Petition, which uses fake experts to cast doubt on the scientific consensus on climate change. In the journal PLOS One, Cook and his colleagues reported that when about 100 study participants were presented with the misinformation alone, their views did further polarize along political lines. But when another group of participants were first warned about a general strategy used in misinformation campaigns — in this case, they were told that fake experts had often been used by the tobacco industry to question the scientific consensus about the effects of tobacco on health, and were shown an ad with the text “20,679 physicians say ‘Luckies are less irritating’” — the polarizing effect of the misinformation was completely neutralized. “Nobody likes to be misled, no matter their politics,” says Cook. He suggests that inoculation messages may serve to put listeners on alert for trickery, making them more likely to scrutinize the information they receive.\n\nThe abstract of John Cook and Stephan Lewandowsky’s study;\n\nMisinformation can undermine a well-functioning democracy. For example, public misconceptions about climate change can lead to lowered acceptance of the reality of climate change and lowered support for mitigation policies. This study experimentally explored the impact of misinformation about climate change and tested several pre-emptive interventions designed to reduce the influence of misinformation. We found that false-balance media coverage (giving contrarian views equal voice with climate scientists) lowered perceived consensus overall, although the effect was greater among free-market supporters. Likewise, misinformation that confuses people about the level of scientific agreement regarding anthropogenic global warming (AGW) had a polarizing effect, with free-market supporters reducing their acceptance of AGW and those with low free-market support increasing their acceptance of AGW. However, we found that inoculating messages that (1) explain the flawed argumentation technique used in the misinformation or that (2) highlight the scientific consensus on climate change were effective in neutralizing those adverse effects of misinformation. We recommend that climate communication messages should take into account ways in which scientific content can be distorted, and include pre-emptive inoculation messages.\n\nThe climate wrongthink psychological vaccine idea has been kicking around for a while.\n\nJohn Cook’s attack on the Oregon Petition is amusing. Back in 2012, PBS News embarrassed themselves trying to attack the reputation of the signatories to the Oregon Petition, when they pulled out a signature at random and displayed it on air. At the last moment someone in post-production realised the signature was that of Edward Teller, one of the giants of 20th Century Physics. PBS then compounded their embarrassment by allegedly trying to conceal their mistake – somehow the image of Edward Teller’s signature was blurred.\n\nI’m sure some fakes have slipped through the process of vetting 30,000+ signatures, but there is no doubt many of the signatories to the Oregon Petition have serious scientific reputations.", "opengraph": {"type": "article", "title": "John Cook, Lewandowsky Claim Psychological Vaccine Against Climate Wrongthink", "url": "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/", "description": "Guest essay by Eric Worrall Cartoonist John Cook has attempted to employ his personal expertise on strange aberrations to help our old friend Stephan Lewandowsky create a psychological “vacci…", "article:published_time": "2017-06-01T03:36:01+00:00", "article:modified_time": "2017-06-01T03:36:01+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2017/05/herr_john_cook_head.jpg?fit=658%2C668&ssl=1", "image:width": "658", "image:height": "668", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://wattsupwiththat.files.wordpress.com/2017/05/herr_john_cook_head.jpg", "https://wattsupwiththat.com/2013/08/06/skeptcial-science-takes-creepy-to-a-whole-new-level/", "https://wattsupwiththat.com/2013/04/28/stephan-lewandowsky-flees-australia-in-wake-of-investigations/", "http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0175799", "https://en.wikipedia.org/wiki/Oregon_Petition", "https://www.vox.com/science-and-health/2017/5/31/15713838/inoculation-climate-change-denial", "http://journals.plos.org/plosone/article?id=10.1371/journal.pone.0175799", "https://wattsupwiththat.com/2017/01/23/study-presenting-deliberately-weakened-skeptic-arguments-increases-climate-acceptance/", "http://www.petitionproject.org", "https://en.wikipedia.org/wiki/Edward_Teller", "https://wattsupwiththat.com/2012/10/25/why-did-pbs-frontline-electronically-alter-the-signature-of-one-of-the-worlds-most-distinguished-physicists-in-their-report-climate-of-doubt/", "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/#print", "mailto:?subject=%5BShared%20Post%5D%20John%20Cook%2C%20Lewandowsky%20Claim%20Psychological%20Vaccine%20Against%20Climate%20Wrongthink&body=https%3A%2F%2Fwattsupwiththat.com%2F2017%2F05%2F31%2Fjohn-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink%2F&share=email", "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/?share=facebook", "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/?share=twitter", "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/?share=custom-1637629091", "https://wattsupwiththat.com/2017/05/31/john-cook-lewandowsky-claims-psychological-vaccine-against-climate-wrongthink/?share=telegram"], "authors": [], "publish_date": "2017-06-01T03:36:01+00:00"}