{"result_id": "336004", "URL": "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/?utm_source=dlvr.it&utm_medium=facebook", "timestamp": "2023-04-25 17:56:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "We Will Have Vaccines Soon—Because of Science, Not Politics", "cleaned_text": "It was one week after the terrorist attacks on 9/11 when envelopes containing a white powder began showing up at random locations in four states; among them, a newspaper office in Florida, the Washington D.C. office of then-Senate Majority Leader Tom Daschle, NBC News and the New York Post. The white powder turned out to be anthrax spores, engineered to be readily dispersed and inhaled – a potentially deadly bioterrorism weapon.\n\nAnthrax infections are treated with antibiotics. There are two that are most effective; ciprofloxacin and doxycycline. At that time, I was the CEO of a small pharmaceutical company that represented foreign API manufacturers in the US. We had a large, domestic customer base to which we marketed dozens of anti-infective agents, including antibiotics. Doxycycline was one of them.\n\nWe had been working with Zenith Laboratories, a generic pharmaceutical manufacturer in South Florida (currently a part of Teva Pharmaceuticals) to approve our doxycycline for use in its formulations. Normally, the turn-around time for the FDA to approve a drug, even a generic copy of an existing drug (which doxycycline was), is well over a year and often two.\n\nBut this was different. The US was facing a crisis in the form of a potential bioterrorism attack. The federal government’s response to anthrax quickly became a national emergency. Zenith Laboratories, along with other manufacturers, was awarded a contract to supply tablets and capsules to the Department of Defense’s Strategic National Stockpile. In less than one month, the Food and Drug Administration granted an emergency use authorization and overnight, we became approved suppliers of doxycycline.\n\nFortunately, anthrax never became the bioterrorism threat many had feared. Five people died as a result of coming into contact with envelopes contaminated with the spores that had been delivered through the postal system.\n\nOur government’s coordinated response in 2001 to apply pressure to drug manufacturers and its own Food and Drug Administration to expedite approval of a life-saving treatment for a bioterrorism weapon bears an eerie similarity to the national health crisis in which we find ourselves.\n\nAny drug, be it an antibiotic, a monoclonal antibody cocktail or a vaccine goes through a rigorous, scientific process long before ever falling into the hands of government regulators, let alone politicians. Drug development begins with a conceptual design model followed by research, engineering, small scale manufacturing and several phases of testing; usually first in animals and then humans. Failures are common along every step of this process. By some estimates over 90 percent of drugs never make it to market. Safety and efficacy must be demonstrated by the manufacturer before the FDA will approve any drug’s use in the general public.\n\nWhat is currently known about the two leading candidates’ mRNA vaccines—Pfizer and Moderna Inc.—is that they are showing safety and efficacy in late stages of phase 3 clinical trials.\n\nParticipants like me have received the first and second booster injections and have provided blood samples to researchers. It is no stretch to believe we will have coronavirus vaccines approved under the FDA’s emergency authorization use as early as next month for distribution to, at the very least, healthcare workers and those most at risk of severe morbidity.\n\nThis is not politics but, in fact, the result of science – lots of science – and shame on those politicians who continue to make this an issue of anything but.\n\nGregory J. Rummo is a Lecturer of Chemistry at Palm Beach Atlantic University and a Contributing Writer for The Cornwall Alliance for the Stewardship of Creation. He is the former CEO of New Chemic US Inc and patient 001 in Moderna’s mRNA-1273 Phase 3 trial currently being conducted at the Palm Beach Research Center in West Palm Beach, FL. The views expressed in his columns are his own.", "opengraph": {"type": "article", "title": "We Will Have Vaccines Soon—Because of Science, Not Politics", "url": "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/", "description": "Any drug, be it an antibiotic, a monoclonal antibody cocktail or a vaccine goes through a rigorous, scientific process long before ever falling into the hands of government regulators, let alone po…", "article:published_time": "2020-10-22T13:00:34+00:00", "article:modified_time": "2020-10-22T02:16:00+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2020/10/35884897_m.jpg?fit=940%2C600&ssl=1", "image:width": "940", "image:height": "600", "locale": "en_US"}, "tags": ["Coronavirus", "Coronavirus Vaccine"], "tweets": [], "movies": [], "links": ["http://www.cornwallalliance.org/", "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/#print", "mailto:?subject=%5BShared%20Post%5D%20We%20Will%20Have%20Vaccines%20Soon%E2%80%94Because%20of%20Science%2C%20Not%20Politics&body=https%3A%2F%2Fwattsupwiththat.com%2F2020%2F10%2F22%2Fwe-will-have-vaccines-soon-because-of-science-not-politics%2F&share=email", "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/?share=facebook", "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/?share=twitter", "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/?share=custom-1637629091", "https://wattsupwiththat.com/2020/10/22/we-will-have-vaccines-soon-because-of-science-not-politics/?share=telegram"], "authors": [], "publish_date": "2020-10-22T13:00:34+00:00"}