{"result_id": "336019", "URL": "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/", "timestamp": "2023-04-25 18:00:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "Covid Passports – Malfunctions, Discrimination and Police Abuse of Process", "cleaned_text": "Store Security – Your Papers Please? As Britain green lights stores and bars insisting on proof of vaccination, its worth considering where potentially telling the government our every move might lead.\n\nVaccine passports: How can I prove I’ve had both my Covid jabs? People in England with both Covid jabs won’t have to self-isolate if a close contact tests positive for Covid after 16 August, Health Secretary Sajid Javid has said. Announcing the changes, he said there would also be details this week on how to “remove the need for fully-vaccinated arrivals to isolate when they return from an amber list country”. So, how do you prove you’ve had both jabs? People in England can do this by requesting an NHS Covid Pass via the NHS website or the NHS app. This is different to the NHS Covid-19 app, which is used for contact tracing. You must be registered with a GP surgery to use the NHS app. Once logged in you can request an NHS Covid Pass. The system generates a QR code, which lasts for 28 days. You can download a PDF copy or have it emailed to you. Will I need to prove I’ve been vaccinated to go to the pub or attend sporting events? The government’s Events Research Programme piloted different ways to run large events safely, including concerts, nightclubs and sporting fixtures. These events were exempt from the wider coronavirus regulations such as the rule of six. As part of the scheme, spectators attending Euro 2020 matches at Wembley Stadium are being asked to show their NHS Covid Pass or provide a negative lateral flow test result. However, when setting out its plans for England’s move to stage four of the roadmap out of lockdown, the government said people will not have to prove their vaccination status in law “as a condition of entry for visitors to any setting”. It said organisations are already able to ask visitors for proof of their vaccination status if they wish – as long as they do not breach existing equality laws – and will be able to continue doing so.\n\nIn Australia police have already been accused of abusing the Covid checkin process, with warrentless trawling of the checkin database to gather information about persons of interest. This has led to a noticeable drop in interest, in complying with a requirement to use the app to register when entering premises.\n\nQueensland Police Service tightens internal protocols on COVID Check In app access after officers perform ‘lawful’ data search The Queensland Police Service (QPS) obtained a “lawfully issued search warrant” to access data from the Check In Queensland COVID-19 app.\n• Officers are now advised not to access the app “except in extraordinary circumstances”\n• Privacy Commissioner Phillip Green says he can see why the public would have concerns about police access to the app\n• The state government is considering legal changes to ensure public confidence in the COVID app The data was accessed as part of an investigation into the theft of a police firearm and taser at the Miriam Vale Hotel in the Gladstone region in central Queensland. “The firearm was subsequently located on June 10 after a more detailed search of the hotel premises. The taser is yet to be located and investigations are ongoing,” a QPS spokesperson said. “The data was accessed in relation to a group of people reported to be acting suspiciously in the area around the time of this incident.” The spokesperson said while the data access was lawful, QPS had reviewed its policy and strengthened it to “ensure public confidence” in the data’s security.\n\nMIT Technology Review reports the system they tried has some bugs.\n\nWe tried out the first statewide vaccine passport When we tested New York’s Excelsior Pass, we found privacy concerns, technical glitches, and questions over who it’s really for.by On June 20, about 20,000 fans gathered at Madison Square Garden in New York City for a Foo Fighters concert. The venue was at full capacity for the first time since the start of the pandemic, but it wasn’t a full return to normalcy: To get in, ticket holders needed to show proof that they’d been vaccinated—in the form of either a paper card or the state’s Excelsior Pass, a much-debated smartphone app that launched earlier this year. The pass now has about 2 million downloads, which represents just 10% of fully vaccinated New Yorkers. Implementation has been rocky—marked by persistent glitches, privacy concerns, and outrage over the state government’s failure to prioritize the material needs of working-classcommunities of color—and businesses that require vaccination proof are already seeing backlash. Despite these concerns, though, it’s becoming more commonplace across the city to require such proof, and other states have expressed interest in launching similar passes. (You can read more about those with our vaccine passport tracker.) So what is it like to use? In anticipation of attending my first comedy show in years, at Union Hall in Brooklyn, I registered for the Excelsior Pass. Spoiler: It did not go smoothly.\n\nI personally comply with the local laws on using the checkin app – as someone who ticks a few boxes in terms of troublesome health issues, I really want to know if I have been exposed, so I can pester my doctor into providing a few therapeutics.\n\nBut it cannot be denied there is a broader conversation to be had. Society is rushing headlong into what is increasingly resembling a Chinese Communist style social credit system, in which people’s level of “voluntary” compliance with state directives has a significant impact on their freedom, and in which the government knows a great deal about your daily activities. I cannot help wondering if the “Covid Checkin” system will be retained, long after the Covid pandemic is well and truly over.\n\nEvery time I comply, because of my fear, I am haunted by the words of Benjamin Franklin – “Those who would give up essential liberty to purchase a little temporary safety, deserve neither liberty nor safety.”.\n\nPerhaps all these government interventions are necessary to protect vulnerable people in society, or perhaps they are all a horrible mistake, which will lead us all unwittingly into a dark place. Or perhaps they are both.", "opengraph": {"type": "article", "title": "Covid Passports – Malfunctions, Discrimination and Police Abuse of Process", "url": "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/", "description": "Store Security – Your Papers Please? As Britain green lights stores and bars insisting on proof of vaccination, its worth considering where potentially telling the government our every move m…", "article:published_time": "2021-07-07T05:00:00+00:00", "article:modified_time": "2021-07-07T00:00:54+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2021/07/Chinese-Police-Checking-Identity-Cards.jpg?fit=750%2C414&ssl=1", "image:width": "750", "image:height": "414", "image:alt": "Chinese Police Checking Identity Cards", "locale": "en_US"}, "tags": ["Covid Vaccination", "Covid Passport"], "tweets": [], "movies": [], "links": ["https://covid-status.service.nhsx.nhs.uk/", "https://www.nhs.uk/nhs-services/online-services/nhs-app/", "https://www.covid19.nhs.uk/", "https://www.gov.uk/government/publications/guidance-about-the-events-research-programme-erp-paving-the-way-for-larger-audiences-to-attend-sport-theatre-and-gigs-safely-this-summer", "https://www.bbc.co.uk/news/uk-51506729", "https://www.bbc.co.uk/news/uk-57460595", "https://www.bbc.co.uk/news/explainers-52530518", "https://www.bbc.com/news/explainers-55718553", "https://www.abc.net.au/news/baz-ruddick/10119472", "https://www.abc.net.au/news/2021-06-29/queensland-coronavirus-check-in-app-police-data-search/100249624", "https://documentedny.com/2021/04/08/elmhurst_encampments/", "https://documentedny.com/2021/04/08/does-the-state-budget-rise-to-the-moment/", "https://citylimits.org/2021/06/28/hundreds-of-new-yorkers-sent-back-to-homeless-shelters-in-return-to-status-quo/", "https://housingjusticeforall.org/housing-advocates-condemn-major-flaws-in-governor-cuomos-covid-emergency-rent-assistance-program/", "https://www.drumnyc.org/viewreport/", "https://www.technologyreview.com/2021/06/12/1026213/anti-vaxxers-negative-yelp-google-reviews-restaurants-bars/", "https://www.technologyreview.com/2021/07/01/1027768/us-vaccine-passport-guide/", "https://www.technologyreview.com/2021/07/06/1027770/vaccine-passport-new-york-excelsior-pass/", "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/#print", "mailto:?subject=%5BShared%20Post%5D%20Covid%20Passports%20-%20Malfunctions%2C%20Discrimination%20and%20Police%20Abuse%20of%20Process&body=https%3A%2F%2Fwattsupwiththat.com%2F2021%2F07%2F06%2Fcovid-passports-malfunctions-discrimination-and-police-abuse-of-process%2F&share=email", "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/?share=facebook", "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/?share=twitter", "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/?share=custom-1637629091", "https://wattsupwiththat.com/2021/07/06/covid-passports-malfunctions-discrimination-and-police-abuse-of-process/?share=telegram"], "authors": [], "publish_date": "2021-07-07T05:00:00+00:00"}