{"result_id": "336032", "URL": "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/", "timestamp": "2023-04-25 18:02:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "UNSUPPORTABLE CLAIM: More than 99.9% of studies agree: Humans caused climate change", "cleaned_text": "Anthony will have a response to this silliness later today.\n\nMore than 99.9% of studies agree: Humans caused climate change\n\nITHACA, N.Y. – More than 99.9% of peer-reviewed scientific papers agree that climate change is mainly caused by humans, according to a new survey of 88,125 climate-related studies.\n\n\n\nThe research updates a similar 2013 paper revealing that 97% of studies published between 1991 and 2012 supported the idea that human activities are altering Earth’s climate. The current survey examines the literature published from 2012 to November 2020 to explore whether the consensus has changed.\n\n\n\n“We are virtually certain that the consensus is well over 99% now and that it’s pretty much case closed for any meaningful public conversation about the reality of human-caused climate change,” said Mark Lynas, a visiting fellow at the Alliance for Science at Cornell University and the paper’s first author.\n\n\n\n“It’s critical to acknowledge the principal role of greenhouse gas emissions so that we can rapidly mobilize new solutions, since we are already witnessing in real time the devastating impacts of climate related disasters on businesses, people and the economy,” said Benjamin Houlton, Dean of the College of Agriculture and Life Sciences at Cornell and a co-author of the study, “Greater than 99% Consensus on Human Caused Climate Change in the Peer-Reviewed Scientific Literature,” which published Oct. 19 in the journal Environmental Research Letters.\n\n\n\nIn spite of such results, public opinion polls as well as opinions of politicians and public representatives point to false beliefs and claims that a significant debate still exists among scientists over the true cause of climate change. In 2016, the Pew Research Center found that only 27% of U.S. adults believe that “almost all” scientists agreed that climate change is due to human activity, according to the paper. A 2021 Gallup poll pointed to a deepening partisan divide in American politics on whether Earth’s rising observed temperatures since the Industrial Revolution were primarily caused by humans.\n\n\n\n“To understand where a consensus exists, you have to be able to quantify it,” Lynas said. “That means surveying the literature in a coherent and non-arbitrary way in order to avoid trading cherry-picked papers, which is often how these arguments are carried out in the public sphere.”\n\n\n\nIn the study, the researchers began by examining a random sample of 3,000 studies from the dataset of 88,125 English-language climate papers published between 2012 and 2020. They found only four out of the 3,000 papers were skeptical of human-caused climate change. “We knew that [climate skeptical papers] were vanishingly small in terms of their occurrence, but we thought there still must be more in the 88,000,” Lynas said.\n\n\n\nCo-author Simon Perry, a United Kingdom-based software engineer and volunteer at the Alliance for Science, created an algorithm that searched out keywords from papers the team knew were skeptical, such as “solar,” “cosmic rays” and “natural cycles.” The algorithm was applied to all 88,000-plus papers, and the program ordered them so the skeptical ones came higher in the order. They found many of these dissenting papers near the top, as expected, with diminishing returns further down the list. Overall, the search yielded 28 papers that were implicitly or explicitly skeptical, all published in minor journals.\n\n\n\nIf the 97% result from the 2013 study still left some doubt on scientific consensus on the human influence on climate, the current findings go even further to allay any uncertainty, Lynas said. “This pretty much should be the last word,” he said.", "opengraph": {"type": "article", "title": "UNSUPPORTABLE CLAIM: More than 99.9% of studies agree: Humans caused climate change", "url": "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/", "description": "If the 97% result from the 2013 study still left some doubt on scientific consensus on the human influence on climate, the current findings go even further to allay any uncertainty, Lynas said. “Th…", "article:published_time": "2021-10-19T17:00:00+00:00", "article:modified_time": "2021-10-19T15:55:25+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2021/01/107711824_m.jpg?fit=940%2C627&ssl=1", "image:width": "940", "image:height": "627", "locale": "en_US"}, "tags": ["The sky is falling!", "Hair on fire", "It's worse than we thought.", "We're all gonna die"], "tweets": [], "movies": [], "links": ["https://www.eurekalert.org/releaseguidelines", "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/#print", "mailto:?subject=%5BShared%20Post%5D%20UNSUPPORTABLE%20CLAIM%3A%20More%20than%2099.9%25%20of%20studies%20agree%3A%20Humans%20caused%20climate%20change&body=https%3A%2F%2Fwattsupwiththat.com%2F2021%2F10%2F19%2Funsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change%2F&share=email", "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/?share=facebook", "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/?share=twitter", "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/?share=custom-1637629091", "https://wattsupwiththat.com/2021/10/19/unsupportable-claim-more-than-99-9-of-studies-agree-humans-caused-climate-change/?share=telegram"], "authors": [], "publish_date": "2021-10-19T17:00:00+00:00"}