{"result_id": "336009", "URL": "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/", "timestamp": "2023-04-25 17:58:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "Covid Madness: People Fleeing a Volcanic Eruption Can’t Board the Rescue Vessels Until Vaccinated", "cleaned_text": "The volcano on the Caribbean Island of St Vincent has erupted. Cruise liners and Ferries are rushing to the scene to evacuate people caught by the eruption – but people are not allowed to board the cruise liners until they receive a Covid vaccination.\n\nAn explosive eruption of the La Soufriere volcano in the Caribbean has rocked the island of St Vincent following mandatory evacuation orders from the local government. More than 16,000 residents had been evacuated as volcanic activity increased ahead of the eruption, which took place on Friday morning local time. Evacuees have been given temporary homes on cruise ships and in safer parts of the island. The new eruption followed mandatory evacuation orders issued on Thursday for people who lived near the volcano. Prime Minister Ralph Gonsalves said in a press conference that people had to be vaccinated if they went aboard a cruise ship or were granted temporary refuge on another island. He said two Royal Caribbean cruise ships were expected to arrive by Friday and a third one in the coming days, as well as two Carnival cruise ships by Friday.\n\nI don’t blame the rescuers – they are doing the right thing, putting their very expensive ships in danger to rescue people. Volcanic ash could easily cause millions of dollars worth of damage just by landing on the ships, or by getting sucked into the engine air intakes. So they deserve recognition for their courage and compassion.\n\nWhat I blame is the world’s obsession with Covid.\n\nIn normal circumstances people are just evacuated from a deadly disaster zones, nobody refuses anyone because they might be sick. Sick people are given medical attention if required.\n\nBut because the world has become obsessed with a disease which kills up to 1% of victims, there is a real possibility that people fleeing a natural disaster will be told they have to stay and die, unless they receive an experimental and potentially life threatening medication.\n\nAs I said, not the rescuers fault – they are the meat in the sandwich. If they don’t insist on vaccination, their reward for compassion and heroism could be to be stuck in the ocean, nobody willing to take the evacuated islanders.\n\nBut the other islands accepting the refugees and insisting on vaccination should have a good hard look in the mirror. By all means keep the rescued people in isolation. But putting rescuers in a position where they feel they have to refuse help to people fleeing a deadly disaster who have not received the Covid jab, even people at high risk of severe complications from the vaccine – in my opinion that is just wrong.\n\nThe following is a video from DW.\n\nUpdate (EW): Click here to see a speech from Dr. Ralph Gonsalves, Prime Minister of St Vincent and the Grenadines, saying that people who are not vaccinated will not be accepted by other countries (almost exactly one hour into the interview, 59:05).\n\nUpdate (EW): h/t Justin Birch, S.K. From The Gateway Pundit – Royal Caribbean has stated they will not refuse unvaccinated people, but they will do their best to make sure people are vaccinated so they can receive refuge. Given things could get complicated for Royal Caribbean if people once onboard refuse vaccination, IMO this is a pretty selfless act.", "opengraph": {"type": "article", "title": "Covid Madness: People Fleeing a Volcanic Eruption Can’t Board the Rescue Vessels Until Vaccinated", "url": "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/", "description": "The volcano on the Caribbean Island of St Vincent has erupted. Cruise liners and Ferries are rushing to the scene to evacuate people caught by the eruption – but people are not allowed to boa…", "article:published_time": "2021-04-11T13:00:00+00:00", "article:modified_time": "2021-04-11T23:08:02+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2021/04/St-Vincent-Eruption.jpg?fit=750%2C407&ssl=1", "image:width": "750", "image:height": "407", "image:alt": "St Vincent Eruption", "locale": "en_US"}, "tags": ["Coronavirus Vaccine"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">1/2Hi, there. Royal Caribbean hasn't made vaccinations a requirement for St. Vincent evacuees. Government officials of St. Vincent have offered to do their best to make sure all who board will be tested and vaccinated in order to receive refuge in neighboring countries.</p>— Royal Caribbean (@RoyalCaribbean) <a href=\"https://twitter.com/RoyalCaribbean/status/1380970187898249218?ref_src=twsrc%5Etfw\">April 10, 2021</a></blockquote> \n"], "movies": [], "links": ["https://www.abc.net.au/news/2021-04-10/caribbean-island-st-vincent-volcano-erupts-16-000-evacuated/100060486", "https://www.facebook.com/watch/live/?v=354855929277755", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/#comment-3223633", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/#comment-3223819", "https://www.thegatewaypundit.com/2021/04/begins-covid-vaccinated-people-can-evacuated-volcano-stricken-caribbean-island-st-vincent/", "https://twitter.com/RoyalCaribbean/status/1380970187898249218?ref_src=twsrc%5Etfw", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/#print", "mailto:?subject=%5BShared%20Post%5D%20Covid%20Madness%3A%20People%20Fleeing%20a%20Volcanic%20Eruption%20Can%27t%20Board%20the%20Rescue%20Vessels%20Until%20Vaccinated&body=https%3A%2F%2Fwattsupwiththat.com%2F2021%2F04%2F11%2Fcovid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated%2F&share=email", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/?share=facebook", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/?share=twitter", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/?share=custom-1637629091", "https://wattsupwiththat.com/2021/04/11/covid-madness-people-fleeing-a-volcanic-eruption-cant-board-the-rescue-vessels-until-vaccinated/?share=telegram"], "authors": [], "publish_date": "2021-04-11T13:00:00+00:00"}