{"result_id": "336036", "URL": "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/", "timestamp": "2023-04-25 18:03:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "A Return To The Land Of Covidia", "cleaned_text": "A while back I gave up looking at COVID stats because there was so much misinformation out there. Now, however, the CDC has published data on total deaths and deaths by category, and there are some interesting things to see. Unfortunately, due to delays in reporting, the data only goes up to July 2021. Here’s the first one.\n\nFigure 1. Deaths by age, both with COVID as the underlying cause on the death certificate and those with COVID plus other causes.\n\nI see lots of folks saying that school kids should be vaccinated … but there have only been 155 deaths of kids under 15, and the overwhelming majority of those had serious co-morbidities.\n\nNext, here are total deaths from all causes since 2019.\n\nFigure 2. US deaths, all causes, January 2019 to July 2021\n\nAs you can see, clearly there are “excess” deaths in 2020 and 2021. Figure 3 shows how the “excess deaths” compare to 2019.\n\nFigure 3. Percentage change in “all-cause” US deaths, 2020-2022 compared to 2019.\n\nOf interest is the fact that deaths among people over 65 or so are basically back to pre-pandemic levels …\n\nNext, here are the totals of excess deaths and deaths with and from COVID.\n\nIt is my assumption that the excess deaths that were not caused by COVID were caused by the lockdowns—suicides and postponed medical procedures.\n\nA final oddity is “Natural” deaths. Note that “Natural” is not a cause of death, like say COVID, heart attacks, or cancer. Instead, it is a manner of death. The possible manners of death are Natural, Homicide, Accident, Pending Investigation, and Suicide. Figure 5 shows the changes in the “Natural” manner of death compared to 2019.\n\nFigure 5. Percentage change in “Natural” US deaths, 2020-2022 compared to 2019.\n\nMost curious. “Natural” deaths are up in those from 15 to 45 years or so, but are flat or even down in older people. I fear I have no explanation for that. I doubt that it is from the vaccine, since those deaths seem to be mostly from things like myocarditis and pericarditis that are heart-related, and here’s the percentage change in heart disease.\n\nFigure 6. Percentage change in heart disease US deaths, 2020-2022 compared to 2019.\n\nNote that recently, heart disease is generally down in the 15-45-year-old age groups with increased “Natural” deaths …\n\nAs always, more questions than answers …\n\nMy very best regards to all,\n\nMy Customary Request: When you comment PLEASE quote the exact words you are discussing, so we all can be clear just who and what you are talking about.\n\nThe Data: These numbers are from the CDC, the US Centers for Disease Control and Prevention, available here. Do I trust them? Not particularly, the CDC has hardly been a beacon of probity in all of this … but they’re the best I can find.\n\nA Final Note: I am neither pro- nor anti-vax. However, I am wholly and completely opposed to all mandates and passports.\n\nThe logic of those pushing for mandates and passports runs like this:\n\nGotta say … that makes no sense to me at all.\n\nI say everyone needs to balance their own personal risk from COVID (real) against their risk from the so-called “vaccine” (also real). Me, I live with my gorgeous ex-fiancee, my daughter, my son-in-law, my 2-1/2 year old granddaughter, and my 2-1/2 month old grandson. At 74 I’m in my middle youth, so high risk. I’ve had two seizures and a heart attack. My gorgeous ex-fiancee is a Family Nurse Practitioner who works with patients, some of whom likely have or have had COVID.\n\nSo it was an easy choice, that good lady and I are both vaccinated and boosted … but that’s us. You need to balance and choose for yourself.", "opengraph": {"type": "article", "title": "A Return To The Land Of Covidia", "url": "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/", "description": "Guest Post by Willis Eschenbach A while back I gave up looking at COVID stats because there was so much misinformation out there. Now, however, the CDC has published data on total deaths and deaths…", "article:published_time": "2022-02-07T18:00:00+00:00", "article:modified_time": "2022-02-07T17:43:40+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2020/04/another-case-of-covid.png?fit=721%2C515&ssl=1", "image:width": "721", "image:height": "515", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://data.cdc.gov/NCHS/AH-Monthly-Provisional-Counts-of-Deaths-by-Age-Gro/ezfr-g6hf", "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/#print", "mailto:?subject=%5BShared%20Post%5D%20A%20Return%20To%20The%20Land%20Of%20Covidia&body=https%3A%2F%2Fwattsupwiththat.com%2F2022%2F02%2F07%2Fa-return-to-the-land-of-covidia%2F&share=email", "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/?share=facebook", "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/?share=twitter", "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/?share=custom-1637629091", "https://wattsupwiththat.com/2022/02/07/a-return-to-the-land-of-covidia/?share=telegram"], "authors": [], "publish_date": "2022-02-07T18:00:00+00:00"}