{"result_id": "336002", "URL": "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/", "timestamp": "2023-04-25 17:56:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "Scientific Breakthrough: Malaria Could be a Thing of the Past", "cleaned_text": "Scientists working at Queensland’s Griffith University have developed what they claim is the world’s first long term effective Malaria vaccine. If this new, cheap vaccine lives up to its promise, it will save millions of poor people who cannot afford Malaria drugs.\n\nQUEENSLAND researchers believe they could be the first in the world to find an effective vaccine for malaria, after a successful trial in humans. Griffith University professor Michael Good said it was a significant step forward in the search for immunisation against one of the world’s most deadly diseases. Prof Good said the vaccine used a form of the malaria parasite that lives in red blood cells, but has had its DNA altered so it cannot ­multiply and therefore does not cause disease. “That parasite though is nevertheless capable of inducing an immune response,” he said. “The immune system looks at that and thinks that it’s really seeing the malaria, the real malaria, whereas in fact it is seeing an (altered) version of the malaria.” Prof Good said the university was now fundraising for the $500,000 it needed for the next round of trials, which would likely involve up to 30 volunteers who would be given three doses of the vaccine.\n\nI was listening to an interview this morning with Professor Good.\n\nProfessor Good’s approach, using a disabled version of real live Malaria parasites to stimulate the immune system, apparently stimulates a different response to previous Malaria vaccines. Instead of stimulating an antibody response which targets specific Malaria proteins, which can easily be confused by rapid mutations which alter surface proteins on the Malaria parasites, Professor Good’s approach stimulates a killer T-cell response. Killer T-cells are responsible for destroying cancer cells or cells which are damaged by viruses, toxins or in this case Malaria parasites. The disabled parasites in the Malaria vaccine actually attack the body in exactly the same way a real Malaria infection does, but the specially prepared vaccine parasites cannot multiply – their ability to spread the infection throughout the body has been disabled. This practice infection teaches the body’s killer T-cells learn to recognise damaged cells which have been infiltrated by Malaria parasites, so when the body faces a real Malaria infection, the infection is rapidly suppressed before it can do any harm.\n\nThis is not the first attempt to create a Malaria vaccine, but previous attempts to create Malaria vaccines only provided a few months protection – their effectiveness rapidly declines. Professor Good hopes his new approach will be different, will offer long term protection.\n\nAlthough Professor Good has received some government funding, his team is currently appealing for private donations for the next round of Malaria vaccine trials.", "opengraph": {"type": "article", "title": "Scientific Breakthrough: Malaria Could be a Thing of the Past", "url": "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/", "description": "Guest essay by Eric Worrall Scientists working at Queensland’s Griffith University have developed what they claim is the world’s first long term effective Malaria vaccine. If this new, …", "article:published_time": "2017-03-27T10:00:23+00:00", "article:modified_time": "2017-03-27T10:00:23+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2015/07/anopheles-mosquito.jpg?fit=1200%2C712&ssl=1", "image:width": "1200", "image:height": "712", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": ["https://wattsupwiththat.files.wordpress.com/2015/07/anopheles-mosquito.jpg", "http://www.couriermail.com.au/news/queensland/queensland-researchers-develop-world-first-malaria-vaccine/news-story/62f6e06f687ee09e873cc138dfb299b8", "https://en.wikipedia.org/wiki/Cytotoxic_T_cell", "https://www.griffith.edu.au/institute-glycomics/donate", "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/#print", "mailto:?subject=%5BShared%20Post%5D%20Scientific%20Breakthrough%3A%20Malaria%20Could%20be%20a%20Thing%20of%20the%20Past&body=https%3A%2F%2Fwattsupwiththat.com%2F2017%2F03%2F27%2Fscientific-breakthrough-malaria-could-be-a-thing-of-the-past%2F&share=email", "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/?share=facebook", "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/?share=twitter", "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/?share=custom-1637629091", "https://wattsupwiththat.com/2017/03/27/scientific-breakthrough-malaria-could-be-a-thing-of-the-past/?share=telegram"], "authors": [], "publish_date": "2017-03-27T10:00:23+00:00"}