{"result_id": "336046", "URL": "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/", "timestamp": "2023-04-25 18:07:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2018/05/cropped-WUWT-logo.jpg?fit=32%2C32&ssl=1", "canonical": "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/", "encoding": "UTF-8"}, "image": null, "domain": "wattsupwiththat.com", "title": "Not recommending AstraZeneca vaccine for the elderly risks the lives of the most vulnerable", "cleaned_text": "Jonathan Pugh, University of Oxford and Julian Savulescu, University of Oxford\n\nRegulators in Europe are at odds over whether the Oxford/AstraZeneca vaccine should be given to the elderly. In the UK, the vaccine has been approved for use in adults aged 18 and up, but France, Germany, Sweden and Austria say the vaccine should be prioritised for those under the age of 65. Poland only recommends it for those younger than 60. Italy goes one step further and only recommends it for those 55 and younger.\n\nIt is only ethical to approve a vaccine if it is safe and effective. Crucially, the reluctance to approve the AstraZeneca vaccine in the elderly is grounded only in concerns about its efficacy.\n\nThe concern is not that there is data showing the vaccine to be ineffective in the elderly, it’s that there is not enough evidence to show that it is effective in this age group. The challenge is in how we manage the degree of uncertainty in the efficacy of the vaccine, given the available evidence.\n\nSo how much data is there? The interim results from the AstraZeneca vaccine study pooled data from over 11,000 participants who received two doses of either the AstraZeneca vaccine or a placebo. A further report shows that only 660 participants were aged over 65, and there were only two cases of COVID in this group. Because of the low numbers, the authors of the study conclude that the efficacy of the vaccine in the elderly could not be determined. In comparison, the published Pfizer vaccine study included nearly 38,000 participants; around 16,000 of them were aged over 55.\n\nThere is also data about the extent to which the AstraZeneca vaccine generates an immune response. A study analysed whether the vaccine provoked an immune response in 560 participants, including 400 participants over the age of 55. Early phase human trials found that the vaccine elicited a similar immune response across all age groups after the second dose. Although this isn’t proof that the vaccine prevents symptomatic disease, it suggests that the vaccine has an important effect in the elderly.\n\nAn ethical rather than scientific disagreement\n\nThe disagreement about whether to recommend the vaccine for the elderly concerns an ethical rather than a scientific question, namely, what standard of evidence do we need to establish the efficacy of a vaccine before approving it for use in a pandemic?\n\nThe more evidence available, the greater the certainty that regulators can have that a vaccine works, and about which distribution strategies will maximise its public health benefit. But gathering evidence takes time. The higher the standard, the greater the delay before people can access the intervention. In the pandemic, this trade-off is particularly acute. Time here is lives.\n\nConsider the following rough calculations based on publicly available statistics. According to data from the Office for National Statistics, from November 28 2020 to January 1 2021, there were 14,633 COVID-related deaths in the UK. Only 1,351 of those deaths were in the 20-64 age group; 13,280 were in people over 65.\n\nImagine that the UK had been able to fully vaccinate all of those between the ages of 20-64 before November 28 2020 with a vaccine that was 95% effective. Assume that preventing infection with coronavirus would have been enough to avoid all of the above deaths. On this assumption, the vaccine could have been expected to prevent 1,283 of the deaths that occurred in the 20-64 age band.\n\nSuppose now that we could also have vaccinated all of those over the age of 65 with this vaccine, but that there was limited data about how effective it would be in the elderly. Here is the crucial point: for it to save a same number of lives (1,283) in those over 65, the vaccine would need to be just shy of 10% effective, given the far higher mortality in the elderly.\n\nThis is generously assuming that the vaccine is very effective below the age of 65. If the vaccine was 70% effective in the 20-64 age band, then it would need to be only 7.1% effective in the elderly to be expected to save an equivalent number of lives (946 in this case).\n\nHere’s another example. A recent study suggests the average risk of death for 60- to 64-year-olds infected with coronavirus is 0.46%. For a person aged 80 or older, the risk is 8.3%. Again, assume generously that a vaccine is 95% effective in 60- to 64-year-olds. That means for every 1,000 people vaccinated in this group who would have become infected, the vaccine would save 4.3 lives. How effective would a vaccine need to be in those aged 80 and older to still save the same number of lives? 5.2%.\n\nWe are not suggesting that the effectiveness of the AstraZeneca vaccine in the elderly is this low, nor that regulators should approve a vaccine as ineffective as this imaginary one. The World Health Organization has stipulated a minimum efficacy of 50% for COVID-19 vaccines. But these examples show how important it is to consider the limitations of efficacy (or its evidence) with the actual mortality risk faced by people in the absence of a vaccine.\n\nA vaccine with limited effectiveness is problematic if it stops people accessing other effective available interventions. However, other vaccine supplies are currently scarce, and their evaluation in the elderly is also ongoing. Meanwhile, those over the age of 65 face an exponentially increasing risk of death. In the absence of other effective prophylactic interventions, a vaccine can have far lower efficacy in older groups and still be expected to save many lives.\n\nJonathan Pugh, Research Fellow, University of Oxford and Julian Savulescu, Visiting Professor in Biomedical Ethics, Murdoch Children’s Research Institute; Distinguished Visiting Professor in Law, University of Melbourne; Uehiro Chair in Practical Ethics, University of Oxford\n\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.", "opengraph": {"type": "article", "title": "Not recommending AstraZeneca vaccine for the elderly risks the lives of the most vulnerable", "url": "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/", "description": "The concern is not that there is data showing the vaccine to be ineffective in the elderly, it’s that there is not enough evidence to show that it is effective in this age group. The challenge is i…", "article:published_time": "2021-02-06T14:00:00+00:00", "article:modified_time": "2021-02-06T01:18:36+00:00", "site_name": "Watts Up With That?", "image": "https://i0.wp.com/wattsupwiththat.com/wp-content/uploads/2020/10/35884897_m.jpg?fit=940%2C600&ssl=1", "image:width": "940", "image:height": "600", "locale": "en_US"}, "tags": ["EU", "Covid-19", "AstraZeneca", "UK", "SARS-Cov-2"], "tweets": [], "movies": [], "links": ["https://theconversation.com/profiles/jonathan-pugh-209098", "https://theconversation.com/institutions/university-of-oxford-1260", "https://theconversation.com/profiles/julian-savulescu-8314", "https://theconversation.com/institutions/university-of-oxford-1260", "https://www.gov.uk/government/news/oxford-universityastrazeneca-vaccine-authorised-by-uk-medicines-regulator", "https://www.euronews.com/2021/02/03/france-poland-sweden-latest-eu-countries-to-rule-out-astrazeneca-jab-for-elderly", "https://www.gavi.org/vaccineswork/what-difference-between-efficacy-and-effectiveness", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)32661-1/fulltext", "https://www.gov.uk/government/publications/regulatory-approval-of-covid-19-vaccine-astrazeneca/information-for-healthcare-professionals-on-covid-19-vaccine-astrazeneca", "https://www.nejm.org/doi/full/10.1056/NEJMoa2034577", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(20)32466-1/fulltext", "https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/deaths/datasets/weeklyprovisionalfiguresondeathsregisteredinenglandandwales", "https://www.nature.com/articles/s41586-020-2918-0", "https://www.who.int/blueprint/priority-diseases/key-action/WHO_Target_Product_Profiles_for_COVID-19_web.pdf", "https://theconversation.com/coronavirus-is-growing-exponentially-heres-what-that-really-means-134591", "https://theconversation.com/profiles/jonathan-pugh-209098", "https://theconversation.com/institutions/university-of-oxford-1260", "https://theconversation.com/profiles/julian-savulescu-8314", "https://theconversation.com/institutions/university-of-oxford-1260", "https://theconversation.com", "https://theconversation.com/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable-154605", "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/#print", "mailto:?subject=%5BShared%20Post%5D%20Not%20recommending%20AstraZeneca%20vaccine%20for%20the%20elderly%20risks%20the%20lives%20of%20the%20most%20vulnerable&body=https%3A%2F%2Fwattsupwiththat.com%2F2021%2F02%2F06%2Fnot-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable%2F&share=email", "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/?share=facebook", "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/?share=twitter", "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/?share=custom-1637629091", "https://wattsupwiththat.com/2021/02/06/not-recommending-astrazeneca-vaccine-for-the-elderly-risks-the-lives-of-the-most-vulnerable/?share=telegram"], "authors": [], "publish_date": "2021-02-06T14:00:00+00:00"}