{"result_id": "337038", "URL": "https://anonhq.com/bill-gates-says-mass-gatherings-may-not-return-without-global-vaccine/", "timestamp": "2023-04-25 18:08:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/bill-gates-says-mass-gatherings-may-not-return-without-global-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Bill Gates Says \"Mass Gatherings\" May Not Return Without Global Vaccine", "cleaned_text": "A recurring theme among conspiracy theorists is that the elite are just waiting for the right moment to roll out their ‘mark of the beast’ technology to remotely identify and control every single human being on the planet, thus sealing their plans for a one world government. And with many people willing to do just about anything to get back to some sense of normalcy, those fears appear more justified with each passing day.\n\nIn the Book of Revelation [13:16-17], there is a passage that has attracted the imagination of believers and disbelievers throughout the ages, and perhaps never more so than right now: “And he causeth all, both small and great, rich and poor, free and bond, to receive a mark in their right hand, or in their foreheads: And that no man might buy or sell, save he that had the mark…”\n\nWas John of Patmos history’s first conspiracy theorist, or are we merely indulging ourselves today with a case of self-fulfilling prophecy? Whatever the case may be, many people would probably have serious reservations about being branded with an ID code even if it had never been mentioned in Holy Scripture. But that certainly has not stopped Microsoft founder Bill Gates, who has been warning about a global pandemic for years, from pushing such controversial technologies on all of us.\n\nIn September 2019, just three months before the coronavirus first appeared in China, ID2020, a San Francisco-based biometric company that counts Microsoft as one of its founding members, quietly announced it was undertaking a new project that involves the “exploration of multiple biometric identification technologies for infants” that is based on “infant immunization” and only uses the “most successful approaches”.\n\nFor anyone who may be wondering what one of those “most successful approaches” might look like, consider the following top contender for the contract. Researchers at the Massachusetts Institute of Technology (MIT) have developed what is essentially a hi-tech ‘tattoo’ that stores data in invisible dye under the skin. The ‘mark’ would be delivered together with a vaccine, most likely administered by Gavi, the global vaccine agency that also falls under the umbrella of the Bill & Melinda Gates Foundation.\n\n“The researchers showed that their new dye, which consists of nanocrystals called quantum dots… emits near-infrared light that can be detected by a specially equipped smartphone,” MIT News reported.\n\nAnd if the reader scrolls to the very bottom of the article, he will find that this study was funded first and foremost by the Bill and Melinda Gates Foundation.\n\nToday, with the global service economy shut down to prevent large groups of infectious humans from assembling, it is easier to imagine a day when people are required to have their infrared ID ‘tattoo’ scanned in order to be granted access to any number of public venues. And from there, it requires little stretch of the imagination to see this same tracking nanotechnology being applied broadly across the global economy, where it could be used to eliminate the use of dirty money. After all, if reusable bags are being outlawed over the coronavirus panic-demic, why should reusable cash get special treatment?\n\nWriting earlier this month in these pages, geopolitical analyst Pepe Escobar provided a compelling argument that the coronavirus, which is driving the world towards a New Great Depression, is “being used as cover for the advent of a new, digital financial system, complete with a forced vaccine cum nanochip creating a full, individual, digital identity.\n\nAs one possible future scenario, Escobar imagined “clusters of smart cities linked by AI, with people monitored full time and duly micro-chipped doing what they need with a unified digital currency…”\n\nThose fears took on greater significance when Bill Gates sat down over the weekend for a breathtaking interview with CBS This Morning. Gates told host Anthony Mason that mass gatherings might have to be prohibited in the age of coronavirus unless and until a wide scale vaccination program is enacted.\n\n“What does ‘opening up’ look like,” Gates asked rhetorically before essentially changing the entire social and cultural makeup of the United States in one fell swoop.\n\n“Which activities, like schools, have such benefit and can be done in a way that the risk of transmission is very low, and which activities, like mass gatherings, maybe, in a certain sense more optional. And so until you’re widely vaccinated those [activities] may not come back at all”\n\n[The interview can be watched in its entirety here].\n\nAccording to Gates, anything that could be defined as a “mass gathering” – from spectators packed into a stadium for a sporting event, to protesters out on the street in demonstration – would be considered an act of civil disobedience without a vaccine. Little surprise that Gates chose the concept of “mass gathering” to snag all of us, for what is modern democratic society if not one big mass event after another? Indeed, since nobody will want to miss the next big happening, like the Super Bowl, or Comic-Con, or, heaven forbid, Eurovision, millions of people would predictably line up for miles to get their Microsoft-supported inoculation, even if it contains tracking technologies.\n\nAll of this seems like sheer madness when it is remembered that there are other options for defeating the coronavirus than a mandatory global vaccine regime.\n\nJust last month, Dr. Anthony Fauci, the Allergy and Infectious Diseases Director, told a Senate Subcommittee that over 80 percent of the people who get infected by the coronavirus “spontaneously recover” without any medical intervention. This makes one wonder why the global lockdown was designed for everyone instead of just the sick and elderly. Meanwhile, the drug hydroxychloroquine, which has been downplayed in the media despite being named as the most effective coronavirus treatment among physicians in a major survey, is starting to get a fresh look.\n\nJust this week, following Nevada’s lead, Michigan just reversed course and is now the second democratic state to request the anti-malarial drug from the Trump administration.\n\nSo now it looks as though we are off to the races to see what will become the approved method of fighting the global pandemic – a hastily developed vaccine that may actually worsen the effects of the disease in those who contract it, or the already proven inexpensive drug hydroxychloroquine.\n\nIf the winner turns out to be a global vaccine, possibly one that carries ID nanotechnology, don’t expect the wealthy to be lining up with their kids to be the first to get it. In 2015, The American Journal of Public Heath surveyed some 6,200 schools in California – the epicenter of biometric ID research – and found vaccine exemptions were twice as common among kindergartners enrolled in private institutions.\n\nIt seems that the elite are betting heavily on the development of an ID-tracking vaccine that would bring all races and institutions together under one big happy roof, but clearly they will continue living in their own fenced-off neighborhood in this one world government. Whether or not they will get a ‘special pass’ from receiving the new-age mark is another question.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2020/04/bill_gates_vax.jpg", "locale": "en_US", "type": "article", "title": "Bill Gates Says \"Mass Gatherings\" May Not Return Without Global Vaccine", "url": "https://anonhq.com/bill-gates-says-mass-gatherings-may-not-return-without-global-vaccine/", "site_name": "AnonHQ", "article:published_time": "2020-04-11T06:41:12+00:00", "article:modified_time": "2020-04-11T06:50:05+00:00", "image:width": "1200", "image:height": "706", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">In a new interview, Bill Gates authoritatively states that mass public gatherings will not come back \"at all\" until we have mass vaccination. Who made him king of the world? <a href=\"https://t.co/siW7bZ9yGc\">https://t.co/siW7bZ9yGc</a> … <a href=\"https://t.co/ivaCI8eAEl\">pic.twitter.com/ivaCI8eAEl</a></p><p>— Alternative News (@NewsAlternative) <a href=\"https://twitter.com/NewsAlternative/status/1246337502161416192?ref_src=twsrc%5Etfw\">April 4, 2020</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">MIT is working on a \"quantum tattoo\" that will mark you with an invisible identifier while also delivering a vaccine. Can you guess who is the premiere donor of the project? <a href=\"https://t.co/ZEWqCUVGwI\">https://t.co/ZEWqCUVGwI</a> <a href=\"https://t.co/jFVip4DaqZ\">pic.twitter.com/jFVip4DaqZ</a></p><p>— Roosh (@rooshv) <a href=\"https://twitter.com/rooshv/status/1246507620405559301?ref_src=twsrc%5Etfw\">April 4, 2020</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\"><p lang=\"en\" dir=\"ltr\">Michigan reverses course, requests anti-malarial drugs from feds to treat coronavirus. Second Democratic governor to change mind this week, following Nevada. <a href=\"https://t.co/TkZyXEqs9l\">https://t.co/TkZyXEqs9l</a></p><p>— John Solomon (@jsolomonReports) <a href=\"https://twitter.com/jsolomonReports/status/1245870442780344322?ref_src=twsrc%5Etfw\">April 3, 2020</a></p></blockquote>"], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://anonhq.com/wp-content/uploads/2020/04/Bridge-930x520_0.jpg", "https://findbiometrics.com/new-id2020-project-to-build-biometric-id-program-around-infant-immunization/", "https://t.co/siW7bZ9yGc", "https://t.co/ivaCI8eAEl", "https://twitter.com/NewsAlternative/status/1246337502161416192?ref_src=twsrc%5Etfw", "https://www.gavi.org/our-alliance/about", "http://news.mit.edu/2019/storing-vaccine-history-skin-1218", "https://www.wsj.com/articles/the-plastic-bag-ban-backfires-11584399666", "https://amazyble.com/products/amazyble-tactical-smartwatch", "https://www.strategic-culture.org/news/2020/04/02/ground-control-planet-lockdown-only-test/", "https://www.cbsnews.com/video/extended-interview-bill-gates-on-coronavirus-pandemic/", "https://t.co/ZEWqCUVGwI", "https://t.co/jFVip4DaqZ", "https://twitter.com/rooshv/status/1246507620405559301?ref_src=twsrc%5Etfw", "https://www.cnsnews.com/article/national/melanie-arter/dr-fauci-80-percent-coronavirus-patients-spontaneously-recover", "https://www.sermo.com/press-releases/largest-statistically-significant-study-by-6200-multi-country-physicians-on-covid-19-uncovers-treatment-patterns-and-puts-pandemic-in-context/", "https://t.co/TkZyXEqs9l", "https://twitter.com/jsolomonReports/status/1245870442780344322?ref_src=twsrc%5Etfw", "https://ajph.aphapublications.org/doi/abs/10.2105/AJPH.2015.302926", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2020-04-11T06:41:12+00:00"}