{"result_id": "337023", "URL": "https://anonhq.com/motorbike-runs-water/", "timestamp": "2023-04-25 18:07:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/motorbike-runs-water/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Motorbike that runs on WATER??", "cleaned_text": "Well, RT has been a credible source of information, particularly when it comes to US domestic affairs, and has offered an unbiased alternative to what has been largely a one-sided Western-Corporate-government owned monopoly that keeps getting further consolidated into fewer hands.\n\nNonetheless, it has its bad days too. This video on a motorbike that “runs on water” has been circulated all over the internet and it seems to have been taken at face value by other news sites as well. It sounds too good to be true… But, let’s take a closer look at the bugger and figure out what potential explanations exist for this apparent hijacking of the laws of thermodynamics, and physics as a whole.\n\nThe man claims that his bike runs entirely on water, using a car battery to splice Hydrogen (H ) from the water molecule (H O)… and uses a litre of it to travel 300miles. First-off, kudos to the man for getting his high school chemistry right. Yes, Hydrogen can be ripped from water- this Hydrogen produces a bucket-load of energy when burned, and releases water as a harmless by-product.\n\nSounds great… until one realizes that electrolysis, the process of removing hydrogen from water in the first place, requires quite a bit more than a bucket-load of energy to separate out the Hydrogen. In the end, you get less than nothing back. Not exactly a worthwhile trade. Of course, one could always argue that large facilities could manufacture hydrogen more efficiently, than a motor vehicle’s engine could burn fossil fuels…. But this idea is hardly new and Hydrogen-powered vehicles have been running around for awhile. Further, electrolysis is not a new discovery.\n\nThere are also problems with the calculations even if we assume that he had somehow managed to convert the 1 litre of water into hydrogen, this amount of Hydrogen could hardly be enough to power his bike for 300 miles. As some commenters of the Daily Mail’s take on the matter have pointed out, all this sounds like a scam:\n\nThis does not pass the smell test. The average motorcycles gets about 35 to 40 mpg (gasoline), but let’s say his bike gets 60 mpg. The approximate energy equivalence is about 1 kilogram (Kg) of hydrogen equals 1 gallon of gasoline. So it would take 1 Kg of hydrogen for his bike to travel 60 miles and a little more than 5 Kg to travel 310 miles. The first problem is that 1 Liter of water contains about 0.11 Kg of hydrogen (the rest oxygen; 0.89 Kg). So this 0.11 Kg of hydrogen from 1 Liter of water would only take the bike about 7 miles. Well short of 310 miles. The second problem is an average 120 amp-hours car battery contains about 1.4 kilowatt-hours of energy and since it takes about 50 kilowatt-hours to produce 1 Kg of hydrogen a single charged car battery will only produce about 0.028 Kg of hydrogen, only enough for his bike to travel about 1.7 miles. In total it would actually take about 44 liters of water and 180 car battery charges to generate enough hydrogen to travel 310 mile.\n\nThe commenter does make ONE error though; although one kilogram of hydrogen might have the energy equivalence of one gallon (or 2.72155 kilograms) of gas, Hydrogen burns far more cleanly and efficiently than gas in your average vehicle’s engine.\n\nIt is entirely possible that what this man is demonstrating is not in fact simple electrolysis, but some new method of obtaining energy from water. Perhaps he’s extracting Deuterium, or heavy Hydrogen, which has been long used in nuclear reactions and the production of the so-called Hydrogen bomb. Perhaps his motorcycle is a mobile nuclear reactor and centrifuge. Unlikely, but possible.\n\nThree sayings come to mind:\n\n“Where there is hope there is life”- Anne Frank\n\n“Where there is life, there’s a sucker. Also, life sucks.”- CoNN\n\nWhat he is suggesting comes from a long line of debunked pseudoscience which seems to grab headlines time and again, for he is certainly not the first to make this “discovery”. Even Faux, I mean FOX, News ran with a story like this one awhile back:\n\nSo, is this a technology that producers of oil want suppressed? Or a common scam, which as usual never provides a detailed means of reproducing the tech? You decide:\n\nFrom Wikipedia (because I could not find anything more credible with regards to this topic)\n\nCharles H. Garrett allegedly demonstrated a water-fuelled car “for several minutes”, which was reported on September 8, 1935, in The Dallas Morning News.[10] The car generated hydrogen by electrolysis as can be seen by examining Garrett’s patent, issued that same year.[11] This patent includes drawings which show a carburetor similar to an ordinary float-type carburetor but with electrolysis plates in the lower portion, and where the float is used to maintain the level of the water. Garrett’s patent fails to identify a new source of energy.\n\nAt least as far back as 1980, Stanley Meyer claimed that he had built a dune buggy that ran on water,[13]although he gave inconsistent explanations as to its mode of operation. In some cases, he claimed that he had replaced the spark plugs with a “water splitter”,[14] while in other cases it was claimed to rely on a “fuel cell” that split the water into hydrogen and oxygen.[15] The “fuel cell”, which he claimed was subjected to anelectrical resonance, would split the water mist into hydrogen and oxygen gas, which would then be combusted back into water vapour in a conventional internal combustion engine to produce net energy. Meyer’s claims were never independently verified, and in an Ohio court in 1996 he was found guilty of “gross and egregious fraud”.[1] He died of an aneurysm in 1998, although conspiracy theories claim that he was poisoned.[7]\n\nIn 2002, the firm Hydrogen Technology Applications patented an electrolyser design and trademarked the term “Aquygen” to refer to the hydrogen oxygen gas mixture produced by the device.[16][17][18] Originally developed as an alternative to oxyacetylene welding, the company claimed to be able to run a vehicle exclusively on water, via the production of “Aquygen”, and invoked an unproven state of matter called “magnegases” and a discredited theory about magnecules to explain their results.[19] Company founder Dennis Klein claimed to be in negotiations with a major US auto manufacturer and that the US government wanted to produce Hummers that used his technology.[20]\n\nAt present, the company no longer claims it can run a car exclusively on water, and is instead marketing “Aquygen” production as a technique to increase fuel efficiency,[21] thus making it Hydrogen fuel enhancement rather than a water-fuelled car.\n\nAlso in 2002, Genesis World Energy announced a market ready device which would extract energy from water by separating the hydrogen and oxygen and then recombining them.[22] In 2003, the company announced that this technology had been adapted to power automobiles.[23] The company collected over $2.5 million from investors, but none of their devices were ever brought to market. In 2006, Patrick Kelly, the owner of Genesis World Energy was sentenced in New Jersey to five years in prison for theft and ordered to pay $400,000 in restitution.[24]\n\nIn June 2008, Japanese company Genepax unveiled a car which it claims runs on only water and air,[25] and many news outlets dubbed the vehicle a “water-fuel car”.[26] The company says it “cannot [reveal] the core part of this invention,” yet,[27] but it has disclosed that the system uses an onboard energy generator (a “membrane electrode assembly”) to extract the hydrogen using a “mechanism which is similar to the method in which hydrogen is produced by a reaction of metal hydride and water”.[28] The hydrogen is then used to generate energy to run the car. This has led to speculation that the metal hydride is consumed in the process and is the ultimate source of the car’s energy, making the car a hydride-fuelled “hydrogen on demand” vehicle, rather than water-fuelled as claimed.[29][30][31] On the company’s website the energy source is explained only with the words “Chemical reaction“.[32] The science and technology magazine Popular Mechanics has described Genepax’s claims as “Rubbish.”[33] The vehicle that Genepax demonstrated to the press in 2008 was a REVAi electric car, manufactured in India and sold in the UK as the G-Wiz.\n\nIn early 2009, Genepax announced they were closing their website, citing large development costs.[34]\n\nAlso in 2008, Sri Lankan news sources reported that Thushara Priyamal Edirisinghe claimed to drive a water-fuelled car about 300 kilometers[35] on three litres of water.[36][37] Like other alleged water-fuelled cars described above, energy for the car is supposedly produced by splitting water into hydrogen and oxygen using electrolysis, and then burning the gases in the engine. Thushara showed the technology to Prime Minister Ratnasiri Wickramanayaka, who “extended the Government’s full support to his efforts to introduce the water-powered car to the Sri Lankan market.”[36]\n\nThushara was arrested a few months later on suspicion of investment fraud. [4]\n\nDaniel Dingel, a Filipino inventor, has been claiming since 1969 to have developed technology allowing water to be used as fuel. In 2000, Dingel entered into a business partnership with Formosa Plastics Group to further develop the technology. I n 2008, Formosa Plastics successfully sued Dingel for fraud, with the 82-year-old Dingel being sentenced to 20 years imprisonment.[3]\n\nIn December 2011 a Pakistani doctor, Ghulam Sarwar claimed that he had invented a car that only runs on water.[38] At the time the invented car was claimed to use 60% water and 40% Diesel or fuel, but that the inventor was working hard to make it run on only water, probably by end of June 2012. It was further claimed that the car “emits only oxygen rather than the usual carbon“.[39]\n\nAgha Waqar Ahmad, a Pakistani, claimed in July 2012 to have invented water-fuelled car by installing a “water kit” for all kind of automobiles.[40][41] The kit consists of a cylindrical jar, which holds the water, a bubbler, and a pipe leading to the engine. He claims that the kit uses electrolysis to convert water into “HHO“, which is then used as fuel. The kit requires use of distilled water to work.[42] Ahmed claims that he has been able to achieve much higher amounts of oxyhydrogen compared to any other inventor because of “undisclosed calculations”.[43] He has applied for a patent in Pakistan.[43] Some Pakistani scientists alleged that Agha’s invention is nothing but a fraud as it violates the laws of thermodynamics", "opengraph": {"image": "http://anonhq.com/wp-content/uploads/2015/08/motorbike-water.png", "locale": "en_US", "type": "article", "title": "Motorbike that runs on WATER??", "url": "https://anonhq.com/motorbike-runs-water/", "site_name": "AnonHQ", "article:author": "https://www.youtube.com/channel/UCzGq5SaoXy7lduMTch2Wgeg", "article:published_time": "2022-04-16T18:05:45+00:00", "article:modified_time": "2022-04-17T03:52:41+00:00", "image:width": "900", "image:height": "500", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "536", "height": "536", "embed_code": "<iframe src=\"https://www.youtube.com/embed/hRo0bxDwusg\" width=\"536\" height=\"536\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/hRo0bxDwusg"}, {"embed_type": "iframe", "provider": "youtube", "width": "525", "height": "525", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/S-uN_dB7thI\" width=\"525\" height=\"525\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/S-uN_dB7thI"}], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.dailymail.co.uk/news/article-3169716/Motorcycle-runs-water-polluted-river-travel-310-miles-single-litre.html", "http://www.dailymail.co.uk/registration/1347656049767141/Mel-Bell/profile.html", "https://en.wikipedia.org/wiki/Water-fuelled_car", "https://en.wikipedia.org/wiki/Dallas_Morning_News", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-10", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-US2006676-11", "https://en.wikipedia.org/wiki/Carburetor", "https://en.wikipedia.org/wiki/Stanley_Meyer%27s_water_fuel_cell", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-US4936961-12", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-13", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-14", "https://en.wikipedia.org/wiki/Stanley_Meyer%27s_water_fuel_cell", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-15", "https://en.wikipedia.org/wiki/Electrical_resonance", "https://en.wikipedia.org/wiki/Internal_combustion_engine", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-Times-1", "https://en.wikipedia.org/wiki/Aneurysm", "https://en.wikipedia.org/wiki/Free_energy_suppression", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-Nature-7", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-16", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-17", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-18", "https://en.wikipedia.org/wiki/Oxyacetylene_welding", "https://en.wikipedia.org/wiki/Magnecule", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-19", "https://en.wikipedia.org/wiki/Hummer", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-20", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-21", "https://en.wikipedia.org/wiki/Hydrogen_fuel_enhancement", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-22", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-23", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-24", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-techon-25", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-reuters61308-26", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-cleantech-27", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-indiatimes-28", "https://en.wikipedia.org/wiki/Metal_hydride", "https://en.wikipedia.org/wiki/Water-fuelled_car#Hydrogen_on_demand_technologies", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-29", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-slashdot-30", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-31", "https://en.wikipedia.org/wiki/Chemical_reaction", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-32", "https://en.wikipedia.org/wiki/Popular_Mechanics", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-33", "https://en.wikipedia.org/wiki/REVAi", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-34", "https://en.wikipedia.org/wiki/Sri_Lanka", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-35", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-bime-36", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-37", "https://en.wikipedia.org/wiki/Ratnasiri_Wickremanayake", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-bime-36", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-SriFraud-4", "https://en.wikipedia.org/wiki/Daniel_Dingel", "https://en.wikipedia.org/wiki/Formosa_Plastics_Group", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-Dingel-3", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-38", "https://en.wikipedia.org/wiki/Oxygen", "https://en.wikipedia.org/wiki/Carbon", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-39", "https://en.wikipedia.org/wiki/Agha_Waqar%27s_water-fuelled_car", "https://en.wikipedia.org/wiki/Agha_Waqar%27s_Water_Fuelled_Car", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-WaterKit-40", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-WaterKit2-41", "https://en.wikipedia.org/wiki/Oxyhydrogen", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-42", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-autogenerated1-43", "https://en.wikipedia.org/wiki/Water-fuelled_car#cite_note-autogenerated1-43", "https://en.wikipedia.org/wiki/Thermodynamics", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2022-04-16T18:05:45+00:00"}