{"result_id": "337014", "URL": "https://anonhq.com/a-closer-look-into-vaccine-safety-and-scientific-integrity/", "timestamp": "2023-04-25 18:07:41 CEST+0200", "meta": {"description": "One of the major misunderstandings stressed throughout the documentary, is that those who are referred to as the “anti-vaxxers” are not against vaccinations", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/a-closer-look-into-vaccine-safety-and-scientific-integrity/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "A Closer Look into Vaccine Safety and Scientific Integrity", "cleaned_text": "In a potentially positive move from Trump, Robert F. Kennedy Jr., nephew of 35th President John F. Kennedy, has been appointed to lead a commission on vaccine safety and scientific integrity, according to a report from The March Against Monsanto. Kennedy’s appointment to this position could reform the vaccination process in the United States, which despite the documentation of often severe health issues that have escalated since the 1990s vaccination surge, is increasingly becoming mandatory. The controversy behind vaccination is often misunderstood, so we thought we’d take a closer look into the issue.\n\nIn the documentary, “The Greater Good” (linked below), both sides of the argument are outlined well, and one of the major misunderstandings stressed throughout the documentary, is that those who are referred to as the “anti-vaxxers” are not against vaccinations, but rather are against mandatory vaccinations – and this is for good reason. The following is a statement from Barbara Loe Fisher, President of the National Vaccine Information Center:\n\n“The only thing that we oppose, is forced vaccination – violation of the informed consent principal. Informed consent means that you have full information about the benefits and risks of any medical intervention that can harm you, and that you have the ability to make a voluntary decision about whether or not you’re going to accept that risk.”\n\nIt cannot be denied that vaccinations for conditions such as measles, mumps, and polio have been beneficial for society. However, what is less often mentioned is how these conditions were already starting to decline before the introduction of vaccinations – meaning there’s a likelihood that other advances in medicine, health, and society have played a contributing role. More importantly, what many don’t know is that these vaccinations often contain elements such as mercury and aluminum, and compounds such as formaldehyde. It is still unknown how the body processes these.\n\nAnother issue is that the amount of vaccinations given to children has increased tremendously over the last 20-30 years, and often at a younger age (see graph below). For example, in some states, it is now mandatory to give your infant a Hepatitis B vaccination, despite the fact infants are not susceptible to Hep-B. Girls as young as 9 were at one point required in the state of Texas to get HPV-vaccinations, such as Gardasil, which has had severe side-effects in some girls, including among them, the tragic story of Gabi Swank, who lost her life. Gardasil was only tested on 1200 girls under the age of 16 before being release to the public within 6 months.\n\nThere are many stereotypical arguments against those who oppose some, or all vaccinations, and unfortunately you can find these admittedly one-sided arguments in commonly used sources, such as Parents.com, or the Huffington Post’s ridiculous and slightly appalling article that tries to make anti-vaxxers appear stupid by comparing them to people who don’t like to use sunblock, microwaves or condoms. Those at Parents.com source agencies such as the CDC and the FDA, when in this case, they’re hardly reliable sources when they’ve been pinpointed as being part of the problem.\n\n“The majority of vaccine research is paid for by the vaccine manufacturers themselves. So the people who are approving the vaccines are taking the word of the pharmaceutical companies.”\n\n“The pharmaceutical companies have been allowed to be too present at the table at the FDA and the CDC, and I think a firewall needs to be built between those in government who are regulating, making policies for, and developing vaccines, and those pharmaceutical companies that are making profit off the sale of vaccines.”\n\n“The ACIP is the organization that approves vaccine policy for the United States, and you have some doctors on that board who have a direct financial interest in these vaccines. That’s a huge conflict of interest.”\n\nParents.com’s report mentions the fact that aluminum – one of the top ingredients used in half of vaccinations – can be found in breast milk and infant formula, however what their report fails to mention is that aluminum that has been ingested is excreted rapidly, whereas aluminum that has been injected is meant to stay in the system. They also argue that mercury is not linked to autism, which can be considered an accurate statement, but that’s only because they failed to elaborate that it does cause neurotoxicity (this is not disputed), and neurotoxicity in turn contributes to the damage that can cause autism.\n\nWhen the conflict of mandatory vaccination is reported in the news, the science is ignored. Instead, images of angry, protesting mothers are showcased against the researchers who support vaccinations as though that’s where the conflict rests; between a supposedly uninformed society and the science community. The issue is in fact between members of the science community and other members of the science community, and we’re in need of not only additional research, but additional scrutiny of the pharmaceutical industry.\n\nPeople are aware there are drugs out there that have now been proven unsafe to use, however when it comes to vaccinations – which are mandatory – people tend to make a separation, and they purposefully choose to forget how dangerous pharmaceutical drugs can be. We genuinely hope Kennedy can bring positive changes to the United States’ vaccination procedures and policies to ensure a healthy future for all citizens, rather than the current system of sacrificing the few for the good of the many.\n\nThis article ([Investigative] A Closer Look into Vaccine Safety and Scientific Integrity) is a free and open source. You have permission to republish this article under a license with attribution to the author and .\n\nSupporting Anonymous’ Independent & Investigative News is important to us. Please, follow us on Twitter:", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2017/01/iu-2.jpg", "locale": "en_US", "type": "article", "title": "A Closer Look into Vaccine Safety and Scientific Integrity", "description": "One of the major misunderstandings stressed throughout the documentary, is that those who are referred to as the “anti-vaxxers” are not against vaccinations", "url": "https://anonhq.com/a-closer-look-into-vaccine-safety-and-scientific-integrity/", "site_name": "AnonHQ", "article:published_time": "2017-02-01T00:00:50+00:00", "article:modified_time": "2017-02-01T00:01:27+00:00", "image:width": "1068", "image:height": "686", "image:type": "image/jpeg"}, "tags": ["The Greater Good", "childhood immunization", "vaccine safety", "Robert F Kennedy jr", "Vaccination"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "620", "height": "349", "embed_code": "<iframe src=\"https://www.youtube.com/embed/o_nWp6ZHA2Q\" width=\"620\" height=\"349\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/o_nWp6ZHA2Q"}], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.march-against-monsanto.com/donald-trump-appoints-rfk-jr-to-lead-commission-on-vaccine-safety-scientific-integrity/", "http://www.cbsnews.com/news/new-worries-about-gardasil-safety/", "http://www.greatergoodmovie.org/news-views/1596/", "https://anonhq.com/wp-content/uploads/2017/01/doses.jpg", "http://www.parents.com/health/vaccines/controversy/vaccines-the-reality-behind-the-debate/", "http://www.huffingtonpost.com/2015/04/07/anti-vaxxers-normal-people_n_7017814.html", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://twitter.com/AnonymousNewsHQ", "https://twitter.com/AnonymousNewsHQ", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-02-01T00:00:50+00:00"}