{"result_id": "337034", "URL": "https://anonhq.com/breakthrough-researchers-develop-cheap-universal-vaccine-cure-cancer/", "timestamp": "2023-04-25 18:07:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/breakthrough-researchers-develop-cheap-universal-vaccine-cure-cancer/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Breakthrough: Researchers Develop Cheap Universal Vaccine to Cure Cancer", "cleaned_text": "A groundbreaking study published in the journal Nature has showed that scientists have for the first time developed a universal cancer vaccine to cure the disease.\n\nCancer is one of the deadly diseases currently facing mankind. The Union for International Cancer Control estimates that the disease will kill more than eight million people worldwide this year, which is equivalent to the entire population of New York. Half of these will be people of working age (30-69 years old).\n\nIt is also estimated that the cost implications on world economies caused by cancer, and the other non-communicable diseases (including mental health), could be as high as USD47 trillion. This has sparked some urgency in the race to finding cure to the deadly disease. Researchers have been busy in the laboratory.\n\nThe researchers announced that this new vaccine was made possible after they figured out how to rewire the human immune cells to fight any type of disease. The process works involves injecting tiny particles of genetic code into the body, which then travel to the immune cells and teach them to recognize specific cancers.\n\nIn the past, scientists have proven that is it is possible to engineer immune cells outside the body so they can spot cancer. However, this current study is groundbreaking because it is the first time the engineering of the immune cells has happened inside the cells.\n\nThe authors of the study said because the genetic code could be programmed for any cancer, it means the technique could be universal. All doctors would need is the genetic profile of the tumor to make a custom-made vaccine, which as well as fighting the disease, would prevent it ever returning.\n\nAccording to the procedure the researcher used to arrive at the results, the research team focused on a class of immune cells known as Dendritic Cells, which are constantly on the look-out for foreign invaders in the body. Once a Dendritic Cell spots a rogue cell like cancer, it captures molecules from the surface and presents it to killer T-cells to instruct it to begin fighting the disease.\n\nAccording to experts, cancer cells look very similar to normal cells and so the immune system often avoids them. This has been a headache for researchers.\n\nBut this new technology involves placing a small piece of genetic code in a nanoparticle and giving it a slightly negative charge so it is drawn to Dendritic Immune Cells in the spleen, lymph nodes and bone marrow. Once there, it orders the creation of a cancer molecule known as an antigen, which is then used as a biological mugshot so that immune cells know what to look out for. The authors proved that it triggers a strong T-cell response and starts fighting tumors.\n\nThe vaccine has so far been tested in mice and three skin cancer patients. In the mice, the vaccine triggered a strong immune response; while it showed that the treatment could be tolerated on the skin of the three cancer patients.\n\nLead author of the study, Prof. Ugur Sahin said the study has brought hope, adding that it very quick and cheap to produce the vaccine. He was quoted as saying: “The vaccines are fast and inexpensive to produce, and virtually any tumor antigen can be encoded by RNA. The approach introduced here may be regarded as a universally applicable novel vaccine class for cancer immunotherapy.” Prof. Sahin is the managing director of Translational Oncology at the University Medical Centre of the Johannes Gutenberg University in the city of Mainz, Germany.\n\nThe senior science information officer at Cancer Research in the United Kingdom, Dr Aine McCarthy welcomed the findings of the study, urging that more clinical trials should be carried out. Dr McCarthy told the Telegraph in an interview: “By combining laboratory-based studies with results from an early-phase clinical trial, this research shows that a new type of treatment vaccine could be used to treat patients with melanoma by boosting the effects of their immune systems. Because the vaccine was only tested in three patients, larger clinical trials are needed to confirm it works and is safe, while more research will determine if it could be used to treat other types of cancer.”\n\nYou want to support Anonymous Independent & Investigative News? Please, follow us on Twitter: Follow @AnonymousNewsHQ\n\nThis article (Breakthrough: Researchers Develop Cheap Universal Vaccine to Cure Cancer) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/06/istock_000019041370_large1.jpg", "locale": "en_US", "type": "article", "title": "Breakthrough: Researchers Develop Cheap Universal Vaccine to Cure Cancer", "url": "https://anonhq.com/breakthrough-researchers-develop-cheap-universal-vaccine-cure-cancer/", "site_name": "AnonHQ", "article:published_time": "2016-06-05T21:20:09+00:00", "article:modified_time": "2016-06-05T21:24:19+00:00", "image:width": "1200", "image:height": "600", "image:type": "image/jpeg"}, "tags": ["Cancer breakthrough"], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://nature.com/articles/doi:10.1038/nature18300", "http://nature.com/articles/doi:10.1038/nature18300", "http://www.telegraph.co.uk/science/2016/06/01/universal-cancer-vaccine-on-horizon-after-genetic-breakthrough/?cid=sf27662015+sf27662015", "http://www.worldcancerday.org/wcd2016-global-press-release", "https://anonhq.com/wp-content/uploads/2016/06/s-1-2-e1464859190233.jpg", "https://anonhq.com/wp-content/uploads/2016/06/s-4....-e1464859161127.jpg", "https://anonhq.com/wp-content/uploads/2016/06/s-2-1-e1464859208732.jpg", "http://www.telegraph.co.uk/science/2016/06/01/universal-cancer-vaccine-on-horizon-after-genetic-breakthrough/?cid=sf27662015+sf27662015", "https://twitter.com/AnonymousNewsHQ", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-06-05T21:20:09+00:00"}