{"result_id": "337010", "URL": "https://anonhq.com/not-just-austism-major-yale-study-shows-vaccines-tied-multiple-brain-disorders/", "timestamp": "2023-04-25 18:07:37 CEST+0200", "meta": {"description": "Scientist found a strong correlation between vaccines and developing a brain disorder such as OCD, anorexia, ADHD, and major depressive disorders.", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/not-just-austism-major-yale-study-shows-vaccines-tied-multiple-brain-disorders/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Not Just Autism, Major Yale Study Shows Vaccines Tied To Multiple Brain Disorders", "cleaned_text": "Scientist found a strong correlation between vaccines and developing a brain disorder such as OCD, anorexia, ADHD, and major depressive disorders.\n\nIt is no question that the subject of vaccines is profoundly controversial. On both sides of the argument exist truths and lies that can hinder the ability of some to make rational decisions.\n\nFor the last 50 years, the world has taken a front row seat to the phenomenological occurrences of the rise of brain disorders such as Autism, ADHD, and major depressive disorders. Anecdotally speaking, parents all over the globe have reported that one day their children were normal and growing healthily, and the next, after having gotten their vaccinations, they get Autism, or ADHD, for example.\n\nWhile science and the government continue to maintain there’s no causal relation between the vaccines and the disorders, parents, multiple studies, and other countries have reported otherwise. Now, it seems, some very brave and unabashed scientists have been able to show a correlation of what many have known for quite some time.\n\nIt has also been proven that CDC scientists destroyed data that showed a correlation between vaccines and autism in children.\n\nResearchers at Pennsylvania State and Yale University sought to examine, “whether antecedent vaccinations are associated with increased incidence of obsessive–compulsive disorder (OCD), anorexia nervosa (AN), anxiety disorder, chronic tic disorder, attention deficit hyperactivity disorder, major depressive disorder, and bipolar disorder in a national sample of privately insured children.”\n\nControlling for broken bones and open wounds (control means to use commonly occurring instances as a contrast method), the researchers concluded that someone who’d received the Flu vaccine within the last year “were also associated with incident diagnoses of AN, OCD, and an anxiety disorder.” These findings greatly expand the common understandings that vaccines are related to Autism and now include the other three brain-based illnesses.\n\nThe study used private insurance claims information as their means of collecting the data. “Using claims data, we compared the prior year’s occurrence of vaccinations in children and adolescents aged 6–15 years with the above neuropsychiatric disorders that were newly diagnosed between January 2002 and December 2007,” the study writes.\n\nMoreover, the correlations were not limited to the Flu vaccine either. According to the published study found in the Journal Frontiers in Psychiatry, “Several other associations were also significant with HRs greater than 1.40 (hepatitis A with OCD and AN; hepatitis B with AN,” meaning the hepatitis vaccines are also implicated in causing brain disorders.\n\nAs with most research studies, the researchers stop short of claiming the vaccinations cause the all too common brain disorders. “This pilot epidemiologic analysis implies that the onset of some neuropsychiatric disorders may be temporally related to prior vaccinations in a subset of individuals,” they write adding the, “findings warrant further investigation, but do not prove a causal role of antecedent infections or vaccinations in the pathoetiology of these conditions.”\n\nThe researchers also warn against the public deciding not to vaccinate their children. “Given the modest magnitude of these findings in contrast to the clear public health benefits of the timely administration of vaccines in preventing mortality and morbidity in childhood infectious diseases, we encourage families to maintain vaccination schedules according to CDC guidelines,” they conclude.\n\nWhile we have everyone from attorneys to biologists, to political scientists who write for the Free Thought Project, none of us are doctors, so we do not make recommendations about what you and your family should do in regards to vaccination. That being said, the drug makers have an incentive for you not to see this information which means it will not be reported on in the mainstream media as their advertising dollars are tied directly to these companies. So, we find that it is our duty to spread this information and with your help sharing it, we can have a massive effect.\n\nWhat are your thoughts? Please comment below and share this news!\n\nThis article (Not Just Austim, Major Yale Study Shows Vaccines Tied To Multiple Brain Disorders) by Jack Burns is free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and TheFreeThoughtProject.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2017/02/photo_2017-02-12_23-33-16-e1486960457353.jpg", "locale": "en_US", "type": "article", "title": "Not Just Autism, Major Yale Study Shows Vaccines Tied To Multiple Brain Disorders", "description": "Scientist found a strong correlation between vaccines and developing a brain disorder such as OCD, anorexia, ADHD, and major depressive disorders.", "url": "https://anonhq.com/not-just-austism-major-yale-study-shows-vaccines-tied-multiple-brain-disorders/", "site_name": "AnonHQ", "article:published_time": "2017-02-13T22:16:36+00:00", "image:width": "730", "image:height": "379", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://thefreethoughtproject.com/author/jburns/", "http://thefreethoughtproject.com/", "http://thefreethoughtproject.com/cdc-scientist-admits-destroyed-data-showed-vaccines-caused-autism-children/", "http://journal.frontiersin.org/article/10.3389/fpsyt.2017.00003/full", "http://www.trueactivist.com/not-just-austim-major-yale-study-shows-vaccines-tied-to-multiple-brain-disorders/", "http://thefreethoughtproject.com/author/jburns/", "http://creativecommons.org/licenses/by/4.0/", "http://thefreethoughtproject.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-02-13T22:16:36+00:00"}