{"result_id": "337006", "URL": "https://anonhq.com/iran-promises-wipe-off-israel-trump-starts-war-middle-east/", "timestamp": "2023-04-25 18:07:34 CEST+0200", "meta": {"description": "Iran has threatened to attack Israel if Trump starts a war in the Middle East", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/iran-promises-wipe-off-israel-trump-starts-war-middle-east/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Iran Promises to Wipe Out Israel Should Trump Start a War in the Middle East", "cleaned_text": "Israel considers Iran to be its biggest Middle Eastern enemy. Because Iran has maintained that Israel should end its aggression and grant the people of Palestine their freedom, the Israelis claim Iran is interfering in their internal affairs.\n\nThe protracted conflict between the Israelis and the Palestinians is an international concern. Therefore, speaking against aggression on behalf of the Palestinians is in no way interfering in the internal affairs of the country, nor is it committing heinous crimes.\n\nSince Donald Trump took office, tension has mounted between Iran and Israel, and Iran and the United States. The tension, some say, is because Israel wants to influence Trump into starting a war between the United States and Iran.\n\nBefore the Obama administration left office, it reached a nuclear deal, together with five other world powers and Iran. As part of the deal, Iran agreed to reduce the number of its centrifuges by two-thirds, cap its uranium enrichment below the level needed for weapons-grade material, reduce its enriched uranium stockpile by 98% from around 10,000kg to 300kg for 15 years, and allow international inspections.\n\nIn return, international sanctions against Iran, due to its nuclear activities, would be lifted. Although Israel and the United States are close allies, the latter years of the Obama administration policies with Israel left the nations tense. The Obama administration demanded that Israel end its illegal occupation on Palestinian lands without any conditions, nearly halting the relationship between the two countries.\n\nWhen the Iranian nuclear deal was reached, Israeli Prime Minister Benjamin Netanyahu openly called it a “bad deal.” The Israelis, knowing they had lost the Obama administration’s support, switched sides to help Trump secure the White House – since they believed Hillary Clinton was likely to follow the foreign policy left by Mr Obama.\n\nTrump himself also criticized the Iran nuclear deal when he campaigned for the presidency, promising to tear it up if elected. He called it “disastrous” and the “worst deal ever negotiated.”\n\nSpeaking at the American Israel Public Affairs Committee conference during his campaign, Trump said his number one priority was to dismantle the deal once he got into office.\n\nHaving Trump on their side, the Israelis are now planning to use the United States to spark a war with Iran. Israel’s influence on the Trump administration is so great that it has set the United States at odds with Iran.\n\nIn February, James Mattis, the United States Defense Secretary, called Iran the single biggest state sponsor of terrorism in the world. President Trump added Iran to his ban, which was later reversed by a unanimous vote in the courts.\n\nAmong these threats, name calling and trying to ban Iranian citizens from entering the United States; the Iranians believe Israel might succeed in misleading Trump into starting a Middle Eastern war. According to the Iranians, this United States war would primarily target their country.\n\nIn response to these concerns, Iran issued a stern warning to Israel, to be careful with how it is pushing their agenda on Trump to start a conflict.\n\nThe Iranian Defense Minister, Hossein Dehghan, told state media that Trump’s election as President of the United States has led to “unease” between Iran and the United States. Mr Dehghan blamed Israel for fanning the flame of war between Iran and the United States, warning that if Trump does attack, it would allow Iran to destroy Israel with advanced weapons. He admitted this could lead to World War III.\n\n“Enemies may want to impose a war on us based on false calculations and only taking into consideration their material capabilities. If such a war were to occur, it would mean the destruction of the Zionist regime [Israel]…and will engulf the whole region and could lead to a world war,” Dehghan said.\n\nMr Netanyahu and his government reportedly met to deliberate on the statement, but refused to publicly comment. Already, Israel firmly believes that Iran has developed a nuclear weapon. The warning sounded by Iran will lead to more verbal attacks from Trump. It seems clear that the Israelis have firmly secured the White House. Don’t forget that Trump’s daughter Ivanka is married to Jared Kushner—who has a Jewish decent. Kushner is now serving as a senior to his father-in-law, President Trump. He practices Modern Orthodox Judaism, and has converted Ivanka to his faith.\n\nThis article (Iran Promises to Wipe Out Israel Should Trump Start a War in the Middle East) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.\n\nSupporting Anonymous’ Independent & Investigative News is important to us. Please, follow us on Twitter:", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2017/02/s-6-12-e1487797346326.jpg", "locale": "en_US", "type": "article", "title": "Iran Promises to Wipe Out Israel Should Trump Start a War in the Middle East", "description": "Iran has threatened to attack Israel if Trump starts a war in the Middle East", "url": "https://anonhq.com/iran-promises-wipe-off-israel-trump-starts-war-middle-east/", "site_name": "AnonHQ", "article:published_time": "2017-02-23T21:17:55+00:00", "image:width": "750", "image:height": "426", "image:type": "image/jpeg"}, "tags": ["nuclear power", "Trump", "iran", "WWIII", "israel", "war", "Iran Israel conflict"], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://anonhq.com/wp-content/uploads/2017/02/s-1-29.jpg", "https://www.congress.gov/bill/115th-congress/house-joint-resolution/10/text", "https://anonhq.com/wp-content/uploads/2017/02/s-2-29-e1487797437540.jpg", "https://anonhq.com/wp-content/uploads/2017/02/s-4-29-e1487797401102.jpg", "https://anonhq.com/wp-content/uploads/2017/02/s-3-28-e1487797419747.jpg", "http://www.independent.co.uk/news/world/americas/iran-worlds-biggest-sponsor-terrorism-us-donald-trump-james-mattis-nuclear-test-missile-sanctions-a7563081.html", "https://www.rt.com/news/370006-israel-iran-deal-trump/", "https://anonhq.com/wp-content/uploads/2017/02/s-7-6-e1487797311988.jpg", "https://anonhq.com/wp-content/uploads/2017/02/s-5-28-e1487797387122.jpg", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://twitter.com/AnonymousNewsHQ", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-02-23T21:17:55+00:00"}