{"result_id": "337037", "URL": "https://anonhq.com/adrenochrome-conspiracy-or-a-dark-secret/", "timestamp": "2023-04-25 18:08:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/adrenochrome-conspiracy-or-a-dark-secret/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Adrenochrome - Conspiracy or A Dark Secret?", "cleaned_text": "And if you’re wondering why it is important to pay attention to this sort of thing, well, let’s start with the fact that more than two dozen congressional candidates have shared QAnon material or even appeared on QAnon shows. Like it or not, there are signs the group’s influence is growing.\n\nLet’s explain what adrenochrome is, what QAnon wants you to believe it is, but is definitely not, and what’s the harm in believing in such misinformation.\n\nAdrenochrome is a chemical that’s a byproduct of adrenaline. That’s it. It turns out you don’t need to kidnap children and drain their blood. There are many trusted chemical suppliers, in fact—which we won’t be linking to, sorry—that sell it.\n\nBack in the ’50s, scientists speculated that adrenochrome caused schizophrenia. Take a megadose of vitamin C, one researcher concluded, and adrenochrome along with schizophrenia should vanish. That…didn’t work, alas.\n\nBut the lack of real science didn’t stop adrenochrome from sounding cool enough to make it into drug lit classics like Aldous Huxley’s The Doors of Perception and Anthony Burgess’ A Clockwork Orange.\n\nThe source of the myth that you need to steal adrenochrome from a corpse goes back to a fun scene in Fear and Loathing in Las Vegas, in which Dr. Gonzo, Hunter S. Thompson’s “attorney,” says adrenochrome “makes pure mescaline seem like ginger beer.” Later, it is explained that “there’s only one source for this stuff—the adrenaline gland from a living human body.” It’s an easy mistake to make, but please know that Fear and Loathing in Las Vegas is not a documentary feature made from archival footage of actual events.\n\nWhat does QAnon think adrenochrome is?\n\nIn short, QAnon followers believe there is an operative in the deep state called Q, and Q leaves secret messages called “Q drops.” Some think that Q is none other than JFK, Jr., who is very much alive today and was supposed to October Surprise us as Trump’s running mate. (He did not.)\n\n“A central conspiracy theory circulating within the QAnon movement is that deep state Satan-worshipping pedophilic liberals are behind an international child sex trafficking ring,” says Joseph Pierre, the acting chief of mental health community care systems at the VA Greater Los Angeles Healthcare System. “A more fringe aspect of that theory is that they are harvesting adrenochrome from children and then self-administering it as a kind of fountain-of-youth potion.”\n\nTo hear it in their own words, as reported by Right Wing Watch, the conspiracy theorist Liz Crokin says in a video, “Adrenochrome is a drug that the elites love. It comes from children. The drug is extracted from the pituitary gland of tortured children. It’s sold on the black market. It’s the drug of the elites. It is their favorite drug.”\n\nOther QAnon conspiracy theorists, which again we are not going to promote by linking to here, use adrenochrome to explain why there are so many missing children worldwide. They also claim that Hillary Clinton and former aide Huma Abedin were caught on tape ripping off a child’s face, wearing it as a mask, and drinking the child’s blood to obtain adrenochrome. (Yes, really.)\n\nWhy does it matter that anyone believes this conspiracy is real?\n\nThere’s an old saying that you should never attribute to malice that which can be explained by stupidity, but in the case of QAnon, their conspiracy theories are a generous helping of both. “QAnon is tapping into both conservative mistrust of liberals as well as the ubiquity of misinformation out there,” Pierre says.\n\nWhat’s different about QAnon is that the conspiracy theory is targeting the party that is not in power. “What’s weird is that these kinds of right-wing conspiracy theories more typically arise when a Democrat is in the White House—as in, for example, the militia movement of the 1990s, which faded in influence once George W Bush was elected,” says Mark Fenster, professor of law at UF and author of Conspiracy Theories: Secrecy and Power in American Culture.\n\nBelieving that liberal elites are drinking dead child blood instead of just going to Oregon for shrooms may seem outrageous, but for some it is just one piece in a big puzzle that they are solving with their friends to take down the people they hate.\n\n“Conspiracy theories can be like drugs,” says Brian Houston, director of the Disaster and Community Crisis Center at the University of Missouri. “If they are doing something for you psychologically, you often need more and more of that to get your fix. So the conspiracy theories just get crazier and crazier.”\n\nThe problem is that belief in something like adrenochrome and Q can translate into action, or inaction. “Belief in misinformation, and more importantly acting on misinformation, always carries a potential of danger. When it comes to misinformation in the form of conspiracy theories, that danger might be avoiding vaccination, leading to outbreaks of measles, or failure to contain COVID-19,” says Pierre.\n\nAccording to Timothy Caulfield, Canada Research Chair in Health Law and Policy at the University of Alberta, who studies misinformation, we’re in a “golden age” of the stuff right now. The problem of inaccurate information being spewed so quickly and at such a high volume these days led the World Health Organization to declare in early 2020 that we’re in the middle of an “infodemic.” Especially when it’s laced with sensationalism, misinformation like the adrenochrome conspiracy theory tends to spread faster and farther than boring, fact-based information.\n\n“The extremism of QAnon means that violence is always possible. Pizzagate illustrated that,” adds Houston, referencing a man shooting, and thank God not killing anyone, inside a Washington, D.C., pizzeria because he believed there was a child sex ring operating there.\n\nBut there’s an even more common danger to people believing in conspiracy theories like adrenochrome harvesting and hunting the internet for Q drops, Pierre says.\n\n“People who fall down the rabbit hole of QAnon are usually neglecting their real lives, jobs, social relationships in favor of spending hours and hours on the internet, working themselves into a kind of self-radicalizing frenzy about the state of the world that isn’t congruent with reality.”", "opengraph": {"image": "http://anonhq.com/wp-content/uploads/2022/05/adrenochrome.jpg", "locale": "en_US", "type": "article", "title": "Adrenochrome - Conspiracy or A Dark Secret?", "url": "https://anonhq.com/adrenochrome-conspiracy-or-a-dark-secret/", "site_name": "AnonHQ", "article:published_time": "2022-05-05T13:18:06+00:00", "article:modified_time": "2022-05-05T13:18:43+00:00", "image:width": "1600", "image:height": "900", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cnn.com/interactive/2020/10/politics/qanon-cong-candidates/", "https://anonhq.com/wp-content/uploads/2022/05/200814-hitt-hollywood-blood-hero_mugwbc.jpg", "https://www.cambridge.org/core/journals/journal-of-mental-science/article/adrenochrome-as-the-cause-of-schizophrenia-investigation-of-some-deductions-from-this-hypothesis/8CD098ECD668B1E3636589C13AEA0214", "https://anonhq.com/wp-content/uploads/2022/05/Fear-and-Loathing-in-Las-Vegas-10_10-Movie-CLIP-Too-Much-Adrenochrome-1998-HD-2-21-screenshot-600x294-1.webp", "https://www.youtube.com/watch?v=m6kFCNsnQpQ", "https://www.rollingstone.com/culture/culture-features/qanon-jfk-jr-conspiracy-theory-854938/", "https://anonhq.com/wp-content/uploads/2022/05/GettyImages_1010070276.jpg", "https://www.rightwingwatch.org/post/liz-crokin-claims-celebrities-are-getting-coronavirus-from-tainted-adrenochrome-supply/", "https://www.oregonlive.com/politics/2020/11/oregon-becomes-first-state-to-legalize-psychedelic-mushrooms.html", "https://www.nytimes.com/2017/06/22/us/pizzagate-attack-sentence.html"], "authors": [""], "publish_date": "2022-05-05T13:18:06+00:00"}