{"result_id": "337043", "URL": "https://anonhq.com/eradicating-pedophilia-single-injection-stops-pedophiles-abusing-children/", "timestamp": "2023-04-25 18:08:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/eradicating-pedophilia-single-injection-stops-pedophiles-abusing-children/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Pedophilia Vaccine: This Single Injection Stops Pedophiles from Abusing Children", "cleaned_text": "Researchers at the Karolinksa Institute in Sweden have identified an existing drug known as degarelix, which is capable of preventing pedophiles from abusing children.\n\nDegarelix is a hormone therapy drug, which is currently used in the treatment of prostate cancer. It blocks brain signals which stimulate the testicles to produce testosterone. The drug is administered by simply injecting it into the pedophile.\n\nAccording to health experts, testosterone is link to high sexual arousal, diminished self-regulation and low empathy. The drug blocks receptors in the limbic system of the brain which promote anger.\n\nThe Telegraph reports that drugs have been used in the past to chemically castrate sexual offenders. But it is always done after the abuse has taken place. Aside this weakness, many of the drugs used also have serious side effects such as breast growth, bone thinning, and mood changes.\n\nHowever, the new treatment using degarelix would work before a crime has been committed. Researchers said they hope that men who mostly sexually abuse children will voluntarily ask for treatment.\n\nThe researchers said they have already carried out a research, which indicates that many pedophiles want help, and will therefore volunteer to be treated with the new drug.\n\n“In 2012 we raised money to establish a telephone line where people who are worried about their own sexuality can call and talk to a professional. We have the proof of principle that people with these worries really want help, and we have shown if help is offered people will come forward,” assistant Professor, Stefan Arver who took part of the study said.\n\nThe drug has been tested on five Swedish pedophile men who voluntary called a sexual offenders helpline, in order to get treated of their sexual inclinations.\n\nThe researchers said the initial trials showed that after three days, the men had no detectable levels of testosterone, and within two weeks their risk of abusing children, had dropped substantially.\n\nThe effect of the drug lasts for three months, and another injection could be given afterwards if sexually inappropriate behavior and thoughts returned to the person.\n\nAccording to the researchers, their study of the drug is only exclusive for men because men are the ones who mostly sexually abuse children. They admitted that some women also sexually abuse children, but it is a small proportion, and not such a problem as compared to men.\n\nStatistics show that between one in 20, and one in 35 men are sexually attracted to pre-pubescent children. Due to the high rate of the figure, researchers believed it could be as a result of orientation in the same way as homosexuality or heterosexuality.\n\nCurrently, the research team is trying to identify biomarkers which could indicate if a person was prone to pedophilia. Last year, researchers from the Karolinska Institute and Oxford University found that 40 per cent of the risk of committing a sex crime is genetic, with the remaining 60 per cent down to personal and environmental factors, such as being abused as a child.\n\nIn the United Kingdom alone, more than 36,000 sexual offences were recorded against children in 2015. The Home Office estimates that the cost associated with each child sexual offence is around £37,000. This includes the costs of police investigation, legal proceedings and medical treatment.\n\nThe Swedish researchers are far advanced with their study, and they believe that they will soon get results. However, the only difficulty they are facing now is finance. Nobody is funding the research.\n\nThey have therefore launched a project known as Paedophilia at Risk – Investigations of Treatment and Biomarkers – on the crowdfunding site Walacea. The Researchers need about £38,000 to fund the project. You can click here to support the project. Let us all help in order to get pedophilia disorders out from the society.\n\nYou want to support Anonymous Independent & Investigative News? Please, follow us on Twitter: Follow @AnonymousNewsHQ\n\nThis article (Eradicating Pedophilia: This Single Injection Stops Pedophiles from Abusing Children) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.", "opengraph": {"image": "http://anonhq.com/wp-content/uploads/2016/04/s-1-9-e1460117329104.jpg", "locale": "en_US", "type": "article", "title": "Pedophilia Vaccine: This Single Injection Stops Pedophiles from Abusing Children", "url": "https://anonhq.com/eradicating-pedophilia-single-injection-stops-pedophiles-abusing-children/", "site_name": "AnonHQ", "article:published_time": "2022-04-23T14:45:30+00:00", "article:modified_time": "2022-04-25T02:33:23+00:00", "image:width": "600", "image:height": "375", "image:type": "image/jpeg"}, "tags": ["Pedophiles"], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://ki.se/en/startpage", "http://www.reuters.com/article/us-science-paedophilia-trial-idUSKCN0X32S2", "http://www.telegraph.co.uk/science/2016/04/06/single-injection-could-stop-paedophiles-abusing-children/?cid=sf23904821&sf23904821=1", "https://anonhq.com/wp-content/uploads/2016/04/s-3-10-e1460117352314.jpg", "https://anonhq.com/wp-content/uploads/2016/04/s-2-10-e1460117340325.jpg", "http://www.telegraph.co.uk/news/uknews/11690451/One-in-35-men-has-paedophile-tendencies-crime-agency-claims.html", "http://www.telegraph.co.uk/news/2016/04/06/sex-offending-is-written-in-dna-of-some-men-oxford-university-fi/", "https://anonhq.com/wp-content/uploads/2016/04/s-4-8-e1460117316299.jpg", "http://walacea.com/campaigns/priotab-to-treat-paedophilia/", "http://walacea.com/campaigns/priotab-to-treat-paedophilia/", "https://twitter.com/AnonymousNewsHQ", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2022-04-23T14:45:30+00:00"}