{"result_id": "337045", "URL": "https://anonhq.com/what-does-marijuana-do-to-your-lungs/", "timestamp": "2023-04-25 18:08:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/what-does-marijuana-do-to-your-lungs/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "What Does Marijuana Do To Your Lungs?", "cleaned_text": "Since tobacco smoking causes cancer, marijuana smoking must as well. Right? Wrong.\n\nMarijuana decreases the risk of lung cancer. Marijuana does not cause chronic obstructive pulmonary disease (COPD). Thus, Pot is safer than cigarettes.\n\nProfessor emeritus of medicine at UCLA and one of the United States’ leading pulmonologists who has been studying weed and its effects on lungs for more than 30 years, Dr. Donald Tashkin once sought to prove pot causes lung cancer, but the evidence forced him to conclude that average weed smoking does not cause lung cancer or impair lung function:\n\n“The smoke content of marijuana is very similar to that of tobacco. There is a higher concentrate of cancer-causing chemicals in marijuana tar, and it reaches the lungs before any other organ, so there is this idea that they are related in causing the same health issues of the lungs. But through my studies we failed to find any positive association [with cancer]. Instead, the association would be negative, between lung cancer and the use of marijuana. The likelihood is, that despite the fact that marijuana smoke contains carcinogens, we don’t see the same heightened risks of cancers that we see in tobacco.”\n\nDr. Tashkin is not alone in his analysis. To investigate the association between cannabis smoking and lung cancer risk, data on 2,159 lung cancer cases and 2,985 controls were pooled from 6 case-control studies in the US, Canada, UK, and New Zealand within the International Lung Cancer Consortium. Results from the pooled analyses in 2014 provided little evidence for an increased risk of lung cancer among habitual or long-term cannabis smokers.\n\n“I was opposed to legalization because I thought it would lead to increased use and that would lead to increased health effects. But at this point, I’d be in favor of legalization. I wouldn’t encourage anybody to smoke any substances. But I don’t think it should be stigmatized as an illegal substance. Tobacco smoking causes far more harm. And in terms of an intoxicant, alcohol causes far more harm.” – Dr. Tashkin\n\nDr. Tashkin also found that smoking marijuana, unlike smoking tobacco, does not cause COPD.\n\n“Reasoning for this may be that marijuana is a potent anti-inflammatory and suppressive. But COPD is activated by tobacco smoke and other toxic substances. The other major impact of tobacco smoking on the lungs is the association between smoking tobacco and the development of destructive pulmonary disease, the third cause of death in America.”\n\nAgain, his current findings echo results from previous research. In a large cross-sectional analysis of US adults aged 18 to 59 using data from two rounds of the National Health and Nutrition Examination Surveys (NHANES), researchers from Georgia’s Emory University found in 2015 that occasional and low cumulative marijuana use was not associated with adverse effects on pulmonary function.\n\nCumulative lifetime marijuana use, up to 20 joint-years, is not associated with adverse changes in spirometric [a person’s ability to exhale] measures of lung health. Although greater than 20 joint-years of cumulative marijuana exposure was associated with a twofold increased odds of a FEV1/FVC less than 70%, this was the result of an increase in FVC [forced vital capacity], rather than a disproportional decrease in FEV1 [forced expiratory volume]as is typically associated with obstructive lung diseases.\n\nThe largest and longest study ever to consider the issue [Researchers tested the lung function of 5115 young adults over the course of 20 years, starting in 1985 when they were aged 18 to 30], published in 2012 in the Journal of the American Medical Association, found that occasional marijuana smoking does not impair lung function.\n\nMarijuana may have beneficial effects on pain control, appetite, mood, and management of other chronic symptoms. Our findings suggest that occasional use of marijuana for these or other purposes may not be associated with adverse consequences on pulmonary function.\n\n“Tobacco contains over 4,000 toxic substances which destroys your lungs. Marijuana for all we know is less toxic, probably contains up to 400 but the combination of smoking marijuana and tobacco they interact and it changes the whole thing into a poison. A poison which destroys the structure and function of the lungs with a lot of consequences.”\n\nMarijuana use alone doesn’t cause significant abnormalities to the lungs\n\nAllen St. Pierre, executive director of the National Organization to Reform Marijuana Laws, told ThinkProgress:\n\n“If we’re serious public policy people, we would let the scientists figure this out. Does one set of vegetative matter produce a certain range of carcinogens? If so, to what degree and amount? How do people consume it? This entire discussion should be based on science. But the laughable thing is that the government is against this type of research. All we have are anecdotes but we need science that meets the standards of a proper peer review.”\n\nThis Article (What Does Marijuana Do To Your Lungs?) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.", "opengraph": {"image": "http://anonhq.com/wp-content/uploads/2022/04/jpg_20220424_233254_0000.jpg", "locale": "en_US", "type": "article", "title": "What Does Marijuana Do To Your Lungs?", "url": "https://anonhq.com/what-does-marijuana-do-to-your-lungs/", "site_name": "AnonHQ", "article:published_time": "2022-04-24T00:05:21+00:00", "article:modified_time": "2022-04-24T21:35:44+00:00", "image:width": "1200", "image:height": "600", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" lang=\"en\"><p dir=\"ltr\" lang=\"en\">I’ll never understand how marijuana is illegal but Tobacco which ruins your lungs &amp; alcohol which ruins your liver are legal</p><p>— Izabel Zambrano (@IzabelZambrano) <a href=\"https://twitter.com/IzabelZambrano/status/685312085002039296\">January 8, 2016</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" lang=\"en\"><p>The <a href=\"https://twitter.com/hashtag/Push?src=hash\">#Push</a> for <a href=\"https://twitter.com/hashtag/Legal?src=hash\">#Legal</a> <a href=\"https://twitter.com/hashtag/Marijuana?src=hash\">#Marijuana</a> Spreads <a href=\"https://twitter.com/hashtag/Bernie2016?src=hash\">#Bernie2016</a> <a href=\"https://t.co/LVKFowqpcH\">https://t.co/LVKFowqpcH</a></p><div id=\"eaa_post_between_content\" class=\"eaa-wrapper eaa_post_between_content eaa_desktop\"><div class=\"eaa-ad  \" style=\"\"><p id=\"M449061ScriptRootC702934\"/>   </div></div><p>— Vote Bernie 2016 (@Bernie_Sanders_) <a href=\"https://twitter.com/Bernie_Sanders_/status/686683281480400897\">January 11, 2016</a></p></blockquote>", "<blockquote class=\"twitter-tweet\" lang=\"en\"><p dir=\"ltr\" lang=\"en\">Lets all just acknowledge that marijuana has medical benefits, but also smoking literally anything is still god-awful for your lungs. <a href=\"https://twitter.com/hashtag/eatit?src=hash\">#eatit</a></p><p>— Johnathan Sainz (@Insainz27) <a href=\"https://twitter.com/Insainz27/status/685844785886711808\">January 9, 2016</a></p></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "630", "height": "473", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/GJmQ16cGBHU?rel=0\" width=\"630\" height=\"473\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/GJmQ16cGBHU?rel=0"}, {"embed_type": "iframe", "provider": "youtube", "width": "630", "height": "473", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/_6pBw0bgmgA?rel=0\" width=\"630\" height=\"473\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/_6pBw0bgmgA?rel=0"}], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.laweekly.com/music/ucla-professor-finds-marijuana-is-safer-to-smoke-than-tobacco-5658317", "https://anonhq.com/wp-content/uploads/2016/01/lung-diagram-whole-lung.jpg", "http://onlinelibrary.wiley.com/doi/10.1002/ijc.29036/abstract", "https://patients4medicalmarijuana.wordpress.com/marijuana-info/marijuana-and-your-lungs-recent-studies/", "https://twitter.com/IzabelZambrano/status/685312085002039296", "http://www.ncbi.nlm.nih.gov/pubmed/23802821", "http://www.attn.com/stories/1962/smoking-marijuana-effects-on-lungs", "https://anonhq.com/wp-content/uploads/2016/01/peoplewhovesmoked.jpg", "http://www.ncbi.nlm.nih.gov/pubmed/25521349", "https://twitter.com/hashtag/Push?src=hash", "https://twitter.com/hashtag/Legal?src=hash", "https://twitter.com/hashtag/Marijuana?src=hash", "https://twitter.com/hashtag/Bernie2016?src=hash", "https://t.co/LVKFowqpcH", "https://twitter.com/Bernie_Sanders_/status/686683281480400897", "http://www.cbsnews.com/news/is-smoking-marijuana-bad-for-your-lungs/", "http://healthland.time.com/2012/01/10/study-smoking-marijuana-not-linked-with-lung-damage/", "http://www.stlucianewsonline.com/marijuana-plus-tobacco-equals-lung-poison-dr-didier/", "https://twitter.com/hashtag/eatit?src=hash", "https://twitter.com/Insainz27/status/685844785886711808", "http://thinkprogress.org/health/2015/01/22/3614459/new-pot-research/", "https://anonhq.com/?p=46062", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2022-04-24T00:05:21+00:00"}