{"result_id": "337018", "URL": "https://anonhq.com/pfizer-vp-turns-whistleblower-exposes-big-pharmas-naked-truth/", "timestamp": "2023-04-25 18:07:44 CEST+0200", "meta": {"description": "Here's how Big Pharma makes enormous profits, how Big Pharma manipulates medical research, and how Big Pharma and the FDA con humanity — Every day.", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/pfizer-vp-turns-whistleblower-exposes-big-pharmas-naked-truth/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Pfizer VP Turns Whistleblower, Exposes Big Pharma’s Naked Truth", "cleaned_text": "There are no prizes for guessing why the United States’ health care spending increased 5.8% to reach $3.2 trillion – or $9,990 per person – in 2015; why prescription drugs are killing far more people than illegal drugs; why Big Pharma is the biggest financial contributor to clinical trials in the U.S., or why health care remains the most profitable industry in the United States.\n\nIn 2003, former vice president of Pfizer, Dr Peter Rost, filed a whistleblower suit against Pfizer, charging the world’s largest pharmaceutical company with illegally promoting the growth hormone Genotropin for off-label use. This resulted in millions of dollars of overpayments by the United States Medicare and Medicaid health programs.\n\nIn 2011, Rost blew the whistle on Big Pharma and its crooked ties with the medical fraternity in a documentary titled “One More Girl.” In the 2-minute clip below, he reveals how Big Pharma makes enormous profits and how Big Pharma manipulates scientific research. He also revealed how Big Pharma is ruining the field of medical clinical research; how medical evidence is nothing more than marketing literature put together by, and funded by Big Pharma; and how Big Pharma and government regulators allow this fraud to happen every day, with the sole intention to con humanity.\n\nTaking inspiration from Rost, former executive director of Eli Lilly, Dr John Rengen Virapen turned whistleblower and confessed, calling out Eli Lilly for manipulating both the government and the mainstream media to push dangerous, ineffective drugs and vaccines. Virapen also admitted to bribing the Swedish government into approving the world’s first SSRI antidepressant, Prozac, despite knowing the drug caused suicide.\n\n“The press works… with the Pharma industry just like the government does. The Pharma companies use the media to implant this dirty work on you. Don’t take for granted what your doctor is telling you because the doctors these days, they don’t know much about medicine and they don’t care much about the patients.\n\nThey think about how much they can get paid. This is how the Pharma industry reigns, stays in power, they buy the doctors. They pick them up when they’re in medical school… I know because when I was a salesman, the Pharma Company used to tell me, ‘Never talk side effects.’ … I also know they hide the dangerous side effects because I was in charge of a clinical study.”\n\nAccording to the Harvard Business Review‘s Paul Thacker, doctors and medical groups routinely accept cash payments from Big Pharma for speaking engagements, scientific papers, and other medical propaganda designed to make drugs and medical devices appear safer and more effective than they actually are. Thacker notes:\n\n“Industry has funded campaigns to undermine scientific work that has major public health implications, such as secondhand smoking, obesity, regulation of chemicals, and climate change. In each case, hidden money buys off science experts, funds think-tank papers, and litters journals with ghostwritten studies.”\n\nDr John Ioannidis, professor of medicine health research and policy at Stanford University, warns how Big Pharma manipulates 80% of medical research for profit:\n\n“They [Big Pharma] can get the results or at least the interpretation that fits their needs. So you have the most powerful and most prestigious design in current medical evidence, and it can be easily manipulated as an advertisement, as a marketing tool.”\n\nDr Richard Horton, chief editor of The Lancet, also declares that a lot of the published medical research is in fact unreliable at best, if not completely false:\n\n“The case against science is straightforward: Much of the scientific literature, perhaps half, may simply be untrue. Afflicted by studies with small sample sizes, tiny effects, invalid exploratory analyses, and flagrant conflicts of interest, together with an obsession for pursuing fashionable trends of dubious importance, science has taken a turn towards darkness.”\n\nThis article (Pfizer VP Turns Whistleblower, Exposes Big Pharma’s Naked Truth) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.\n\nSupporting Anonymous’ Independent & Investigative News is important to us. Please, follow us on Twitter:", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/12/big_pharma-1.jpg", "locale": "en_US", "type": "article", "title": "Pfizer VP Turns Whistleblower, Exposes Big Pharma’s Naked Truth", "description": "Here's how Big Pharma makes enormous profits, how Big Pharma manipulates medical research, and how Big Pharma and the FDA con humanity — Every day.", "url": "https://anonhq.com/pfizer-vp-turns-whistleblower-exposes-big-pharmas-naked-truth/", "site_name": "AnonHQ", "article:published_time": "2016-12-18T20:54:22+00:00", "image:width": "790", "image:height": "386", "image:type": "image/jpeg"}, "tags": ["Medical Research", "Pfizer", "whistleblower", "Big Pharma"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "696", "height": "392", "embed_code": "<iframe width=\"696\" height=\"392\" src=\"https://www.youtube.com/embed/TrCizlAOBAo?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/TrCizlAOBAo?feature=oembed"}, {"embed_type": "iframe", "provider": "youtube", "width": "696", "height": "522", "embed_code": "<iframe loading=\"lazy\" width=\"696\" height=\"522\" src=\"https://www.youtube.com/embed/s-8ItXRMPfA?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/s-8ItXRMPfA?feature=oembed"}], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.collective-evolution.com/2015/07/07/pfizer-vice-president-blows-the-whistle-tells-the-truth-about-the-pharmaceutical-industry/", "https://www.lawyersandsettlements.com/articles/drugs-medical/Pharma-00227.html", "https://www.intellihub.com/big-pharma-will-never-solve-the-worlds-health-problems-because-it-makes-too-much-money-off-disease/", "http://www.naturalnews.com/047941_Sunshine_law_corruption_pharmaceuticals.html", "https://anonhq.com/wp-content/uploads/2016/12/Big-Pharma.jpg", "http://healthawarenessforall.com/doctor-proves-big-pharma-manipulates-80-medical-research-profit/", "http://www.thelancet.com/pdfs/journals/lancet/PIIS0140-6736%2815%2960696-1.pdf", "https://anonhq.com/?p=83792", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com", "https://twitter.com/AnonymousNewsHQ", "https://twitter.com/AnonymousNewsHQ", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-12-18T20:54:22+00:00"}