{"result_id": "337047", "URL": "https://anonhq.com/frightening-new-test-reveals-deadly-roundup-present-children-vaccines/", "timestamp": "2023-04-25 18:08:08 CEST+0200", "meta": {"description": "A study has revealed the presence of RoundUp in children vaccines.", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/frightening-new-test-reveals-deadly-roundup-present-children-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Frightening: New Test Reveals Deadly RoundUp Present in Children Vaccines", "cleaned_text": "For many critics of vaccination, this article might not surprise them. For a long time, some people have spoken against it. These people are not necessarily against the vaccination, but the vaccines being used.\n\nSome of the chemical compounds used in the manufacturing of the vaccines are dangerous to the health of humans. In fact, some of the vaccines, instead of curing a particular ailment or serving as a helper of the immune system to fight disease, rather, weaken the immune system and some of the vital cells in the body, which can cause key organs in the body to fail.\n\nA new study, sponsored by Moms Across America (MAA), has revealed that five childhood vaccines contain the deadly herbicide, glyphosate. Glyphosate is a broad-spectrum systemic herbicide and crop drying agent. It is used to kill weeds. Glyphosate was discovered by Monsanto chemist John E. Franz in 1970. By 1974, Monsanto had introduced it into the market under the trade name, RoundUp.\n\nMAA is an advocacy group that raises awareness about toxic exposure, leadership and community health. The group also campaigns against Genetically Modified Foods.\n\nThe disturbing findings from the AMM study have caused outrage. In 2014, AMM sponsored a study that also revealed the presence of glyphosate in breast milk of American mothers. High levels of the deadly compound were found in 3 out of 10 samples. However, in order to protect its business interest, Monsanto funded and authored a counter-study, claiming that there was no presence of glyphosate in breast milk.\n\nIn this current study, which was first published in EcoWatch, it listed the following five childhood vaccines as containing the deadly glyphosate compound:\n• MMR II (Merk) vaccine had 2.671 parts per billion (ppb) of glyphosate.\n\nMAA revealed laboratory testing of the vaccines was done by bMicrobe Inotech Laboratories Incorporated. Apart from the vaccines, Cow Milk, Canola Oil, Ensure Drinks and Soda were all found to contain the deadly compound. You can click here for the detailed summary of the laboratory report. Particularly for the vaccines, additional independent testing confirmed the presence of glyphosate in them.\n\nAmong the five vaccines found to contain the deadly glyphosate, MAA said the MMR II vaccine is of particular concern. This is because the results showed the presence of glyphosate levels 25 times higher than the other four vaccines.\n\nSince the study was published, some researchers have expressed grave concern about the findings. It is said because vaccines are mostly injected, the dangerous compounds present in them can bypass protective functions of the skin and the digestive system, getting into the body quickly and directly.\n\nDr Toni Bark of the Center for Disease Prevention and Reversal was quoted by the Free Thought Project as saying: “I am deeply concerned about injecting glyphosate, a known pesticide, directly into children. Neither Roundup nor glyphosate has been tested for safety as an injectable. Injection is a very different route of entry than oral route. Injected toxins, even in minute doses can have profound effects on the organs and the different systems of the body. In addition, injecting a chemical along with an adjuvant or live virus, can induce severe allergic reactions to that substance as vaccines induce the immune system to create antibodies to whatever is included in the vaccine. Since glyphosate is heavily used in corn, soy, wheat, cotton and other commodities, we can expect to see more severe food allergies in the vaccine recipients. In addition, chemicals in ultra low doses, can have powerful effects on physiology behaving almost as hormones, stimulating or suppressing physiological receptors.”\n\nThis is not the first time the deadly glyphosate compound has been found in food, or something that goes into the human body. In early 2016, the United States Food and Drug Administration was forced by public pressure to agree to the test for the presence of glyphosate in food.\n\nEven the World Health Organization – which we cannot trust – has labeled glyphosate among the “probable carcinogen” compounds. This means the harm the compound causes to the human body is certainly great.\n\nIn fact, many foods are now made with RoundUp Ready soy, corn, and canola. And it is not only humans who consume these foods; some are fed to factory farmed animals for meat and dairy products.\n\nIn the United States, for example, statistics show that farmland in the country has been drenched with more than 2.6 billion pounds of glyphosate, since 1992. Many grain and seed crops receive a dose of RoundUp just before harvest, in a process known as desiccation. This process forces the grains and crops to dry quickly rather than waiting for their natural period to dry.\n\nYou want to support Anonymous Independent & Investigative News? Please, follow us on Twitter: Follow @AnonymousNewsHQ\n\nThis article (Frightening: New Test Reveals Deadly RoundUp Present in Children Vaccines) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/09/s-2-27-e1474272586710.jpg", "locale": "en_US", "type": "article", "title": "Frightening: New Test Reveals Deadly RoundUp Present in Children Vaccines", "description": "A study has revealed the presence of RoundUp in children vaccines.", "url": "https://anonhq.com/frightening-new-test-reveals-deadly-roundup-present-children-vaccines/", "site_name": "AnonHQ", "article:published_time": "2016-09-29T23:51:14+00:00", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": ["childhood vaccines"], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://anonhq.com/wp-content/uploads/2016/09/s-5-16-e1474272541933.jpg", "http://www.ecowatch.com/glyphosate-vaccines-1999343362.html", "http://www.momsacrossamerica.com/about", "http://www.momsacrossamerica.com/glyphosate_testing_results", "https://anonhq.com/wp-content/uploads/2016/09/s-3-27-e1474272573580.jpg", "http://www.ecowatch.com/glyphosate-vaccines-1999343362.html", "https://d3n8a8pro7vhmx.cloudfront.net/yesmaam/pages/1707/attachments/original/1473092174/312_Honeycutt__Zen_Glyphosate_10_Samples_Version_1.2.pdf?1473092174", "https://anonhq.com/wp-content/uploads/2016/09/s-1-26-e1474272597815.jpg", "http://thefreethoughtproject.com/report-glyphosate-childhood-vaccine/", "https://anonhq.com/wp-content/uploads/2016/09/s-4-22-e1474272557669.jpg", "http://www.ewg.org/agmag/2015/10/billions-pounds-monsanto-s-glyphosate-blanket-us-farmland", "https://twitter.com/AnonymousNewsHQ", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-09-29T23:51:14+00:00"}