{"result_id": "337001", "URL": "https://anonhq.com/official-zika-linked-condition-is-now-a-global-public-health-emergency/", "timestamp": "2023-04-25 18:07:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/official-zika-linked-condition-is-now-a-global-public-health-emergency/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Official: Zika-linked Condition Is Now A Global Public Health Emergency", "cleaned_text": "The World Health Organization (WHO) has declared that a disease linked to the Zika virus, microcephaly which is spreading fast in Latin America poses a serious health threat to the world.\n\nScientists said recently that there is growing evidence of a link between the Zika virus and microcephaly, babies born with abnormally small heads, and a rare nervous system disorder known as Guillain-Barre syndrome.\n\nWHO said last week that up to four million people could be infected with the Zika virus in the Americas by the end of 2016. The Zika virus is spread by mosquitoes. The current outbreak is primarily in the Americas, with Brazil being the worst affected country. There have been about 4,000 reported cases of microcephaly in Brazil alone since October 2015.\n\nDirector-General of WHO, Dr Margaret Chan called Zika an “extraordinary event” that needed a co-ordinate and united response worldwide.\n\n“I am now declaring that the recent cluster of microcephaly and other neurological abnormalities reported in Latin America following a similar cluster in French Polynesia in 2014 constitutes a public health emergency of international concern”, she said.\n\nDr Chan said priorities were to protect pregnant women and their babies from harm, and to control the mosquitoes that are spreading the virus. She advised pregnant women to consider delaying traveling to areas affected by Zika. Pregnant women should also seek advice from their physician if they are living in areas affected by the disease, as well as protect themselves against mosquito bites by wearing repellent.\n\nThe emergency response will also look at areas such as research and how aid could be fast-tracked to tackle the disease in affected areas.\n\nBBC reports that Dr Chan justified the emergency declaration, saying it is time to take action. However, there are still some uncertainties about the disease.\n\nObservers said last week that it is likely that Zika will be declared a Global Public Health Emergency. The last time an international emergency was declared was for the Ebola outbreak in West Africa, which killed more than 11,000 people. Shortly after the spread of the disease, critics blamed the WHO for not acting early enough to help stop the spread of the disease. The WHO alert puts Zika in the same category of concern as Ebola.\n\nBrazil first reported the Zika virus in South America in May 2015. The virus has since spread to more than 20 countries in the region. The WHO officials have estimated that between 500,000 and 1.5 million people have been infected with the Zika virus in Brazil. In the northeastern city of Recife, it is said doctors are overwhelmed with cases of microcephaly.\n\nThe Zika virus is spread by the Aedes aegypti mosquito, which also carries dengue fever and yellow fever. The disease was first detected in Uganda in 1947.\n\nSymptoms of Zika include fever and rashes, but most people show no symptoms. The bigger health threat is believed to be in pregnancy, to the unborn child.\n\nCurrently, there is no known cure for the disease. The only way to fight Zika is to clear stagnant water where mosquitoes breed, and protect yourself against mosquito bites.\n\nThe United States has said it will begin human vaccine trials for the disease by the end of this year. Officials from the National Institute of Health said they have two potential Zika vaccines in development.\n\nThe Centers for Disease Control also confirmed that there had been 31 cases of the Zika disease in the US. It further added that all the cases were linked to travelers who had returned from affected areas in South America.\n\nYou want to support Anonymous Independent & Investigative News? Please, follow us on Twitter: Follow @AnonymousNewsHQ\n\nThis Article (Official: Zika-linked Condition Is Now A Global Public Health Emergency) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/01/S-4-e1454113078483.jpg", "locale": "en_US", "type": "article", "title": "Official: Zika-linked Condition Is Now A Global Public Health Emergency", "url": "https://anonhq.com/official-zika-linked-condition-is-now-a-global-public-health-emergency/", "site_name": "AnonHQ", "article:published_time": "2016-02-04T20:51:53+00:00", "article:modified_time": "2016-02-04T20:53:41+00:00", "image:width": "600", "image:height": "345", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.bbc.com/news/health-35459797", "https://anonhq.com/wp-content/uploads/2016/01/S-4-e1454113078483.jpg", "https://anonhq.com/wp-content/uploads/2016/01/s-1-1-e1454113106167.png", "https://anonhq.com/wp-content/uploads/2016/01/S-3-1.jpg", "http://www.bbc.com/news/health-35459797", "https://anonhq.com/wp-content/uploads/2016/02/s-1-2-e1454402475166.jpg", "https://anonhq.com/wp-content/uploads/2016/01/s-2-26-e1454113094275.jpg", "https://twitter.com/AnonymousNewsHQ", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-02-04T20:51:53+00:00"}