{"result_id": "337019", "URL": "https://anonhq.com/deep-state-safari-club-cabal/", "timestamp": "2023-04-25 18:07:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/deep-state-safari-club-cabal/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "The Deep State and the Safari Club Cabal", "cleaned_text": "In 1982 a formal, written agreement was discovered by prominent Arab journalist of an intelligent community, named the Safari Club.\n\nIn a time when the Nixon administration was at its height of Watergate scandal, the unknown Safari Club was said to have established themselves as a group of countries united to fight communism. It left its mark for sometime into the Carter administration. According to Turki, a Saudi Prince who headed Saudi Intelligence from 1977-2001, gave a speech in 2001 to Georgetown University.\n\n“In 1976, after the Watergate matters took place here, your intelligence community was literally tied up by Congress. It could not do anything. It could not send spies, it could not write reports, and it could not pay money, In order to compensate for that, a group of countries got together in hope of fighting communism and established what was called the Safari Club. The Safari Club included France, Egypt, Saudi Arabia, Morocco, and Iran…so, the Kingdom, with these countries, helped in some way, I believe, to keep the world safe when the United States was not able to do that. That, I think, is a secret that many of you don’t know.”\n\nNixon, at the height of the Watergate scandal\n\nBut it’s not the entire truth. High powered American elites were said to be involved with the Safari Club – those who tended to disregard the final word of Congress during the Carter era. It was to be what Allen Dulles, the director of the CIA from 1953 to 1\n\n961, stood for, and perhaps strived for. Though shortly after his death, his work arguably set the path for the rise of the Safari Club.\n\nAccording to Mohamed Hassanein Heikal, the high profile journalist who penned Iran: The Untold Story, it was Henry Kissenger that organized a number of Arab countries rich in oil, into “bankrolling operations against communist influence on their doorstep.” But it was a French right-winged Alexandre de Marenches who formalized the operations. Head of the equivalent to the CIA, de Marenches assumed leadership of the Safari Council.\n\nIn a congressional investigation it was said that de Marenches had intentionally organized a meeting between Casey, Reagan’s campaign manager (who later became director of the CIA) and the Islam Republic of Iran to arrange a hold on the release of American hostages until after the Regan/Carter elections. The plot worked. Carter’s administration lost the elections and the CIA was able to reinstate itself during the Reagan years.\n\nDulles once said “Democracy only works if the so-called intelligent people make it work. You can’t sit back and let democracy run itself.” The Devil’s Chessboard, a new biography tracing the Dulles’ years in power and the brickwork he laid for the current climate, suggests that our suspicions are not only correct but an ‘underestimate.’ The almost unheard of Safari Club highlights this nature. The ‘Deep State’ is here, setting the boundaries forever governing those elected who try to buck the system.\n\nSnowden blew the lid on part of it with his surveillance state whistleblowing, but it appears we’ve only just scratched the surface.\n\nThis Article (The Deep State and the Safari Club Cabal) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2015/11/thEE8NUQ9J.jpg", "locale": "en_US", "type": "article", "title": "The Deep State and the Safari Club Cabal", "url": "https://anonhq.com/deep-state-safari-club-cabal/", "site_name": "AnonHQ", "article:published_time": "2016-01-29T16:02:40+00:00", "article:modified_time": "2016-01-29T16:04:16+00:00", "image:width": "300", "image:height": "209", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://web.archive.org/web/20020328105205/http://www.ccasonline.org/publicaffairs/turki_02032002.html", "https://anonhq.com/wp-content/uploads/2015/11/th3A5KU3IU.jpg", "https://anonhq.com/wp-content/uploads/2015/11/th3A5KU3IU.jpg", "https://theintercept.com/2015/11/02/the-deepest-state-the-safari-club-allen-dulles-and-the-devils-chessboard/", "https://anonhq.com/wp-content/uploads/2015/11/8d5b6e3e140b720185491acd83c92edc.jpg", "https://www.youtube.com/watch?v=4mGFrj60WN8", "https://books.google.co.nz/books?id=-KgZAAAAMAAJ&redir_esc=y", "https://anonhq.com/wp-content/uploads/2015/11/thZDETK2Z9.jpg", "https://consortiumnews.com/2011/05/12/jimmy-carters-october-surprise-doubts/", "http://www.motherjones.com/media/2015/10/book-review-devils-chessboard-david-talbot", "http://billmoyers.com/2014/02/21/anatomy-of-the-deep-state/", "https://anonhq.com/wp-content/uploads/2015/11/snowden102way_sq-e640efc5481e6a88137c4aa402822717bc5c48b2-s6-c30.jpe.jpg", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-01-29T16:02:40+00:00"}