{"result_id": "337033", "URL": "https://anonhq.com/author-of-us-biowarfare-act-admits-biolabs-in-ukraine-are-criminal-enterprises/", "timestamp": "2023-04-25 18:07:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/author-of-us-biowarfare-act-admits-biolabs-in-ukraine-are-criminal-enterprises/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Author of US Biowarfare Act Admits Biolabs in Ukraine Are ‘Criminal Enterprises’", "cleaned_text": "Boyle said an estimated 13,000 “death scientists” in 400 laboratories in the U.S. and abroad, including Ukraine and other countries on Russia’s doorstep, are employed making new strains of offensive killer germs that will be resistant to vaccines.\n\nFor example, Dr. Yoshihiro Kawaoka’s group at the University of Wisconsin has found a way to increase the toxicity of the flu virus by 200 times. Boyle says Kawaoka is “the same death scientist who resurrected the genocidal Spanish Flu virus for the Pentagon for offensive biowarfare purposes.”\n\nAs for fighting flu, the National Institutes of Health in 2006, a typical year, got only $120 million from Congress to fight flu, which kills an estimated 36,000 Americans annually. By contrast, Congress gave NIH $1.76 billion for “biodefense,” even though the anthrax outbreak in 2001 killed just five persons.\n\n“These distorted budgetary allocations,” (spending 15 times as much for germ warfare as for fighting flu) “demonstrate that the priority here is not the promotion of the public health of American citizens but rather to further develop the U.S. offensive biowarfare industry that will someday ‘blowback’ upon the American people with a catastrophic pandemic,” Boyle said.\n\nHe went on to say the Pentagon and Central Intelligence Agency(CIA) are “ready, willing, and able to launch biowarfare when it suits their interests…They have a super-weapons-grade anthrax that they already used against us in October, 2001.”\n\nBoyle here was referring to the anthrax pathogens mailed to two U.S. Senators (Tom Daschle, of South Dakota and Patrick Leahy, of Vermont) and others after 9/11 that were traced back to the Government’s biowarfare lab at Fort Detrick, Md.\n\nBoyle’s remarks came in response to written questions from Sherwood Ross, a Miami, Fla.-based columnist. Asked if the recent outbreaks of Ebola in Sierra Leone and Liberia could be from U.S. Government-backed facilities, Boyle replied:\n\n“These Ebola vaccines were experimental U.S. biowarfare vaccines that were being tested out in West Africa. It was a result of testing out of the U.S. biowarfare vaccines at our lab in Kenema, Sierra Leone, that created the West African Ebola pandemic in the first place.“\n\nBoyle warned that the Galveston National Laboratory in Texas, a high-containment research lab, has been seeking for potential biowarfare agents in the wild in other parts of the world “in order to turn them into biological weapons.”\n\nHe said, “They should shut down Galveston as an ongoing criminal enterprise along the lines of the S.S. and the Gestapo — except that Galveston is far more dangerous to humanity than Hitler’s death squads ever were.“\n\nBoyle added, “American universities have a long history of willingly permitting their research agenda, researchers, institutes, and laboratories to be co-opted, corrupted, and perverted by the the Pentagon and the C.I.A. into death science. These include Wisconsin, North Carolina, Boston U., Harvard, M.I.T., Tulane, University of Chicago, and my own University of Illinois, as well as many others.”\n\nSherwood Ross, who formerly reported for the Chicago Daily News, interviewed Prof. Boyle in 2015. The interview is fascinating and disturbing. We have reprinted the interview in its entirety below.\n\nQ. AND A. WITH FRANCIS A. BOYLE ON BIOWARFARE\n\nFrancis A. Boyle is a leading American professor, practitioner and advocate of international law. He was responsible for drafting the Biological Weapons Anti-Terrorism Act of 1989 (BWATA), the American implementing legislation for the 1972 Biological Weapons Convention. His BWATA was passed unanimously by both Houses of the United States Congress and signed into law by President George Bush Sr. The story is told in his book Biowarfare and Terrorism (Clarity Press: 2005). He served on the Board of Directors of Amnesty International USA (1988-1992), and represented Bosnia-Herzegovina at the World Court. Professor Boyle teaches international law at the University of Illinois College of Law in Champaign. He holds a Doctor of Law Magna Cum Laude as well as a Ph.D. in Political Science, both from Harvard University.\n\nQ: To get some idea of the magnitude of U.S. biological warfare research involving deadly diseases now going forward, the Federal government is said to be funding 400 laboratories globally. These labs purportedly are concocting new strains of lethal microbes for which there is no cure. Right off the bat, I’d like to ask you, “Is this a criminal enterprise whose dimensions are being concealed from the American public?”\n\nA: Of course it is! Since September 11, 2001, we have spent somewhere in the area approaching $100 billion on biological warfare. Effectively we now have an Offensive Biological Warfare Industry in this country that violates the Biological Weapons Convention and my Biological Weapons Anti-terrorism Act of 1989. We have reconstructed the Offensive Biological Warfare Industry that we had deployed in this county before its prohibition by the Biological Weapons Convention of 1972 that was described by Sy Hersh in his groundbreaking exposé of it in his book Chemical & Biological Warfare: America’s Hidden Arsenal (Bobbs-Merrill: 1968). Our putative adversaries around the world such as Russia and China have undoubtedly reached the same conclusions I have derived from the same open and public sources, and have responded in kind. So what the world now witnesses is an all-out offensive biological warfare arms race among the major military powers of the world: United States, Russia, Britain, France, China, Israel, inter alia. The Biological Weapons Convention has become the proverbial “mere scrap of paper.” But my BWATA still remains the law of the land in the United States with a penalty of life-in-prison for violators. That is why the self-styled “synthetic biologists” proposed to repeal my BWATA so that they can use Synthetic Biology to manufacture new classes of biological weapons more efficiently.\n\nQ: Exactly what is biowarfare?\n\nA: Biological warfare involves the use of living organisms for military purposes. Such weapons can be viral, bacterial, and fungal, among other forms, and can be spread over a large geographic terrain by wind, water, insect, animal, or human transmission. Toxins—living organisms such as fungi—are also used.\n\nQ: Which are the most dangerous?\n\nA: Today several U.S.G. labs are at work on Anthrax, Tularemia, Plague, Ebola, Botulism, and the genocidal Spanish Flu virus.\n\nQ: What do they do with these pathogens?\n\nA: Using DNA genetic engineering, U.S. death scientists are concocting new strains of lethal microbes for which there are no cures. Bacteria, for example, can be made resistant to vaccines, made more virulent, easier to spread, and harder to eradicate. Right now U.S. death scientists are scouring the biosphere around the world to locate any bioagent in nature that they can exploit and pervert into offensive biowarfare purposes.\n\nQ: USA Today has done some fine reporting on this subject. Among other things, their reporters have exposed massive incidents of lax security conditions at U.S.G. labs and university labs funded by U.S.G. What might the consequences be of this disregard for safety?\n\nA: This is a biocatastrophe waiting to happen here in the United States. In fact it has already happened in West Africa with the Ebola pandemic there. It is only a matter of time before we have a similar pandemic at home here caused by U.S. biowarfare programs. In this regard you should watch the excellent award-winning documentary by Coen & Nadler entitled Anthrax-War (Transformer Films: 2009) in which I appear and served as a consultant on.\n\nQ: Recently, 13 cases of plague were reported in Arizona, California, Colorado, Georgia, New Mexico, Oregon and Utah, resulting in three deaths. Could these deadly plague pathogens (infectious agents) have come from the U.S. government’s (U.S.G.) germ warfare labs?\n\nA: I suspect they might have. But proving it is another matter. Any time you see some mysterious and widespread outbreak of an exotic disease around the country, you have to factor into the analytical explanatory equation that it could be the result of some illegal U.S. biowarfare program.\n\nQ: Is it a fact, as alleged, that the Anthrax pathogens mailed to two U.S. Senators and others after 9/11 trace back to the U.S.G. biowarfare lab at Ft. Detrick, Md.? You have written that Senators Daschle and Leahy, both Democrats, had opposed the Patriot Act, which gives U.S.G. unprecedented powers and abolishes Americans’ traditional personal liberties. If the Anthrax was sent by the Pentagon, was it to intimidate the Senators?\n\nA: Yes! I have written about this in my book Biowarfare and Terrorism (Clarity Press: 2005). More recently my friend and colleague Professor Graeme MacQueen from McMaster University in Canada has also written about this in his book The 2001 Anthrax Deception (Clarity Press: 2014). You are free to read these two books, draw your own conclusions, and see if you agree with us. Over the years there are numerous interviews I have given on this matter that you can obtain by Googling my name and adding the word “anthrax” to their search engine. The twin purposes of these October 2001 anthrax attacks were (1) to scaremonger the American People and Congress into adopting the totalitarian and Orwellian USA Patriot Act and (2) to wage an offensive war of aggression against Iraq. As President George Bush Jr. proudly boasted: “Mission accomplished!” — on both counts.\n\nQ: Recently, there have been outbreaks of Ebola in Sierra Leone and Liberia. You have raised the possibility that U.S.G. may be illegally experimenting with these diseases on citizens of those African nations. Could you please elaborate?\n\nA: These Ebola vaccines were experimental U.S. biowarfare vaccines that were being tested out in West Africa. It was a result of testing out of the U.S. biowarfare vaccines at our lab in Kenema, Sierra Leone, that created the West African Ebola pandemic in the first place. I have given numerous interviews to support my conclusion here in more detail. These can be located by Googling my name and adding the word “Ebola” to their search engine.\n\nQ: Is such germ warfare development work illegal under the BWC Treaty of 1972? (Dr. Boyle was the American attorney who wrote the implementing legislation for the U.S. that passed Congress without a single negative vote.)\n\nA: Yes. The U.S. is a party to the 1972 Biological and Toxic Weapons Convention which bans “development, production, stockpiling and use of microbes or their poisonous products except in amounts necessary for protective and peaceful research…” Colonel David Huxsoll, Commander of the Army’s Medical Institute of Infectious Diseases, has admitted that offensive research is indistinguishable from defensive research.\n\nQ: Although Russia said it scrapped its germ warfare program after the Communists lost power in 1991, the U.S. budget for this purpose has increased. Are there any countries or terrorist groups that might realistically attack the U.S. with such weapons? One critic has said .U.S.G.’s biowarfare push resembles “a dog chasing its own tail.”\n\nA: The truth of the matter is that the United States government has been pursuing the development of an offensive biowarfare program and industry since the Reagan administration and his Neoconservatives came to power in 1981. I set forth this earlier biowarfare documentation on Reagan and his Neo-Cons in my previous book The Future of International Law and American Foreign Policy (Transnational Publishers Inc.: 1989), Chapter 8, “The Legal Distortions Behind the Reagan Administration’s Chemical and Biological Warfare Buildup.” Interestingly enough, the Department of Defense itself reprinted my study as Current News: Special Edition: CHEMICAL WEAPONS, NO. 1586 (28 May 1987) and distributed it to thousands of high-level D.O.D. civilian and military officials all over the world.\n\nQ: It sounds fantastic, I know, but scientists once paid by the U.S.G. to cure cancer are now being paid to develop deadlier strains of anthrax, dengue, Japanese encephalitis, tularemia, Q fever, and other dread diseases. Comment?\n\nA: On the relationship between cancer research and bioweapons you should have a look at the book by Dr. Len Horowitz, Emerging Viruses: AIDS and Ebola – Nature, Accident, or Intentional? (Tetrahedron Inc. 1996).\n\nQ: You have written that Dr. Yoshihiro Kawaoka’s group at the University of Wisconsin has found a way to increase the toxicity of flu virus by 200 times. What is the purpose of this horrible-sounding research and why should U.W. support it?\n\nA: This is the same U.S. death scientist who resurrected the genocidal Spanish Flu virus for the Pentagon for offensive biowarfare purposes. Like all U.S. universities, Bucky Badger U. gets a cut out of all research funds brought in from the outside. Here at Chief Illiniwak University they publicly admitted that they take 51 cents out of every research $1 Buck brought in from the outside and charge it off to “overhead.” At most American Universities today, money talks and principles walk. My Disalma Mater Harvard is no better, no worse, and no different.\n\nQ: During the 1980-88 Iraq-Iran war, the Reagan White House okayed the Pentagon’s sale of weapons-specific biological agents and poison gas to Iraq that Saddam Hussein used against Iran and his own Kurdish minority? At least 5,000 Kurds were gassed. And, according to Time magazine of Jan. 20, 2014, the CIA reckoned Iran suffered 50,000 deaths. Doesn’t this prove the White House has used biological agents offensively?\n\nA: Certainly chemical weapons were used illegally. In addition, the Reagan administration shipped weapons-specific biowarfare agents to Saddam Hussein in Iraq in the hope and expectation that he would weaponize them and use them against Iran. He did weaponize them. So far I have not seen evidence that he used bioweapons against Iran or the Kurds. But these biowarfare weapons that Saddam Hussein produced thanks to Reagan and his Neo-Cons did “blowback” upon U.S. armed forces when they invaded Iraq in 1991. This “blowback” played a causative role in the Gulf War Syndrome that afflicted U.S. soldiers who participated in Gulf War I under President Bush Sr. I discuss this in my book Destroying World Order (Clarity Press: 2004) and in the British TV documentary The Dirty War (1993) produced by and shown on Britain’s Independent Television Network TV4 that I consulted on and appear in.\n\nQ: You have pointed out that the Galveston National Laboratory in Texas, a high-containment research lab, admits to seeking for potential biowarfare agents in the wild in other parts of the world “in order to turn them into biological weapons.”\n\nA: Right! They should shut down Galveston as an ongoing criminal enterprise along the lines of the S.S. and the Gestapo — except that Galveston is far more dangerous to humanity than Hitler’s death squads ever were. They say their work with Ebola is for a vaccine, but the same technology can also be weaponized. Galveston is working to aerosolize Ebola just as Ft. Detrick worked to aerosolize Anthrax. Aerosolization of a biowarfare agent is always the tip-off to the development of a weapon to be delivered by air to human beings who will breathe it in. Ft. Detrick should be shut down as well because it too is an ongoing criminal enterprise.\n\nQ: Besides Ft. Detrick and Galveston, are there any other biowarfare laboratories you believe should be closed?\n\nA: All of them. Since 1981, the Pentagon has been gearing up to fight and “win” biological warfare without prior public knowledge and review. What’s more, American universities have a long history of willingly permitting their research agenda, researchers, institutes, and laboratories to be co-opted, corrupted, and perverted by the Pentagon and the C.I.A. into death science. These include Wisconsin, North Carolina, Boston U., Harvard, M.I.T., Tulane, University of Chicago, and my own University of Illinois as well as many others.\n\nQ: Biological warfare development requires highly sophisticated technology and safe laboratories. No so-called “terrorist” group is known to possess anything like the requisite facilities. Besides America, what countries have operative biowarfare labs?\n\nA: U.S., U.K., Russia, France, China, Israel, for sure. There are several other countries that the U.S. has established satellite biowarfare labs in.\n\nQ: Is there any published data on U.S.G.’s expenditures for biowarfare since 9/11? I assume it has taken off like other Pentagon outlays.\n\nA: Yes, there are published figures on this in the open record. The last time I did a calculation from them the sum was approaching $100 billion. By comparison, in 2012 Dollars we spent $30 Billion on the Manhattan Project to develop the atom bombs that were then used to destroy Hiroshima and Nagasaki. You can see my book The Criminality of Nuclear Deterrence (Clarity Press: 2002), Chapter 2, “The Lessons of Hiroshima and Nagasaki.” So that historical precedent and analogy is a pretty good indication that the U.S. Offensive Biowarfare Industry is intended for use on human beings somewhere. The momentum behind the money propels inexorably towards use of the weapons.\n\nQ: Does the recent Pentagon mail-out of live anthrax virus to 86 laboratories here and to 7 nations abroad, bear out your prior criticism of U.S.G.’s careless handling of these pathogens?\n\nA: Of course. But I don’t believe there was anything “careless” or “accidental” about any of this. The Pentagon knows exactly what they are doing. They are not “incompetent” at the Pentagon. This was deliberate. Just like the anthrax attacks of October 2001 were deliberate.\n\nQ: You contend that the American pharmaceutical industry and the World Health Organization (WHO) are dumping dangerous vaccines in West Africa where the publics are already suffering from Ebola. Why would WHO get involved in this? Can you elaborate?\n\nA: First, to make money. WHO is a front organization for BIG PHARMA. Second, to reduce the numbers of Black West Africans — genocide.\n\nQ: It’s been estimated that 36,000 Americans are dying every year from flu. By contrast, only five Americans died from an Anthrax attack and that was back in 2001. Yet, the National Institutes of Health (NIH) in 2006, a typical fiscal year, received only $120 million from Congress to fight flu but $1.76 billion for “biodefense”?\n\nA: Right! These distorted budgetary allocations demonstrate that the priority here is not the promotion of the Public Health of American citizens but rather to further develop the U.S. Offensive Biowarfare Industry that will someday “blowback” upon the American People with a catastrophic pandemic.\n\nQ: Scientists who oppose the Pentagon’s activity insist that germ-warfare defense is clearly impractical; that every person would have to be vaccinated against every harmful biological agent. Since that likely is clearly impossible isn’t the only application of a defensive development in conjunction with offensive use?\n\nA: We are currently stockpiling vaccines to immunize our Civilian and Military Leadership Elites for if and when they decide to wage offensive biowarfare. Pace the Constitution, “We the People of the United States” will have to fend for ourselves as best we can with our grossly underfunded and inadequate public health services that have been deliberately starved of money in order to feed the U.S. Offensive Biowarfare Industry Beast.\n\nQ: Recently, Defense Secretary Ashton Carter told a St. Louis audience of government employees, “You’re some of the nation’s most innovative and inventive physicists, chemists, and geneticists…molecular biologists,” etc. Yes, indeed. How many employees does the Pentagon now have in germ warfare work and how much is it costing the American people?\n\nA: Overall I have read a figure that there about 13,000 death scientists in America today doing dirty biowarfare work who perversely call themselves “life scientists.” Doctor Mengele would be proud of them all! As Doctor Strangelove said: “Mein Fuhrer, I can walk!” Seventy years after World War II ended the Nazis have won.\n\nQ: Given all of the above, does it appear conceivable to you the Pentagon is developing a massive germ warfare weapon as a means of intimidating the world? After all, it has positioned itself in about 900 bases around the globe from which it can, and does, strike using conventional weapons, and it has used illegal radioactive ammunition in its war against Iraq.\n\nA: Of course. But not just intimidation. The Pentagon and the C.I.A. are ready, willing, and able to launch biowarfare when it suits their interests. They already attacked the American People and Congress and disabled our Republic with super-weapons-grade anthrax in October 2001. A fortiori they will do so again to foreign states and peoples when deemed convenient. Us too! They have a stockpile of that super-weapons-grade anthrax that they already used against us in October 2001.\n\nA: Thanks so much for doing this interview.", "opengraph": {"image": "http://anonhq.com/wp-content/uploads/2022/05/biolab-hazmat-suits-quarantine-1085790253-678x381.jpg.optimal-1.jpg", "locale": "en_US", "type": "article", "title": "Author of US Biowarfare Act Admits Biolabs in Ukraine Are ‘Criminal Enterprises’", "url": "https://anonhq.com/author-of-us-biowarfare-act-admits-biolabs-in-ukraine-are-criminal-enterprises/", "site_name": "AnonHQ", "article:published_time": "2022-05-01T04:18:40+00:00", "image:width": "678", "image:height": "381", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2022-05-01T04:18:40+00:00"}