{"result_id": "337021", "URL": "https://anonhq.com/western-sanctions-prevent-cancer-stricken-syrian-children-receiving-treatment/", "timestamp": "2023-04-25 18:07:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/western-sanctions-prevent-cancer-stricken-syrian-children-receiving-treatment/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Western Sanctions Prevent Cancer Stricken Syrian Children from Receiving Treatment", "cleaned_text": "Western sanctions against Syria have hit the country where it really hurts – their children. Reuters has reported medical professionals are struggling to resource much needed cancer treatments critical for Syrian children who are fighting paediatric cancers.\n\nThe specialist drugs were severely restricted after western sanctions targeted pharmaceutical imports to the country. Although the targeting of medical supplies “is largely exempt from [these] measures,” children in the Syrian health service are suffering.\n\nOnce the best health service in the Middle East, reports Reuters, the Syrian conflict coupled with the sanctions have crippled their hospitals and medical provisions. Government cuts to the health budget – to divert funds into fighting the ongoing and expensive Syrian war – have also played a role.\n\nBut to the patients who desperately need foreign-made drugs to treat them, the situation is grim, particularly for the children.\n\nThe cancer ward in the Children’s Hospital in Damascus is over crowded with relatives bringing much needed mattresses, blankets and cloths for the patients.\n\nChildren who were once treated quickly and with essential drug therapies are now relying on family for basic living essentials.\n\nPrior to the war, Syria produced around 90 percent of all its required medicines. However, it always relied on imports for anti-cancer drugs.\n\nWHO representative in Syria Elizabeth Hoff stated government cuts to the health budget have been significant since 2011, when the Syrian conflict began. But she also noted other circumstances, such as the value of the Syrian pound dropping by 90 percent, making the purchasing of pharmaceutical imports “prohibitively expensive.”\n\nHoff also added, “The impact of economic sanctions imposed on Syria heavily affected the procurement of some specific medicine including anti-cancer medicines.” Hoff said international pharmaceutical companies are prevented from dealing with the Syrian government because of the western sanctions.\n\n“Washington has banned the export or sale of goods and services to Syria from the United States or by U.S. citizens. The EU has imposed travel bans, asset freezes and an arms embargo, with sanctions also targeting financial ties with Syrian institutions, buying oil and gas from the country or investing in its energy industry.”\n\nThe inadvertent fallout from these sanctions and clamping down on the Syrian financial dealings with businesses, results indirectly on pharmaceutical trading, despite US and EU sanctions exempting humanitarian supplies as part of the embargo. Thus, many pharmaceutical companies now avoid dealing with the Syrian government.\n\nAccording to Hoff, the WHO aides with essential generic medical supplies, but US branded products are unobtainable due to the sanctions.\n\nThousands of children are reported to have leukaemia, whom received life-saving medications from WHO, with the assistance of funds from Kuwait.\n\nCancer patients aside, the Syrian health care services are also struggling to meet the demands for patients requiring insulin or intensive care antibiotics. Anaesthetics, vaccines and blood products are also at critically low levels.\n\n“Most of the cancer medicines are imported. Pharmex used to import the stock of medicines that public hospitals need. But it has not been able to do so largely because of the economic sanctions, I believe,” the head of the Children’s Hospital in Damascus, Maher Haddad said.\n\nThe ratio of doctors to patients has also significantly dropped to around 1 per 1,000. Only 44 percent of Syrian hospitals are functional, and over 200 children are reported to visit Damascus Children’s Hospital every day – the only hospital to offer free treatment.\n\nThis article (Western Sanctions Prevent Cancer Stricken Syrian Children from Receiving Treatment) is a free and open source. You have permission to republish this article under a license with attribution to the author and .\n\nSupporting Anonymous’ Independent & Investigative News is important to us. Please, follow us on Twitter:", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2017/03/00-syrian-kids-28-07-14.jpg", "locale": "en_US", "type": "article", "title": "Western Sanctions Prevent Cancer Stricken Syrian Children from Receiving Treatment", "url": "https://anonhq.com/western-sanctions-prevent-cancer-stricken-syrian-children-receiving-treatment/", "site_name": "AnonHQ", "article:published_time": "2017-03-17T01:11:55+00:00", "image:width": "1068", "image:height": "712", "image:type": "image/jpeg"}, "tags": ["syrian war", "western sanctions", "pharmaceuticals", "children"], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://www.yahoo.com/news/syria-sanctions-indirectly-hit-childrens-cancer-treatment-134023508.html", "https://citizentv.co.ke/news/syria-sanctions-indirectly-hit-childrens-cancer-treatment-160806/", "https://creativecommons.org/licenses/by/4.0/", "https://twitter.com/AnonWatcherHQ", "https://anonhq.com/", "https://twitter.com/AnonymousNewsHQ", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-03-17T01:11:55+00:00"}