{"result_id": "337044", "URL": "https://anonhq.com/china-begins-construction-of-new-biolab-with-extremely-deadly-sars-mers-viruses/", "timestamp": "2023-04-25 18:08:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/china-begins-construction-of-new-biolab-with-extremely-deadly-sars-mers-viruses/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "China Begins Construction Of New Biolab With Extremely Deadly SARS & MERS Viruses", "cleaned_text": "As the new trade/tech/diplomatic/cultural (in fact, everything but kinetic) war between the US and China is heating up by the hour, one would think that China would do everything in its power to defuse one of the core accusations by the Trump administration, namely that the Wuhan Institute of Virology (WIV) in China was the source of the global coronavirus pandemic (going so far as to spark unofficial demands for hundreds of billions in reparations from Beijing for its “criminal” actions), an allegation which Peter Navarro on Sunday expanded when he accused China of deliberately “seeding” the world with the “China virus”:\n\n“The Chinese behind the shield of the World Health Organization – for two months – hid the virus from the world and then sent hundreds of thousands of Chinese on aircraft to Milan, New York and around the world to seed that,” Navarro said on ABC. “They could have kept it in Wuhan. Instead it became a pandemic.”\n\nWell, one would be wrong, because in a “completely unexpected” twist – assuming China was indeed telling the truth and that the WIV had nothing to do with the original viral release – on Friday, a senior Chinese official confirmed Secretary of State Mike Pompeo’s allegation that Beijing had told labs in the country to destroy coronavirus samples in early January.\n\nRecall that in a May 6 press briefing, Pompeo accused China of covering up the Covid-19 outbreak as it emerged in the central city of Wuhan, saying China’s National Health Commission had ordered destruction of samples of the virus on Jan. 3.\n\nAsked about those comments at a press briefing in Beijing on Friday, NHC official Liu Dengfeng confirmed that the commission had issued these guidelines at that time “for pandemic prevention and control, which also played an important role in preventing biosafety risks.”\n\n“If the laboratory conditions cannot meet the requirements for the safe preservation of samples, the samples should be destroyed on the spot or transferred to a professional institution for safekeeping,” said Liu, supervisor of the commission’s Department of Health Science, Technology and Education.\n\nChinese law has clear rules for the handling of highly pathogenic samples, he said, and we are sure that it does… but wait a gosh darned minute? According to Dengfeng, China is basically admitting that the coronavirus samples – which were held in China’s P-4 rated, top “biosafety” lab in Wuhan which incidentally is also where the virus was leaked from according to a mountain of circumstantial evidence – were not safe in the Wuhan lab and thus had to be destroyed?\n\nConsidering that one of the core arguments made by the Trump administration (and this website) is that the virus (whether genetically engineered or otherwise) was released (hopefully without premeditation although there is no way of knowing for certain) by the Wuhan lab, China’s actions essentially confirm that the Wuhan Institute of Virology was unsafe, and thus every last sample of the virus had to be destroyed.\n\nOf course, the real reason why China destroyed the samples was different, and it had to do with not only destroying all the evidence but crushing any hope of finding what the real source of the pandemic was. As the WSJ reported, “Public health experts say it is likely too late to investigate the role of the market in Covid-19’s spread and that proving its origin might now be impossible.” And with China destroying the last remaining coronavirus samples, well – there goes any hope of proving or disproving that the virus emerged from the Wuhan Institute of Virology.\n\nSo with all that in mind, and with China’s track record in biotechnology, “gain of function” experiments and reputation of deadly viral “containment” destroyed, what does China do? Why it plans to build an entirely new biolab, only this time not in the industrial backwater of Wuhan, but in the capital itself.\n\nAccording to the Global Times, China’s capital Beijing will build its own, P-3 rated laboratory “to improve and explore infectious disease detection capacity” Lei Haichao, director of Beijing Municipal Health Commission, said at a press conference on Sunday, Chinanews reported.\n\nThere is no P-3 laboratory in Beijing now, while the nation’s only P-4 lab – which as a reminder is the highest level of biosafety precautions, and is appropriate for work with “agents that could easily be aerosol-transmitted within the laboratory and cause severe to fatal disease in humans for which there are no available vaccines or treatments” – remains in Wuhan.\n\nWhen COVID-19 emerged, the nation’s capital had 17 facilities equipped with nucleic acid testing capabilities. Within two months, 70 institutions had added testing capabilities necessary to conduct 51,000 tests daily, Lei said.\n\nRecently, the highest number of tests completed in one day is 30,000, indicating ample reserve capacity. However, the ability of Beijing laboratories to target infectious diseases needs to be explored and improved in the long term, according to Lei.\n\nOf course, testing is just one of the many aspects that a biosafety level 3 lab does. According to the CDC’s “Biosafety in Microbiological and Biomedical Laboratories” manual, P-3 labs are appropriate for work involving microbes which can cause serious and potentially lethal disease via the inhalation route. This type of work can be done in clinical, diagnostic, teaching, research, or production facilities. Here, the precautions undertaken in BSL-1 and BSL-2 labs are followed, as well as additional measures including:\n• All laboratory personnel are provided medical surveillance and offered relevant immunizations (where available) to reduce the risk of an accidental or unnoticed infection.\n• All procedures involving infectious material must be done within a biological safety cabinet.\n• Laboratory personnel must wear solid-front protective clothing (i.e. gowns that tie in the back). This cannot be worn outside of the laboratory and must be discarded or decontaminated after each use.\n• A laboratory-specific biosafety manual must be drafted which details how the laboratory will operate in compliance with all safety requirements.\n\nIn addition, the facility which houses the BSL-3 laboratory must have certain features to ensure appropriate containment. The entrance to the laboratory must be separated from areas of the building with unrestricted traffic flow. Additionally, the laboratory must be behind two sets of self-closing doors (to reduce the risk of aerosols escaping). The construction of the laboratory is such that it can be easily cleaned. Carpets are not permitted, and any seams in the floors, walls, and ceilings are sealed to allow for easy cleaning and decontamination. Additionally, windows must be sealed, and a ventilation system installed which forces air to flow from the “clean” areas of the lab to the areas where infectious agents are handled. Air from the laboratory must be filtered before it can be recirculated.\n\nSo after Wuhan and the whole “coronavirus thing”, what do Beijing residents have to look forward to?\n\nAccording to the CDC, biosafety level 3 is commonly used for research and diagnostic work involving various microbes which can be transmitted by aerosols and/or cause severe disease. These include Francisella tularensis, Mycobacterium tuberculosis, Chlamydia psittaci, Venezuelan equine encephalitis virus, Eastern equine encephalitis virus, Coxiella burnetii, Rift Valley fever virus, Rickettsia rickettsii, several species of Brucella, chikungunya, yellow fever virus, West Nile virus, Yersinia pestis.\n\nOh, and the SARS coronavirus, SARS-Cov-2, and MERS coronavirus. Just in case the world really needs that second wave.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2020/05/Kopie-von-Kopie-von-BREAKING-NEWS-LIVE-UPDATES-2.jpg", "locale": "en_US", "type": "article", "title": "China Begins Construction Of New Biolab With Extremely Deadly SARS & MERS Viruses", "url": "https://anonhq.com/china-begins-construction-of-new-biolab-with-extremely-deadly-sars-mers-viruses/", "site_name": "AnonHQ", "article:published_time": "2020-05-18T05:07:08+00:00", "image:width": "1200", "image:height": "600", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://www.wsj.com/articles/china-told-labs-to-destroy-coronavirus-samples-to-reduce-biosafety-risks-11589684291", "https://www.globaltimes.cn/content/1188638.shtml", "https://www.cdc.gov/labs/BMBL.html", "https://www.zerohedge.com/s3/files/inline-images/p3%20lab%20beijing.jpg?itok=qoCRUJro", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2020-05-18T05:07:08+00:00"}