{"result_id": "337030", "URL": "https://anonhq.com/anti-vaxxer-biologist-stefan-lanka-bets-100k-measles-isnt-virus-wins-german-federal-supreme-court/", "timestamp": "2023-04-25 18:07:54 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/anti-vaxxer-biologist-stefan-lanka-bets-100k-measles-isnt-virus-wins-german-federal-supreme-court/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Anti-Vaxxer Biologist Stefan Lanka Bets Over $100K Measles Isn't A Virus; He Wins In German Federal Supreme Court", "cleaned_text": "By prophylactic vaccination of adults and especially children against measles, the pharmaceutical industry has earned Billions over a 40-year period. The judges at the German Federal Supreme Court (BGH) confirmed in a recent ruling that measles virus do not exist though. Furthermore: There is not a single scientific study in the world which could prove the existence of such virus so far. This raises the question of what was actually injected into millions of German citizens over the past decades. According to the judgment by the Supreme Court, it may not have been a vaccine against measles.\n\nThe Federal Supreme Court (BGH) has ruled in the measles virus trial. The First Civil Senate of the BGH has confirmed the judgment by the Higher Regional Court of Stuttgart (OLG) of the 16 February 2016. The sum of €100,000 which I had offered as a reward for scientific proof of the existence of the alleged measles virus does not have to be paid to the plaintiff. The plaintiff also was ordered to bear all procedural costs.\n\nFive experts have been involved in the case and presented the results of scientific studies. All five experts, including Prof. Dr. Dr. Andreas Podbielski who had been appointed by the OLG Stuttgart as the preceding court, have consistently found that none of the six publications which have been introduced to the trial, contains scientific proof of the existence of the alleged measles virus.\n\nIn the trial, the results of research into so-called genetic fingerprints of alleged measles virus have been introduced. Two recognised laboratories, including the world’s largest and leading genetic Institute, arrived at exactly the same results independently.The results prove that the authors of the six publications in the measles virus case were wrong, and as a direct result all measles virologists are still wrong today: They have misinterpreted ordinary constituents of cells as part of the suspected measles virus.\n\nBecause of this error, during decades of consensus building process, normal cell constituents were mentally assembled into a model of a measles virus. To this day, an actual structure that corresponds to this model has been found neither in a human, nor in an animal. With the results of the genetic tests, all thesis of existence of measles virus has been scientifically disproved.\n\nThe authors of the six publications and all other persons involved, did not realise the error because they violated the fundamental scientific duty, which is the need to work “lege artis”, i.e. in accordance with internationally defined rules and best practice of science. They did not carry out any control experiments. Control experiments would have protected authors and mankind from this momentous error. This error became the basis of belief in the existence of any disease-causing viruses. The expert appointed by the court, Prof. Dr. Dr. Podbielski, answering to the relevant question by the court, as per page 7 of the protocol explicitly confirmed that the authors did not conduct any control experiments.\n\nThe OLG Stuttgart on 16 February 2016 overturned the judgment of the court of first instance, dismissed the action and referred, inter alia, to the central message of Prof. Podbielski with respect to the six publications. The plaintiff filed an appeal against the judgment of the OLG to the Supreme Court. As reason he stated his subjective, yet factually false perception of the trial sequence at the court in Stuttgart, and the assertion that our naming of facts about measles posed a threat to public health. The plaintiff’s position was rejected by the Supreme Court in plain words. Thus, the Supreme Court confirmed the judgment of the OLG Stuttgart from 16 February 2016.\n\nThe six publications submitted in the trial are the main relevant publications on the subject of “measles virus.” Since further to these six publications there not any other publications which would attempt by scientific methods to prove the existence of the measles virus, the Supreme Court judgment in the measles virus trial and the results of the genetic tests have consequences: Any national and international statements on the alleged measles virus, the infectivity of measles, and on the benefit and safety of vaccination against measles, are since then of no scientific character and have thus been deprived of their legal basis.\n\nUpon enquiries which had been triggered by the measles virus contest, the head of the National Reference Institute for Measles at the Robert Koch Institute (RKI), Prof. Dr. Annette Mankertz, admitted an important fact. This admission may explain the increased rate of vaccination-induced disabilities, namely of vaccination against measles, and why and how specifically this kind of vaccination seems to increasingly trigger autism.\n\nProf. Mankertz has admitted that the “measles virus” contains typical cell’s natural components (ribosomes, the protein factories of the cell). Since the vaccination against measles contains whole “whole measles virus”, this vaccine contains cell’s own structures. This explains why vaccination against measles causes frequent and more severe allergies and autoimmune reactions than other types of vaccination. The court expert Prof. Podbielski stated on several occasions that by the assertion of the RKI with regard to ribosomes in the measles virus, the thesis of existence of measles virus has been falsified.\n\nIn the trial it was also put on record that the highest German scientific authority in the field of infectious diseases, the RKI, contrary to its legal remit as per § 4 Infection Protection Act (IfSG), has failed to create tests for alleged measles virus and to publish these. The RKI claims that it made internal studies on measles virus, however refuses to hand over or publish the results.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2017/01/deadstate-stefan-lanka-.jpg", "locale": "en_US", "type": "article", "title": "Anti-Vaxxer Biologist Stefan Lanka Bets Over $100K Measles Isn't A Virus; He Wins In German Federal Supreme Court", "url": "https://anonhq.com/anti-vaxxer-biologist-stefan-lanka-bets-100k-measles-isnt-virus-wins-german-federal-supreme-court/", "site_name": "AnonHQ", "article:published_time": "2017-01-21T23:39:59+00:00", "article:modified_time": "2017-01-21T23:41:35+00:00", "image:width": "700", "image:height": "488", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.wissenschafftplus.de/", "http://www.wissenschafftplus.de/uploads/article/Wissenschafftplus_Viren_entwirren.pdf", "http://www.wissenschafftplus.de/uploads/article/Protokoll_13_4_20150001.pdf", "http://lrbw.juris.de/cgi-bin/laender_rechtsprechung/document.py?Gericht=bw&GerichtAuswahl=Oberlandesgerichte&Art=en&sid=46bf3db2df690aba6e4874acafaf45b6&nr=20705&pos=0&anz=1", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-01-21T23:39:59+00:00"}