{"result_id": "337028", "URL": "https://anonhq.com/california-seeks-to-curb-parents-natural-right-to-freely-raise-their-children/", "timestamp": "2023-04-25 18:07:52 CEST+0200", "meta": {"description": "SB-18 is about giving California lawmakers and big government nanny-state bureaucrats the power to decide what is and is not “equitable” for the kids.", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/california-seeks-to-curb-parents-natural-right-to-freely-raise-their-children/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "California Seeks to Curb Parents’ Natural Right to Freely Raise Their Children", "cleaned_text": "Dr. Richard Pan, the man behind the mandatory vaccination law (SB-277) that banned unvaccinated children from attending public or private schools, is back with another controversial proposal to usurp parents’ natural rights to make decisions for their children.\n\nThe California State Senator has introduced a Bill of Rights for Children and Youth (SB-18) that, critics argue, gives sweeping powers to the State to prevail over the fate and well-being of all children, to be in charge of children against their will without parental consent, to create policy around seven areas of what is in a child’s best interest, and to seize children from their families if the government deemed it necessary.\n\nThis bill is in its early stages, and it’s not expected to be enacted — if passed — until 2022. But the language of the bill, critics insist, is a matter of concern.\n\nDr. Pan’s seven-point list of rights declares that “all children and youth” have a right to have “parents, guardians, or caregivers who act in their best interest” and to “form healthy attachments with adults responsible for their care and well-being.” It also stipulates that the child is to “live in a safe and healthy environment” and benefit from having “social and emotional well-being,” and to have “opportunities to attain optimal cognitive, physical, and social development.” The child should also have the “appropriate, quality education and life skills leading to self-sufficiency in adulthood;” and to have “appropriate, quality health care.” However, critics claim, this sets a dangerous precedent that spells the end of parental rights whenever a government official or agency declares it so.\n\nFurther, the Legislature’s intent — to “establish a comprehensive framework that governs the rights of all children and youth in California; outlines the research-based essential needs of California’s children; and establishes standards relating to the health, safety, well-being, early childhood and educational opportunities, and familial supports necessary for all children to succeed” — critics add, essentially makes the state the primary caretaker and caregiver of children, over the rights of parents.\n\nShannan Martinez, Dr. Pan’s spokeswoman, told Snopes critics of SB-18 “oppose an effort to empower parents and ensure children and families get the support they need to succeed.” But JD Heyes, contributing writer to Natural News, notes:\n\n“This measure isn’t about ensuring basic rights for kids; it’s about giving California lawmakers and big government nanny-state bureaucrats the power to decide what is and is not “equitable” for the state’s kids. And it won’t matter a bit what their parents think…or want.\n\n“[Senator Richard Pan] He’s tyrannical, in that he believes that only he and the state know what is best for kids — not their parents. He doesn’t trust parents to do the right things for their kids. And he doesn’t believe parents should have a “bill of rights” giving them, and not a faceless, all-powerful bureaucracy the power to make decisions for their own children.”\n\nWhat’s truly dangerous about SB18 is its vagueness, observes Modern Alternative Health:\n\n“It’s extremely problematic to allow a very small group of people to decide what constitutes “best” for an entire group of millions of families. Why do these people get to be the ones to decide? What if they don’t know or understand (or want to understand) those families’ perspective and needs?\n\n“The biggest problem with this proposed law is its utter vagueness. It actually doesn’t do anything at all, in and of itself. What it does is allow them to create lots of other new laws, programs, taxes, or whatever they want…and enforce it. We won’t know exactly what they’re going to come up with or to what extent they’ll enforce them until after this law is passed.”\n\n“Let’s go to the money. In SB-18, a group is referred to: the Peninsula Partnership Leadership Council. The Peninsula Partnership Leadership Council is composed of the San Mateo County Superintendent of Schools, the County Board of Supervisors and the Silicon Valley Community Foundation. The Silicon Valley Community Foundation is a non-profit that has assets of $7.3 BILLION. Here are some of its corporate partners: Alexza Pharmaceuticals. Microsoft. PepsiCo Foundation. Cisco. Hewlett Packard. Dell. Symantec. Unilever. You can bet these corporate partners will reap profits.\n\n“Beyond that, this is their version of a MASSIVE social engineering program. And that program is part of a technocratic movement to plan, format, and run the lives of the population from cradle to grave, because… the hi-tech scientists and engineers know best. They should rule the future because they can plot and chart it out, based on their version (you weren’t consulted) of “greatest good for the greatest number”.\n\n“The best place to start? THE CHILDREN. This is TECHNOCRACY INC. at work. This is the big picture, and it’s bigger than any election or political party. It’s THE PLANNED SOCIETY. It absolutely ignores your freedom or independent choice.”\n\nThis article (California Seeks to Curb Parents’ Natural Right to Freely Raise Their Children) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.\n\nSupporting Anonymous’ Independent & Investigative News is important to us. Please, follow us on Twitter:", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/12/SB-18-11.jpg", "locale": "en_US", "type": "article", "title": "California Seeks to Curb Parents’ Natural Right to Freely Raise Their Children", "description": "SB-18 is about giving California lawmakers and big government nanny-state bureaucrats the power to decide what is and is not “equitable” for the kids.", "url": "https://anonhq.com/california-seeks-to-curb-parents-natural-right-to-freely-raise-their-children/", "site_name": "AnonHQ", "article:published_time": "2017-01-02T22:49:58+00:00", "image:width": "940", "image:height": "788", "image:type": "image/jpeg"}, "tags": ["Senate", "children", "SB-18", "california", "rights"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "696", "height": "392", "embed_code": "<iframe width=\"696\" height=\"392\" src=\"https://www.youtube.com/embed/Y1GUYRkZw1I?feature=oembed\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Y1GUYRkZw1I?feature=oembed"}], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://reason.com/blog/2016/12/29/california-bill-of-rights-for-children-i", "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201720180SB18", "http://www.march-against-monsanto.com/opinion-sacrificing-children-to-the-state-with-new-california-bill-sb-18/", "http://healthimpactnews.com/2016/new-california-proposed-bill-to-increase-government-seizure-of-children-from-families/", "http://www.thenewamerican.com/culture/family/item/24883-nanny-state-shock-california-bill-would-strip-parental-rights", "https://anonhq.com/wp-content/uploads/2016/12/SB-18-1.jpg", "http://www.snopes.com/california-bill-enables-government-to-seize-children/", "http://naturalnews.com/2016-12-20-ca-state-senator-proposing-bill-of-rights-for-children-is-the-same-guy-who-kicked-kids-out-of-school-for-avoiding-vaccines.html", "http://www.modernalternativehealth.com/2016/12/10/californias-sb-18-parental-rights-gone/", "https://anonhq.com/wp-content/uploads/2016/12/SB-18.jpeg", "https://jonrappoport.wordpress.com/2016/12/15/bombshell-sacrificing-children-to-the-state-of-california-sb18/", "https://anonhq.com/?p=85031", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com", "https://twitter.com/AnonymousNewsHQ", "https://twitter.com/AnonymousNewsHQ", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-01-02T22:49:58+00:00"}