{"result_id": "337032", "URL": "https://anonhq.com/china-cuban-drug-proves-itself-in-the-fight-against-corona-virus/", "timestamp": "2023-04-25 18:07:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/china-cuban-drug-proves-itself-in-the-fight-against-corona-virus/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "China: Cuban Drug Proves Itself In The Fight Against Corona Virus", "cleaned_text": "In the fight against the lung disease COVID-19 caused by the corona virus, a newly developed Cuban drug has proven itself in China. But so far, hardly any notice has been taken of it in western latitudes.\n\nChina’s President Xi Jinping recently thanked his Cuban counterpart Miguel Mario Díaz-Canel for supporting the socialist island nation in combating lung disease COVID-19 in China “through preventive and control measures.”\n\nTwo days earlier, Xinhua had reported on the Cuban drug called “Interferon Alfa 2B Humano Recombinante”. The Chinese news agency quoted Li Wenlan, director of the Chinese-Cuban pharmaceutical company Changchun Heber Biotechnology, based in Jilin province in northeast China:\n\n“The Chinese National Health Commission has added interferon to the list of medications to prevent and fight the corona virus.”\n\nThe director reported that a variant of the drug has been manufactured against various virus-related diseases in China using Cuban technology since 2007. Based on the existing stocks, the Chinese now produced and distributed the new interferon Alfa 2B Humano Recombinante in just 21 days. The director of Changchun-Heber also emphasized that a group of Cuban experts are deployed in China.\n\nThere is currently no tested vaccine against the current variant of the corona virus worldwide. But the Cuban pharmaceutical industry offers two drugs that work on a similar principle and have been used successfully in China. One is the said interferon, the other is Biomodulina T. Both serve to strengthen the immune system.\n\nEduardo Martínez Díaz, director of the leading Cuban pharmaceutical laboratory BioCubaFarma, recalled that the official medical guideline of the Chinese health system recommends 30 drugs. The Cuban-Chinese interferon is mentioned in the first place.\n\nThe vice director of the Cuban Center for Genetics and Biotechnology (CIGB), Marta Ayala Ávila, told the press that the new interferon will be administered as an inhalation spray. This is the shortest way to get into the lungs and to act in the early phase of the respiratory disease COVID-19 triggered by the corona virus.\n\nDoctors and nurses in China are currently taking the drug as a precautionary measure to strengthen their immune systems. Infected patients are treated as quickly as possible, because the earlier it is used, the greater its effectiveness. Therefore, early detection techniques play a vital role in combating such an epidemic.\n\nÁvila explained that the “interferons” are molecules that the organism produces when it is attacked by a virus. They are the first organic response of the immune system to the viral attack. But the corona virus directly blocks the production of these interferon molecules instead of starting them. The effectiveness of the Cuban biotech drug is that it starts at this point and supplies the organism with the vital molecules.\n\nIn previous epidemics caused by variants of the corona virus, such as SARS or MERS, interferons have also been used successfully for the treatment of infected patients.\n\nThe drug Biomodulina T. was developed according to similar principles. Immunology specialist Mary Carmen Reyes, head of the clinical trials group at the National Center for Biopreparations (BioCen) in Havana, said the drug is a balancing modulator. It is used successfully in older patients with respiratory infections to alleviate the symptoms of the disease and prevent relapses. This would potentiate the patient’s resistance. The drug is particularly effective and safe, with little side effects, says Reyes.\n\nBoth products are also made in Cuba. The island nation now has the capacity to meet intra-Cuban needs for three to six months in the event of a possible epidemic. Sufficient production can also be made for international demand.\n\nWe have taken stock of the product in process. The stock is practically the amount that would be needed to treat the infections that have occurred in China, “said CIGB Director General Dr. Vázquez.\n\nIn the meantime, 15 requests have been received from other nations, who either ask for initial information or want to buy the drug.\n\nExact side effects still need to be researched\n\nIn fact, the current interferon spray was developed as a quick response to the new virus and had to be used directly. There was no time for preliminary clinical examinations. On the other hand, there are studies of previous generations of medications from the same family that were carried out after previous corona virus infections, as reported by the Cuban newspaper GRANMA.\n\nGabriela Delgado, president of the Colombian Immunotherapy Society, said in a radio interview that interferon, on the one hand, boosts the immune system’s defenses, but on the other, it can sometimes weaken other antibodies.\n\nActivation of the immune system is non-specific in interferon, but must be specific to avoid such effects, “said Delgado.\n\nAccording to her, in China the malaria drug chloroquine is used in severe cases, which is statistically more efficient. Unlike Delgado, Dr. Gerardo Guillén of the CIGB, however, expressly points out that “interferon is involved in the (balancing) modulation of the immune system. It acts both in the innate, non-specific area and in the part of the immune system acquired later”. It would also prevent the spread of pathogenic germs.\n\nIn a scientific study conducted by the Catholic University of Bogota in Colombia in 2018, the effects of the subcutaneously administered interferon alfa drugs in the anti-virus area were classified: they regulate the immune system, fight viral infections, prevent their spread and are anti-inflammatory . Side effects such as mild flu symptoms, fatigue, headache or fever have been noted. Any combination with other drugs must therefore be strictly controlled.\n\nEverything suggests that the interferon drug will bring positive results when used preventively or in the early stages of corona infection. Certainly also because the build-up process in the immune system takes some time. The results are not clear in the case of highly advanced infections, which is why other drugs must be used as a priority in such cases.\n\nA final evaluation of the treatment of the Corona virus with the Cuban interferon drug is not yet possible, but it is striking that the associated experience in media and medical discourse in Europe does not appear to play a role.\n\nFor example, a current overview by the Association of Researching Pharmaceutical Manufacturers (vfa) on currently tested or developing therapeutic corona drugs lacks Cuban interferon.\n\nNone of the products of western pharmaceutical companies mentioned therein have been sufficiently scientifically tested and are ready for use against the corona virus. They are at least in the same stage as the Cuban drug. The Cubans, however, have practical successes during a massive epidemic and are thus almost ahead of all other competitors.\n\nSo what criteria did you choose here? According to scientific or economic? One thing is clear: Cuban drugs stand in the way of the profit interests of the domestic pharmaceutical industry, which may be the primary reason why they receive so little attention in the West – even with proven effectiveness during the corona epidemic in China.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2020/03/cuban-coronavirus-drug.jpg", "locale": "en_US", "type": "article", "title": "China: Cuban Drug Proves Itself In The Fight Against Corona Virus", "url": "https://anonhq.com/china-cuban-drug-proves-itself-in-the-fight-against-corona-virus/", "site_name": "AnonHQ", "article:published_time": "2020-03-23T04:48:09+00:00", "article:modified_time": "2020-03-24T00:25:26+00:00", "image:width": "790", "image:height": "444", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://www.facebook.com/amazyble/videos/802769883460006/", "https://anonhq.com/wp-content/uploads/2020/03/Cuba-Italy.jpg", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2020-03-23T04:48:09+00:00"}