{"result_id": "337011", "URL": "https://anonhq.com/zika-carrying-mosquito-triggers-yellow-fever-epidemic-congo-country-runs-vaccines/", "timestamp": "2023-04-25 18:07:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/zika-carrying-mosquito-triggers-yellow-fever-epidemic-congo-country-runs-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Zika-Carrying Mosquito Triggers Yellow Fever Epidemic in Congo: Country Runs Out of Vaccines", "cleaned_text": "The Democratic Republic of the Congo has declared an epidemic of yellow fever; three provinces, including the capital Kinshasa, are said to be currently affected by the virus.\n\nThe announcement, which comes just weeks after the Red Cross warned that another outbreak in neighboring Angola risked sparking a “global crisis,” was made after 67 cases – five of them fatal– where yellow fever were confirmed. An additional 1,000 cases are currently monitored, according to the country’s health minister.\n\n“I declare today a localised epidemic of yellow fever in the provinces of Kinshasa, Kongo Central and Kwango,” Health Minister Felix Kabange told a news conference.\n\nYellow fever is a is a serious viral infection spread by certain types of mosquito – the same type that also spreads the Zika and dengue viruses. The symptoms of yellow fever occur in two stages. The initial symptoms include a high temperature (fever), a headache, nausea or vomiting, muscle pain and loss of appetite.\n\nThe majority of sufferers will recover from these symptoms after three to four days. However, around 15 percent of those who have contracted the virus will develop more serious problems, including jaundice, kidney failure and bleeding from the mouth, nose, eyes or stomach – as many as 50 percent of the people who develop these advanced symptoms will die.\n\nThe Democratic of the Congo has a nationwide population of around 77 million; more than 12 million currently live in the capital Kinshasa. As a result, millions of people are at severe risk of contracting the deadly disease.\n\nThe outbreak in Kinshasa is a cause for major concern for global health officials – especially since a vast majority of the stockpiled yellow fever vaccines were consumed during the Angola outbreak. According to reports, the DRC has almost depleted its stocks of the vaccine in the capital.\n\nIn Angola, yellow fever has been spreading across the nation since last December; more than 300 are said to have died from the disease, while another 2,267 people are said to be infected. Julie Hall, health director for the International Federation of Red Cross and Red Crescent Societies, had urged international agencies and donors to take early action that would prevent an outbreak.\n\nIn a statement she said: “Unvaccinated travellers could transform this outbreak into a regional or international crisis if we don’t move quickly to protect vulnerable populations and help communities to reduce their risk of infection.”\n\nOf the 67 cases confirmed in the DRC, seven were locally transmitted, 58 were imported from Angola and two came from remote forested areas not linked to the current outbreak. About 2 million people, half of them located in Kinshasa, were vaccinated by the government and international health organizations between May 26 and June 4.\n\nHowever, as the vaccines stocks have near entirely diminished – a small number of doses remain in reserve in Congo Central – some local people have reported that they were denied immunization due to the shortage. Many have stood in ques, waiting for the possibly life saving vaccine, only to be turned down later.\n\nIn Kinshasa’s Ndjili commune, fights have broken out among the lines of people waiting to receive the vaccine. “Everyone started coming, even from other districts. Near the end we realized that the vaccine was insufficient,” said Murphy Nzuzi, a doctor at a dimly-lit health center in Ndjili.\n\nIn fact, residents of a nearby market revealed that although they had been presented with vaccination papers whilst waiting in line, they did not receive the vaccine.\n\n“When you present yourself, they give you the card that gives you access to the vaccine, but then there wasn’t enough vaccine for everyone,” said local resident Mama Mavungu.\n\nIn response to the shortage, the International Coordinating Group on vaccine provision has pledged to provide the Congo with a further 1 million doses of the vaccine, according to Eugene Kabambi, the World Health Organization (WHO) spokesman in Congo.\n\n“That requires either a cargo flight, in which case it would come very quickly but cost a lot, or if it’s by boat, it could take a few weeks,” he told Reuters.\n\nYou want to support Anonymous Independent & Investigative News? Please, follow us on Twitter: Follow @AnonymousNewsHQ\n\nThis article (Zika-Carrying Mosquito Triggers Yellow Fever Epidemic in Congo: Country Runs Out of Vaccines) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/06/24483881083_615e89ee4c_z.jpg", "locale": "en_US", "type": "article", "title": "Zika-Carrying Mosquito Triggers Yellow Fever Epidemic in Congo: Country Runs Out of Vaccines", "url": "https://anonhq.com/zika-carrying-mosquito-triggers-yellow-fever-epidemic-congo-country-runs-vaccines/", "site_name": "AnonHQ", "article:published_time": "2016-06-25T14:58:53+00:00", "image:width": "640", "image:height": "427", "image:type": "image/jpeg"}, "tags": ["Yellow Fever"], "tweets": ["<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p dir=\"ltr\" lang=\"en\">WHO to launch emergency yellow fever vaccinations in Angola, Congo <a href=\"https://t.co/vzRTircTzM\">https://t.co/vzRTircTzM</a> <a href=\"https://t.co/v0XBPLiWSz\">pic.twitter.com/v0XBPLiWSz</a></p><p>— Scientific American (@sciam) <a href=\"https://twitter.com/sciam/status/745999909531287552\">June 23, 2016</a></p></blockquote>"], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.telegraph.co.uk/news/2016/06/21/yellow-fever-epidemicdeclared-in-congo/", "http://www.telegraph.co.uk/news/2016/06/21/yellow-fever-epidemicdeclared-in-congo/", "http://www.independent.co.uk/news/world/africa/yellow-fever-epidemic-declared-in-congo-with-1000-suspected-cases-a7091821.html", "http://www.nhs.uk/Conditions/Yellow-fever/Pages/Introduction.aspx", "http://www.breitbart.com/national-security/2016/06/21/zika-carrying-mosquito-brings-yellow-fever-epidemic-congo/", "http://www.telegraph.co.uk/news/2016/06/21/yellow-fever-epidemicdeclared-in-congo/", "https://anonhq.com/wp-content/uploads/2016/06/10703811283_2f27382f1e_z.jpg", "http://www.telegraph.co.uk/news/2016/06/21/yellow-fever-epidemicdeclared-in-congo/", "http://www.reuters.com/article/us-congodemocratic-yellowfever-idUSKCN0Z81FI", "http://www.reuters.com/article/us-congodemocratic-yellowfever-idUSKCN0Z81FI", "https://t.co/vzRTircTzM", "https://t.co/v0XBPLiWSz", "https://twitter.com/sciam/status/745999909531287552", "http://www.reuters.com/article/us-congodemocratic-yellowfever-idUSKCN0Z81FI", "http://www.reuters.com/article/us-congodemocratic-yellowfever-idUSKCN0Z81FI", "https://www.flickr.com/photos/braerik/", "https://twitter.com/AnonymousNewsHQ", "https://creativecommons.org/licenses/by/4.0/", "http://www.anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-06-25T14:58:53+00:00"}