{"result_id": "337035", "URL": "https://anonhq.com/mutant-mosquitoes-released-near-florida/", "timestamp": "2023-04-25 18:07:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/mutant-mosquitoes-released-near-florida/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Mutant Mosquitoes To Be Released Near Florida", "cleaned_text": "Odds are you have already heard of Genetically Modified Organisms (GMOs), especially in relation to food crops such as corn, wheat and potatoes, and how individuals and countries are electing to avoid them. But now, British biotechnology company, Oxitec, is seeking Federal Drug Administration (FDA) approval to “field test” its genetically modified mosquito in the Florida Keys. Citing an increase in tropical diseases from climate change and globalization, companies like Oxitec seek to control disease-spreading mosquito populations.\n\nCertainly mosquitoes are an issue in the Florida Keys, where despite spraying insecticides continuously, the local mosquitoes, Aedes aegypti, continue to flourish and have even adapted to become resistant to four out of the six pesticides used. Aedes aegypti, also known as the yellow fever mosquito, can spread Dengue Fever and Chikungunya, two highly painful diseases for which there are no vaccines yet.\n\n According to the Center for Disease Control (CDC), there are only about 28 cases of Chikungunya per year in the United States, usually from individuals who had been traveling in the Caribbean or in Asia. On its website, the CDC states the last real outbreak of Dengue in the continental U.S. was in 2005, in Texas.\n\nOxitec aims to reduce the mosquito population by introducing its genetically modified specimens. The company has developed a way of inserting fragments of genetic material from other organisms, such as coral and E. coli bacteria, into the male mosquitoes. The males are then released to mate with the females in the wild, and this genetic material passes from the males and essentially kills the larvae resulting from these couplings.\n\nOxitec claims this same genetic material poses no threat to other organisms and will not interfere with humans at all, as only the male mosquitoes will be released and it is only the females who bite. Even if bitten, none of the genetically modified material would enter a human’s bloodstream, they claim. But others say the company has not done enough to prove these claims.\n\n“Why are we being used as the experiment, the guinea pigs, just to see what happens?” Marilyn Smith, a Key West resident wondered at a public meeting following a presentation by Oxitec, according to an Associated Press report.\n\nOxitec released 3.3 million of these modified mosquitoes in the Cayman Islands over six months in 2012. Residents say there was an issue of informed consent, as no one was informed stray females from the lab could also escape into the wild population.\n\n“To say that there’s no genetically modified DNA that might get into a human, that’s kind of a gray matter,” Phil Lounibos, of the Florida Entomology Laboratory, told the AP.\n\nOxitec is hoping to release its mosquitoes from its lab in Key West this spring. To date, it has released 70 million modified mosquitoes in countries around the world. A petition on Change.org has already garnered over 140 thousand signatures pleading for government agencies to refuse Oxitec’s plans for Florida. Theresa Eisenman, spokeswoman for the FDA, told the AP the FDA would not give Oxitec the go-ahead until the FDA has “thoroughly reviewed all the necessary information.”", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2015/01/Mosquito-Brazil-e1422290884789.jpg", "locale": "en_US", "type": "article", "title": "Mutant Mosquitoes To Be Released Near Florida", "url": "https://anonhq.com/mutant-mosquitoes-released-near-florida/", "site_name": "AnonHQ", "article:published_time": "2015-01-31T02:15:53+00:00", "article:modified_time": "2015-01-31T02:18:34+00:00", "image:width": "650", "image:height": "365", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://anonhq.com/wp-content/uploads/2015/01/gmomosquito.jpg", "http://www.contracostatimes.com/environment/ci_27390300/millions-gmo-insects-could-be-released-florida-keys", "https://rt.com/usa/226203-florida-mosquitoes-gmo-insects/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2015-01-31T02:15:53+00:00"}