{"result_id": "337026", "URL": "https://anonhq.com/trump-is-anti-flu-shot-and-questions-childhood-vaccine-schedule/", "timestamp": "2023-04-25 18:07:51 CEST+0200", "meta": {"description": "In 2015, Trump made it clear that he believed the vaccine industry needs to be looked at; that childhood immunisation schedules need to be re-examined.", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/trump-is-anti-flu-shot-and-questions-childhood-vaccine-schedule/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Trump is Anti-Flu Shot and Questions Childhood Vaccine Schedule", "cleaned_text": "In 2015, CNN attempted to “destroy” Donald Trump with the debate. When they with all the usual pro-vaccine arguments and propaganda and why children must be vaccinated, Trump got them with one line:\n\n“But I want smaller doses [for children] over a longer period of time.”\n\nWhat really backfired on CNN was their attempts then to have Ben Carson attack Trump’s comment. Instead, Carson agreed, “We are probably giving way too many in too short a period of time…”\n\nRand Paul, also expressed his concern that evening, said “I’m all for vaccines, but I’m also for freedom. I’m concerned about how they’re bunched up… I ought to have the right to spread out the vaccines a little bit…”\n\nMike Huckabee followed up with a “Why doesn’t this country focus on cures rather than treatment? Why don’t we focus on the cure for cancer, diabetes, Alzheimer’s?”\n\nIt was with that, CNN very quickly changed the subject.\n\nIn the same year, Trump admitted his strong distrust of the flu vaccine. In an interview with Opie and Anthony on Sirius XM, Trump described flu shots as “totally ineffective,” stating he had never had one and had never come down with the flu.\n\n“I’ve never had one. And thus far I’ve never had the flu. I don’t like the idea of injecting bad stuff into your body. And that’s basically what they do. And this one (latest flu vaccine) has not been very effective to start off with.\n\n“I have friends that religiously get the flu shot and then they get the flu. You know, that helps my thinking. I’ve seen a lot of reports that the last flu shot is virtually totally ineffective.”\n\nEveryone knows – and Big Pharma companies around the world admit to it – that mercury, a powerful neurotoxin is contained in a vaccine.\n\nThe vaccine industry itself, is also utterly protected after Congress passed law protecting them against lawsuits and criminal prosecution, essentially granting them legal immunity – even if a person dies as a result of their vaccine.\n\nAny level of mercury in the body is not good. Any self-respecting scientist will agree with that simple statement. \n\n\n\nPushing copious amounts of vaccines on an infant under the latest schedules and within such short time frames has never fully been investigated long term. And now, in the United States and Australia, the law is there to punish all those parents who refuse to have their child immunised according to the schedule – including the latest hepatitis shot.\n\nFast forward to 2017, and the argument about vaccine protocols is still there. But one thing has changed, and that is Donald Trump is now the 45th President of the United States.\n\nThe big question is, will Donald Trump hold Big Pharma accountable? If there is ever an executive order to pass it’s the one that removes the legal immunity from such companies, force further research, and slow down the immunisation schedule for children.\n\nIn Trump’s own words: “I’m in favor of vaccines [but] do them over a longer period of time, same amount, but just in little sections. I think you’re going to have — I think you’re going to see a big impact on autism.”\n\nThis article (Trump is Anti-Flu Shot and Questions Childhood Vaccine Schedule) is a free and open source. You have permission to republish this article under a license with attribution to the author and .\n\nSupporting Anonymous’ Independent & Investigative News is important to us. Please, follow us on Twitter:", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2017/01/vaccine-600x360.jpg", "locale": "en_US", "type": "article", "title": "Trump is Anti-Flu Shot and Questions Childhood Vaccine Schedule", "description": "In 2015, Trump made it clear that he believed the vaccine industry needs to be looked at; that childhood immunisation schedules need to be re-examined.", "url": "https://anonhq.com/trump-is-anti-flu-shot-and-questions-childhood-vaccine-schedule/", "site_name": "AnonHQ", "article:published_time": "2017-01-30T00:44:57+00:00", "image:width": "600", "image:height": "360", "image:type": "image/jpeg"}, "tags": ["children", "mercury", "Trump", "pro-vaccine", "anti-vaccine", "autism link", "vaccines", "flu shot"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "700", "height": "400", "embed_code": "<iframe src=\"https://www.youtube.com/embed/cDARZJxzeoY\" width=\"700\" height=\"400\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/cDARZJxzeoY"}], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://www.naturalnews.com/046630_CDC_whistleblower_public_confession_Dr_William_Thompson.html", "http://www.naturalnews.com/051213_Donald_Trump_vaccines_CNN_debate.html", "https://creativecommons.org/licenses/by/4.0/", "https://twitter.com/AnonWatcherHQ", "https://anonhq.com/", "https://twitter.com/AnonymousNewsHQ", "https://twitter.com/AnonymousNewsHQ", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2017-01-30T00:44:57+00:00"}