{"result_id": "337027", "URL": "https://anonhq.com/better-worse-heres-global-elite-shaped-world/", "timestamp": "2023-04-25 18:07:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/better-worse-heres-global-elite-shaped-world/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "For Better or Worse, Here's how the Global Elite have Shaped our World", "cleaned_text": "When talking about the world’s richest and most powerful people, it is hard to separate the truth from conspiracy. Secret Illuminati out to destroy humanity or philanthropists re-investing their wealth back into society? For better or worse, here is how the global elite influence the world.\n\nModern Americans only seem to remember this name from clever commercials about their national bank, but following the industrial revolution, J.P. Morgan was one of the wealthiest men in the United States. He was personally responsible for leading the merger which formed General Electric, the largest power company of the early 20th century. In 2016, this company still remains the 9th largest corporation in the fortune 500.\n\nWe all remember the controversial bail out of 2009 when several companies, deemed too big to fail, were granted trillions of dollars in loans by the Federal Government to stay in business. What few remember is that the United States government itself once had to be bailed out.\n\nSo, where does the federal government turn to avoid collapse? J.P. Morgan.\n\nIn 1895, JP Morgan sold the federal government 62 million dollars in gold bonds after 2 years of depression threatened to undermine the economy. This amount is the modern equivalent of 2.1 billion dollars. It might not sound like that much but at the time, the federal government, our military and federal programs were almost non existent compared to the levels we see today.\n\nHis banks remain one of the main managing partners of the federal reserve.\n\nIt could be argued that no family has done more harm to the Earth than the Rockefellar’s – though it is not really all their fault. According to Forbes, the Rockellar family remains the 24th richest family in the United States today, worth over an estimated 11 billion dollars. All of this money is from the result of oil.\n\nBelieve it or not, in the late 1800’s, gasoline used to be dumped into rivers by kerosene companies as an unnecessary/unwanted bi-product from kerosene production. In the early 20th century, John Rockefellar discovered the first practical use for the ‘waste product’ known as gasoline, forever changing the world in the process. The rest is history.\n\nIn addition to the Rockefellar’s global oil production causing countless wars throughout the 20th & 21st centuries, and devastating the global climate, the Rockefellar’s have also left their mark on the American public as well. Redistributing their wealth back into society and into the government, the Rockefellar’s are responsible for founding the modern day federal education system; they regulated and funded the federal medical care system as well as founded the now multi-billion dollar vaccine industry.\n\nWithout a doubt, the Rothchild’s are the wealthiest family in the history of the world. Their modern fortune can be traced back the 1760’s when Mayer Amschel Rothschild, a Jew living inside Germany, founded a banking business handling the finances of German Royals.\n\nBy 1815 Mayer Rothchild and his 5 sons opened multiple new banks across Europe and like they did in Germany, they were in the business of managing the finances of political elites/wealthiest members of these countries. For more then a century after this time, the Rothchilds owned the worlds largest bank and the largest individual banks in several countries.\n\nAs the Rothchilds owned not only the largest bank in the world but the largest banks across Europe, whilst simultaneously managing the wealth of political leaders in these countries, their power in the global market is without measure – directly leading to the conspiracies we hear today.\n\nSince the Rothchilds owned the largest banks in the same countries that were at war with one another, it has been successfully argued that the Rothchilds directly funded both sides of WW1 and WW2. As they are Jewish themselves, the Rothchilds are directly responsible for the spread of Zionism in the early 20th century and the founding of Israel after WW2 as well.\n\nAs if this is not enough, it has long since been alleged that the Rothchilds own the global media – the reason why they are never talked about in the media. This stems back to the fact that Paul Reuter, the founder of REUTERS, in the mid 1800’s, was a banking partner of the Rothchilds’ – who later went on to purchase the rights to REUTERS media from him.\n\nToday REUTERS, an international conglomerate, owns the Associated Press, an international new agency that operates 1,700 newspapers; 243 news bureaus and employs over 5,000 television broadcastors across 120 separate countries.\n\nBill Gates of course rose to fame after founding Microsoft. This one time college drop out has grown to become the single wealthiest man in the United States today. Today, Bill Gates uses his tremendous wealth in philanthropic endeavors across the globe.\n\nGates is one of the largest shareholders behind Monsanto, a company producing genetically modified crops to poverty stricken, third world countries across the globe – they of course also have a large presence within the United States. In addition to this, Bill Gates was one of the major donors to step forth behind the implementation of Common Core, which established new guidelines for the federal education system.\n\nPerhaps Gates biggest endevor is spreading vaccines across the globe, particularly within some of the most remote regions of the Africa. By some estimations, Bill Gates has personally put forward 2.5 billion dollars of his own money to spread vaccines to hard to reach places around the world.\n\nThough these actions may be looked at as valiant by some, every one of the topics above has been harshly criticized by the conspiracy community.\n\nYou want to support Anonymous Independent & Investigative News? Please, follow us on Twitter: Follow @AnonymousNewsHQ\n\nThis article (For Better or Worse, Here’s how the Global Elite have Shaped our World) is a free and open source. You have permission to republish this article using a creative commons license with attribution to the author and AnonHQ. Join the conversations at www.anonboards.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/08/roth-e1470601106369.jpg", "locale": "en_US", "type": "article", "title": "For Better or Worse, Here's how the Global Elite have Shaped our World", "url": "https://anonhq.com/better-worse-heres-global-elite-shaped-world/", "site_name": "AnonHQ", "article:published_time": "2016-08-14T21:56:36+00:00", "article:modified_time": "2016-08-14T22:12:03+00:00", "image:width": "700", "image:height": "352", "image:type": "image/jpeg"}, "tags": ["Rockefeller", "J.P. Morgan", "world's elite", "Bill Gates"], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://www.msn.com/en-us/money/topstocks/the-10-biggest-companies-of-the-fortune-500/ss-BBkCAR0#image=5", "http://projects.vassar.edu/1896/morganbonds.html", "http://www.davemanuel.com/inflation-calculator.php?x=119&y=21", "http://www.attendly.com/rockefellers-unconventional-approach-to-getting-rid-of-waste/", "http://rockefeller100.org/exhibits/show/health/childhood-immunization", "http://history1900s.about.com/cs/holocaust/p/balfourdeclare.htm", "https://twitter.com/AnonymousNewsHQ", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/author/righteous/", "https://anonhq.com", "https://www.anonboards.com", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-08-14T21:56:36+00:00"}