{"result_id": "337012", "URL": "https://anonhq.com/jim-carrey-slams-big-pharmas-influence-over-us-political-system/", "timestamp": "2023-04-25 18:07:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/jim-carrey-slams-big-pharmas-influence-over-us-political-system/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Jim Carrey Slams Big Pharma’s Influence Over US Political System", "cleaned_text": "Earlier this month actor Jim Carrey made headlines after he tweeted his feelings about California’s new vaccine law to his 14 million followers. The new law eliminates exemptions for vaccines based on religious or personal reasons. The well-known actor called California Governor Jerry Brown a “corporate fascist.”\n\nFollowing the tweets, Jim Carrey was attacked by the media for not blindly supporting vaccinations. In a post titled, “Safety and Civil Liberties: Is Corporate Clout Calling the Shots?,”Carrey stated that he supports the use of vaccines but also called out the dangers in accepting the practice without question. He writes, “Let me be clear: I fully support the use of vaccines and believe they play a vital role in protecting the health of individuals and the public at large. That does not mean, however, that every vaccine is healthy, imperative, or right for every individual in every circumstance.”\n\nCarrey goes on to acknowledge that vaccines have saved millions of lives from whooping cough, smallpox and more deadly diseases. “There is no question that many of these vaccines have been among the greatest medical advancements in history. There is also no question that vaccines can and do injure people as the hundreds of millions of dollars awarded in vaccine court have proved.”\n\nThe vaccine court Carrey refers to is officially known as the Office of Special Masters of the U.S. Court of Federal Claims. The so-called vaccine court is a little-known system that is intended to address claims of Americans who believe their children have been harmed by vaccinations. The court is an established part of the federal judiciary system, however, the authorities over the cases are not called judges but rather “special masters.”\n\nIn late 2014, TruthInMedia reported that the Associated Press examined hundreds of court decisions, performed more than 100 interviews, and studied a database containing more than 14,500 cases. The database was last updated in January 2013, with the government refusing to release any new updates.\n\nThe AP investigation found several issues with the court. These included tens of millions of taxpayer dollars paid to private attorneys who often practice “churning,” a practice described as filing a large number of claims regardless of the quality of the claims. In the private court, attorneys are paid out whether or not they succeed in convincing the court. That fact has lead to questionable billing practices and an increase in court claims.\n\nThe AP report also found that “expert” witnesses for the families and the government often have a lack of credibility or conflicts of interest. The report said that some of the experts are also involved in setting up nonprofits that question vaccine safety. Meanwhile, doctors hired by the government to testify in defense of vaccines have ties to the pharmaceutical industry.\n\nThe AP report seems to confirm Jim Carrey’s concerns. “Over the past 20 or so years, pharmaceutical companies have given nearly $300 million to candidates for federal office, spent almost $200 million influencing California state elections, and have amassed over $3 billion in fees for high-powered lobbyists in Washington,” he writes. “I don’t think its crazy to be suspicious when these companies receive guaranteed revenue streams from politicians they have spent billions trying to influence.”\n\nCarrey also says that the Center for Disease Control (CDC) operates a “revolving door” which “spins in perpetuity.”He also mentions CDC whistleblower Dr. William Thompson. In February of this year, TruthInMedia reported on the existence of a whistleblower within the CDC. Dr. William Thompson alleges that a study he worked on “fudged numbers” to lower the number of black children who were adversely affected by a certain type of vaccine.\n\nJournalist Ben Swann later confirmed that Dr. Thompson did, in fact, turn over documents to Congressman Bill Posey’s office:\n\n“Congressman Bill Posey’s office has confirmed exclusively to Benswann.com that a ‘very large number’ of documents have been turned over by CDC scientist, Dr. William Thompson, who has admitted that the CDC suppressed information about the links between the MMR vaccine and autism in some cases.\n\n“According to Congressman Posey’s spokesman, George Cecala, ‘I can confirm that we have received a very large number of documents and we are going through those documents now. There are a lot of them, so it will take some time.’ Cecala could not say exactly how many documents are in possession of the Congressman’s staff though sources tell me that as many as 100,000 documents have been handed over.”\n\nAgain, Jim Carrey does not seem to be a raving madman but rather, someone who is well-researched and generally concerned. Lastly, he remarks about the dangers of allowing the government to make health decisions for individuals and families.\n\n“It is simply unacceptable for the government to infringe on this right by forcing a mother or father to accept a one-size-fits-all approach to their child’s medical care. Such a requirement should never be tolerated, but is particularly troubling when questions still remain concerning the safety of certain chemicals used to produce some vaccines.”\n\nSo far it seems like the corporate media is not buying Carrey’s latest memo.\n\nWhether you believe what he is saying or not, it seems perfectly reasonable to ask the government to allow free individuals to make their own health decisions. If the people of the United States allow the government to decide what vaccines they can and cannot have, it will only be a matter of time before every free person is subject to the will of the State. Jim Carrey seems to offer a warning of what may come if we do not assert our rights.\n\n“I haven’t lost my sense of humor folks. It’s just buried under the rubble that was once my faith in government oversight. But there’s a time to laugh and a time for a serious debate over what it could mean to have our civil liberties taken away by our government at the behest of pharmaceutical companies and their shareholders. If we just sit back and let corporate clout call the shots our children may not remember what freedom was.”\n\nWhat are your thoughts? Are the legitimate dangers associated with vaccinations? Is this a paranoid conspiracy? Leave your comments below.\n\nGet Your Anonymous T-Shirt / Sweatshirt / Hoodie / Tanktop, Smartphone or Tablet Cover or Mug In Our Spreadshirt Shop! Click Here", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2015/07/jim-carrey-vaccines.jpg", "locale": "en_US", "type": "article", "title": "Jim Carrey Slams Big Pharma’s Influence Over US Political System", "url": "https://anonhq.com/jim-carrey-slams-big-pharmas-influence-over-us-political-system/", "site_name": "AnonHQ", "article:published_time": "2015-07-26T00:30:08+00:00", "image:width": "728", "image:height": "380", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://theantimedia.org/author/derrickb1/", "http://theantimedia.org/", "http://theantimedia.org/jim-carrey-forced-vaccinations/", "https://twitter.com/JimCarrey", "http://theantimedia.org/jim-carrey-forced-vaccinations/", "https://medium.com/@JimCarreyIsHere/safety-and-civil-liberties-is-corporate-clout-calling-the-shots-ce1ac9a6c7ed", "http://truthinmedia.com/report-vaccine-court-keeps-thousands-of-injured-families-waiting-for-compensation/", "http://news.yahoo.com/ap-impact-vaccine-court-keeps-claimants-waiting-183827288--finance.html", "http://www.opensecrets.org/industries/totals.php?cycle=2014&ind=h04", "http://www.followthemoney.org/show-me?f-fc=2,3&d-cci=68&s=CA", "https://www.opensecrets.org/lobby/top.php?indexType=i", "http://truthinmedia.com/update-congressmans-office-in-possession-of-100000-cdc-whistleblower-documents/", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2015-07-26T00:30:08+00:00"}