{"result_id": "337003", "URL": "https://anonhq.com/is-zika-linked-birth-defects-a-monsanto-cover-up/", "timestamp": "2023-04-25 18:07:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/is-zika-linked-birth-defects-a-monsanto-cover-up/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Is Zika-Linked Birth Defects a Monsanto Cover Up?", "cleaned_text": "It wasn’t long ago, our Anonymous media branch revealed that the link between the Mosquito borne virus Zika and the birth defect Microcephaly may be circumstantial only. Now, it seems, a group of physicians have declared similar.\n\nThe Argentine doctors who have banded together under the banner Physicians in the Crop-Sprayed Towns, have raised concern about the birth defects being related to the deliberately polluted water in the towns where abnormally high rates of Microcephaly are present.\n\nThe guilty party, they claim is a ‘strategic partner’ of Monsanto. Their counterpart, Japanese company Sumitomo, manufactured a chemical called Pyriproxyfen, which was introduced into the drinking water supplies in 2014. According to the physicians’’ report, Pyriproxyfen is a chemical larvicide that was produced to curtail the mosquito breeding cycle. The affects that alter the developing mosquitoes during its developmental cycle – larva, pupa, adult – mimic the birth defects now affecting unborn babies.\n\nThe inhabitance of the development of the mosquito can range from wing and genitalia defect, to disabling and killing them.\n\n“Malformations detected in thousands of children from pregnant women living in areas where the Brazilian state added Pyriproxyfen to drinking water are not a coincidence, even though the Ministry of Health places a direct blame on the Zika virus for this damage,” the Physicians in the Crop-Sprayed Towns have commented.\n\nAccording to the Pesticide Action Network Pesticide database, pesticides such as Pyriproxyfen are Endocrine disruptors and can “interfere” with animals and humans. “Exposures can cause sterility or decreased fertility, impaired development, birth defects of the reproductive tract, and metabolic disorders.”\n\nAccording to sponsored WHO reports, the same chemical still has a “?” for the “Developmental or Reproductive Toxin” and “Endocrine Disruptor” categories. But they do say this:\n\n“Some pesticides are known to cause birth defects or interfere with normal development… Many pesticides that disrupt endocrine functions also cause reproductive and developmental harm, as well as other adverse effects,” says one report.\n\nNothing is confirmed by the sources, as studies are yet to be conducted in an appropriate manner to rule out negative outcomes.\n\nAccording to advice to veterinarians who use the substance on domestic animals to control fleas, it is stipulated that “[Pyriproxyfen] neither veterinary antiparasitic nor any agricultural pesticides are tested in human beings to determine their toxicity to humans before they are introduced in the market.” The parent site suggests pregnant women should avoid it, as “acute intoxication” may be more likely.\n\nThe State-controlled program to eradicate mosquitos in Brazil by adding Pyriproxyfen (also less commonly known as Pyroproxyfen) to the drinking water of residents, has been urged by these Physicians to conduct further studies to “rule out” their hypothesis.\n\nThis Article (Is Zika-Linked Birth Defects a Monsanto Cover Up?) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author AnonWatcher and AnonHQ.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/02/zika.jpg", "locale": "en_US", "type": "article", "title": "Is Zika-Linked Birth Defects a Monsanto Cover Up?", "url": "https://anonhq.com/is-zika-linked-birth-defects-a-monsanto-cover-up/", "site_name": "AnonHQ", "article:published_time": "2016-02-15T09:38:45+00:00", "article:modified_time": "2016-02-15T09:43:19+00:00", "image:width": "734", "image:height": "489", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://anonhq.com/48462-2/", "http://www.reduas.com.ar/wp-content/uploads/downloads/2016/02/Informe-Zika-de-Reduas_TRAD.pdf", "http://news.monsanto.com/press-release/corporate/joint-press-release-monsanto-sumitomo-chemical-and-valent-extend-crop-protec", "http://www.icup.org.uk/reports%5CICUP886.pdf", "http://www.pesticideinfo.org/Detail_Chemical.jsp?Rec_Id=PC35792", "http://www.pesticideinfo.org/Docs/ref_toxicity5.html", "http://www.pesticideinfo.org/Detail_Chemical.jsp?Rec_Id=PC35792#Toxicity", "http://www.pesticideinfo.org/Docs/ref_toxicity4.html#ReproDevelopmental", "http://parasitipedia.net/index.php?option=com_content&view=article&id=3159&Itemid=2949", "http://parasitipedia.net/index.php?option=com_content&view=article&id=2485&Itemid=2754", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-02-15T09:38:45+00:00"}