{"result_id": "337036", "URL": "https://anonhq.com/46845-2/", "timestamp": "2023-04-25 18:07:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/46845-2/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Cancer Curing Doctor Found Shot Dead shortly after Govt. Raid on Clinic", "cleaned_text": "In recent articles the use of cannabis oil (THC) has been explored in the treatment of seizure, proving with literature that the oil can have a drastic and positive impact on patient quality of life. Big Pharma companies and ‘sponsored’ medical practitioners would prefer you believe in pixie dust than alternative medicines. In recent times, the demonization of chiropractors has also been spotlighted, with the American Medical Association portraying them as quacks.\n\nThe suppression of medical science is a history backdating over decades. Coupled with the oddity of several medical researchers who were on the cusp of medical breakthroughs, meeting with unexpected and sometimes violent deaths, one’s curiosity is piqued, to say the least.\n\nOne such medical researcher was the pioneering Dr. Bradsheet, found floating in a river recently, with a gunshot wound to the chest. Dr. Bradsheet was working on a molecule called GcMAF, a little known but potentially groundbreaking cure for cancer, and treatment for HIV and autism.\n\nGcMAF is a naturally occurring molecule in the body, and has demonstrated its healing properties over multiple studies, with little side effects on the patient. As with all treatments there are pros and cons, but the pros in this instance seem to outweigh chemotherapy for instance, costing less than US$2000 for a full 24-week treatment that is witnessing over 85% success rates, prolonged remissions, cure, and what appears to be a life-long immunity after treatment in a high percentage of cases.\n\nDr Bradsheet’s death followed a raid on his clinic by the U.S. government confiscating his research on GcMAF and halting his treatment of his patients. The U.S. Food and Drug Administration had outlawed its use, calling it an “unapproved drug.” However, in dozens of countries around the world, including Japan, GcMAF is legally practiced and with outstanding results.\n\nGcMAF has been hailed by those who use it as the “universal cancer cure.” The blood product (Globulin component Macrophage Activating Factor) can treat a range of conditions including HIV, autism, and Parkinson’s disease. Where endocannabinoids can be mimicked by the use of THC at a molecular level; the GcMAF works by stimulating the immune system and activating macrophages “so they can destroy cancer cells and other abnormal cells in the body.”\n\nAccording to a FAQ page of a treatment clinic in Japan, GcMAF can treat the following diseases where there is immune dysfunction or compromise.\n\nIn a world where cancer and other illness’ are a lucrative business, a potential miracle treatment like GcMAF can be seen as a threat. Laws such as the 1939 Cancer Act in the UK, which makes it illegal to discuss the possibility of curing cancer with your medical provider, become part of the medical world’s monopoly on profiteering from disease. Lives can be saved each year simply by repealing this Act, let alone providing further funding for GcMAF research and THC repeal of prohibition.\n\nSix doctors on the East Coast of Florida were found dead in one month, most in similar circumstances: single gunshot wound. Although some of these cases have presented open and close cases, in the context of the above, too many questions remain unanswered. As for the case of Dr. Bradsheet, his family are calling for answers, most of which are falling on deaf ears.\n\nThis Article (Cancer Curing Doctor Found Shot Dead shortly after Govt. Raid on Clinic) is a free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author AnonWatcher and AnonHQ.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/01/Dr.-Jeff-Bradstreet-676x450.jpg", "locale": "en_US", "type": "article", "title": "Cancer Curing Doctor Found Shot Dead shortly after Govt. Raid on Clinic", "url": "https://anonhq.com/46845-2/", "site_name": "AnonHQ", "article:published_time": "2016-01-23T22:25:15+00:00", "article:modified_time": "2016-01-24T14:04:38+00:00", "image:width": "676", "image:height": "450", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "https://anonhq.com/46622-2/", "http://www.naturalnews.com/049680_chiropractic_alternative_medicine_AMA.html", "http://www.naturalnews.com/050553_Dr_Bradstreet_GcMAF_cancer_therapy.html#ixzz3xZVR1R6j", "http://www.alive.com/health/the-failure-of-chemotherapy/", "http://www.theepochtimes.com/n3/blog/doctor-vaccine-injury-dies-60/", "http://www.saisei-mirai.or.jp/gan/macrophage_gcmaf_faq_eng.html", "http://www.saisei-mirai.or.jp/gan/macrophage_gcmaf_faq_eng.html", "http://www.legislation.gov.uk/ukpga/Geo6/2-3/13/contents", "http://www.healthnutnews.com/md-found-murdered-inside-florida-home-today-this-makes-6-in-30-days-5-still-missing/", "http://www.gwinnettdailypost.com/archive/controversial-autism-researcher-jeff-bradstreet-commits-suicide-after-fda-raid/article_f5192b34-9d05-504f-973a-4778728ede09.html", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com/", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-01-23T22:25:15+00:00"}