{"result_id": "337002", "URL": "https://anonhq.com/brazil-declares-emergency-after-2400-babies-were-born-with-small-deformed-heads/", "timestamp": "2023-04-25 18:07:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://anonhq.com/logo-192ios.png", "canonical": "https://anonhq.com/brazil-declares-emergency-after-2400-babies-were-born-with-small-deformed-heads/", "encoding": "UTF-8"}, "image": null, "domain": "anonhq.com", "title": "Brazil Declares Emergency After Over 3,000 Babies Are Born With Tiny, Deformed Heads", "cleaned_text": "A sudden rise in the number of babies born with microcephaly, or underdeveloped brains and skulls, has forced Brazil to warn hopeful mothers to put off their pregnancy plans to avoid the birth defect. Health authorities are investigating more than 3,000 suspected cases of microcephaly and 38 deaths of infants that occurred in 2015. In 2014, the country saw only 147 cases of microcephaly.\n\nIn November, Brazil declared a nationwide public health emergency, calling it an “unprecedented situation, unprecedented in world scientific research”, to dedicate resources to investigating the causes of the rise. Claudio Maierovitch, director of the department for infectious disease surveillance, said:\n\n“It is very important that in every state, notifications of cases are made so they can be monitored. For pregnant women, it is important to follow antenatal routines and not take any medication without guidance. As well as this, it is important to avoid exposure to mosquitoes that transmit disease, in particular Aedes aegypti. Pregnant women who have any signs of illness should follow doctors’ recommendations.”\n\nDoctors in Brazil are investigating links between Zika virus, a mosquito-borne virus that restricts the size of babies’ brains and skulls, they believe may be the cause of thousands of infants being born with an incurable rare condition. In May 2015, Brazil reported its first case of Zika and by December 2015 the virus had made its way into several countries in Central and South America.\n\nRio de Janeiro, which will host the 2016 Olympic Games, is one of the areas in Brazil where the Zika virus has been found. According to The Washington Post, the health ministry is sending truckloads of larvicide – enough to treat 3,560 Olympic-sized swimming pools – to northeastern and southeastern states that have been most affected.\n\nDr Kleber Luz, an infectologist at the Federal University of Rio Grande do Norte, said around 80% of the mothers whose babies had microcephaly in Rio Grande do Norte also had symptoms compatible with Zika in their first trimester.\n\nAngela Rocha, the pediatric infectologist at Oswaldo Cruz Hospital in Brazil’s hardest-hit state, told CNN:\n\n“It’s a very personal decision, but at this moment of uncertainty, if families can put off their pregnancy plans, that’s what we’re recommending…These are newborns who will require special attention their entire lives. It’s an emotional stress that just can’t be imagined. Here in Pernambuco, we’re talking about a generation of babies that’s going to be affected.”\n\nIt’s believed that the virus is caused by the Aedes aegypti mosquito, which can also carry yellow fever, dengue fever, and chikungunya. It is suspected the deformation occurs during pregnancy, after the mother contracts the Zika virus through a mosquito bite.\n\nZika, named for the forest in Uganda where scientists discovered it in the 1940s, often goes unnoticed in the people it infects and was not considered especially life-threatening before spreading to Brazil. The country offers the ideal conditions for Zika to spread so quickly. Before Zika’s arrival, Brazil was already grappling with a much deadlier epidemic of dengue – the country had nearly 1.6 million cases of dengue in 2015.\n\nThere is no vaccine or specific treatment for Zika, and symptoms normally include a mild fever of under 38.5C, a rash and headache. Microcephaly is diagnosed when a baby’s head measures less than 33 cm in circumference, compared to the normal 33-38 cm.\n\nBrazil’s warm climate is ideal for mosquitoes and scientists think climate change may be responsible for the virus’ spread. As temperatures increase in some areas, they argue, mosquitoes can multiply more quickly, potentially enhancing their collective ability to transmit diseases. Additionally, increased precipitation in some areas creates places where mosquitoes can breed. And droughts, like those that recently afflicted parts of Brazil, can cause people to hoard water in containers, providing additional mosquito habitats.\n\nThe World Health Organisation and the Pan American Health Organisation issued a worldwide epidemiological alert over the Zika virus, which has also been recorded in Chile, Colombia, El Salvador, Guatemala, Mexico, Paraguay, Suriname and Venezuela. The two health organisations called for improved prenatal care for pregnant women and newborns in affected areas, as well as renewed efforts to limit the spread of the Aedes aegypti.\n\nThis Article (Brazil Declares Emergency After Over 3,000 Babies Are Born With Tiny, Deformed Heads) is free and open source. You have permission to republish this article under a Creative Commons license with attribution to the author and AnonHQ.com.", "opengraph": {"image": "https://anonhq.com/wp-content/uploads/2016/01/zika-virus1.jpg", "locale": "en_US", "type": "article", "title": "Brazil Declares Emergency After Over 3,000 Babies Are Born With Tiny, Deformed Heads", "url": "https://anonhq.com/brazil-declares-emergency-after-2400-babies-were-born-with-small-deformed-heads/", "site_name": "AnonHQ", "article:published_time": "2016-01-14T14:39:47+00:00", "image:width": "642", "image:height": "347", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" lang=\"en\"><p dir=\"ltr\" lang=\"en\">Drastic rise in microcephaly (babies born w/ too –small heads) in Brazil likely linked w/ <a href=\"https://twitter.com/hashtag/Zika?src=hash\">#Zika</a> virus. Learn more: <a href=\"https://t.co/5OJMStQe67\">https://t.co/5OJMStQe67</a></p><p>— Boston Children’s (@BostonChildrens) <a href=\"https://twitter.com/BostonChildrens/status/686624699883884545\">January 11, 2016</a></p><div id=\"eaa_after_nth_p\" class=\"eaa-wrapper eaa_after_nth_p eaa_desktop\"><div class=\"eaa-ad  \" style=\"\"><p id=\"M449061ScriptRootC1299471\"/>   </div></div></blockquote>", "<blockquote class=\"twitter-tweet\" lang=\"en\"><p> What’s behind Brazil’s alarming surge in babies born with small heads <a href=\"https://t.co/71zORLGK3Q\">https://t.co/71zORLGK3Q</a> By <a href=\"https://twitter.com/Dina_Maron\">@Dina_Maron</a> <a href=\"https://twitter.com/hashtag/Zika?src=hash\">#Zika</a> <a href=\"https://t.co/92jk7uIHeT\">pic.twitter.com/92jk7uIHeT</a></p><p>— Scientific American (@sciam) <a href=\"https://twitter.com/sciam/status/684744032736702464\">January 6, 2016</a></p></blockquote>"], "movies": [], "links": ["https://t.me/armyanonymous", "https://anonhq.com/support-us/", "http://portalsaude.saude.gov.br/index.php/cidadao/principal/agencia-saude/21459-saude-divulga-dados-atualizados-de-microcefalia", "http://www.telegraph.co.uk/news/worldnews/southamerica/brazil/12003083/Fears-that-Zika-virus-is-causing-deformities-in-babies-as-it-spreads-across-South-America.html", "https://twitter.com/hashtag/Zika?src=hash", "https://t.co/5OJMStQe67", "https://twitter.com/BostonChildrens/status/686624699883884545", "http://www.scientificamerican.com/article/what-s-behind-brazil-s-alarming-surge-in-babies-born-with-small-heads/", "https://anonhq.com/wp-content/uploads/2016/01/zika-virus.jpg", "https://www.washingtonpost.com/news/to-your-health/wp/2015/12/23/brazil-declares-emergency-after-2400-babies-are-born-with-brain-damage-possibly-due-to-mosquito-borne-virus/", "http://edition.cnn.com/2015/12/23/health/brazil-zika-pregnancy-warning/", "https://t.co/71zORLGK3Q", "https://twitter.com/Dina_Maron", "https://twitter.com/hashtag/Zika?src=hash", "https://t.co/92jk7uIHeT", "https://twitter.com/sciam/status/684744032736702464", "http://www.independent.co.uk/news/world/americas/zika-virus-that-shrinks-babies-brains-is-spreading-say-scientists-a6795326.html", "https://www.facebook.com/NowThisNews/videos/1718779671677166/", "https://www.facebook.com/NowThisNews/", "http://www.nytimes.com/2015/12/31/world/americas/alarm-spreads-in-brazil-over-a-virus-and-a-surge-in-malformed-infants.html?_r=0", "https://www.theguardian.com/global-development/2015/dec/04/brazil-zika-virus-pregnancy-microcephaly-mosquito-rare-birth-defect", "https://anonhq.com/?p=46084", "https://creativecommons.org/licenses/by/4.0/", "https://anonhq.com", "https://www.patreon.com/armyanonymous\n", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10=", "http://www.cpaclickz.com/c/71/1?s1=&s2=&s3=&s4=&s5=&s6=&s7=&s8=&s9=&s10="], "authors": [""], "publish_date": "2016-01-14T14:39:47+00:00"}