{"result_id": "338014", "URL": "https://wearechange.org/hospital-workers-turn-down-the-jab-theres-too-much-mistrust/", "timestamp": "2023-04-25 18:08:47 CEST+0200", "meta": {"description": "\"People are genuinely afraid of the vaccine.\"", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/hospital-workers-turn-down-the-jab-theres-too-much-mistrust/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Hospital Workers Turn Down The Jab: \"There's Too Much Mistrust\"", "cleaned_text": "Less than a week after we reported on widespread resistance among healthcare workers in one Chicago hospital, BeckersHospitalReview.com’s Ayla Ellison reports that the virus of vaccine mistrust is spreading…\n\nMany employees at Howard University Hospital in Washington, D.C., have reservations about taking the COVID-19 vaccine, and CEO Anita Jenkins is trying to get workers to follow her lead by getting vaccinated, according to CNN.\n\nThe hospital, a major healthcare provider for the Black community, received 725 doses of the Pfizer vaccine Dec. 15 and expects to receive a second shipment this week. As of Dec. 18, only about 600 of the hospital’s 1,900 employees had signed up for the shots, according to Kaiser Health News.\n\nThe vaccination numbers, though low, still exceeded expectations, Ms. Jenkins told CNN. An internal hospital survey of about 350 employees in early November showed that 70 percent were not willing to take the COVID-19 vaccine or would not take it immediately after it became available.\n\nMs. Jenkins received the shot Dec. 15 in hopes of inspiring staff to get vaccinated. She’s part of a widespread effort by healthcare experts and community leaders to combat vaccine hesitancy among Black Americans. About 35 percent of Black Americans said they probably or definitely would not get the vaccine if it was determined to be safe by scientists and widely available for free, according to a Kaiser Family Foundation study cited by CNN.\n\nHoward University Hospital isn’t the only healthcare provider with workers who turned down the vaccine.\n\nAt Doctors Hospital at Renaissance in Edinburg, Texas, so many workers declined the COVID-19 vaccine that the hospital offered doses to other medical workers in the region, according to ProPublica.\n\nThe hospital received 5,850 doses of the vaccine, and it quickly became clear that not enough people eligible for the vaccine, like staff who work directly with COVID-19 patients, were opting to get it, DHR Health CMO Robert Martinez, MD, told ProPublica.\n\nAfter the first day of distribution, DHR reached out to other hospitals and healthcare facilities in the region to offer doses of the vaccine. ProPublica reported that the vaccine ended up going to non-medical personnel as well, including state Sen. Eddie Lucio Jr. He told ProPublica he was invited to take the vaccine by DHR after officials explained to him that all eligible workers who wanted the vaccine received it.\n\nIn short, as we noted previously, nobody wants to be a guinea pig.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hospital Workers Turn Down The Jab: \"There's Too Much Mistrust\"", "description": "\"People are genuinely afraid of the vaccine.\"", "url": "https://wearechange.org/hospital-workers-turn-down-the-jab-theres-too-much-mistrust/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2020-12-23T07:20:53+00:00", "image": "https://wearechange.org/wp-content/uploads/2020/12/sdfdsfiiii-600x315.png", "image:width": "600", "image:height": "315", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/covid-19/who-wants-be-guinea-pig-health-workers-balk-vaccine-40-staff-one-chicago-hospital-refuse", "https://www.beckershospitalreview.com/workforce/staff-at-hospitals-in-dc-texas-turn-down-covid-19-vaccine.html", "https://www.cnn.com/2020/12/21/us/howard-hospital-vaccine-hesitancy-trnd/index.html", "https://khn.org/news/article/with-few-takers-for-covid-vaccine-dc-hospital-ceo-takes-one-for-the-team/", "https://www.propublica.org/article/rio-grande-hospital-workers-turned-down-the-vaccine-a-senator-and-a-sheriffs-deputy-lined-up-instead", "https://www.zerohedge.com/covid-19/who-wants-be-guinea-pig-health-workers-balk-vaccine-40-staff-one-chicago-hospital-refuse", "https://www.zerohedge.com/covid-19/hospital-workers-turn-down-covid-vaccine-theres-too-much-mistrust", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2020-12-23T07:20:53+00:00"}