{"result_id": "338001", "URL": "https://wearechange.org/major-glitch-emerges-most-europeans-including-hospital-staff-are-refusing-to-take-the-jab/", "timestamp": "2023-04-25 18:08:09 CEST+0200", "meta": {"description": "\"I am not saying vaccination shouldn’t be taking place. But I am not going to test an unverified vaccine on my children, or on myself.\"", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/major-glitch-emerges-most-europeans-including-hospital-staff-are-refusing-to-take-the-jab/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Major Glitch Emerges: Most Europeans, Including Hospital Staff, Are Refusing To Take The Jab", "cleaned_text": "All is not going according to plan in the biggest global rollout of what is arguably the most important vaccine in a century, and it is not just growing US mistrust in the covid injection effort that was rolled out in record time: an unexpected spike in allergic reactions to the Pfizer/BioNTech vaccine (and now, Moderna too) may prove catastrophic to widespread acceptance unless scientists can figure out what is causing it after the FDA’s rushed approval, and is also why as we reported yesterday, scientists are scrambling to identify the potential culprit causing the allergic reactions.\n\nMaking matters worse, Europe rolled out a huge COVID-19 vaccination drive on Sunday to try to rein in the coronavirus pandemic but even more Europeans than American are sceptical about the speed at which the vaccines have been tested and approved and reluctant to have the shot.\n\nWhile the European Union has secured contracts drugmakers including Pfizer, Moderna and AstraZeneca, for a total of more than two billion doses and has set a goal for all adults to be inoculated next year, this is looking increasingly like a pipe dream: according to recent surveys, the local population has expressed “high levels of hesitancy” towards inoculation in countries from France to Poland, with many used to vaccines taking decades to develop, not just months.\n\n“I don’t think there’s a vaccine in history that has been tested so quickly,” Ireneusz Sikorski, 41, said as he stepped out of a church in central Warsaw with his two children.\n\n“I am not saying vaccination shouldn’t be taking place. But I am not going to test an unverified vaccine on my children, or on myself.”\n\nSmart: why take the risk of getting vaccinated when others will do it, resulting in the same outcome.\n\nSurveys in Poland, where distrust in public institutions runs deep, show that fewer than 40% of people planning to get vaccinated. Worse, according to Reuters on Sunday, only half the medical staff in a Warsaw hospital where the country’s first shot was administered had signed up. And if the doctors don’t trust the vaccine, one can be certain that the broader population will refuse to take it.\n\nThe situation is similar in Spain, one of Europe’s hardest-hit countries, where 28-year-old singer and music composer German summarizes the skepticism of a broad range of the population, and plans to wait for now.\n\nA Christian Orthodox bishop in Bulgaria, where 45% of people have said they would not get a shot and 40% plan to wait to see if any negative side effects appear – meaning only 15% of the population will actually volunteer for a vaccine in the near future – is in the tiny minority when it comes to taking the vaccine.\n\n“Myself, I am vaccinated against everything I can be,” Bishop Tihon told reporters after getting his shot, standing alongside the health minister in Sofia. He spoke about anxiety over polio before vaccination became available in the 1950s and 1960s.\n\nTo be sure, the establishment is pounding the table on why the vaccines are safe despite the record short time in development (even though not even the “scientists” can explain what is behind the spike in vaccine allergic reactions), and claiming that the new technology behind the mRNA vaccine is all one needs to know… when it is precisely this new technology that is sparking the skepticism.\n\n“We’ll look back on the advances made in 2020 and say: ‘That was a moment when science really did make a leap forward’,” said Jeremy Farrar, director of the Oxford University Clinical Research Unit, which is backed by the Wellcome Trust. Oxford also received $750MM from Bill Gates in June in the billionaire’s quest to vaccinate the world against Covid.\n\nOnly problem: nobody in Europe seems to care about these “scientific” justifications. Independent pollster Alpha Research said its recent survey suggested that fewer than one in five Bulgarians from the first groups to be offered the vaccine – frontline medics, pharmacists, teachers and nursing home staff – planned to volunteer to get a shot.\n\nAn IPSOS survey of 15 countries published on Nov. 5 showed then that 54% of French would have a COVID vaccine if one were available. The figure was 64% in Italy and Spain, 79% in Britain and 87% in China.\n\nSince then things have gone far worse, and a more recent IFOP poll showed that only 41% people in France would take the shot. This means that a vast majority will not.\n\nNot even in Sweden, where public trust in authorities is absurdly and inexplicably high, is there a universal trust in the vaccine, with at least one in three saying they won’t get the shot: “If someone gave me 10 million euro, I wouldn’t take it,” Lisa Renberg, 32, told Reuters on Wednesday.\n\nMeanwhile, in a paradoxical attempt to force more to sign up – not realizing that it will only have the precisely opposite effect – Polish Prime Minister Mateusz Morawiecki urged Poles on Sunday to sign up for vaccination, saying the herd immunity effect depended on them. Critics have accused Warsaw’s “nationalist leaders” of being too accepting of anti-vaccination attitudes in the past in an effort to garner conservative support. Well… let’s check back on said attitude in 10 years and see if perhaps it was the right one.\n\nFor now, however, the more European governments pressure their populations to get immunized, the fewer the people who will actually sign up and the worse the vaccine rollout will be, that much we can be 100% sure of.", "opengraph": {"locale": "en_US", "type": "article", "title": "Major Glitch Emerges: Most Europeans, Including Hospital Staff, Are Refusing To Take The Jab", "description": "\"I am not saying vaccination shouldn’t be taking place. But I am not going to test an unverified vaccine on my children, or on myself.\"", "url": "https://wearechange.org/major-glitch-emerges-most-europeans-including-hospital-staff-are-refusing-to-take-the-jab/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2020-12-28T03:41:54+00:00", "image": "https://wearechange.org/wp-content/uploads/2020/12/saoidjsdoifjdsfsd-600x315.png", "image:width": "600", "image:height": "315", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nytimes.com/2020/12/25/health/Covid-moderna-vaccine-allergies.html", "https://www.zerohedge.com/medical/scientists-scramble-identify-culprit-behind-covid-vaccine-allergic-reactions", "https://www.reuters.com/article/health-coronavirus-europe-vaccines-resis/despite-hi-tech-advances-many-europeans-wary-of-taking-covid-shot-idUSKBN2910J4", "https://www.zerohedge.com/medical/major-covid-vaccine-glitch-emerges-most-europeans-including-hospital-staff-refuse-take-it", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2020-12-28T03:41:54+00:00"}