{"result_id": "338045", "URL": "https://wearechange.org/doctors-whitewash-killing-of-infant-who-died-after-8-simultaneous-vaccinations/", "timestamp": "2023-04-25 18:10:27 CEST+0200", "meta": {"description": "Out of shame, doctors at a California hospital hid the body of an infant whose sudden death was believed to have been caused by eight simultaneous", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/doctors-whitewash-killing-of-infant-who-died-after-8-simultaneous-vaccinations/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Doctors whitewash killing of infant who died after 8 simultaneous vaccinations", "cleaned_text": "Out of shame, doctors at a California hospital hid the body of an infant whose sudden death was believed to have been caused by eight simultaneous vaccinations.\n\nAccording to Crystal Downing, the mother of the infant, her son, Matthew, had been given DTaP (Diphtheria, Tetanus, and Pertussis or whooping cough), IPV (Inactivated Polio Vaccine), Hib (a vaccine against meningitis, pneumonia and other illnesses caused by the bacterium Haemophilus Influenzae Type b), PCV (Packed Cell Volume), Hep B (Hepatitis B) and Hep A (Hepatitis A) in three shots, one in the right arm and two in the left leg, just a day before his sudden death. Mathew became irritable and cried a lot the day after receiving the eight vaccine injections. His mother thought this was normal behavior following vaccination.\n\n The Downings thought their child would get better after receiving the eight injections – only to find his lifeless body the next day.\n\nThey tried their best to revive Mathew. They called 911 and rushed him to Colorado River Medical Center in Needles, California, where he was swiftly pronounced dead. As is the case with most cases of vaccine-associated infant death, the cause of death was ruled as Sudden Infant Death Syndrome (SIDS). SIDS, also known as cot death or crib death, is the “sudden unexplained death of a child less than one year of age.” SIDS usually occurs during sleep, and no other investigations are conducted on the cause of death. Parents are often told to just accept a baby’s death as a random event, even after their infant was injected with multiple toxic substances.\n\nAlthough an autopsy was conducted on Matthew’s body, even after more than a year, the results remain undisclosed. Worse, his parents were never even allowed to see the body of their son before it was cremated. All they’ve ever gotten was their son’s ashes. Now, however, they’re aware that aside from giving their son an extra hepatitis B vaccine dose, doctors had also given their baby a vaccine not approved for his age – two fatal mistakes which could have saved Matthew’s life, had they only been prevented.\n\nCrystal Downing now urges parents to do their own research on vaccines before offering their children up to whatever the doctor says. She wrote, “I want to tell other parents, they say vaccinations are safe, but in reality, they aren’t.”\n\nParents must exercise their right to choose what’s best for their own child in order to prevent vaccine violence and abuse. Since there are no clinical trials showing the safety of multiple injections, the parents should question the use of multiple vaccines, especially against doctors who are hell-bent on imposing upon parents the philosophy of vaccination. The use, especially, of adaptive immune response for multiple viruses with aluminum adjuvants should be questioned. Doctors, first and foremost, must set aside their wrong perceptions about the use of vaccines. Nowadays, it’s rare to find an MD who’s done his research on how the ingredients in vaccines cause negative reactions that result in brain damage or death. Medical professionals continuously just write off infant death after vaccination as a case of “sudden infant death syndrome.”\n\nAfter the tragedy, Crystal Downing decided to open up and share her views on the matter, to help other parents make better decisions for their children:\n\n“Ask questions and know which vaccines they plan to give to your baby. Know the risks associated with all of the vaccines they plan to give during the checkup. And remember, it’s your choice. It’s your child. And whatever you do, don’t let them mix the vaccines into one needle or give them so many at once because if you don’t think this won’t harm your child, then look at the child I lost. It is possible.\n\n“My son was injected with 8 vaccines, if you don’t know what is in them, learn! When I did, I was shocked and mad at myself for not questioning this before. Matthew is the reason I opened my eyes, to see what vaccines can really do to a baby, let alone anyone. I’m not the only one who believes vaccines are not what they claim they are. I really hope this opens parent’s eyes who do vaccinate their children.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Doctors whitewash killing of infant who died after 8 simultaneous vaccinations | We Are Change", "description": "Out of shame, doctors at a California hospital hid the body of an infant whose sudden death was believed to have been caused by eight simultaneous", "url": "https://wearechange.org/doctors-whitewash-killing-of-infant-who-died-after-8-simultaneous-vaccinations/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2016-02-25T22:57:07+00:00", "article:modified_time": "2016-04-05T14:25:46+00:00", "image": "https://wearechange.org/wp-content/uploads/2016/02/Baby-Crying-Vaccine-Injection-1.jpg", "image:width": "560", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://NaturalNews.com", "http://TruthWiki.org", "http://www.newstarget.com/2016-02-25-doctors-whitewash-killing-of-infant-who-died-after-8-simultaneous-vaccinations.html", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["Jeffrey Phillips"], "publish_date": "2016-02-25T22:57:07+00:00"}