{"result_id": "338046", "URL": "https://wearechange.org/african-union-who-backed-covax-refuse-to-buy-moderna-covid-19-vaccines-as-demand-plummets/", "timestamp": "2023-04-25 18:10:31 CEST+0200", "meta": {"description": "Outside of China and Hong Kong, COVID-19 cases, deaths and hospitalizations have waned dramatically. This in turn has undermined demand.", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/african-union-who-backed-covax-refuse-to-buy-moderna-covid-19-vaccines-as-demand-plummets/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "African Union, WHO-Backed Covax Refuse to Buy Moderna COVID-19 Vaccines as Demand Plummets", "cleaned_text": "Get ready for another wave of COVID fearmongering as Big Pharma tries to push a second (then a third, then a fourth…) booster dose as demand wanes (even as scientists warn about a new hybrid mutant strain).\n\nModerna shares are tumbling on Tuesday after two of the world’s most critical supranational bodies representing low- and middle-income countries have decided not to purchase hundreds of millions of additional doses of the company’s vaccine as a result of waning demand.\n\nThe African Union and Covax, the Bill Gates and WHO-backed group dedicated to spreading (low cost) vaccines across the world, made the decision to pass on buying more jabs (while the US rolls out a second booster for older patients) as developing nations struggle to find enough customers eager to be inoculated.\n\nOf course, it’s not just demand that’s keeping vaccination numbers low: According to Bloomberg, developing nations have struggled to turn supplies into inoculations. Lower-income countries left behind in the global rollout are now grappling with a lack of funds, hesitancy, supply-chain obstacles and other factors that are hampering distribution.\n\nBut outside of China and Hong Kong, COVID cases, deaths and hospitalizations have waned dramatically. This in turn has undermined demand.\n\nWhat’s more, after more than a year of getting the short end of the stick from Western vaccine makers, developing nations have become resentful, as more consumers take the view that, if they have made it this far without the jabs, then they certainly don’t need them now.\n\nWhile the African Union agreed to purchase 50 million doses during Q1, the organization opted not to acquire another 60 million doses in the second quarter.\n\nCovax, meanwhile, opted not to buy 166 million doses for delivery in Q3, and also turned down another alternative for 166 million doses in Q4. Although a spokesperson for the organization said talks for another round of purchases have continued to drag on.\n\nAfrica has the world’s lowest immunization rate, with only 15% of the continent’s population counted as fully vaccinated. That’s compared with a global average of 57%, the WHO said last month. Only about 400 million of the more than 700 million doses Africa has received have been administered, leaving hundreds of millions of doses to rot on the shelves.", "opengraph": {"locale": "en_US", "type": "article", "title": "African Union, WHO-Backed Covax Refuse to Buy Moderna COVID-19 Vaccines as Demand Plummets", "description": "Outside of China and Hong Kong, COVID-19 cases, deaths and hospitalizations have waned dramatically. This in turn has undermined demand.", "url": "https://wearechange.org/african-union-who-backed-covax-refuse-to-buy-moderna-covid-19-vaccines-as-demand-plummets/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2022-04-06T14:13:42+00:00", "image": "https://wearechange.org/wp-content/uploads/2022/04/uyuiyiuy-600x315.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/covid-19/introducing-covid-xe-new-mutant-strain-found-uk-who-warns-its-more-contagious-omicron", "https://www.bloomberg.com/news/articles/2022-04-05/buyers-turn-down-moderna-covid-vaccine-as-pandemic-demand-wanes?sref=i4qXzk6d", "https://www.zerohedge.com/covid-19/african-union-covax-refuse-buy-more-vaccines-moderna-demand-plummets", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2022-04-06T14:13:42+00:00"}