{"result_id": "338006", "URL": "https://wearechange.org/new-injection-to-combat-heavily-mutated-variant-could-take-100-days-pfizer-ceo-warns/", "timestamp": "2023-04-25 18:08:22 CEST+0200", "meta": {"description": "It is regarded as the most heavily mutated variant with 32 mutations in the spike protein and 50 overall...", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://news4achange.com/new-injection-to-combat-heavily-mutated-variant-could-take-100-days-pfizer-ceo-warns/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "New Injection to Combat Heavily-Mutated Variant Could Take 100 Days, Pfizer CEO Warns", "cleaned_text": "Several countries — including Britain, France, Israel, Italy, and Singapore are moving fast to restrict travel from South Africa and other countries after a new coronavirus variant with mutations was discovered five days ago. The new variant is so concerning that Pfizer’s CEO confirmed a new vaccine would take more than three months to develop.\n\nAccording to a research note published by Citi analyst Andrew Baum, the Nu variant, referred to as B.1.1529, was discovered in Botswana with at least 100 confirmed cases in South Africa and detection in Israel and Hong Kong. We noted Friday morning Belgium, the first European country, has documented cases of the new strain.\n\nBaum said the next few weeks of testing would be essential to determine whether Nu is more aggressive than delta. Lab tests could conclude BioNTech, Pfizer would have to reformulate their vaccine.\n\nHe noted one Hongkonger who was double Pfizer vaccinated experienced a breakthrough infection with Nu. The breakthrough cases are concerning as waning immunity from the COVID-19 vaccine continues as governments offer booster shots.\n\nSo here’s the most troubling part.\n\nBaum spoke with Pfizer’s CEO, Albert Bourla, who said it could take scientists 100 days to develop a novel variant vaccine to combat Nu.\n\nIn the meantime, global stock and futures markets are plunging as treasury yields sink lower. Brent and WTI dropped more than 5%. Already, countries are halting flights from South Africa and Botswana as the new variant appears to be spreading.\n\nTalk about perfect timing for central bankers who were embarking on the most aggressive tapering and rate hike cycle in years to curb out-of-control inflation. US money markets show traders are pushing back their tightening wagers.\n\nPeter Chatwell, head of the multi-asset strategy at Mizuho International, offered his thoughts on Nu in a new research note.\n\nSo the question heading into the weekend is if bad news is good news (delays the taper so BTFD!), or if bad news is bad news (Fed is cornered and can’t re-up QE due to inflation, the vaccine premium in the market needs to come out).", "opengraph": {"locale": "en_US", "type": "article", "title": "New Injection to Combat Heavily-Mutated Variant Could Take 100 Days, Pfizer CEO Warns", "description": "It is regarded as the most heavily mutated variant with 32 mutations in the spike protein and 50 overall...", "url": "https://news4achange.com/new-injection-to-combat-heavily-mutated-variant-could-take-100-days-pfizer-ceo-warns/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2021-11-26T14:57:44+00:00", "image": "https://news4achange.com/wp-content/uploads/2021/11/sadsadsadsadsa-600x315.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/covid-19/belgium-first-european-nation-confirm-spread-nu-variant", "https://www.zerohedge.com/markets/one-traders-first-thoughts-nu-variant", "https://www.zerohedge.com/covid-19/pfizer-ceo-warns-new-vaccine-combat-heavily-mutated-coronavirus-could-take-100-days", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2021-11-26T14:57:44+00:00"}