{"result_id": "338026", "URL": "https://wearechange.org/country-with-worlds-highest-vaccination-rate-orders-new-lockdown-as-covid-19-cases-surge/", "timestamp": "2023-04-25 18:09:25 CEST+0200", "meta": {"description": "All schools in the country have been closed and sporting activities cancelled for two weeks in the country.", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://news4achange.com/country-with-worlds-highest-vaccination-rate-orders-new-lockdown-as-covid-19-cases-surge/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Country With World's Highest Vaccination Rate Orders New Lockdown as COVID-19 Cases Surge", "cleaned_text": "While most people might guess that Israel or the UK hold the title, the tiny island nation of Seychelles is actually the most vaccinated country on earth, with more than 62% of its adult population already “fully vaccinated”, according to a BBC report.\n\nHowever, despite the fact that the island nation is closing in on the herd immunity threshold, the country and its public health officials have been forced this week to reimpose restrictions due to a surge in COVID-19 cases.\n\nAll schools in the country have been closed and sporting activities cancelled for two weeks in the country, which is spread across an archipelago in the Indian Ocean.\n\nMeasures also include a ban on inter-household interaction, some types of in-person gatherings, and the early closure of shops, bars and casinos. Non-essential workers are also being encouraged to work from home, while a 2300 local time curfew has been revived.\n\nThere are currently 1.07K active Covid cases in the Seychelles, of which a third have been detected in people given two doses of either AstraZeneca’s or China’s Sinopharm’s vaccine.\n\nIt is unclear what has triggered the surge in cases but testing has detected the South African variant spreading on the islands. Scientists believe the mutant strain can evade immunity and make jabs up to 30 per cent weaker at preventing infections — but they think Western vaccines should still stop people falling severely ill if they get infected. But because Seychelles is not actively analyzing a large amount of positive tests (something the UK and other countries are doing to monitor the spread of variants) it is difficult to tell exactly which strain has taken hold in the country.\n\nBut the country’s close links to South Africa means it is likely the B.1.351 variant could be behind the rise. Seychelles was added to Britain’s travel “red list” in January along with nine southern African countries and Mauritius in a bid to prevent the UK from importing the strain.\n\nDuring a recent press conference, officials didn’t offer much in the way of detail about what they suspect might be causing the revival.\n\nThe country acted quickly to begin its vaccination program in January, using doses from China’s Sinopharm vaccine that were donated from the UAE. It also received doses of AstraZeneca from India. When Seychelles president Wavel Ramkalawan first announced the country’s vaccination drive, the Seychelles had recorded a total of only 531 coronavirus cases and a single death, according to data from its health ministry. But in the span of four months, that number has risen more than 10x to 6,373 with 146 total deaths. Seychelles isn’t alone: Chile, another country that has been heavily reliant on vaccines developed in China, has also seen rising cases despite its successful inoculation campaign.", "opengraph": {"locale": "en_US", "type": "article", "title": "Country With World's Highest Vaccination Rate Orders New Lockdown as COVID-19 Cases Surge", "description": "All schools in the country have been closed and sporting activities cancelled for two weeks in the country.", "url": "https://news4achange.com/country-with-worlds-highest-vaccination-rate-orders-new-lockdown-as-covid-19-cases-surge/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2021-05-06T07:42:05+00:00", "image": "https://news4achange.com/wp-content/uploads/2021/05/rytrytrytrytr-600x315.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.bbc.com/news/world-africa-56992121", "https://www.zerohedge.com/covid-19/country-worlds-highest-vaccination-rate-orders-new-lockdown-covid-cases-surge", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2021-05-06T07:42:05+00:00"}