{"result_id": "338031", "URL": "https://wearechange.org/maine-bill-seeks-halt-surge-vaccination-avoidance/", "timestamp": "2023-04-25 18:09:42 CEST+0200", "meta": {"description": "A bill that would make it more difficult for parents to opt out of immunizing their children could go before the state Legislature in January.", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/maine-bill-seeks-halt-surge-vaccination-avoidance/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Maine Bill Seeks To Halt Surge In Vaccination Avoidance", "cleaned_text": "A bill that would make it more difficult for parents to opt out of immunizing their children could go before the state Legislature in January. The proposed law is driven by the public health threat posed by the increase in unvaccinated children, the bill’s sponsor said.\n\nMaine’s opt-out rate for children entering kindergarten has climbed in recent years, and in the 2013-14 school year reached 5.2 percent, the fifth-highest in the nation, according to the U.S. Centers for Disease Control and Prevention. Public health experts worry that the state is becoming susceptible to a return of vaccine-preventable diseases such as measles and pertussis. Maine has seen a surge in pertussis cases in the past few years, and in other states, such as California and Ohio, measles made a comeback this year.\n\nMore Maine parents are using the philosophic exemption to forgo vaccinations, probably because of concerns that vaccinations cause autism or are otherwise harmful, health experts say.\n\nScientific research has debunked the alleged autism connection and has shown that vaccines are safe, according to the federal CDC.\n\nIn Maine, the philosophic exemption is easy to obtain – parents just sign a form. The entire increase in Maine’s opt-out rate – from 2.7 percent in the 2003-04 school year to 5.2 percent, or about 800 kindergartners, in 2013-14 – is because of parents signing the philosophic exemption, according to the CDC. Exemptions based on religious grounds remained steady at 0.1 percent over time.\n\nThe bill, submitted Monday by Rep. Richard Farnsworth, D-Portland, would require parents who wish to opt out for philosophic reasons to first consult with a primary care professional, such as a doctor, nurse practitioner or physician assistant. After the discussion, if the parents still don’t want their children vaccinated, they would need to obtain a medical professional’s signature.\n\nDavid Sorensen, spokesman for the Maine Department of Health and Human Services, said the department does not yet have a position on the bill.\n\nFarnsworth said the bill is a simple way to improve the health of Maine’s children.\n\n“We need to improve our rates of early childhood vaccinations,” Farnsworth said. “We need to reduce the risk to the general population. It has become a public health issue.”\n\nFor some infectious diseases, “herd immunity” starts to break down when vaccination rates fall below 95 percent. Herd immunity – the community protection against viruses because almost everyone has been vaccinated – also protects infants too young to be immunized or people who can’t be vaccinated for medical reasons.\n\nBut those skeptical of vaccines say parents should have the freedom to conduct their own research and determine for themselves what vaccines, if any, their children should receive.\n\nFormer Rep. Andrea Boland, D-Sanford, who has sided with those questioning the safety of vaccines, said she’s against the bill because parents should not be forced to talk to their doctor about vaccines. She also said doctors already have too much to do without the extra burden of signing vaccine forms.\n\n“I don’t think the doctor should be in the position of being the parent of the parent,” Boland said.\n\nAndrew MacLean, deputy executive vice president of the Maine Medical Association, a physician advocacy group, said the association supports the extra step for parents to obtain a philosophic exemption.\n\n“An unvaccinated child is a risk to the other students,” MacLean said. He said the association is working with another lawmaker on similar legislation.\n\nMacLean said vaccines, when in great use, are extremely effective at preventing diseases.\n\n“Most physicians would consider childhood vaccinations one of the most important public health advances over the last 100 years,” he said.\n\nDr. Laura Blaisdell, a Yarmouth pediatrician who is studying why parents are opting out, said she believes the discussions would lead to better vaccination coverage.\n\n“Dialogue is essential,” Blaisdell said. “I believe that a lot of parents, once they had their questions answered and any fallacies that they had heard put to rest, would agree to have their children vaccinated.”\n\nResearch in 2013 by New York University found that states where it’s more difficult to obtain the exemptions have lower rates of unvaccinated children. When Washington state made it harder to decline on philosophic grounds two years ago, its opt-out rates immediately fell.\n\nTwenty states permit parents to opt out of school-required vaccinations for philosophic reasons.\n\nIn Maine, cases of pertussis – commonly known as whooping cough – have spiked to rates not seen since the 1960s, including 737 in 2012, 332 in 2013 and 453 through Dec. 10 of this year.\n\nAlthough public health experts say vaccination rates play a role, the pertussis vaccine has also become less effective since the current form of the vaccine was introduced in the 1990s, according to a 2013 study published in Pediatrics, a scholarly journal.\n\nBut Dr. Paul Offit, director of the Vaccine Education Center at the Children’s Hospital of Philadelphia, wrote in an op-ed for The Wall Street Journal this year that recent pertussis outbreaks are also related to parents refusing to vaccinate. He noted that in California, where pertussis has sickened thousands and hospitalized hundreds this year, counties with the highest rates of unvaccinated children had greater rates of pertussis cases.", "opengraph": {"locale": "en_US", "type": "article", "title": "Maine Bill Seeks To Halt Surge In Vaccination Avoidance | We Are Change", "description": "A bill that would make it more difficult for parents to opt out of immunizing their children could go before the state Legislature in January.", "url": "https://wearechange.org/maine-bill-seeks-halt-surge-vaccination-avoidance/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2014-12-31T15:15:45+00:00", "image": "http://www.google.com/url?sa=i&source=images&cd=&ved=0CAUQjBw&url=http%3A%2F%2Fwww.ou.org%2Fjewish_action%2Ffiles%2Fvaccine.jpg&ei=BhKkVOiAKJD3yQSi04KoAw&psig=AFQjCNH9g5QziXgHmSzT2ZAa5k0VEcjbJg&ust=1420125062786240"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.pressherald.com/2014/12/30/maine-bill-seeks-to-halt-surge-in-vaccination-avoidance/", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["Alec Cope"], "publish_date": "2014-12-31T15:15:45+00:00"}