{"result_id": "338021", "URL": "https://wearechange.org/weapons-of-mass-vaccination-cdc-intensifies-childhood-vaccine-schedule-to-include-74-injections-before-age-17/", "timestamp": "2023-04-25 18:09:08 CEST+0200", "meta": {"description": "The Centers for Disease Control (CDC) has just added three new vaccines to the Childhood Immunization Schedule, bringing the total to an almost", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/weapons-of-mass-vaccination-cdc-intensifies-childhood-vaccine-schedule-to-include-74-injections-before-age-17/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Weapons of Mass Vaccination? CDC intensifies childhood vaccine schedule to include 74 injections before age 17", "cleaned_text": "The Centers for Disease Control (CDC) has just added three new vaccines to the Childhood Immunization Schedule, bringing the total to an almost unbelievable 74 vaccine doses recommended before the age of 17.\n\nThe agency also lowered the age of HPV (a sexually-transmitted virus) vaccination to include nine-year-olds.\n\nSince 1950, the number of required vaccine doses has risen from 3 to 74 – an increase of more than 24 times.\n\nIn 1983, there were still only 10 recommended vaccines being administered to children under the age of 6 – the schedule then required 24 doses, 7 injections and 4 oral polio doses.\n\nBy 2010, the number of doses had increased to 68, with over half of them being administered before children reached 18 months of age.\n\nAs of February 1, 2016, the number of doses before age 17 has increased to 74 – including 53 injected vaccines and 3 oral rotavirus doses.\n\n“These rapid increases in the vaccine schedule mean that a 6 month old baby born today would receive over 2.5 times the number of vaccines as the maximum permitted for a 6 year old back in the 1980’s. And, by the time that same baby was 12 years old, he/she would have received over 7X the number of vaccines as a child born 30 years ago.\n\n“Predictably, children today are suffering from autoimmune disorders, behavioral problems, and physical disabilities at a rate growing in lockstep with the skyrocketing number of shots.\n\n“One in every two children suffers from a chronic problem today and the situation is only growing worse with each passing year.”\n\nSo, why the huge increase since 1983?\n\nMany Americans are unaware of the fact that in 1986, a bill called the Vaccine Injury Act was passed into law.\n\nThis Act absolves vaccine manufacturers from any liability for injury or death caused by vaccines.\n\nThat’s right: If a vaccine injures or kills your child, the company which made the vaccine will not be held responsible.\n\nNow it becomes clear why so many new vaccines have been added to the schedule, and why there are currently another 271 new vaccines awaiting approval by the FDA:\n\n“The CDC will never stop adding to the immunization schedule as long as pharmaceutical manufacturers are protected from ALL liability of injury and death … There is absolutely no incentive to make existing or new vaccines safe or keep the schedule at a reasonable level since the passage of the 1986 Vaccine Injury Act.”\n\nFor many parents, the health risks associated with vaccines are much worse than the risk of no vaccines at all, but Big Pharma lobbyists have deep pockets, and have managed to buy out the politicians in charge of drafting vaccine-related policies.\n\nThe anti-vaccine movement has been portrayed in the media as a bunch of paranoid lunatics who are endangering the lives of the rest of the population, when in fact the exact opposite is the reality.\n\nNow, lawmakers are pushing for mandatory vaccinations so that the big drug companies can keep making huge profits without any regard for their safety or efficacy.\n\nThis is happening despite a large (and continuously increasing) amount of evidence, that vaccines do cause serious health problems, and that many of them are ineffective in the first place.\n\nNot only are many of these vaccines tainted and useless, but at least one of the major vaccine makers – Merck – has been caught falsifying efficacy data.\n\nAs long as vaccine manufacturers remain legally protected from liability, we can expect to see the number of recommended vaccine doses continuing to rise exponentially.\n\nWe can also expect to see the number of children harmed by vaccines continuing to increase.\n\nIsn’t it time to stop this madness before future generations are irreparably harmed due to the greed of the big drug companies?", "opengraph": {"locale": "en_US", "type": "article", "title": "Weapons of Mass Vaccination? CDC intensifies childhood vaccine schedule to include 74 injections before age 17 | We Are Change", "description": "The Centers for Disease Control (CDC) has just added three new vaccines to the Childhood Immunization Schedule, bringing the total to an almost", "url": "https://wearechange.org/weapons-of-mass-vaccination-cdc-intensifies-childhood-vaccine-schedule-to-include-74-injections-before-age-17/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2016-02-16T15:54:59+00:00", "image": "https://wearechange.org/wp-content/uploads/2016/02/Child-Vaccine-Crosshairs.jpg", "image:width": "560", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://TheHealthyHomeEconomist.com", "http://NaturalNews.com", "http://www.naturalnews.com/052992_vaccine_schedule_childhood_vaccines_CDC.html", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["Jeffrey Phillips"], "publish_date": "2016-02-16T15:54:59+00:00"}