{"result_id": "338042", "URL": "https://wearechange.org/mmr-measles-vaccine-clinical-trial-results-faked-big-pharma/", "timestamp": "2023-04-25 18:10:15 CEST+0200", "meta": {"description": "While the vaccine industry is exploiting the Disneyland measles outbreak to call for widespread MMR vaccination, nobody in the mainstream media is telling", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/mmr-measles-vaccine-clinical-trial-results-faked-big-pharma/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "MMR measles vaccine clinical trial results FAKED by Big Pharma", "cleaned_text": "While the vaccine industry is exploiting the Disneyland measles outbreak to call for widespread MMR vaccination, nobody in the mainstream media is telling you how the MMR vaccine clinical trial results were faked by Big Pharma in yet another example of runaway scientific fraud by the vaccine industry.\n\nAccording to two Merck scientists who filed a False Claims Act complaint in 2010 — a complaint which was unsealed three years ago — vaccine manufacturer Merck knowingly falsified its mumps vaccine test data, spiked blood samples with animal antibodies, sold a vaccine that actually promoted mumps and measles outbreaks, and ripped off governments and consumers who bought the vaccine thinking it was “95% effective.”\n\nNatural News acquired that document years ago and maintains one of the very few copies in existence, as all “official” sources have tried to remove this document from human memory and bury the case.\n\nClick here to read the full document now. (PDF)\n\nAccording to Stephen Krahling and Joan Wlochowski, both former Merck virologists, the Merck company engaged in all the following behavior:\n• In order to do this, Merck spiked the blood test with animal antibodies to artificially inflate the appearance of immune system antibodies. As reported in CourthouseNews.com:\n\nMerck also added animal antibodies to blood samples to achieve more favorable test results, though it knew that the human immune system would never produce such antibodies, and that the antibodies created a laboratory testing scenario that “did not in any way correspond to, correlate with, or represent real life … virus neutralization in vaccinated people,” according to the complaint. (http://www.courthousenews.com/2012/06/27/478…)\n• Merck then used the falsified trial results to swindle the U.S. government out of “hundreds of millions of dollars for a vaccine that does not provide adequate immunization.”\n• Merck’s vaccine fraud has actually contributed to the continuation of mumps across America, causing more children to become infected with mumps. Yes, the vaccine spreads disease, they say.\n• Merck used its false claims of “95 percent effectiveness” to monopolize the vaccine market and eliminate possible competitors.\n• The Merck vaccine fraud has been going on since the late 1990’s, say the Merck virologists.\n• Testing of Merck’s vaccine was never done against “real-world” mumps viruses in the wild. Instead, test results were simply falsified to achieve the desired outcome.\n• This entire fraud took place “with the knowledge, authority and approval of Merck’s senior management.”\n• Merck scientists “witnessed firsthand the improper testing and data falsification in which Merck engaged to artificially inflate the vaccine’s efficacy findings,” according to court documents (see below).\n\nUS government chose to ignore the 2010 False Claims Act!\n\nRather than taking action on this false claims act, the U.S. government simply ignored it, thereby protecting Merck’s market monopoly instead of properly serving justice. This demonstrates the conspiracy of fraud between the U.S. government, FDA regulators and the vaccine industry.\n\nChatom Primary Care sues Merck for Sherman Act monopolization, breach of warranty, violation of consumer protection laws\n\nFollowing the unsealing of this 2010 False Claims Act, Chatom Primary Care, based in Alabama, smelled something rotten. In 2012, Chatom filed a lawsuit against Merck. That lawsuit record is also available on Natural News, where real medical history is archived in the public interest.\n\nClick here to read the Chatom lawsuit document.\n\nIt alleges, among other shocking things:\n\n[Merck engaged in] …a decade-long scheme to falsify and misrepresent the true efficacy of its vaccine.\n\nMerck fraudulently represented and continues to falsely represent in its labeling and elsewhere that its Mumps Vaccine has an efficacy rate of 95 percent of higher.\n\nIn reality, Merck knows and has taken affirmative steps to conceal — by using improper testing techniques and falsifying test data — that its Mumps Vaccine is, and has been since at least 1999, far less than 95 percent effective.\n\nMerck designed a testing methodology that evaluated its vaccine against a less virulent strain of the mumps virus. After the results failed to yield Merck’s desired efficacy, Merck abandoned the methodology and concealed the study’s findings.\n\n…incorporating the use of animal antibodies to artificially inflate the results…\n\n…destroying evidence of the falsified data and then lying to an FDA investigator…\n\n…threatened a virologist in Merck’s vaccine division with jail if he reported the fraud to the FDA…\n\n…the ultimate victims here are the millions of children who every year are being injected with a mumps vaccine that is not providing them with an adequate level of protection. And while this is a disease that, according to the Centers for Disease Control (‘CDC’), was supposed to be eradicated by now, the failure in Merck’s vaccine has allowed this disease to linger, with significant outbreaks continuing to occur.\n\nChatom Primary Care also alleges that the fraudulent Merck vaccine contributed to the 2006 mumps outbreak in the Midwest, and a 2009 outbreak elsewhere. It says, “there has remained a significant risk of a resurgence of mumps outbreaks…”\n\nSources for this article:\n\n NaturalNews wishes to thank CourthouseNews.com for its coverage of this story. Original article at: http://www.courthousenews.com/2012/06/27/478…\n\n2010 False Claims Act against Merck, by two Merck virologists\n\n www.naturalnews.com/gallery/documents/Merck-…\n\nAnnouncement of the lawsuit in the media:\n\n http://www.nasdaq.com/article/lawsuit-claims…", "opengraph": {"locale": "en_US", "type": "article", "title": "MMR measles vaccine clinical trial results FAKED by Big Pharma | We Are Change", "description": "While the vaccine industry is exploiting the Disneyland measles outbreak to call for widespread MMR vaccination, nobody in the mainstream media is telling", "url": "https://wearechange.org/mmr-measles-vaccine-clinical-trial-results-faked-big-pharma/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2016-03-10T15:39:24+00:00", "image": "https://wearechange.org/wp-content/uploads/2016/03/Vaccine-Insanity-1.jpg", "image:width": "560", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.naturalnews.com/gallery/documents/Merck-False-Claims-Act.pdf", "http://www.courthousenews.com/2012/06/27/47851.htm", "http://www.naturalnews.com/gallery/documents/Chatom-Lawsuit-Merck-Mumps.pdf", "http://www.courthousenews.com/2012/06/27/47851.htm", "http://www.naturalnews.com/gallery/documents/Chatom-Lawsuit-Merck-Mumps.pdf", "http://www.nasdaq.com/article/lawsuit-claims...", "http://www.naturalnews.com/048402_measles_vaccine_scientific_fraud_court_documents.html#ixzz42VyoxdPG", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["Jeffrey Phillips"], "publish_date": "2016-03-10T15:39:24+00:00"}