{"result_id": "338018", "URL": "https://wearechange.org/sb-277-signed-into-law-by-ca-governor-to-deny-vaccine-exemptions-for-school-children/", "timestamp": "2023-04-25 18:08:58 CEST+0200", "meta": {"description": "(OrganicLifestyleMagazine) The vaccine discussion just got more complicated as California governor Jerry Brown signed SB 277. Just one day after lawmakers", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/sb-277-signed-into-law-by-ca-governor-to-deny-vaccine-exemptions-for-school-children/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "SB 277 SIGNED INTO LAW BY CA GOVERNOR TO DENY VACCINE EXEMPTIONS FOR SCHOOL CHILDREN", "cleaned_text": "(OrganicLifestyleMagazine) The vaccine discussion just got more complicated as California governor Jerry Brown signed SB 277. Just one day after lawmakers sent him the bill, Brown signed it into law, eliminating all personal and religious exemptions for vaccines for California’s schoolchildren.\n\nIt defies common sense. It negates basic human rights. But Governor Brown has chosen to take away the right to exempt children from vaccinations for religious and personal (philosophical ) reasons for anyone who wants their child to attend school.\n\nEven though California is only the third state to eliminate these vaccine exemptions, they are the largest and most public. Since the initial proposal of the bill by Democratic state senator Richard Pan, protests and petitions against it have been rampant, and opponents say that they are planning to use every avenue available to them to have the law repealed.\n\nThis new bill is a change from Governor Brown’s previous stand on the issue when he left religious exemptions intact but required parents to speak to a health professional before obtaining an exemption. With 67% of California’s adults in favor of the bill and increased pressure from the vaccine and pharmaceutical lobbyists, this bill is not a measured and thoughtful response. It is a frantic scramble after a very public, but very overblown, health scare. Unfortunately, many lawmakers have not fully considered the consequences of their decision.\n\nOpponents of the legislation claim it restricts parents’ rights to chose their children’s care. Opponents vowed to challenge the law immediately.\n\nWhen does the law take effect?\n\nOn January of 2016 schools will “…ensure kids entering kindergarten and seventh grade are vaccinated in July 2016, ahead of the 2016-17 school year.” – Sacramento Bee\n\n Required Vaccines\n\nDiphtheria\n\n Haemophilus influenzae type b (Hib meningitis),\n\n Measles, mumps\n\n Pertussis (whooping cough)\n\n Poliomyelitis\n\n Rubella (German measles)\n\n Tetanus\n\n Hepatitis B\n\n Chickenpox\n\n Can children keep personal belief exemptions they already have?\n\nIf a child is currently exempted (or gains an exemption before the law goes into effect in 2016), that exemption remains in effect until the child enters the seventh grade. No child can enter kindergarten or the seventh grade without vaccinations unless they obtain a medical exemption. Any unvaccinated child with an exemption who enters the seventh grade before the law goes into effect will not have to be vaccinated.\n\nMedical exemptions are allowed at a doctors discretion. The doctor can take earlier responses to a vaccine into account as well as family history, including reactions of siblings.\n\nParents are forced to vaccinate their children if they want their child to attend school. The mounting evidence of corruption and careless abandonment of all ethical and moral standards of the pharmaceutical companies who make vaccines is appalling. They recommend an outrageous number of vaccines for our children in the name of preventative medicine while lying about the risks involved. Children are dying all over the world and other countries are refusing our vaccines due to death and injury, but here in America we keep hearing the mantra, “Vaccines are safe and effective.”\n\nBig Pharma is running the show, honing the message, and pulling the strings. They own the media. Mainstream news is afraid to speak out due to the real threat of loss of revenue. Government is just a puppet, pulled along and pushed around by propaganda and our representatives are shamefully bought off with dirty money. How many more children will be neurologically damaged or killed while their parents feel they have no choice but to comply?\n\nWake up America. Something is very, very wrong when corporations rule the nation, not the people.\n\n We must learn more about the very real dangers of vaccinations and why they are so much more dangerous now for the current generation. To learn more about the flu shot and the MMR, check out the sources below.", "opengraph": {"locale": "en_US", "type": "article", "title": "SB 277 SIGNED INTO LAW BY CA GOVERNOR TO DENY VACCINE EXEMPTIONS FOR SCHOOL CHILDREN | We Are Change", "description": "(OrganicLifestyleMagazine) The vaccine discussion just got more complicated as California governor Jerry Brown signed SB 277. Just one day after lawmakers", "url": "https://wearechange.org/sb-277-signed-into-law-by-ca-governor-to-deny-vaccine-exemptions-for-school-children/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2015-07-09T05:07:26+00:00", "article:modified_time": "2016-02-12T15:50:00+00:00", "image": "https://wearechange.org/wp-content/uploads/2015/07/california-vaccine-1400x500.jpg", "image:width": "600", "image:height": "214", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://wearechange.org/wp-content/uploads/2015/07/california-vaccine-1400x500.jpg", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["Jeffrey Phillips"], "publish_date": "2015-07-09T05:07:26+00:00"}