{"result_id": "338049", "URL": "https://wearechange.org/harvard-epidemiologist-says-the-case-for-covid-19-vaccine-passports-was-just-demolished/", "timestamp": "2023-04-25 18:10:41 CEST+0200", "meta": {"description": "There is simply no historical parallel for governments attempting to restrict the movements of healthy people in this manner.", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/harvard-epidemiologist-says-the-case-for-covid-19-vaccine-passports-was-just-demolished/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Harvard Epidemiologist Says the Case for COVID-19 Vaccine Passports Was Just Demolished", "cleaned_text": "A newly published medical study found that infection from COVID-19 confers considerably longer-lasting and stronger protection against the Delta variant of the virus than vaccines.\n\n“The natural immune protection that develops after a SARS-CoV-2 infection offers considerably more of a shield against the Delta variant of the pandemic coronavirus than two doses of the Pfizer-BioNTech vaccine, according to a large Israeli study that some scientists wish came with a ‘Don’t try this at home’ label,” the Scientific American reported Thursday. “The newly released data show people who once had a SARS-CoV-2 infection were much less likely than vaccinated people to get Delta, develop symptoms from it, or become hospitalized with serious COVID-19.”\n\nPut another way, vaccinated individuals were 27 times more likely to get a symptomatic COVID infection than those with natural immunity from COVID.\n\nThe findings come as many governments around the world are demanding citizens acquire “vaccine passports” to travel. New York City, France, and the Canadian provinces of Quebec and British Columbia are among those who have recently embraced vaccine passports.\n\nMeanwhile, Australia has floated the idea of making higher vaccination rates a condition of lifting its lockdown in jurisdictions, while President Joe Biden is considering making interstate travel unlawful for people who have not been vaccinated for COVID-19.\n\nVaccine passports are morally dubious for many reasons, not the least of which is that freedom of movement is a basic human right. However, vaccine passports become even more senseless in light of the new findings out of Israel and revelations from the CDC, some say.\n\nHarvard Medical School professor Martin Kulldorff said research showing that natural immunity offers exponentially more protection than vaccines means vaccine passports are both unscientific and discriminatory, since they disproportionately affect working class individuals.\n\n“Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical,” Kulldorff, a biostatistician and epidemiologist, observed on Twitter.\n\nNor is the study out of Israel a one-off. Media reports show that no fewer than 15 academic studies have found that natural immunity offers immense protection from COVID-19.\n\nMoreover, CDC research shows that vaccinated individuals still get infected with COVID-19 and carry just as much of the virus in their throat and nasal passage as unvaccinated individuals\n\n“High viral loads suggest an increased risk of transmission and raised concern that, unlike with other variants, vaccinated people infected with Delta can transmit the virus,” CDC Rochelle Director Walensky noted following a Cape Cod outbreak that included mostly vaccinated individuals.\n\nThese data suggest that vaccinated individuals are still spreading the virus much like unvaccinated individuals.\n\nVaccine passports would be immoral and a massive government overreach even in the absence of these findings. There is simply no historical parallel for governments attempting to restrict the movements of healthy people over a respiratory virus in this manner.\n\nYet the justification for vaccine passports becomes not just wrong but absurd in light of these new revelations.\n\nPeople who have had COVID already have significantly more protection from the virus than people who’ve been vaccinated. Meanwhile, people who’ve not had COVID and choose to not get vaccinated may or may not be making an unwise decision. But if they are, they are principally putting only themselves at risk.", "opengraph": {"locale": "en_US", "type": "article", "title": "Harvard Epidemiologist Says the Case for COVID-19 Vaccine Passports Was Just Demolished", "description": "There is simply no historical parallel for governments attempting to restrict the movements of healthy people in this manner.", "url": "https://wearechange.org/harvard-epidemiologist-says-the-case-for-covid-19-vaccine-passports-was-just-demolished/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2021-09-02T15:50:28+00:00", "image": "https://wearechange.org/wp-content/uploads/2021/09/uuuuuuuuuuuu-600x315.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">In Israel, vaccinated individuals had 27 times higher risk of symptomatic COVID infection compared to those with natural immunity from prior COVID disease [95%CI:13-57, adjusted for time of vaccine/disease]. No COVID deaths in either group.<a href=\"https://t.co/hopImCD1D0\">https://t.co/hopImCD1D0</a></p>\n<p>— Martin Kulldorff (@MartinKulldorff) <a href=\"https://twitter.com/MartinKulldorff/status/1430660291579105284?ref_src=twsrc%5Etfw\">August 25, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Prior COVID disease (many working class) provides better immunity than vaccines (many professionals), so vaccine mandates are not only scientific nonsense, they are also discriminatory and unethical. <a href=\"https://t.co/d14kTPnCWk\">https://t.co/d14kTPnCWk</a></p>\n<p>— Martin Kulldorff (@MartinKulldorff) <a href=\"https://twitter.com/MartinKulldorff/status/1431220427758710784?ref_src=twsrc%5Etfw\">August 27, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">“Among the most fraudulent messages of the CDC's campaign of deceit is to force the vaccine on those with prior infection, who have a greater degree of protection against all versions of the virus than those with any of the vaccines.”</p>\n<p>15 studies show…<a href=\"https://t.co/oXaI3L0Y3S\">https://t.co/oXaI3L0Y3S</a></p>\n<p>— Thomas Massie (@RepThomasMassie) <a href=\"https://twitter.com/RepThomasMassie/status/1430842643693572100?ref_src=twsrc%5Etfw\">August 26, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://www.medrxiv.org/content/10.1101/2021.08.24.21262415v1", "https://www.sciencemag.org/news/2021/08/having-sars-cov-2-once-confers-much-greater-immunity-vaccine-no-infection-parties", "https://t.co/hopImCD1D0", "https://twitter.com/MartinKulldorff/status/1430660291579105284?ref_src=twsrc%5Etfw", "https://www.nytimes.com/2021/08/04/technology/vaccine-passport-ny-privacy.html", "https://www.voanews.com/covid-19-pandemic/thousands-canada-and-france-protest-vaccine-passports", "https://fee.org/articles/vaccine-passports-have-come-to-canada-don-t-expect-the-canadian-constitution-to-stop-them/", "https://www.dailymail.co.uk/news/article-9920409/Low-vaccination-rates-WA-Queensland-delay-freedom-Covid-Australia-Scott-Morrison.html", "https://www.argusleader.com/story/news/2021/08/14/biden-isnt-considering-interstate-covid-vaccine-mandates-noem-says-south-dakota-wont-support-idea/8137205002/", "https://fee.org/articles/free-people-require-free-movement/", "https://t.co/d14kTPnCWk", "https://twitter.com/MartinKulldorff/status/1431220427758710784?ref_src=twsrc%5Etfw", "https://t.co/oXaI3L0Y3S", "https://twitter.com/RepThomasMassie/status/1430842643693572100?ref_src=twsrc%5Etfw", "https://www.washingtonpost.com/health/2021/07/30/provincetown-covid-outbreak-vaccinated/", "https://fee.org/articles/harvard-epidemiologist-says-the-case-for-covid-vaccine-passports-was-just-demolished/", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2021-09-02T15:50:28+00:00"}