{"result_id": "338013", "URL": "https://wearechange.org/pfizer-covid-19-vaccine-was-just-12-effective-against-omicron-in-kids-ages-5-to-11-study-finds/", "timestamp": "2023-04-25 18:08:44 CEST+0200", "meta": {"description": "As it turns out, the Pfizer vaccine is almost entirely ineffective in children ages 5-11.", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://news4achange.com/pfizer-covid-19-vaccine-was-just-12-effective-against-omicron-in-kids-ages-5-to-11-study-finds/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Pfizer COVID-19 Vaccine Was Just 12% Effective Against Omicron in Kids Ages 5 to 11, Study Finds", "cleaned_text": "As it turns out, the Pfizer vaccine is almost entirely ineffective in children ages 5-11, according to the latest batch of trial data released by the vaccine giant.\n\nHere’s more from the NYT:\n\nThe coronavirus vaccine made by Pfizer-BioNTech is much less effective in preventing infection in children ages 5 to 11 years than in older adolescents or adults, according to a large new set of data collected by health officials in New York State — a finding that has deep ramifications for these children and their parents. The Pfizer vaccine is the only Covid shot authorized for that age group in the United States. It still prevents severe illness in the children, but offers virtually no protection against infection, even within a month after full immunization, the data, which were collected during the Omicron surge, suggest.\n\nThe scientists who led the study noted that the jab was far less effective and that the data weaken the argument for mandating the jabs in children.\n\nWhile states across the US – including California, Oregon and Washington, which announced today they would lift masking guidance starting March 11 – and the CDC have lifted requirements for people to mask up (it’s worth noting that more than a dozen conservative-leaning states barred masking requirements). But vaccination requirements will likely remain a part of our society in some form from here on out. While a federal judge struck down the Biden Administration’s attempts to pass a federal vaccine mandaate, the firing of workers for being unvaccinated remains commonplace. Many others are forced to be tested for COVID at least once a week, at their own expense.\n\nBut as schools across the country move to require all students to be vaccinated – with rare exceptions – even the MSM is acknowledging that jabs in elementry school-aged children are ineffective.\n\nWhile the jabs supposedly prevent “severe illness” in children, it’s worth noting that children who lack co-morbidities rarely display even moderate symptoms, and severe cases are almost unheard of.\n\nEven Dr. Fauci has acknowledged that “many” children hospitalized with COVID are there for some other reason. However, every patient brought into a hospital is tested for COVID, and those who test positive are automatically counted as hospitalized with COVID.\n\nAmusingly, the NYT suggested that one reason for the drop in performance might be the fact that children receive “one third the dose” of adults.\n\nThe vaccine also performed poorly on children ages 2-4, the next-youngest age group.\n\nCharts from the study show the slim gap between unvaccinated and vaccinated children in terms of hospitalizations.\n\nIt also shows how effectiveness wanes as the age of the recipient falls.\n\nReaders can find the full study here.", "opengraph": {"locale": "en_US", "type": "article", "title": "Pfizer COVID-19 Vaccine Was Just 12% Effective Against Omicron in Kids Ages 5 to 11, Study Finds", "description": "As it turns out, the Pfizer vaccine is almost entirely ineffective in children ages 5-11.", "url": "https://news4achange.com/pfizer-covid-19-vaccine-was-just-12-effective-against-omicron-in-kids-ages-5-to-11-study-finds/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2022-03-01T21:59:47+00:00", "article:modified_time": "2022-03-01T22:02:12+00:00", "image": "https://news4achange.com/wp-content/uploads/2022/03/oifusdoifusoidfsd-600x315.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Fauci: \"If you look at the children that are hospitalized, many of them are hospitalized with Covid, as opposed to because of Covid.\" <a href=\"https://t.co/57Rdx8gPg3\">pic.twitter.com/57Rdx8gPg3</a></p>\n<p>— The Post Millennial (@TPostMillennial) <a href=\"https://twitter.com/TPostMillennial/status/1476710278096166917?ref_src=twsrc%5Etfw\">December 31, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://www.nytimes.com/2022/02/28/health/pfizer-vaccine-kids.html", "https://www.zerohedge.com/covid-19/think-twice-you-vaccinate-your-kids-dr-robert-malone-warns-parents-covid-19-shots", "https://t.co/57Rdx8gPg3", "https://twitter.com/TPostMillennial/status/1476710278096166917?ref_src=twsrc%5Etfw", "https://www.scribd.com/document/561807314/2022-02-25-22271454v1-full#download&from_embed", "https://www.zerohedge.com/covid-19/pfizer-vaccine-far-less-effective-5-11-year-olds-latest-data-show", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2022-03-01T21:59:47+00:00"}