{"result_id": "338039", "URL": "https://wearechange.org/fauci-calls-for-more-vaccine-mandates-at-the-local-level-slams-alex-berenson-for-spreading-facts/", "timestamp": "2023-04-25 18:10:05 CEST+0200", "meta": {"description": "\"I have been of this opinion, and I remain of that opinion, that I do believe at the local level, Jake, there should be more mandates...\"", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://news4achange.com/fauci-calls-for-more-vaccine-mandates-at-the-local-level-slams-alex-berenson-for-spreading-facts/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Fauci Calls for \"More Vaccine Mandates at the Local Level,\" Slams Alex Berenson for Spreading Facts", "cleaned_text": "The nation’s highest-paid employee in the US government, Anthony Fauci, has gone full-throttle on vaccines – this time with a Sunday appearance on CNN‘s “State of the Union,” where he pushed for vaccine mandates at the local level, and slammed a guest speaker at CPAC (Alex Berenson) for applauding young people for researching vaccine side-effects.\n\nMore on local mandates from Jenny Goldsberry via SaraACarter.com,\n\nDr. Anthony Fauci of the National Institute of Allergies and Infectious Diseases Director appeared on CNN’s State of the Union Sunday to give his opinion on vaccine mandates. He agrees with the White House and President Biden himself, saying vaccination mandates should be the next step.\n\n“I have been of this opinion, and I remain of that opinion, that I do believe at the local level, Jake, there should be more mandates,” Fauci told host Jake Tapper. “There really should be.”\n\nFor fear of more people dying, Fauci strongly supports mandates. “We’re talking about life and death situation. We have lost 600,000 Americans already, and we’re still losing more people,” Fauci said. “There have been 4 million deaths worldwide. This is serious business. So I am in favor of that.”\n\nMeanwhile, at the Conservative Political Action Conference, author Alex Berenson called out the vaccination efforts as a scam. “The government was hoping that they could sort of sucker 90% of the population into getting vaccinated,” Berenson said. “And it isn’t happening.” People in the audience cheered when they heard that. On the other hand, Fauci called the reaction “horrifying.”\n\nAs a result, the NIAID director says the solution to vaccine hesitancy is official approval from the Food and Drug Administration. “One of the things that will happen, and I think the hesitancy at the local level of doing mandates is because the vaccines have not been officially fully approved,” Fauci said. “But people need to understand that the amount of data right now that shows a high degree of effectiveness and a high degree of safety is more than we’ve ever seen with the emergency use authorization, so these vaccines are as good as officially approved with all the I’s dotted and T’s crossed. It hasn’t been done yet because the FDA has to do certain things. But it’s as good as done. So people should really understand that. But they are waiting now until you get an official approval before. And I think when you do see the official approval, you’ll see a lot more mandates.”\n\nMeanwhile, Steve Watson of Summit News notes Fauci’s shock at the ‘horrifying’ facts presented by Berenson.\n\nAppearing on CNN Sunday, Anthony Fauci described it “horrifying” that a crowd at the CPAC gathering applauded when a guest speaker declared that young people are educating themselves about the side effects of the COVID vaccine.\n\nConservative writer Alex Berenson was speaking about the government’s attempts to indiscriminately push the vaccine on people of all ages, including young people who are statistically more at risk from the vaccine than from the virus.\n\n“They were hoping, the federal government was hoping, they could sucker 90 percent of the population into getting vaccinated,” Berenson said, adding “younger people are well aware of what the risks really are and they are well aware of the side effect profile of the vaccines.”\n\nThe comments drew applause from sections of the crowd.\n\nWhen asked for his thoughts by CNN host Jake Tapper, Fauci responded “It’s horrifying…I just don’t get that. I mean, and I don’t think that anybody who is thinking clearly can get that.”\n\n“We’ve got to put aside this ideological difference or differences thinking that somebody is forcing you to do something,” Fauci continued.\n\n“The public health officials, like myself and my colleagues, are asking you to do something that will ultimately save your life and that of your family, and that of the community,” he continued.\n\n“I don’t know. I really don’t have a good explanation, Jake, about why this is happening. I mean, it’s ideological rigidity, I think. There’s no reason not to get vaccinated,” Fauci further proclaimed.\n\nThe government has failed to reach its targets on fully vaccinating 70 percent of the population, with the White House suggesting “herd immunity is kind of an outdated term,” and vowing to send “strike forces” to people’s homes in an effort to get more vaccinated.\n\nMeanwhile, the Vaers report continues to monitor deaths from side effects of the vaccine, which are at time of writing approaching 10,000 in the U.S. alone, with in excess of 438,000 adverse reactions also reported.\n\nThe likes of CNN are declaring that it is “time to start mandating” coronavirus vaccines for all Americans to counter people opting not to take the shots because of hesitancy over potential side effects.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fauci Calls for \"More Vaccine Mandates at the Local Level,\" Slams Alex Berenson for Spreading Facts", "description": "\"I have been of this opinion, and I remain of that opinion, that I do believe at the local level, Jake, there should be more mandates...\"", "url": "https://news4achange.com/fauci-calls-for-more-vaccine-mandates-at-the-local-level-slams-alex-berenson-for-spreading-facts/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2021-07-13T03:35:07+00:00", "image": "https://news4achange.com/wp-content/uploads/2021/07/fauci-covid-566x315.png", "image:width": "566", "image:height": "315", "image:type": "image/png"}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">On <a href=\"https://twitter.com/hashtag/CNNSOTU?src=hash&amp;ref_src=twsrc%5Etfw\">#CNNSOTU</a> w/ <a href=\"https://twitter.com/jaketapper?ref_src=twsrc%5Etfw\">@jaketapper</a>, Dr. Anthony Fauci calls the reaction by the crowd at the Conservative Political Action Committee to a conservative author's comments about the US falling short of it's vaccination goal 'horrifying' <a href=\"https://t.co/riMPKronHA\">https://t.co/riMPKronHA</a></p>\n<p>— State of the Union (@CNNSotu) <a href=\"https://twitter.com/CNNSotu/status/1414295173178200069?ref_src=twsrc%5Etfw\">July 11, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">CPAC crowd applauds a comment about the U.S. failing to reach a 90% vaccination rate <a href=\"https://t.co/iGX6FD4SaU\">pic.twitter.com/iGX6FD4SaU</a></p>\n<p>— Andrew Solender (@AndrewSolender) <a href=\"https://twitter.com/AndrewSolender/status/1413996097270435840?ref_src=twsrc%5Etfw\">July 10, 2021</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Jake Tapper asks Dr. Anthony Fauci to react to the CPAC Texas crowd cheering that the government has been unable to reach its vaccine goals so far.</p>\n<p>Fauci:  \"It’s horrifying…  I just don’t get that. I mean, and I don’t think that anybody who is thinking clearly can get that.\" <a href=\"https://t.co/4nY7CMor5i\">pic.twitter.com/4nY7CMor5i</a></p>\n<p>— Justin Baragona (@justinbaragona) <a href=\"https://twitter.com/justinbaragona/status/1414212780434108420?ref_src=twsrc%5Etfw\">July 11, 2021</a></p></blockquote>\n"], "movies": [], "links": ["https://www.forbes.com/sites/adamandrzejewski/2021/01/25/dr-anthony-fauci-the-highest-paid-employee-in-the-entire-us-federal-government/?sh=3d21378f386f", "https://saraacarter.com/fauci-says-there-should-be-more-mandates-on-vaccinations-at-the-local-level/", "https://saraacarter.com/rasmussen-poll-nearly-half-of-american-voters-think-fauci-lied-about-gain-of-function-research/", "https://www.cnn.com/shows/state-of-the-union", "https://twitter.com/hashtag/CNNSOTU?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/jaketapper?ref_src=twsrc%5Etfw", "https://t.co/riMPKronHA", "https://twitter.com/CNNSotu/status/1414295173178200069?ref_src=twsrc%5Etfw", "https://summit.news/2021/07/12/video-fauci-declares-it-horrifying-after-cpac-crowds-applauds-young-people-being-aware-of-vaccine-side-effects/", "https://t.co/iGX6FD4SaU", "https://twitter.com/AndrewSolender/status/1413996097270435840?ref_src=twsrc%5Etfw", "https://t.co/4nY7CMor5i", "https://twitter.com/justinbaragona/status/1414212780434108420?ref_src=twsrc%5Etfw", "https://summit.news/2021/07/08/video-white-house-says-strike-forces-being-sent-to-get-kids-vaccinated/", "https://www.openvaers.com/covid-data/mortality", "https://www.openvaers.com/covid-data/covid-full-data", "https://summit.news/2021/07/09/video-cnn-doctor-says-its-time-to-start-mandating-covid-vaccines/", "https://www.zerohedge.com/covid-19/fauci-calls-more-vaccine-mandates-local-level-slams-alex-berenson-spreading-facts-cpac", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2021-07-13T03:35:07+00:00"}