{"result_id": "338010", "URL": "https://wearechange.org/scientists-scramble-to-identify-culprit-behind-allergic-reactions-to-the-jab/", "timestamp": "2023-04-25 18:08:34 CEST+0200", "meta": {"description": "An unexpected spike in allergic reactions to the jab may prove catastrophic to widespread acceptance unless scientists can figure out why.", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/scientists-scramble-to-identify-culprit-behind-allergic-reactions-to-the-jab/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "Scientists Scramble to Identify Culprit Behind Allergic Reactions to The Jab", "cleaned_text": "All is not going according to plan in the global rollout of what is arguably the most important vaccine in a century, and it is not just growing mistrust in the covid injection effort that was rolled out in record time: an unexpected spike in allergic reactions to the Pfizer/BioNTech vaccine may prove catastrophic to widespread acceptance unless scientists can figure out what is causing it after the FDA’s rushed approval. So in a welcome development, the WSJ reports that according to scientists, the potential culprit causing the allergic reactions to the Pfizer/BioNTech vaccine is the compound polyethylene glycol, also known as PEG.\n\nAccording to the CDC, at least six severe allergic reactions to the vaccine have been reported so far in the US out of 272,001 doses administered through Dec. 19, while at least two cases of anaphylaxis have also occurred in the UK.\n\nPolyethylene glycol – a polyether compound derived from petroleum with many applications, from industrial manufacturing to medicine – is present in both the Moderna and Pfizer–BioNTech vaccines for SARS-CoV-2 as a PEGylated lipid, which is used as an excipient. Both RNA vaccines consist of Messenger RNA, or mRNA, encased in a bubble of oily molecules called lipids. Proprietary lipid technology is used for each. In both vaccines, the bubbles are coated with a stabilizing molecule of polyethylene glycol.\n\nScientists have focused in on PEG as a potential suspect even as health authorities say they are still investigating the incidents and plan to study the issue further. The compound is found in other drugs and is known to trigger anaphylaxis on rare occasions.\n\n“Although I think we’re just speculating here…it is known that one of the components that is present in both of the vaccines—polyethylene glycol—can be associated, uncommonly, with allergic reactions,” said Peter Marks, director of the Food and Drug Administration’s Center for Biologics Evaluation and Research, at a Dec. 18 press conference.\n\n“What we’re learning now is that those allergic reactions could be somewhat more common than the highly uncommon that we thought they were because people do get exposed to polyethylene glycol in various pharmaceutical preparations,” Marks added, noting that the FDA also plans to watch the Moderna vaccine rollout “very closely” since both vaccines contain PEG.\n\nIn a statement, Pfizer said it “will closely monitor all reports suggestive of serious allergic reactions following vaccination.” The company said its prescribing information includes a warning that “appropriate medical treatment and supervision should always be readily available in case of a rare anaphylactic event following the administration of the vaccine.”\n\nAs noted above, in both the Pfizer-BioNTech and Moderna vaccines, PEG is part of the fatty envelope that surrounds the messenger RNA, the main ingredient in the vaccine. Once the mRNA gets into cells, it teaches them to make a protein that resembles the spike protein found on the surface of the coronavirus. That induces a specific immune response that shores up the body’s defenses for when it is exposed to the real virus. The PEG-containing fatty envelope helps ensure the mRNA gets across the cell membrane and into the cells.\n\nOf course, with scientists openly scrambling and throwing anything at the wall hoping something sticks so it doesn’t appear that they rushed the vaccines without actually checking for all potential complications, it is likely that the PEG trail is cold. As the WSJ reports, allergies to PEG are extremely rare, and it is possible that the few people who had reactions after getting the Pfizer-BioNTech vaccine reacted to something else. The compound is found in a range of products, they say, such as cosmetics, foods and drugs. Some vaccines also contain PEG-like compounds. Adding to the complexity, some types of PEG are more likely to cause allergic reactions than others.\n\nAt the same time, “the PEG in the vaccines is different than what has been previously associated with allergic reactions,” said James Baker, an immunologist who heads the Michigan Nanotechnology Institute for Medicine and the Biological Sciences at the University of Michigan.\n\nAllergy experts say it isn’t certain yet whether the reactions seen so far were classic allergic reactions—that is, immune reactions involving an antibody called immunoglobulin E, or IgE, which are part of the so-called adaptive arm of the immune system, which learns to recognize specific intruders. The reactions could also be due to a misfiring of the innate immune system, causing a cascade of reactions in what’s known as the body’s complement system.\n\n“We have to look at all the possibilities,” said . Baker. Both he and Dr. Phillips recently attended a virtual meeting hosted by the National Institute of Allergy and Infectious Diseases to discuss the Covid-19 vaccine allergic reactions. The agency said it is designing a study to look more closely at the issue.\n\n“We anticipate studying highly allergic individuals with prior episodes of anaphylaxis, as well as some other groups such [as] patients with known PEG allergy,” said Daniel Rotrosen, the director of the Division of Allergy, Immunology and Transplantation at NIAID, in an email. The study will include healthy individuals for comparison, he said, and researchers will gather biologic samples before and after vaccination to monitor for any immune changes induced by the vaccine.\n\nWhile PEG is a possible culprit, “we need to keep an open mind regarding other possibilities,” he added.\n\nFor now, the CDC says people who have a history of severe allergic reactions to any component of the Pfizer-BioNTech or Moderna vaccines should not receive the vaccine, and those who have a severe allergic reaction after the first dose should not receive the second. The agency also says people who get the shots should be observed for 15 minutes after vaccination to monitor for possible adverse reactions. People with a history of anaphylaxis should be observed for 30 minutes, it says.\n\nOne final note: while until now all allergic reactions had been in response to the Pfizer vaccine, with the the rollout of Moderna’s mRNA vaccine largely without glitches, that changed on Friday when a Boston doctor suffered a serious allergic reaction to Moderna’s coronavirus vaccine, the first of its kind documented, the NYT reported.\n\nDr. Hossein Sadrzadeh, a geriatric oncologist at Boston Medical Center, became dizzy and felt his heart racing minutes after receiving the vaccine on Thursday, he told The New York Times.\n\n“It was the same anaphylactic reaction that I experience with shellfish,” Dr. Sadrzadeh told the paper, noting that his tongue became numb, his blood pressure plummeted and he broke into a cold sweat. “I don’t want anybody to go through that.”\n\nHis reaction was remarkably similar to what happened to nurse Tiffany Dover, at the CHI Memorial Hospital in Chattanooga, who fainted on live TV shortly after getting the Pfizer vaccine.\n\nSadrzadeh self-administered an EpiPen he brought in the event of such a reaction, and was discharged following a brief emergency room examination, the report said. Sadrzadeh’s symptoms were the first known reaction of its severity to the Moderna shot.", "opengraph": {"locale": "en_US", "type": "article", "title": "Scientists Scramble to Identify Culprit Behind Allergic Reactions to The Jab", "description": "An unexpected spike in allergic reactions to the jab may prove catastrophic to widespread acceptance unless scientists can figure out why.", "url": "https://wearechange.org/scientists-scramble-to-identify-culprit-behind-allergic-reactions-to-the-jab/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2020-12-26T23:21:38+00:00", "image": "https://wearechange.org/wp-content/uploads/2020/12/dufsdoiufdsff-600x315.png", "image:width": "600", "image:height": "315", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wsj.com/articles/scientists-eye-potential-culprit-for-covid-19-vaccine-allergic-reactions-11608901200", "https://www.nytimes.com/2020/12/25/health/Covid-moderna-vaccine-allergies.html?surface=most-popular&fellback=false&req_id=5611048&algo=bandit-all-surfaces&variant=0_bandit-all-surfaces&imp_id=699541521&action=click&module=Most%20Popular&pgtype=Homepage", "https://www.zerohedge.com/covid-19/tennessee-nurse-passes-out-front-news-crew-minutes-after-taking-covid-19-vaccine", "https://www.zerohedge.com/medical/scientists-scramble-identify-culprit-behind-covid-vaccine-allergic-reactions", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2020-12-26T23:21:38+00:00"}