{"result_id": "338035", "URL": "https://wearechange.org/reacts-to-magnets-moderna-covid-19-vaccine-halted-in-japan-due-to-contamination-from-black-substances/", "timestamp": "2023-04-25 18:09:52 CEST+0200", "meta": {"description": "\"It's a substance that reacts to magnets,\" an official told Nikkei, adding \"It could be metal.\"", "lang": "en", "keywords": "", "favicon": "https://wearechange.org/wp-content/uploads/2021/09/cropped-favicon2large-32x32.png", "canonical": "https://wearechange.org/reacts-to-magnets-moderna-covid-19-vaccine-halted-in-japan-due-to-contamination-from-black-substances/", "encoding": "UTF-8"}, "image": null, "domain": "wearechange.org", "title": "“Reacts to Magnets”: Moderna COVID-19 Vaccine Halted in Japan Due to Contamination From \"Black Substances\"", "cleaned_text": "Three days after the Japanese Ministry of Health announced that they were pulling 1.6 million doses of Moderna’s Covid-19 vaccine due to contamination in some vials that ‘reacts to magnets’ and which led to the deaths of at least two men in their 30s who died after receiving their second dose of the Moderna vaccine, two prefectures have halted or limited its use after more contaminated vials were discovered, according to Japan’s public broadcaster, NHK, and The Korea Times, citing local reports.\n\nThe move comes as the Japanese health ministry said it’s investigating the August deaths of two men who received doses from tainted Moderna batches.\n\nAccording to NHK, “black substances” were found in syringes and a vial, while pink substances were spotted in a different syringe.\n\n“We are suspending the use of Moderna Covid-19 vaccines as foreign substances were spotted,” according to a Sunday statement by authorities in Okinawa prefecture, located in southern Japan.\n\nAnother prefecture, Gunama, has halted affected batches of Moderna, telling AFP “We continue use of Moderna lots that are not affected by the incident.”\n\nOn Thursday, Japan suspended three batches of Moderna doses, removing 1.6 million doses from circulation, after several vaccination centers reported finding foreign matter in them.\n\n“It’s a substance that reacts to magnets,” an official told Nikkei, adding “It could be metal.”\n\nModerna, meanwhile, has confirmed receiving “several complaints of particulate matter” in vials distributed in Japan, but that “not safety or efficacy issues” were found related to the reports.\n\n“The company is investigating the reports and remains committed to working transparently and expeditiously with its partner, Takeda, and regulators to address any potential concerns,” a spokesperson told Nikkei, adding that a “manufacturing issue” at a plant in Spain was to blame.\n\nThe contamination reports come after the August deaths of two men, aged 30 and 38, following their second Moderna doses which were drawn from one of the three batches suspended last week.\n\n“At this time, we do not have any evidence that these deaths are caused by the Moderna Covid-19 vaccine, and it is important to conduct a formal investigation to determine whether there is any connection,” Moderna said in a Saturday joint statement with its Japanese distributor, Takeda.\n\nThe nature of the particles found in the vials, which were manufactured by a Moderna contractor in Europe, is also not known yet. “The vials have been sent to a qualified lab for analysis and initial findings will be available early next week,” Moderna and Takeda said. The contractor, Spanish pharmaceutical firm ROVI, said in a statement Thursday that it was investigating the cause of contamination and the doses were only distributed in Japan. –Korea Times\n\nMeanwhile, the European Medicines Agency (EMA) has launched a separate probe to determine if any Moderna doses in the EU are similarly tainted.", "opengraph": {"locale": "en_US", "type": "article", "title": "“Reacts to Magnets”: Moderna COVID-19 Vaccine Halted in Japan Due to Contamination From \"Black Substances\"", "description": "\"It's a substance that reacts to magnets,\" an official told Nikkei, adding \"It could be metal.\"", "url": "https://wearechange.org/reacts-to-magnets-moderna-covid-19-vaccine-halted-in-japan-due-to-contamination-from-black-substances/", "site_name": "We Are Change", "article:publisher": "https://www.facebook.com/WeAreChangee/", "article:published_time": "2021-08-29T21:21:29+00:00", "image": "https://wearechange.org/wp-content/uploads/2021/08/bnmbnmbnmbnmb-600x315.jpg", "image:width": "600", "image:height": "315", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/covid-19/japan-withdraws-16-million-moderna-doses-over-contaminant-reacts-magnets", "https://www.reuters.com/business/healthcare-pharmaceuticals/two-die-japan-after-shots-suspended-moderna-vaccines-japan-govt-2021-08-28/", "https://m.koreatimes.co.kr/pages/article.amp.asp?newsIdx=314685", "https://www3.nhk.or.jp/nhkworld/en/news/20210829_09/", "https://asia.nikkei.com/Spotlight/Coronavirus/COVID-vaccines/1.6m-Moderna-doses-withdrawn-in-Japan-over-contamination", "https://m.koreatimes.co.kr/pages/article.amp.asp?newsIdx=314685", "https://www.zerohedge.com/covid-19/okinawa-halts-moderna-vaccine-over-contamination-black-substances", "https://lukeunfiltered.com/subscribe/", "https://thebestpoliticalshirts.com"], "authors": ["John Titor"], "publish_date": "2021-08-29T21:21:29+00:00"}