{"result_id": "339034", "URL": "https://www.westonaprice.org/help-stop-an-outlandish-covid-19-vaccine-mandate-bill-in-rhode-island/", "timestamp": "2023-04-25 18:11:23 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/help-stop-an-outlandish-covid-19-vaccine-mandate-bill-in-rhode-island/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Help Stop An Outlandish Covid-19 Vaccine Mandate Bill In Rhode Island", "cleaned_text": "Rhode Island legislators are considering a bad bill that would impose fines and increase the taxes of those who refuse COVID-19 vaccines.\n\nPeople who do not get the vaccine would face fines of $50 per month AND would have to pay twice what they’d owe in personal income taxes, under S.B. 2552, introduced by Senator Samuel W. Bell [D-RI].\n\nThis bill would require every eligible person who is at least 16 years old and lives, works, or pays personal income tax in Rhode Island to be immunized against COVID-19. And it would require every eligible resident under 16 years of age to be immunized against COVID-19, with the responsibility for ensuring compliance falling on parents or guardians.\n\nUnder the bill, anyone found in violation may present a signed petition of exemption to the Department of Health. Petitions must be signed by three licensed physicians stating that the person is not a fit subject for immunization against COVID-19 for medical reasons.\n\nThe bill would also require employers to provide proof of compliance for any employee working in-person within the state. Any employer found to be knowingly in violation of the law for more than seven days would have to pay a monthly civil penalty of $5,000 for every violation.\n\nPlease help us stop this ridiculous bill in its tracks by contacting your Rhode Island state senator today! Vaccines are a medical decision that should be left up to individuals and parents, not mandated.\n\nContact your Rhode Island state senator and ask him or her to OPPPOSE S.B. 2552. You can find out who represents you at:\n\nBe sure to contact your State Senator, not your U.S. Senators. Calls are more effective than emails, and only take a few minutes.\n\n“Hi, my name is ____ and I am a constituent. I am calling to ask ___ to oppose S.B. 2552, which mandates COVID-19 vaccines for Rhode Islanders and their children.\n\nThis intrusive bill would fine and double the income taxes of those individuals who do not comply. This is a ludicrous, unconstitutional proposal that also places a penalty of $5,000 per month per violation on employers who have unvaccinated employees. The decision to take an experimental medical product must be left up to the individual, not the government.\n\nCOVID injections have been rushed to market and there have been no long-term studies to guarantee their safety. To date 1,226,314 people have reported adverse reactions and 26,976 have died after the COVID vaccine – as reported to the U.S. Vaccine Adverse Events Reporting System (VAERS). Many more have probably suffered reactions, since it is estimated that only between 1 and 10 percent of reactions are reported. Yet the manufacturers are shielded from liability for any harm they cause.\n\nVaccine mandates are being justified on the idea of the “greater good” and protecting other people. But no individual should be forced to take a medical treatment for someone else’s benefit.\n\nAnd even if it were possible to justify requiring people to take a shot in order to protect others around them, the data shows that the vaccine fails to prevent transmission of COVID. A recent study in the Lancet found that the peak viral load of COVID patients was similar regardless of vaccination status. The CDC’s data shows that tens of thousands of vaccinated individuals have gotten severe enough cases of COVID to have to be hospitalized – and the agency isn’t even trying to track cases among vaccinated people that don’t result in hospitalization, even though those individuals can spread COVID.\n\nS.B. 2552 would require people to put themselves at risk for potentially life-long health problems or even death, based on the desire to believe that the vaccine protects others – when it doesn’t.\n\nBe sure to explain why this issue is important to you. You may wish to use a couple of the talking points below. Don’t copy all of them – just use them as ideas to help structure your own message.\n• Share a personal story if you have relevant experience. Have you or a family member had an adverse reaction to a vaccine?\n• One of the most basic human rights is that of bodily autonomy, as recognized by the Nuremburg Code. Ethical medicine requires prior, completely voluntary and fully informed consent.\n• COVID-19 vaccine manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 vaccines is the Countermeasures Injury Compensation program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medial expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000, and there is no judicial appeal. In other words, the victims will be severely undercompensated while the pharmaceutical companies get rich.\n• COVID-19 vaccines carry the risk of injury and death for some so there must be informed consent and the right to refuse the vaccine without penalty. As of April 8th, there have already been 1,226,314 COVID-19 Vaccine adverse events and 26,976 COVID-19 Vaccine deaths reported in the U.S. to the Vaccine Adverse Events Reporting System. https://vaers.hhs.gov/data.html\n• There are no long-term studies on the safety, genotoxicity, carcinogenicity, or effect on reproduction of COVID-19 shots.\n• Natural immunity is superior to COVID-19 injections and there is no scientific rationale to vaccinate those individuals who have already recovered.\n• The Director of the CDC admits COVID-19 shots do not prevent transmission. For this reason alone, children and school employees should not be forced to submit to the injections. https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html#", "opengraph": {"locale": "en_US", "type": "article", "title": "Help Stop An Outlandish Covid-19 Vaccine Mandate Bill In Rhode Island", "description": "🖨️ Print post Rhode Island legislators are considering a bad bill that would impose fines and increase the taxes of those who refuse COVID-19 vaccines. People who do […]", "url": "https://www.westonaprice.org/help-stop-an-outlandish-covid-19-vaccine-mandate-bill-in-rhode-island/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2022-04-26T13:39:52+00:00", "article:modified_time": "2022-04-26T13:39:54+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://vote.sos.ri.gov/Home/PollingPlaces?ActiveFlag=3", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19", "http://ow.ly/OxTu50Da2zN", "https://vaers.hhs.gov/data.html", "https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html#", "https://www.theguardian.com/world/2021/oct/28/covid-vaccinated-likely-unjabbed-infect-cohabiters-study-suggests", "http://webserver.rilin.state.ri.us/BillText/BillText22/SenateText22/S2552.pdf", "https://www.bostonglobe.com/2022/04/20/metro/ri-bill-would-impose-fines-double-taxes-those-who-refuse-covid-19-vaccine/", "https://turnto10.com/politics/rhode-island-covid-19-coronavirus-vaccination-requirement-mandate-jonathon-acosta-tiara-mack-sam-bell", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2022-04-26T13:39:52+00:00"}