{"result_id": "339031", "URL": "https://www.westonaprice.org/health-topics/covid-injections-infertility/", "timestamp": "2023-04-25 18:11:20 CEST+0200", "meta": {"description": "The COVID-19 vaccine fertility fallout. Reports and scientific date of female and male fertility problems after taking COVID-19 injections.", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/health-topics/covid-injections-infertility/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Covid Injections: The Emerging Reproductive Fallout", "cleaned_text": "Widely shared posts on social media feature tens of thousands of testimonials from women around the world who claim Covid-19 injections have affected their reproductive health. These include reports of abnormal menstruation, mis­carriages, stillbirths, birth defects and concerns about infertility. Although in lesser numbers, men have also reported reproductive disorders, including erectile dysfunction, testicular pain, scrotal pain and haematospermia (blood in the semen). While this phenomenon clearly calls into question the safety of the experimental biologics, health officials have largely dismissed these desperate accounts, insisting that the nega­tive health ramifications being publicized are merely “anecdotal.”\n\nIn addition, despite mixed and inconsistent advice from doctors, governments and industry bodies, the World Health Organization (WHO) and the Centers for Disease Control and Preven­tion (CDC) recommend that pregnant women receive Covid-19 injections. WHO says that pregnant women should do so “when the ben­efits. . . outweigh the potential risks,”1,2 while the CDC more assertively states that “the benefits of receiving a COVID-19 vaccine outweigh any known or potential risks of vaccination during pregnancy.”3\n\nThe CDC recommendation that pregnant women get the Covid-19 injections is puzzling, considering the agency’s tacit admission that the potential risks of messenger RNA (mRNA) and other Covid-19 injections for pregnant women and fetuses are unknown—the injections were not studied in this cohort prior to their emer­gency use authorization (EUA) by the Food and Drug Administration (FDA).4,5 To be clear, not a single clinical trial conducted to win EUA for Covid-19 injections included expectant mothers, nor were the expedited trials designed to tell us whether the injections cause problems with menstruation, birth defects or fertility.\n\nPregnant women who receive the injections should know, therefore, that they are unwitting participants in the largest liability-free medical experiment in history. Because the injections have no long-term safety profile, the manu­facturers cannot guarantee that their biologics will not contribute to autoimmune disorders, neurodevelopmental disorders, inflammatory conditions, chronic pain syndromes or neurode­generative diseases in either recipients or their offspring. Health professionals recommending that pregnant women receive experimental Covid-19 injections are doing so in the absence of any human safety data, at best relying on minimal developmental and reproductive ani­mal data from the pharmaceutical companies. This begs the question: What has happened to the precautionary principle and to physicians’ oath to “first, do no harm?”\n\nLate last year, the UK government produced safety instructions for Covid-19 injections indicating that pregnant women and breastfeed­ing mothers and children should not use the experimental Covid-19 injections. A LifeSite News report published on December 4 quoted the guidelines, titled “Reg 174 Information for UK Healthcare Professionals,” as specifically stating in a section on “Fertility, Pregnancy and Lactation” that there were “no or limited [reproductive] data” on the Pfizer BNT162b2 injection.6 At the time, the news site reported, the guidelines indicated that “Animal reproduc­tive toxicity studies have not been completed,” “Covid-19 mRNA Vaccine BNT162b2 is not recommended during pregnancy” (or lactation) and, “It is unknown whether Covid-19 mRNA Vaccine BNT162b2 has an impact on fertility.” The safety instructions further specified, “For women of childbearing age, pregnancy should be excluded before vaccination.”\n\nIn the version of the UK guidelines avail­able online as of August 2021, all of this lan­guage has vanished,7 and England has joined the U.S. in recommending the injections to pregnant women, stating that the shots “have been shown. . . to have a good safety profile.”8 The “Reg 174” guidelines now merely state that “Animal studies do not indicate direct or indi­rect harmful [reproductive or developmental] effects”; the guidelines still admit, however, that it is “unknown” whether the chemicals in the experimental gene therapy injections are excreted in breast milk.7\n\nAs of August 16, 2021, the CDC website stated that nearly one hundred forty-nine thou­sand pregnant women enrolled in a smartphone-based monitoring system called “v-safe” had received a Covid-19 injection.9 V-safe uses text messaging and web surveys to check in with individuals after they have received one or more Covid shots and is supposed to function as a repository for reports of side effects.\n\nTo gather more detailed information about the reproductive impact of the injections, the CDC also established a “v-safe COVID-19 Vaccine Pregnancy Registry.” The registry is collecting voluntary information from a lim­ited number of women who received Covid-19 injections either in the periconception period (within thirty days before last menstrual period) or during pregnancy. Through periodic “check-ins,” the registry is intended to assess general health, pregnancy complications, pregnancy outcomes and newborn outcomes through three months of age. By August 16, just over five thousand pregnant women had enrolled in the registry.9\n\nManufacturer studies of pregnant women are also belatedly under­way, primarily focusing on short-term “safety and reactogenicity” or “safety and tolerability” of Covid-19 injections in women in their second or third trimesters of pregnancy. Pfizer began a clinical trial with seven hundred healthy pregnant women in February; scheduled to end in late 2022, the trial will consider adverse events reported through one month after the second dose, and serious adverse events only through six months after delivery.10\n\nModerna began conducting a trial in late July, with plans to enroll one thousand adult women who have received a Moderna vaccine either twenty-eight days prior to their last menstrual period or any time during pregnancy.11 Outcome measures include pregnancy complications “up to mid-third trimester,” preterm birth, stillbirth, “infants with suspected major and minor congenital malformations” (assessed up to one year of infant age) and maternal death, among others.\n\nJanssen/Johnson & Johnson (J&J) launched a clinical trial with four hundred women in their later stages of pregnancy in August 2021; the protocol states that the study will monitor “unsolicited adverse events” (defined as “any untoward medical occurrence”) for only twenty-eight days following each injection; “serious adverse events” and “adverse events of special interest” (such as blood clots) will be assessed at most for sixteen months.12\n\nWho oversees the “independent boards” called Data and Safety Monitoring Boards (DSMBs) that evaluate clinical trial findings? The members of DSMBs are selected in secret and meet in secret—and are notorious for their conflicts of interest.\n\nInvestigations by the Informed Consent Action Network (ICAN) uncovered the fact that the DSMB overseeing clinical trials by Astra­Zeneca, Moderna and Pfizer-BioNTech was created by Dr. Anthony Fauci’s National Institute of Allergy and Infectious Diseases (NIAID). Although members’ identities are supposed to remain secret, ICAN was able to identify two DSMB members.13 Both have blatant conflicts, having served as paid spokespersons for pharmaceuti­cal companies.\n\nNIAID’s DSMB chairman, Dr. Richard Whitley, has personally received payments of over two million dollars from the pharmaceuti­cal industry. Dr. Kathryn Edwards (member of the Pfizer DSMB) has received personal fees from Pfizer, Merck, GlaxoSmithKline, Sanofi and more. Edwards even gave a presentation to the CDC’s Advisory Committee on Immuniza­tion Practices (ACIP) titled, “Covid-19 Vaccine Safety Considerations.”14\n\nThese conflicts of interest go directly against the assurances proclaimed by Fauci and other public health officials that members of the DSMBs are “independent” of the pharmaceuti­cal industry. Ludicrously, Fauci told the public last September: “[P]eople need to understand that an independent body, the Data and Safety Monitoring Board, is beholden to no one, not to the president, not to the vaccine companies, not to the FDA. Not to me.”15\n\nIn a June 2021 webinar, the WHO stated, “Data from animal studies and post-introduction surveillance data have not shown harmful ef­fects in pregnancy.”16 However, the Vaccine Adverse Event Reporting System (VAERS) in the U.S. and other reporting systems in various countries demonstrate otherwise. As of August 20, 2021, over six hundred twenty-three thou­sand adverse events, including over thirteen thousand six hundred deaths, had been reported to VAERS post Covid-19 injection; excluding “foreign reports” filed in VAERS, the U.S. deaths numbered six thousand one hundred twenty-eight.17 Through July 2021, the Euro­pean Medicines Agency’s twenty-seven-country EudraVigilance database included reports of nearly two million injuries and well over twenty thousand deaths post-Covid-19 injection.18\n\nThese reports reveal disturbing indications of Covid-19 injection-related miscarriages, stillbirths and other reproductive problems. As of the August 20 VAERS data dump, over three thousand women had reported adverse events related to the injections, including nearly one thousand reports of miscarriage or premature birth.17 Additional complications reported to VAERS both early and late in pregnancy include premature delivery, fetal-maternal hemorrhag­ing, placental disorders, fetal cardiac disorders, birth defects and late-term fetal loss. Given that a government-commissioned Harvard Pilgrim Healthcare study found adverse events may be underreported by as much as 99 percent,19 the true number of post-injection problems experienced by pregnant women could be in the hundreds of thousands. The EudraVigilance reports through July likewise included over seven hundred “pregnancy, puerperium and perinatal conditions,” including twenty-four deaths, as well as over eight thousand “repro­ductive system and breast disorders,” including two deaths.18\n\nThe VAERS reports provide harrowing details of the adverse outcomes that have been occurring almost from the moment the injec­tions began rolling out in December 2020. Vi­sion Times summarized several reports in early March:20\n• In one VAERS report from late December, a thirty-eight-year-old Californian woman received the Pfizer-BioNTech injection when nearly six weeks pregnant. Four hours after the shot, she experienced lower abdominal cramping and vaginal bleeding that “steadily increased in severity” over the next twenty-four hours, which ulti­mately resulted in a miscarriage [VAERS ID 924247].21\n• A thirty-two-year-old woman from Virgin­ia, eight weeks pregnant, received a Moderna injection in mid-January after two differ­ent obstetrician-gynecologists advised her to get it. Two days later, she began to feel stomach cramping and had vaginal bleed­ing. She suffered a miscarriage five days after injection [VAERS ID 958501].22\n• In early February, another thirty-two-year-old woman from Nebraska had a positive home pregnancy test the same day she received the Moderna injection. Light vagi­nal bleeding and spotting began that night, followed by heavier bleeding two days later. She also experienced severe abdominal and back pain. Lab tests shortly after indicated that a miscarriage had occurred [VAERS ID 1045927].23\n\nAlso in February, a Wisconsin physician miscarried in the second trimester of pregnancy just days after enthusiastically tweeting, “14 weeks pregnant and fully vaccinated!” In her misguided tweet, the physician encouraged oth­ers to “do the same,” stating that she had chosen to receive the injections “to protect myself, my baby, my patients, and my community!”24\n\nOn June 17, 2021, the New England Journal of Medicine (NEJM) published a CDC study titled, “Preliminary Findings of mRNA Co­vid-19 Vaccine Safety in Pregnant Persons.”25 The authors examined data from more than thirty-five thousand pregnant women (Decem­ber 14, 2020 – February 28, 2021) from three databases: the general v-safe system, the v-safe Pregnancy Registry and VAERS.\n\nPresenting results specific to the eight hundred twenty-seven women enrolled in the v-safe Pregnancy Registry who had a “com­pleted pregnancy,” the authors reported that one hundred four women (12.6 percent) expe­rienced miscarriages (spontaneous abortion) at less than twenty weeks of pregnancy (that is, before the third trimester).25 However, it seems the authors deliberately sought to deceive the public by obfuscating numbers in their cal­culations. Specifically, they included in their twenty-week-or-earlier miscarriage denomina­tor women who should not have been included: seven hundred women who received their first dose of vaccine in the third trimester. Only one hundred twenty-seven received it during the first or second trimesters. A correct analysis of pregnancy loss at less than twenty weeks would have produced an astounding 82 percent miscarriage rate (104/127).26\n\nAmong the seven hundred twelve women who had a live birth, 9.4 percent experienced preterm birth and 3.2 percent had babies who were small size for gestational age. Nonetheless, the CDC authors concluded that their “pre­liminary findings did not show obvious safety signals among pregnant persons who received mRNA Covid-19 vaccines,” noting that ACIP and physician trade groups (the American College of Obstetricians and Gynecologists and the American Academy of Pediatrics) had each issued guidance stating that Covid-19 vaccines “should not be withheld” from pregnant women.25 Based on the retrospective study and trade group guid­ance, CDC Director Rochelle Walensky began actively recommending that all pregnant women get the injections, stating that “no safety con­cerns were observed” for women injected in the third trimester or their babies, with no mention made of the first and second trimester results or the almost one in ten women who had preterm births.27\n\nAnd what about the many pregnant women who have already had Covid-19 illness? Why are they being offered the “investigational vac­cines,” when the science shows that having had Covid-19, even mildly, produces long-lasting and possibly even lifelong immunity? According to Dr. Peter McCullough, an internist, cardiologist, epidemiologist and professor of medicine at Texas A&M College of Medicine, natural immu­nity is “far superior” to vaccine-induced immunity—“robust, complete, and durable.”28\n\nNone of the clinical trials for the EUA Covid-19 injections being distributed in the U.S. examined changes in menstruation as a potential adverse effect. And as of early August, the CDC did not list it as a po­tential side effect either.29\n\nOthers are paying attention, however, and given the volume of women reporting unusual menstrual cycle changes following Covid-19 injections, doctors have also begun to formulate hypotheses about pos­sible biological mechanisms. A hematologist at Loma Linda University School of Medicine, Akshat Jain, MD, reached out to reporters about the problem, stating: “Inflammatory reaction has been noticed with the COVID vaccine. We know that because many, including myself after the second vaccine, developed some mild flu-like symptoms. That inflam­mation can potentially modulate estrogen response, which could be the link between certain women having heavy periods after the vaccine.”30\n\nAnother plausible explanation, according to Dr. Victoria Male, a reproductive immunologist at the Imperial College of London, has to do with the chemical signals that circulate in the body post-injection, which have the potential to affect immune cells.31 Noting that the lining of the uterus is part of the immune system, Male stated that these chemi­cal signals could cause the womb lining to shed, leading to spotting or earlier periods. Choosing to ignore the true implications of the NEJM study, however, Male asserted that “extensive evidence from women who have had the jab” indicates they are “at no higher risk of pregnancy loss.”\n\nNot everyone is inclined to believe that the changes in menstruation can be so easily explained. A group of independent data analysts, doctors, lawyers, scientists and citizens—“in agreement that there is ‘something’ happening”—are collecting data from women experiencing menstrual irregularities (either post-injection or in uninjected women who have been exposed to others who received the jab) at the mycyclestory.com website.32 Their aims are to make sure women are heard, provide some answers and use their findings to demand further investigation. The researchers’ concerns were augmented when they began witnessing tens of thousands of stories erased from the Internet and when other studies failed to ask the right questions.33\n\nLong-Term Effects on Fertility After COVID-19 Injection: The Big Unknown\n\nPfizer’s former chief scientific officer and vice president of Allergy and Respiratory Research, Dr. Michael Yeadon, and German lung specialist Dr. Wolfgang Wodarg warned from the beginning that women might become infertile from Covid-19 injections, submitting an urgent petition to the European Medicines Agency in early December, 2020.34 In their peti­tion, the two doctors suggested that injections against coronavirus spike proteins could trigger an immune reaction in which antibodies could mistakenly attack human Syncitin-1 proteins in placental tissue because they are similar to SARS-CoV-2 spike proteins.\n\nIf such an autoimmune reaction were to occur, Yeadon and Wodarg argued it could result in several possible adverse outcomes: loss of pregnancy, birth defects and continued sterility. The doctors noted that pregnant and breastfeeding women were excluded from the clinical trials, and women of childbearing age were allowed to participate only if they were us­ing pharmaceutical contraception. They wrote: “This means that it could take a relatively long time before a noticeable number of cases of postvaccination infertility could be observed.”35 No animal studies to investigate the potential cross-reaction of Covid injection spike protein with Syncytin-1 have been conducted.\n\nOne thing we know for sure is that nano­meter-sized materials found in vaccines can pass through protective biological barriers. Specifically, nanoparticles can pass through the blood-testis, placental and epithelial barriers, which protect reproductive tissues. Nanoparticle accumulation damages reproductive organs by destroying Sertoli cells, Leydig cells and germ cells.36 (See my Summer 2021 article in Wise Traditions, “Tiny but Toxic: Nanoparticles in Vaccines,” for more information.)37\n\nWriting for The Highwire, journalist Jef­ferey Jaxen summarized alarming biodistribu­tion data from animal studies that Japan (unlike the U.S.) insisted on from Pfizer. The results have potentially serious implications for female fertility. The study, Jaxen wrote, “released to the public via a freedom of information act request from Japanese health authorities, shows that Pfizer’s vaccine ingredient, lipid nanoparticles called ALC-0315 and ALC-0159, which travel with the spike protein, began to accumulate in the ovaries as quickly as fifteen minutes after injection. Perhaps more concerning is that the nanoparticle accumulation showed a linear increase in the ovaries through the end of the study’s duration window of forty-eight hours.”38 In addition, the group Doctors for COVID Eth­ics has warned that “a high level expression of spike [protein] in the ovaries raises the prospect of significant damage to that organ, with pos­sible consequences for female fertility.”39\n\nRyan Cole, MD, one of the physicians who have banded together under the umbrella of America’s Frontline Doctors (AFLDS), is in a position as a pathologist to assess, via autopsy, whether the gene sequence given via investiga­tional Covid-19 injections stays in the deltoid muscle as we are told. Dr. Cole confirmed in a presentation for an AFLDS “White Coat Sum­mit” that it does not.40 Rather, pathologist au­topsies visibly show that spike proteins circulate in the blood and land in multiple organs in the body. In fact, Pfizer-BioNTech’s own data show widespread distribution of the mRNA and sub­sequent spike protein in the body within hours.41\n\nThis is a serious problem because we know that the spike protein alone induces the same diseases credited to the purported virus, including damage to the lungs, cardiovascular system and brain. Cole asks, “Why are we injecting something into the body that is the toxin?”42 Cole has been able to demonstrate through various tissue samples that the spike protein from Covid injections changes the cells’ mitochondria—imperative for good health, in­nate immunity and disease prevention—leaving them “blown apart” and “fragmented.”42 When the spike protein interacts with ACE2 receptors, it can disrupt mitochondrial signaling, inducing the production of reactive oxygen species and oxidative stress; if the damage is serious enough, uncontrolled cell death can occur.\n\nCole is clear about something else: Covid-19 injections are not “vaccines.”42 Many prominent doctors share this sentiment, stating that Co­vid-19 injections should not be called “vaccines” because they do not meet any of the criteria and standards by which a vaccine is supposed to work. As Dr. Joseph Mercola has summarized, one of the distinct features of the Covid shots is that “they’re not designed to block infection. They allow infection to occur and at best lessen the symptoms of that infection.”43\n\nClearly, we must consider the health rami­fications of giving these experimental biolog­ics to groups for whom the injections pose the greatest risks with no compensatory benefit, including children and young adults, pregnant women and those who have already recovered from Covid-19.\n\nAt an August 2021 roundtable, fourteen high-profile vaccine-risk-aware doctors shared different opinions about the injuries result­ing from Covid shots and the mechanisms of injury.44 Some in attendance, like Dr. Peter McCullough, are focusing on the short-term neurological, immunologic, hematologic and cardiac injuries. Others, like Dr. Vladimir Zelenko, who has treated thousands of Covid-19 patients, believe there is a “distinct possibility” that all who receive the injections will die from complications within two to three years, notably from blood clots and lung damage. Dr. Richard Fleming, a physicist, nuclear cardiologist and attorney, posits that the injections will lead to “an inflammable thrombotic process affecting every organ system and prion diseases that not only affect the brain, but also affect the heart and other vital organs in the body.” Cole, for his part, is concerned about the “post-vaccine immunodeficiency syndrome” he is observing in his practice, which has led to increases in herpes viruses and human papilloma viruses. He has also seen a ten- to twenty-fold increase of uterine cancer. All fourteen experts agreed there is enough evidence to halt the mass Covid-19 injection program.44\n\nOther Vaccines Given to Pregnant Women\n\nLessons learned from pharmaceutical fiascos such as DES and thalidomide (see sidebar) should have taught us that we need to exercise extreme caution when administering drugs to pregnant women—especially drugs that have not undergone proper regulatory testing. Such is the case with the influenza and Tdap (tetanus-diphtheria-acellular pertussis) vaccines recommended for use in preg­nancy. These vaccines have been aggressively promoted to pregnant women since 2006 and 2011, respectively.\n\nAmong other toxic ingredients, many flu shots contain organic mercury, and Tdap shots contain high levels of neurotoxic aluminum. Both vaccines also contain polysorbate 80, a chemical that has exhibited delayed toxicity to rat ovaries. Polysorbate 80 is also found in AstraZen­eca’s Covid-19 injections as well as in human papillomavirus (HPV) vaccines, which were previously recommended to pregnant women. HPV vaccines have been suspected of causing ovarian damage associated with autoimmune reactions. As with Covid-19 injections, HPV-vaccinated women have reported spontaneous abortion, amenorrhea and irregular menstruation following vaccination. Case reports also document prema­ture ovarian failure, premature menopause and infertility in recipients of the HPV injections, yet they are still recommended and in some cases are mandatory for all teens. (See my Fall 2018 article in Wise Traditions, “The Troubling Truth Behind HPV Vaccines: Prepare to Be Outraged.”)45\n\nAt the time when the CDC began recommending influenza and Tdap vaccines for pregnant women, no prelicensure studies of safety during pregnancy had been conducted, and to this day, each of these vaccines comes with very specific warnings. Influenza vaccines come with a pack­age insert that says the safety and effectiveness of the vaccines have not been established in pregnant women or nursing mothers,46 and online information for Boostrix states that “it is not known whether Tdap vac­cine will harm an unborn baby.”47 In the 2010-2012 flu seasons, women vaccinated with inactivated influenza vaccine had a 3.7-fold greater chance of experiencing a spontaneous abortion within twenty-eight days compared to women not receiving the vaccine.48\n\nTo illustrate just how dangerous these vaccines really are, it is worth mentioning that influenza-vaccine-related injuries and deaths are the most compensated claims for adults through the U.S. National Vaccine Injury Compensation Program (NVICP), and pertussis-vaccine-related injuries and deaths are the most compensated claims for infants and children. Of note, the 21st Century Cures Act, passed by Congress and signed into law in 2016, amended the National Childhood Vaccine Injury Act of 1986, giving vaccine manufacturers indemnity so they cannot be sued in civil court when there is evidence that a federally licensed vaccine recom­mended by the CDC for pregnant women injures or kills either women or infants injured in utero.49 (See my Summer 2018 Wise Traditions article, “Vaccines and Pregnancy.”)50\n\nVaccine manufacturers also have full indemnity against injuries or deaths resulting from EUA Covid-19 injections under the Public Readi­ness and Emergency Preparedness (PREP) Act passed in 2005.51 With the FDA’s August 23 decision to grant full approval to the Pfizer-BioNTech injection (under the brand name Comirnaty) and ACIP’s August 30 deci­sion to recommend the licensed vaccine for people sixteen years of age and older, debate is swirling about the liability implications.52,53\n\nThanks to a leaked confidential agreement between Pfizer-BioNTech and Albania, we also know that the vaccine manufacturer’s indemni­fication agreement ensures that other countries Pfizer sells to cannot hold the company respon­sible for damages under any circumstances. According to the agreements, the countries must acknowledge that “Pfizer’s efforts to develop and manufacture the Product” are “subject to significant risks and uncertainties.”54 And, as America’s Frontline Doctors has reported, treatment with drugs such as ivermectin has been suppressed in many areas “because the agreement that countries had with Pfizer does not allow them to escape their contract, which states that even if a drug will be found to treat COVID-19, the contract cannot be voided.”55\n\nWhat About COVID-19 Injection For Children?\n\nOne of the most important questions we should be asking is what will happen if we inject our children with the experimental biologics? In Israel, ninety-three doctors signed a joint letter of protest calling on the chiefs of the Ministry of Health, their fellow doctors and the general public to refrain from administering Covid-19 injections to children.56 The letter stated that “the increasingly prevalent opinion within the scientific community is that the vaccine cannot lead to herd immunity, therefore there is cur­rently no ‘altruistic’ justification for vaccinat­ing children to protect at-risk populations.” In addition: “We believe that not even a handful of children should be endangered through mass vaccination against a disease that is not danger­ous to them.” They also emphasized that “it cannot be ruled out that the vaccine will have long-term adverse effects that have not yet been discovered. . . including on growth, reproductive system or fertility.”\n\nWe have already seen devastating adverse reactions in our pediatric and young adult popu­lations following Covid injections, including escalating reports of myocarditis for which the long-term cardiac effects remain unknown. As of August 20, 2021, excluding “foreign reports,” four hundred forty-four adverse cardiac events in twelve- to seventeen-year-olds had been reported to VAERS, a subset of the over two thousand total adverse cardiac events reported.17\n\nPerhaps it is time to stop listening to the fear-mongering and unscientific narratives of “officials.” Since early 2020, the public has heard one lie after another, including the latest propaganda about the delta variant, being ad­vertised by the likes of Anthony Fauci as both more transmissible and more dangerous than the original virus.57 Fauci and others are now using the hysteria about variants to justify and urge booster shots—less than a year after the original injections first rolled out.58 Admitting to ineffec­tive shots and waning immunity,59 Israel began recommending a third booster shot for people over the age of sixty on August 1, expanding the booster program to those over age thirty a few weeks later.60 In the U.S., the FDA authorized a third dose of the Pfizer-BioNTech or Moderna Covid injections for people with compromised immune systems in mid-August,61 and the Biden administration now plans to offer a third dose to all by late September.62\n\nThe CDC and mainstream media report very high Covid vaccination rates in the U.S.—saying that roughly three in five adults (and more than four in five seniors) are fully vaccinated. This has led the unvaccinated to believe they are in the minority. But are they? In mid-May, the Kaiser Family Foundation re­ported on data gathered from two thousand four hundred fifteen counties—about 77 percent of all U.S. counties—and reported that an average of 28.5 percent of people living in primarily red counties were fully vaccinated, while 35 percent of people living in primarily blue counties were fully vaccinated.63 Pam Popper, president of Wellness Forum Health, points out that the aver­age of these two numbers is about 32 percent.64\n\nThis does not bode well for a federal gov­ernment that has purchased 1.41 billion injec­tions but distributed only four hundred fifty million doses, and only some of the distributed doses having been administered.65,66 The feds have committed to purchase another five hun­dred sixty-two million doses from Moderna, Pfizer and J&J by year’s end, as well as five hundred million for low- and middle-income countries.65 Moderna is forecasting almost two hundred billion dollars in revenue from Covid jabs this year,67 and Pfizer has raised its 2021 sales forecast to thirty-three billion dollars.68 As Popper notes, “This is an incredible gift to the vaccine makers, but hard to justify in view of so little demand.”64\n\nOne of the most egregious false narratives is the one that claims that the devastating eco­nomic and social disruptions of the past eighteen months are due to a virus rather than intentional and coordinated policies.69 Yet we know that Covid has a survival rate of over 99.98 percent for women of childbearing age and children, even without treatment. Under the guise of “pro­tecting public health,” “lockdowns” and other tyrannical policies have caused tens of millions to lose their jobs, with many falling into extreme poverty, and have produced trauma for children that will reverberate for years. Meanwhile, the unneeded “vaccines” cause widespread injuries and deaths.\n\nIf we were to “vaccinate” every pregnant woman during the first twenty weeks of preg­nancy, the NEJM study suggests that four out of five would experience a spontaneous abor­tion, and U.S. live births would plummet by 3.2 million over the next year alone.26 Recent reports show that fertility rates are already falling dramatically worldwide. In the U.S., birth rates have been falling continually since 2007. And while some people see decreases in global population as beneficial, others are is­suing warnings that the looming fertility crisis is a threat to human survival.70 Suffering what is known as a “baby bust,” many countries are seeing an insufficient number of children born to maintain their population size, which can mean challenging economic consequences.71 China, meanwhile, expanded its family plan­ning policy this year to allow couples to have three children.72\n\nIn a free society, the government has no business mandating vaccines or imposing penalties on those who choose not to take their drugs, yet that is what is happening. We are already seeing Covid-19 injection mandates for federal employees, the military, schools and private businesses. Cities like New York and San Francisco are creating two classes of citizens, requiring proof of vaccination to enter restaurants, bars, gyms, theaters and more. Re­cently the National Football League’s Raiders announced that fans would need to show proof of vaccination at home games or get jabbed at the entrance of the stadium. What if a pregnant woman wants to attend a football game? Worse yet, what if all pregnant women are mandated to receive the harmful injections? Parents should have the right to refuse vaccination for their chil­dren, including in utero, and adults should have the right to refuse vaccination for themselves. And every citizen, vaccinated or not, should be concerned about the human rights abuses, the encroachment on our civil liberties and the lack of informed consent we are witnessing.\n\nAround the world, tyrannical governments are using fear to maintain and aggregate power with unprecedented speed. Remember the word of Martin Niemöller: “First they came for me and I did not speak out because I was a socialist. Then they came for the trade unionists and I did not speak out because I was not a trade union­ist. Then they came for the Jews and I did not speak out because I was not a Jew. Then they came for me and there was no one left to speak for me.” People might want to think again if they believe censorship and restrictions are not going to affect them. The U.S. Department of Homeland Security has gone so far as to release a bulletin implying that those who question, re­sist or disobey government Covid-19 restrictions or question the origin of Covid-19 or vaccine effectiveness could be treated as a domestic terrorism threat.73 The global “pandemic” was never about public health. Everyone in America needs to stand strong and take to the streets in peaceful protest because if we do not, this land that we love and all the freedoms we enjoy will soon be gone.\n\nThe CDC states that pregnant women may be at greater risk than non-pregnant women for severe illness after SARS-CoV-2 infection, particularly if they have preexisting conditions such as diabetes, hypertension or obesity.74 Complications have been reported to include adverse pregnancy outcomes such as preeclampsia, preterm birth and cesarean delivery.75 In a CDC study that compared Covid-19-symptomatic pregnant and non-pregnant women, researchers reported similar frequencies of cough and shortness of breath, though pregnant women less frequently reported headache, muscle aches, fever, chills and diarrhea.74 The CDC authors found that pregnant women who had Covid-19 were roughly twice as likely to have comorbidities such as chronic lung disease, diabetes mellitus and cardiovascular disease compared to women who were not pregnant. The study could not determine, however, whether these chronic conditions had been present before pregnancy or were exclusively associated with the pregnancy. Although the authors reported that approximately one-third of pregnant women were hospitalized, compared with 5.6 percent of non-pregnant women, data were not available to differentiate between hospitalization for Covid-19-related illness versus for pregnancy-related reasons, in­cluding giving birth!\n\nIn addition to cycle irregularities, health care providers are witnessing an influx of female patients reporting enlarged lymph nodes (lymphadenopathy) in the armpit area after receiving Covid-19 injections, sometimes exhibiting as a lump the size of a golf ball.76 Yet once again, doctors are largely dismissing these reports, labeling the reactions a “normal” im­mune response by lymph nodes just “doing their job.”\n\nCalling the reaction “harmless,” Yale Medicine has sought to reassure the public by noting that swelling of the lymph nodes was a recognized side effect in the Pfizer and Moderna clinical trials.77 Whereas less than 1 percent of Pfizer- BioNTech trial participants reported lymph swelling after the first dose, 11.6 percent of Moderna’s participants did so after the first dose, and 16 percent after the second dose.78\n\nOne need not look too many decades into the past to see other instances of pharmaceutical companies inflicting harm on pregnant women and their offspring. For example, doctors prescribed a synthetic form of the female hormone estrogen, called diethylstilbestrol (DES), to pregnant women beginning in 1940 and continuing until 1971, even though as early as 1953, published research showed that the drug did not live up to its promise of preventing miscarriage, premature labor and other complications of pregnancy. An estimated five to ten million pregnant women and their children were exposed to DES in the U.S.79 Daughters of women who used DES while pregnant (“DES daughters”) have roughly a forty times greater risk of developing cancer of the cervix and vagina than women whose mothers did not take DES. They are also at greater risk of infertility, pregnancy complications and other forms of cancer. New research additionally shows that increased risks for cancer and birth defects even extend to the granddaughters and grandsons of women exposed to DES due to heritable changes in DNA.80\n\nThalidomide proved to be another horrific tragedy bestowed upon pregnant women and their babies. Doctors pre­scribed the drug widely in the 1950s and early 1960s as a treatment for nausea. The use of thalidomide was banned in most countries after it caused irreversible fetal damage, with thousands of children born with severe congenital malfor­mations. Many did not survive more than a few days. Those who did survive were forced to live with abnormalities such as bilateral limb atrophy, missing fingers, extra toes, hearing loss, vision loss and paralysis.81\n• Interim recommendations for use of the Pfizer-BioNTech COVID-19 vaccine, BNT162b2, under Emergency use Listing. World Health Organization, updated Jun. 15, 2021. https://www.who.int/publications/i/item/WHO-2019-nCoV-vaccines-SAGE_recommendation-BNT162b2-2021.1\n• The Moderna COVID-19 (mRNA-1273) vaccine: what you need to know. World Health Organization, updated Jun. 25, 2021. https://www.who.int/news-room/feature-stories/detail/the-moderna-covid-19-mrna-1273-vaccine-what-you-need-to-know\n• COVID-19 vaccines while pregnant or breastfeeding. Centers for Disease Control and Preven­tion, updated Aug. 11, 2021. https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommen­dations/pregnancy.html\n• Haelle T. Pfizer and Moderna vaccines safe for pregnant people, major study confirms. National Geographic, May 6, 2021.\n• Interim clinical considerations for use of COVID-19 vaccines currently authorized in the United States. Centers for Disease Control and Prevention, updated Aug. 13, 2021. https://www.cdc.gov/vaccines/covid-19/clinical-considerations/covid-19-vaccines-us.html\n• UK Department of Health and Social Care and Medicines & Healthcare Products Regulatory Agency. Reg 174 Information for UK Healthcare Professionals. https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1010381/Temporary_Authorisation_HCP_Information_BNT162_13_0_UK_Clean.pdf\n• COVID-19 vaccination: a guide for all women of childbearing age, pregnant or breastfeeding. Public Health England, updated Jul. 29, 2021. https://www.gov.uk/government/publications/covid-19-vaccination-women-of-childbearing-age-currently-pregnant-planning-a-pregnancy-or-breastfeeding/covid-19-vaccination-a-guide-for-women-of-childbearing-age-pregnant-planning-a-pregnancy-or-breastfeeding\n• BioNTech SE and Pfizer. Study to Evaluate the Safety, Tolerability, and Immunogenicity of SARS-CoV-2 RNA Vaccine Candidate (BNT162b2) Against COVID-19 in Healthy Pregnant Women 18 years of Age and Older. https://clinicaltrials.gov/ct2/show/NCT04754594\n• Rameswaram S. “It isn’t a question of politics”: Fauci on calling out Sen. Rand Paul’s misin­formation. Vox, Sep. 24, 2020.\n• Goodman T. Update on WHO Interim recommendations on COVID-19 vaccination of pregnant and lactating women. World Health Organization AFRO webinar, Jun. 2, 2021. https://cdn.who.int/media/docs/default-source/2021-dha-docs/update-on-who-interim-recommendations-on-c-19-vaccination-for-pregnant-and-lactating-women-70-.pdf?sfvrsn=2c1d9ac8_1&download=true\n• Redshaw M. COVID vaccine injury reports jump by 27,000 in one week, FDA pulls “bait and switch” with Pfizer vaccine approval. The Defender, Aug. 27, 2021. https://childrenshealthde­fense.org/defender/vaers-cdc-covid-vaccine-injury-reports-jump-27000-one-week/\n• Shilhavy B. 20,595 DEAD 1.9 million injured (50% SERIOUS) reported in European Union’s database of adverse drug reactions for COVID-19 shots. Health Impact News, Aug. 2, 2021. https://healthimpactnews.com/2021/20595-dead-1-9-million-injured-50-serious-report­ed-in-european-unions-database-of-adverse-drug-reactions-for-covid-19-shots/\n• Harvard Pilgrim Health Care, Inc. Electronic Support for Public Health—Vaccine Adverse Event Reporting System (ESP:VAERS). Rockville, MD: The Agency for Healthcare Research and Quality (AHRQ); 2010. https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf\n• Shimabukuro TT, Kim SY, Myers TR, et al. Preliminary findings of mRNA Covid-19 vaccine safety in pregnant persons. N Engl J Med. 2021;384:2273-2282.\n• Adams M. DEPOPULATION ALERT: Shocking new study reveals covid vaccine TERMI­NATES 4 out of 5 pregnancies via “spontaneous abortions.” Natural News, Jul. 1, 2021.\n• Don’t fear the delta variant, treat it. COVID Call to Humanity, Jul. 5, 2021. https://covidcall­tohumanity.org/2021/07/05/dont-fear-the-delta-variant-treat-it/\n• Centers for Disease Control and Prevention. Possible side effects after getting a COVID-19 vaccine. Updated Aug. 6, 2021. https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html\n• Larsen K. Reports of menstrual cycle changes after COVID vaccine highlight issues with clinical trials. ABC, Apr. 28, 2021.\n• Robinson O, Schraer R. Covid vaccine: period changes could be a short-term side effect. BBC, May 13, 2021.\n• McGovern C. Thousands of reports of menstrual irregularities, reproductive dysfunction fol­lowing COVID vaccines. LifeSite News, Apr. 19, 2021.\n• Wang R, Song B, Wu J, et al. Potential adverse effects of nanoparticles on the reproductive system. Int J Nanomedicine. 2018;13:8487-8506.\n• Jaxen J. The issues surrounding an experimental Covid shot during pregnancy? The Highwire, Jul. 26, 2021. https://thehighwire.com/editorial/the-issues-surrounding-an-experimental-covid-shot-during-pregnancy/\n• Palmer M, Bhakdi S, Hockertz S. Expert statement regarding Comirnaty—COVID-19-mRNA-vaccine for children. Doctors for COVID Ethics, Mar. 7, 2021. https://doctors4covidethics.org/expert-evidence-regarding-comirnaty-covid-19-mrna-vaccine-for-children/\n• A pathologist summary of what these jabs do to the brain and other organs. https://rumble.com/vkopys-a-pathologist-summary-of-what-these-jabs-do-to-the-brain-and-other-organs.html\n• Redshaw M. Vaccinated people may play key role in aiding evolution of more dangerous COVID variants, study says. The Defender, Aug. 2, 2021. https://childrenshealthdefense.org/defender/vaccinated-people-key-role-evolution-dangerous-covid-variants/\n• Nelson K. The troubling truth behind HPV vaccines: prepare to be outraged. Wise Traditions. 2018;19(3):90-95.\n• Donahue JG, Kieke BA, King JP, et al. Association of spontaneous abortion with receipt of inactivated influenza vaccine containing H1N1pdm09 in 2010-11 and 2011-12. Vaccine. 2017;35(40):5314-5322.\n• Kennedy Jr. RF, Nass M. 2 things mainstream media didn’t tell you about FDA’s approval of Pfizer vaccine. The Defender, Aug. 24, 2021. https://childrenshealthdefense.org/defender/mainstream-media-fda-approval-pfizer-vaccine/\n• Redshaw M. CDC endorses FDA approval of Pfizer COVID vaccine for 16 and older, amid ques­tions about missing data and which vaccine is actually approved. The Defender, Aug. 31, 2021. https://childrenshealthdefense.org/defender/cdc-endorses-fda-approval-pfizer-covid-vaccine-age-16-older-missing-data/\n• Sones M. Information security expert on revealed Pfizer agreements: “There’s good reason Pfizer fought to hide the details of these contracts.” America’s Frontline Doctors, Jul. 28, 2021. https://americasfrontlinedoctors.org/frontlinenews/information-security-expert-on-revealed-pfizer-agreements-theres-good-reason-pfizer-fought-to-hide-the-details-of-these-contracts/?fbclid=IwAR1w0M2i8zkj3vGZx9HYgwMqRcSlsLw3J-5julojKjQXPhI\n• Arutz Sheva staff. 93 Israeli doctors: Do not use Covid-19 vaccine on children. Arutz Sheva, Apr. 11, 2021.\n• Dr. Fauci on delta variant, booster shots and masks for the vaccinated. PBS, Jun. 29, 2021.\n• Lovelace Jr. B. Israel says Pfizer Covid vaccine is just 39% effective as delta spreads, but still prevents severe illness. CNBC, Jul. 23, 2021.\n• Andrews L. Israel expands booster Covid vaccine programme to over-30s to combat alarming fourth wave as data shows third doses dragged R rate below 1 in elderly groups in THREE WEEKS. Daily Mail, Aug. 24, 2021.\n• Redshaw M. FDA approves boosters for immunocom­promised, Pfizer and Moderna set to reap billions from sales of third shot. The Defender, Aug. 13, 2021. https://childrenshealthdefense.org/defender/fda-approves-boosters-immunocompromised-pfizer-moderna-reap-billions/\n• Weixel N. Risks rise as vaccination gap with Trump counties grows wider. The Hill, Jul. 6 2021.\n• Popper PA. An analysis you will want to read! The Forbid­den COVID-19 Chronicles, Aug. 9, 2021. https://wellnessforumhealth.com/wp-content/uploads/2021/08/Forbidden-Newsletter-Article-080921.pdf\n• Goldhill O. States are sitting on millions of surplus COVID-19 vaccine doses as expiration dates approach. STAT, Jul. 20, 2021.\n• Cimino A. 19 words from Moderna’s CEO that may guarantee billions in revenue for the long term. The Motley Fool, Jul. 11, 2021.\n• Children’s Health Defense. The Cassandras were right: the “cure” for COVID—a global takedown of the 99%—has proven far worse than the disease. The Defender, Sep. 2, 2021. https://childrenshealthdefense.org/defender/global-non-pharmaceutical-interventions-covid-human-economic-trade-offs/\n• Raines K. Fertility rates are dropping around the world. The Vaccine Reaction, May 31, 2021. https://thevaccinereaction.org/?s=fertility+rates+are+dropping+around+the+world\n• Cowen T. What does the world need? More humans. Bloom­berg, Mar. 28, 2021.\n• Mullen A. Three-child policy: how many children can you have in China? South China Morning Post, Jun. 5, 2021.\n• Ellington S, Strid P, Tong VT, et al. Characteristics of women of reproductive age with laboratory-confirmed SARS-CoV-2 infection by pregnancy status – United States, January 22– June 7, 2020. MMWR Morb Mortal Wkly Rep. 2020;69:769- 775.\n• Villar J, Ariff S, Gunier RB, et al. Maternal and neonatal mor­bidity and mortality among pregnant women with and without COVID-19 infection: the INTERCOVID multinational cohort study. JAMA Pediatr. 2021;175(8):1-10.\n• Pena L. Vaccine side effects: why women are mistaking swol­len lymph nodes for breast cancer. ABC, May 4, 2021.\n• Grady D. A Covid vaccine side effect, enlarged lymph nods, can be mistaken for cancer. The New York Times, Mar. 1, 2021.\n• Victims Association of Canada. What is thalidomide? https://thalidomide.ca/en/what-is-thalidomide/\n\nThis article appeared in Wise Traditions in Food, Farming and the Healing Arts, the quarterly journal of the Weston A. Price Foundation, Fall 2021", "opengraph": {"locale": "en_US", "type": "article", "title": "Covid Injections: The Emerging Reproductive Fallout", "description": "The COVID-19 vaccine fertility fallout. Reports and scientific date of female and male fertility problems after taking COVID-19 injections.", "url": "https://www.westonaprice.org/health-topics/covid-injections-infertility/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:modified_time": "2022-05-05T19:13:22+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/", "https://www.who.int/publications/i/item/WHO-2019-nCoV-vaccines-SAGE_recommendation-BNT162b2-2021.1", "https://www.who.int/news-room/feature-stories/detail/the-moderna-covid-19-mrna-1273-vaccine-what-you-need-to-know", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/recommen­dations/pregnancy.html", "https://www.cdc.gov/vaccines/covid-19/clinical-considerations/covid-19-vaccines-us.html", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1010381/Temporary_Authorisation_HCP_Information_BNT162_13_0_UK_Clean.pdf", "https://www.gov.uk/government/publications/covid-19-vaccination-women-of-childbearing-age-currently-pregnant-planning-a-pregnancy-or-breastfeeding/covid-19-vaccination-a-guide-for-women-of-childbearing-age-pregnant-planning-a-pregnancy-or-breastfeeding", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/safety/vsafepreg­nancyregistry.html", "https://clinicaltrials.gov/ct2/show/NCT04754594", "https://clinicaltrials.gov/ct2/show/NCT04958304", "https://clinicaltrials.gov/ct2/show/NCT04765384", "https://www.icandecide.org/wp-content/uploads/2020/10/Conflicted-Members-on-DSMBs-for-COVID-19-Vaccines-Final.pdf", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2020-07/COVID-03-Edwards-508.pdf", "https://cdn.who.int/media/docs/default-source/2021-dha-docs/update-on-who-interim-recommendations-on-c-19-vaccination-for-pregnant-and-lactating-women-70-.pdf?sfvrsn=2c1d9ac8_1&download=true", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injury-reports-jump-27000-one-week/", "https://healthimpactnews.com/2021/20595-dead-1-9-million-injured-50-serious-report­ed-in-european-unions-database-of-adverse-drug-reactions-for-covid-19-shots/", "https://digital.ahrq.gov/sites/default/files/docs/publication/r18hs017045-lazarus-final-report-2011.pdf", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=924247", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=958501", "https://medalerts.org/vaersdb/findfield.php?IDNUMBER=1045927", "https://www.whitehouse.gov/briefing-room/press-briefings/2021/04/23/press-briefing-by-white-house-covid-19-response-team-and-public-health-officials-31/", "https://covidcalltohumanity.org/2021/07/05/dont-fear-the-delta-variant-treat-it/", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/expect/after.html", "https://mycyclestory.com", "https://mycyclestory.com/home/questions/", "https://dryburgh.com/wp-content/uploads/2020/12/Wodarg_Yeadon_EMA_Petition_Pfizer_Trial_FINAL_01DEC2020_signed_with_Exhibits_geschwarzt.pdf", "https://thehighwire.com/editorial/the-issues-surrounding-an-experimental-covid-shot-during-pregnancy/", "https://doctors4covidethics.org/expert-evidence-regarding-comirnaty-covid-19-mrna-vaccine-for-children/", "https://www.bitchute.com/video/oBPGDbwWzPQy/", "https://rumble.com/vkopys-a-pathologist-summary-of-what-these-jabs-do-to-the-brain-and-other-organs.html", "https://childrenshealthdefense.org/defender/vaccinated-people-key-role-evolution-dangerous-covid-variants/", "https://www.globalresearch.ca/awareness-foundation-covid-19-round­table/5753088", "http://myfluvaccine.com/assets/downloads/pi-Flu%202015-16_AFLURIA_bioCSL.pdf", "https://www.drugs.com/boostrix.html", "https://www.fda.gov/regulatory-information/selected-amendments-fdc-act/21st-century-cures-act", "https://www.phe.gov/Preparedness/legal/prepact/Pages/default.aspx", "https://childrenshealthdefense.org/defender/mainstream-media-fda-approval-pfizer-vaccine/", "https://childrenshealthdefense.org/defender/cdc-endorses-fda-approval-pfizer-covid-vaccine-age-16-older-missing-data/", "https://childrenshealthdefense.org/defender/leaked-document-terms-pfizers-international-vaccine-agreements/", "https://americasfrontlinedoctors.org/frontlinenews/information-security-expert-on-revealed-pfizer-agreements-theres-good-reason-pfizer-fought-to-hide-the-details-of-these-contracts/?fbclid=IwAR1w0M2i8zkj3vGZx9HYgwMqRcSlsLw3J-5julojKjQXPhI", "https://childrenshealthdefense.org/defender/fda-approves-boosters-immunocompromised-pfizer-moderna-reap-billions/", "https://wellnessforumhealth.com/wp-content/uploads/2021/08/Forbidden-Newsletter-Article-080921.pdf", "https://covid.cdc.gov/covid-data-tracker/#vaccinations_vacc-total-admin-rate-total", "https://childrenshealthdefense.org/defender/global-non-pharmaceutical-interventions-covid-human-economic-trade-offs/", "https://thevaccinereaction.org/?s=fertility+rates+are+dropping+around+the+world", "https://www.greenmedinfo.com/blog/vaccine-hesitant-conspiracy-theorists-domestic-terrorism-threat-new-homeland-secu3", "https://www.cancer.gov/about-cancer/causes-prevention/risk/hormones/des-fact-sheet", "https://www.cancer.gov/about-cancer/causes-prevention/risk/hormones/des-fact-sheet", "https://thalidomide.ca/en/what-is-thalidomide/", "https://www.westonaprice.org/journal-fall-2021-covid-vaccine-shedding/", "javascript:window.print()"], "authors": [], "publish_date": "December 28, 2021"}