{"result_id": "339001", "URL": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-colorado-4/", "timestamp": "2023-04-25 18:10:48 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-colorado-4/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support A Good Vaccine Bill In Colorado!", "cleaned_text": "Colorado legislators have introduced a good bill that would protect minors (and parental rights) in regard to COVID-19 shots.\n\nHB 1029 is titled the “COVID-19 Vaccine Informed Consent for Minors Protection Act.”\n\nThis bill prohibits COVID-19 shots from being required for a minor in Colorado, a child from being administered a COVID-19 shot unless the parent or legal guardian provides informed consent, and public and private entities from discriminating against a minor based on whether the minor received a COVID-19 shot.\n\nIt also allows for an aggrieved person to file a civil action for any violations of their rights.\n\nHB 1029 is especially important given the pressure that is mounting to mandate COVID-19 injections for children, even though the shots are experimental, have now been proven to be ineffective, and carry a high rate of side effects.\n\nHB 1029 is being heard on February 7, 2023! We need you to tell Committee members to vote YES on this bill and help us get it moving.\n• Contact Members of the Health & Insurance Committee by February 7th and urge them to support SB 1029. Phone calls are more effective than emails; so please follow up with calls, especially if you are a constituent of any member. See Talking Points below and committee member contact details at the end.\n\nYou may copy/paste this block of email addresses for the committee:\n• Members of the public can participate in the hearing by submitting written testimony; testifying before a committee remotely or in person; listening to committee proceedings, and watching floor proceedings over the internet. For steps to do so, go to\n\nhttps://www2.leg.state.co.us/CLICS/CLICS2023A/commsumm.nsf/signIn.xsp\n\nListen to live and archived legislative proceedings and watch floor sessions here: http://leg.colorado.gov/watch-listen.\n• Contact your State Representative and urge him or her to SUPPORT H.B. 1029. You can look up who represents you at: https://leg.colorado.gov/find-my-legislator.\n\nCalls are more effective than emails and only take a few minutes. Below is a sample script, and there are additional talking points after the second action item. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“My name is ____, and I live in (town). I am calling to ask Representative ____ to support H.B. 1029, which would protect minors from mandatory COVID shots and discrimination.\n\nThis bill also protects parental rights by requiring informed consent from parents prior to a child being administered a COVID-19 shot. As recognized by the U.S. Supreme Court, vaccines are pharmaceutical products that carry the risk of injury or death. It is irresponsible to allow children to make medical decisions that may injure or kill them without the knowledge of their parents.\n\nThere have been no long-term studies on the safety of these shots. People should not be forced to be injected with an experimental substance that could cause serious side effects. As of 1/20/23, there have been 2,412,411 injuries and 33,775 deaths reported in connection with the Covid shots to the CDC’s Vaccine Adverse Events Reporting System (VAERS) — and it is estimated that only 1-10 percent of adverse reactions are ever reported. And yet the manufacturers are shielded from liability for any harm they cause.\n\nVaccine mandates are being justified by the idea of the “greater good” and protecting other people. But no individual, especially not children, should be forced to take a medical treatment for someone else’s benefit.\n\nMany individuals have already suffered bad reactions with the first dose or have already recovered from the disease and thus have natural immunity.\n\nI urge Representative _____to SUPPORT HB 1029, which would protect minors’ rights to bodily autonomy and parents’ rights to informed consent.”\n\nKeep your call or email short! Pick the 2 or 3 of these talking points – or none of them — that are most important to you, and be sure to explain why this issue matters to you personally.\n• A child may not know their personal or family medical history, including vaccine reactions, allergies, and autoimmune or neurological disorders, all of which contribute to the chances that they may have a serious reaction to a vaccine.\n• Children do not have the same kind of critical thinking skills or emotional maturity to make a vaccine benefit-risk decision as adults. Additionally, children and adolescents are vulnerable to authority-figure persuasion.\n• If a child consents to vaccination without their parent knowing and has a reaction, the parent may not recognize the reason for their child’s decline in health, and this lack of knowledge could be life-threatening for the child.\n• According to the Centers for Disease Control and Prevention (CDC), the “infection fatality rate” (IFR) from Covid for children and adolescents is 0.0009 percent. [see Table 2, for Feb 2020-Sep 2021: 0.9 deaths by 100,000 for age 0-17 at https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/burden.html#est-infections]\n• In April 2022, the CDC estimated that about 75 percent of America’s children and adolescents had already had Covid. https://www.cdc.gov/mmwr/volumes/71/wr/mm7117e3.htm\n• No one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• Young adults and teens (especially males) vaccinated against Covid have been shown to have a higher risk for myocarditis (heart inflammation) than other populations. There has not been enough time to see what the risks of myocarditis and other potentially serious side effects of the vaccine are for younger children.\n• In Thailand, 29 percent of young recipients of Pfizer’s Covid shots experienced heart problems in a study involving several hundred adolescents (aged thirteen to eighteen.) [Mansanguan S, Charunwatthana P, Piyaphanee W, et al. Cardiovascular effects of the BNT162b2 mRNA COVID-19 vaccine in adolescents. Trop Med Infect Dis. 2022;7(8):196. – https://pubmed.ncbi.nlm.nih.gov/36006288/]\n• Data from 145 of the most vaccinated countries show that Covid shots are associated with a 31 percent increase in deaths.\n• The mRNA Covid shots include polyethylene glycol (PEG), an immunogenic chemical compound associated with severe allergic reactions that can lead to death.\n• Some Covid shot batches have been found to contain metallic particles, and all mRNA shots contain dangerous lipid nanoparticles, which can create a series of toxic reactions, including damage to DNA.\n• Manufacturers originally claimed their Covid shots were 95 percent effective. The Director of the CDC now admits Covid shots do not prevent Covid. For this reason alone, children should not be forced to submit to the injections. https://edition.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/h_d2accec79fdc37f422d02c536828ea1e\n• Covid shot manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 vaccines is the Countermeasures Injury Compensation Program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medical expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000, and there is no judicial appeal. In other words, the victims will be severely under-compensated while the pharmaceutical companies get rich. https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx\n• There have already been 2,412,411 COVID-19 Vaccine adverse events and 33,775 COVID-19 vaccine deaths reported in the U.S. to the Vaccine Adverse Events Reporting System (per data released 1/20/23).\n• There are no long-term studies on the safety, genotoxicity, carcinogenicity, or effect on the reproduction of COVID-19 shots.\n• COVID injections were not properly tested and are dangerous, as confirmed by Pfizer’s own documents.\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations.\n\nRead these articles for more information on the dangers of Covid shots:\n\nYou can find the Committee Members’ info online at https://leg.colorado.gov/committees/health-insurance/2023-regular-session", "opengraph": {"locale": "en_US", "type": "article", "title": "Support A Good Vaccine Bill In Colorado!", "description": "🖨️ Print post Colorado legislators have introduced a good bill that would protect minors (and parental rights) in regard to COVID-19 shots. HB 1029 is titled the “COVID-19 […]", "url": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-colorado-4/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-02-03T21:50:20+00:00", "article:modified_time": "2023-02-06T20:33:14+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://leg.colorado.gov/committees/health-insurance/2023-regular-session", "mailto:brianna.titone.house@coleg.gov", "https://www2.leg.state.co.us/CLICS/CLICS2023A/commsumm.nsf/signIn.xsp", "https://leg.colorado.gov/find-my-legislator", "https://www.cdc.gov/coronavirus/2019-ncov/cases-updates/burden.html", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7117e3.htm", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-11-2-3/04-COVID-Oster-508.pdf", "https://pubmed.ncbi.nlm.nih.gov/36006288/", "https://edition.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/h_d2accec79fdc37f422d02c536828ea1e", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://www.medalerts.org/vaersdb/index.php", "https://www.medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5B%5D=COVID19&DIED=Yes", "https://leg.colorado.gov/bills/hb23-1029", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/", "https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-02-03T21:50:20+00:00"}