{"result_id": "339047", "URL": "https://www.westonaprice.org/health-topics/vaccinations/why-we-need-to-reexamine-the-riskbenefit-tradeoffs-of-vaccines/", "timestamp": "2023-04-25 18:11:37 CEST+0200", "meta": {"description": "Stephanie Seneff looks at rising rates of autism", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/health-topics/vaccinations/why-we-need-to-reexamine-the-riskbenefit-tradeoffs-of-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Why We Need to Reexamine the Risk/Benefit Tradeoffs of Vaccines", "cleaned_text": "The recent media blitz on the measles outbreak in Disneyland has caused even greater polarization than that which previously existed between pro-vaccine and anti-vaccine camps. State governments have jumped on the notion that measles remains a threat, taking this opportunity to pass even more stringent laws restricting parents’ rights to refuse vaccination for their children. Pro-vaccine enthusiasts are delighted that clamping down on the right to refuse vaccines will push the percentage vaccinated up towards 100 percent.\n\nBut parents who are legitimately concerned over possible harm from the adverse reactions to vaccines now feel threatened that “medical tyranny” will force them to stand by helplessly as they watch their child get injected with the toxic chemical soup that’s contained in most vaccines. Both sides feel outrage for the same reason: concern that their children will suffer consequences if their belief system is not upheld.\n\nIt is very difficult to weigh the pros and cons of any given vaccine properly, or even on the vaccination concept in general. The public forum promoted by the government downplays the risks and exaggerates the benefits. In the case of measles, we have become programmed to fear a disease that is usually very mild and almost never fatal. I remember well the measles outbreak in my community when I was a child in the 1950s. We were encouraged to be sure to catch it in this wave, as the opportunity might not come again until we were adults. We understood that it was best to get measles in childhood and that this would afford lasting protection from a future infection.\n\nDespite all the hoopla surrounding the Disneyland outbreak, there have been no fatalities. In fact, the Centers for Disease Control (CDC) records no fatalities at all in measles cases in the U.S. over the past ten years. Over that same time period, the CDC’s Vaccine Adverse Event Reporting System (VAERS) database has reported over one hundred fatalities linked to the measles, mumps, and rubella (MMR) vaccine. Since VAERS adverse reactions are grossly under-reported,1 the actual number is probably much larger.\n\nIt is ironic that health officials express such concern about the non-vaccinated spreading disease to the vaccinated population. Presumably, if you’re vaccinated you have protection, so why should you worry? What’s even more ironic is that the vaccine itself can be contagious. For example a one-year-old baby was vaccinated with varicella and his pregnant mother developed a varicella infection sixteen days later, verified as the vaccine strain.2 She elected to abort the pregnancy as a consequence.\n\nWhile immunity following a measles infection is permanent, vaccination-based immunity wears off over time, leaving an unknown percentage of the vaccinated population now susceptible to exposure. As a consequence, we now face a difficult situation with respect to measles, because most of the children and young adults in this country are now vaccinated against it, and almost none of them have the lifetime protection afforded by a measles infection. Most at risk are the infants under six months old, born to mothers whose vaccine-based immunity has worn off. In nature’s clever design, newborn infants receive in their mother’s milk antibodies to diseases to which the mother has acquired immunity, and this affords protection against the disease during the critical neonatal period, when infants’ own immature immune systems leave them more vulnerable. The solution offered by the medical community—to vaccinate pregnant women with MMR—poses a direct threat to the fetus due to the toxic chemicals in the vaccine, which may cause harm to the developing fetal brain.\n\nI am especially concerned about the glutamate—glutamate makes up 10 percent of the amino acid content of the gelatin on which the virus is grown. Glutamate is a well-established neurotoxin, contained in only a few vaccines, one of which is MMR. Another vaccine that contains glutamate is the flu vaccine, now administered much more widely than was the case just a few years ago, including to pregnant women, and based on the same argument of protection for the newborn. Half the doses of flu vaccine also contain mercury, arguably the most toxic metal on earth.\n\nWhen most people think of potential harm from vaccines, they think of mercury, as this has been the most widely publicized toxicant contained in vaccines. The issue of mercury in vaccines has allegedly been put to rest, following a reduction in mercury burden around the year 2000, but that did not lead to a reduction in the incidence of autism. However, that experiment was flawed because other factors, particularly a simultaneous increase in the aluminum content in vaccines, but also an increase in toxic exposure from food (more about that later) likely were offsetting factors. Dialysis dementia establishes beyond a shadow of a doubt that aluminum is toxic to the brain. Patients with kidney failure develop dementia if there is too much aluminum present in the dialysate.\n\nIt is disturbing to me that we are now (in my opinion, recklessly) administering the flu vaccine to infants and pregnant women without regard to the fact that about half of the flu vaccines administered contain mercury as a preservative. As mentioned previously, the flu vaccine also contains glutamate, a known neurotoxin.\n\nPotential links between MMR and autism are probably the second-most common general perception about vaccine risk. Many people are aware of the “discredited” Lancet paper published by Dr. Andrew Wakefield in 1998,3 which proposed a link between the measles component of MMR and gut disease in children with autism. This paper engendered an intense investigation, which led to its retraction and a campaign to discredit its author through accusations of fraud. Wakefield is a gastroenterologist, and therefore an expert on children with gastrointestinal disorders. Today it has become very clear that gut dysbiosis is strongly linked to autism, and, furthermore, that gut dysbiosis is rapidly becoming an epidemic.\n\nThat Wakefield was aware of the link between autism and gut problems such a long time ago is stunning, and what frustrates me is the fact that the retraction of his paper has led to a long delay in our awareness of this link, which would have helped us to recognize better how to treat or prevent autism. Despite his setback, Wakefield published a follow-on article providing a strong argument for how gut dysbiosis can lead to encephalopathy linked to autism through the release of excitatory peptides through the leaky gut barrier.4 I have personally investigated potential links between autism and MMR, which resulted in a paper published in 2012, based on an analysis of the VAERS database.5 At the time, I was frustrated because I did not understand which ingredients in the MMR vaccine might be toxic to the child’s brain, but I believe I now understand this much better, as will become clear later in this article.\n\nAlthough it might seem a simple matter to compare a vaccinated population with an unvaccinated one to see whether there are differences in the incidence of various health issues, this is difficult to do in practice, because those who choose not to vaccinate are different from the general population in important ways. For example, parents often arrive at this decision after one of their children has suffered from a severe adverse reaction to a vaccine. This likely means that the family’s genetic make-up predisposes them to increased risk to the very conditions that vaccines are linked to. On the other hand, those who choose not to vaccinate are probably also more likely to avoid other environmental chemicals, for example, to provide their children with an organic diet. This may bias the distribution towards a perceived risk from vaccines that is actually due to chemicals in foods treated with pesticides or contaminated with food additives.\n\nI believe that one of the best ways to examine risk is to look at large population studies. A unique opportunity to study correlations with vaccination and autoimmune disease was the “wave” of vaccination of twenty million French individuals, across multiple ages, with hepatitis B (Hep-B) vaccine, concentrated over the four-year period from 1994 to 1997.6 This wave was followed by an “echo” about two years later of an “epidemic” in multiple sclerosis; that is, the two curves match remarkably well with a delay of two years (see Figure 1). Hep-B contains aluminum adjuvant, which could be a causative factor in the development of MS, although molecular mimicry between proteins in the virus and components of myelin are another possibility. In fact, it could be that aluminum bound to the antigen increases its allergenicity, leading to a synergistic effect.\n\nAnother excellent example of an epidemiological study is the recent paper by Deisher and others,7 which examined changes over time in vaccination policy and compared them to changes in autism rates across multiple countries. They were able to show a consistent trend over multiple vaccines whereby a large increase in the vaccinated population for a specific vaccine was followed directly by an increase in the slope of the autism curve. They noted that every one of the implicated vaccines contained live cultures grown on human fetal tissue. They conjectured that human DNA or retrovirus were the critical factors in the vaccine causing harm.\n\nIt should be noted that while our bodies contain huge amounts of our own DNA, it is normally housed inside the nucleus of our cells, and when cells die they normally undergo a programmed death procedure called apoptosis that involves breaking down the DNA so that it will not be released into the tissues. If a cell is acutely exposed to a toxic chemical that rapidly destroys its membrane, it may react so quickly that it is unable to undergo apoptosis. As a result, its DNA spills into the environment, and immune cells interpret this as a cue to go on high alert.\n\nThis may well be the reason that aluminum adjuvant works in vaccines to enhance the immune reaction to aluminum-containing vaccines. Vaccine manufacturers believe that aluminum adjuvant is beneficial because it reduces the amount of antigen needed to get the vaccine to produce the desired immune response. It may well be, therefore, that the DNA contained in the vaccines produced by growing the infective agent on human fetal tissue also induces a similar acute response of the immune system, due to a false interpretation of the human DNA as coming from an acutely poisoned cell. The problem in both cases (aluminum or fetal tissues) is that DNA exposure to immune cells can lead to autoimmune disease.\n\nIt is quite possible, however, that other ingredients besides the human DNA are at play in the correlations with autism observed by Deisher and others.8 While they found an effect for several different vaccines, every one of them contained either aluminum— Havrix (hepatis A) and Pentacel (diphtheria, tetanus, pertussis, poliomyelitis, and influenza B) or glutamate (Varivax, MMR and Meruvax rubella)— present either as free glutamate or a component of gelatin or both. We have already seen how aluminum might cause harm by exposing immune cells to human DNA from cells at the site of injection, fatally damaged by aluminum, but aluminum is also a well-established neurotoxin, on par with mercury.8,9 Studies on premature infants exposed to aluminum through intravenous feeding have clearly shown a link between the small amounts of aluminum in the nutrient solution and neurological damage.10\n\nGlutamate in vaccines is less well studied, even though glutamate is a known excitatory neurotoxin that’s linked to autism11 and multiple other neurological diseases.12,13 In the next section, I will explain my hypothesis that vaccines are becoming more and more toxic over time due to their synergy with glyphosate, the active ingredient in the most pervasive herbicide, Roundup.\n\nIn 2012, I published a paper together with collaborators titled, “Empirical Data Confirm Autism Symptoms Related to Aluminum and Acetaminophen Exposure.”14 This paper was based on a detailed analysis of the VAERS database, and we specifically looked at frequencies of various adverse reactions to subsets of the database, restricted either to different time intervals or to different subsets of the vaccines. We were interested in both aluminum-containing vaccines and the MMR vaccine (due to its plausible link to autism identified by Andrew Wakefield).\n\nWhat we discovered was very surprising: the aluminum-containing vaccines appeared to be much more toxic after the turn of the century compared to before the turn of the century. Table 1 is reproduced from that paper, where we enumerated several symptoms that were far more likely to occur in association with an aluminum-containing vaccine, but also far more likely to occur after 2000 compared to before 2000, when all the vaccines were included in the analyzed sets!\n\nWe wrote in the paper’s abstract: “A strong correlation between autism and the MMR (measles, mumps, rubella) vaccine is also observed, which may be partially explained via an increased sensitivity to acetaminophen [Tylenol] administered to control fever.” We were frankly at a loss to explain how MMR could cause autism, because it does not contain either aluminum or mercury, two well-established neurotoxic metals. Our theory, which others had suggested as well,15 was that the autistic children were especially sensitive to acetaminophen, which is often administered to control fever following vaccination. MMR was significantly more often associated with fever than all the other vaccines serving as a control.\n\nToday I recognize two additional factors that more fully explain both the acetaminophen connection and the MMR connection to autism. Acetaminophen is metabolized in the liver by cytochrome P450 (CYP) enzymes, and glyphosate— the active ingredient in the herbicide Round-Up— suppresses CYP enzyme activity in the liver. What this means is that glyphosate is synergistically toxic with acetaminophen because it interferes with its breakdown. And, glyphosate usage on corn and soy crops increased dramatically following 2000, due to the widespread adoption of the new “Roundup Ready” genetically modified versions of these crops.\n\nAnother factor associated with MMR that we completely overlooked in the paper is glutamate. Glutamate is a known neurotoxin, but the body is normally able to convert it to glutamine, using the enzyme glutamine synthase. However, glutamine synthase depends on manganese, which is chelated by glyphosate, making it unavailable. MMR contains glutamate, as it represents 10 percent of the amino acids found in gelatin, which is used as a nutrient on which the live virus is grown. More recently, I published another paper together with Anthony Samsel describing all the ways in which manganese chelation by glyphosate would disrupt physiology,16 and a surprising number of these were linked to known pathologies in autism.\n\nI think it likely that glyphosate is making the glutamate in vaccines more toxic than it would otherwise be, due to the fact that it sticks around much longer when manganese is unavailable. In fact, if you separate the VAERS database at the midpoint in time (2002), and look at the reactions associated with MMR before and after that date, you find several reactions that are more common after 2002 (including autism), and only one reaction (joint pain) that is more common before 2002 (see Table 2). Interestingly, both joint pain and many of the reactions that are more common after 2002 (such as anaphylactic shock, seizures, hives, eczema, and shortness of breath), are also typical adverse reactions that occur in people who have an allergy to monosodium glutamate (MSG).\n\nIn the conclusion of the paper on aluminum and acetaminophen, we wrote: “The fact that mentions of autism rose steadily concomitant with significant increases in the aluminum burden in vaccines is highly suggestive. However, it is possible that other factors, such as more aggressive reporting or simultaneous increases in other environmental toxins, for examples herbicides or pesticides, or aluminum in other products such as antiperspirants and antacids, may have contributed to these observed increases.” This was prescient, as I now believe that indeed there is one herbicide in particular that has caused the aluminum in vaccines to be much more toxic than it used to be, and that is glyphosate. In fact, I have published two papers, together with colleagues, in which we propose that glyphosate enhances the toxicity of aluminum, through multiple mechanisms.17,18\n\nGlyphosate makes both the gut barrier and the brain barrier leaky, which allows aluminum to get past these barriers and into the brain. Disruption of the pineal gland in the brain stem can explain the increased incidence of sleep disturbances in association with aluminum-containing vaccines and with vaccines administered after 2000. Glyphosate also causes pathogens to overgrow in the gut, and one of the toxic products of these pathogens enhances uptake of aluminum by cells. We even suspect that glyphosate binds to the aluminum in the vaccines and “escorts” it to the terminal watershed region of the brain stem, where it then unloads its cargo in the acidic environment, essentially delivering aluminum to the brain. Glyphosate also enhances voltage-gated calcium channels, and aluminum can gain entry through these channels by acting as a calcium mimetic.\n\nVACCINES JUST ALTER WHICH VIRUS YOU GET\n\nIt is becoming increasingly clear to me that the vaccination program as a whole is only succeeding in altering which infections we get; it is not actually protecting us from infectious disease in general. This is most glaringly apparent for the flu vaccine. We are told that this year’s vaccine is not very effective because we “guessed wrong” when we made the decision about which strains to include in the vaccine. A mid-season evaluation of the effectiveness of this year’s flu vaccine in the UK came up with a dismal performance of just 3.4 percent effectiveness.19 These authors wrote: “The current season has led to large numbers of care home outbreaks, often in highly vaccinated populations, hospitalizations and significant excess all-cause mortality in the over sixty-five-year-old population.”\n\nMy prediction is that we will continue to “guess wrong” every year, because the vaccine itself is actually influencing which strains thrive. When the vaccination coverage is very high, the strains that are targeted are effectively wiped out, and this provides an opportunity for other strains to fill the vacuum.\n\nThis pattern is unfolding across multiple vaccine series. The original Hib vaccine targeted just Haemophilus influenzae type b. The result was that types a, e, and f gained prominence. So a new pneumococcal vaccine (Prevnar 7) was introduced to cover seven strains. A few years later, this was replaced by “Prevnar 13.” They are playing a similar game with Gardasil: the original Gardasil vaccine covered four major strains of HPV. But it’s been found that women who are vaccinated against these four have a higher risk of being infected with some other strain not covered by the vaccine. The answer, it seems, is to add more strains to the mix. “Gardasil-9” is about to appear, covering nine strains of HPV and with twice as much aluminum content. The original Gardasil vaccine already had a high level of a very toxic form of aluminum. There are more than eighty different strains of HPV, so this is not a scalable solution.\n\nThus, we can never win this game. In fact, a placebo controlled study in Hong Kong found that those who were vaccinated against the flu had no statistically significant improvement in flu infection rates, but had a 4.4-fold increase in infection with syncytial virus, a strain that produces symptoms nearly indistinguishable from influenza.20 People who get the flu vaccine every year are reducing their general immune health with each vaccine, due in part to the accumulation in their tissues of mercury and glutamate. Very soon it will become clear to everybody that the flu vaccine has no benefit, and I think it is likely contributing to the epidemic we’re seeing in Alzheimer’s disease in the elderly, because of the toxic effects of glutamate and mercury on the brain.\n\nStreptococcus pneumoniae lives naturally in the nasopharynx of healthy individuals, causing no harm. A vaccine against this microbe will cause it to disappear from the respiratory tract, nasopharynx and sinuses, with unknown consequences. Certainly this leaves room for other species to take hold, and one can only guess what those species might be. So by vaccinating against one microbe, you are opening the door for other microbes to invade. This is true more generally, and it might explain why we are seeing a number of strange new pathogens emerging, or old pathogens becoming much more virulent in recent years, such as SARS (bird flu), H1N1 (swine flu), Lyme disease, Ebola, Epstein Barr, hepatitis C, and AIDS.\n\nThere is much about viruses that we simply do not understand. Viruses are fascinating life forms, and recent evidence suggests that they are the main source of new DNA sequences that drive our own evolution.21 I conjecture that they play an essential role in driving adaptation to environmental stress factors.\n\nMy studies on the flu virus have revealed that these tiny creatures infect muscle cells in order to raid them of sulfate. The viruses reprogram the infected cell to build a sulfated mucopolysaccharide coat to decorate the exterior of each newly minted virus particle.22 The freshly minted viruses are released into the blood stream, and are later devoured by a roaming immune cell, such as a macrophage. The macrophage then kills and digests the virus, thus essentially accepting delivery of the mucopolysaccharides from the muscle cell, packaged up on the back of the virus. The sulfate in the mucopolysaccharides can then be used by the macrophage to solve its deficiency problem.\n\nMy research has identified systemic sulfate deficiency as a key component of most diseases that are on the rise today. The immune system is especially vulnerable to insufficient sulfate. Macrophages depend upon sulfate to maintain the acidic environment in the lysosomes that is needed to digest and recycle cellular debris. Insufficient sulfate will impair both their ability to kill viruses and metabolize their contents, and their ability to clear debris from dead and dying human cells.\n\nThus, when the immune cells have insufficient sulfate, the flu viruses flourish, invade the muscles, and redistribute sulfate from the muscles to the immune cells. Other viruses infect different tissues and steal sulfate from them. This reinvigorates the immune system at the expense of the cells under attack. Once the immune cells acquire sufficient sulfate to clear the virus, the person recovers from the disease. People with a plentiful supply of sulfate to begin with never get the flu, because the virus particles are easily kept in check by the healthy macrophages.\n\nMeasles probably serves a similar purpose. Few people realize that multiple studies have shown that an infection with the measles virus can produce beneficial results. Children who have had the measles have fewer allergic diseases.23,24 Intractable epileptic seizures have been known to disappear following a virus infection, including measles, mumps and rotavirus.25 Juvenile rheumatoid arthritis has been brought into remission by infection with measles.26 Psoriasis has been cured by measles infection.27\n\nMost remarkably, cases of substantial shrinkage of tumors (infantile Hodgkin’s disease) have been recorded following a measles infection.28 A seminal study on mice showed that injection of live (but not killed) measles virus directly into a tumor led to a mobilization of neutrophils to the tumor site, where they released cytotoxic chemicals that resulted in tumor shrinkage.29 This to me is clear evidence that measles strengthens the immune system.\n\nScientists have known since at least the early 1990s that the virus responsible for Newcastle disease also shows promise in cancer therapy.30,31 Ironically, if the person’s immune system is efficient in attacking the virus, then it will not work well for cancer therapy. Thus, a massive vaccination program would pretty much preclude the possibility of using a particular virus strain as treatment. Neuroblastoma is one of the most common cancers in childhood and it has a poor prognosis. One experimental treatment that is being explored at the State University of New York at Stony Brook is to use polio virus to treat this cancer.32\n\nResearchers at Duke University are having some preliminary success in using polio virus infection to treat glioblastoma, the most common and most aggressive malignant primary brain tumor in humans. Their research was recently highlighted by the television program “60 Minutes.” The discoveries that certain viruses preferentially infect tumor cells and mobilize an immune response imply that a natural infection with the virus would be protective against cancer.\n\nWHAT CAN A MOTHER DO TO PROTECT HER CHILD?\n\n What’s my advice to a mother facing an onslaught of vaccinations for her child? I recommend reading some of the literature on the dangers of the toxic chemicals in the vaccines, such as aluminum, mercury, glutamate, retroviruses and human DNA, to help you make an informed decision. Vaccines used to be a lot safer than they are today, and the reason, I believe, is the synergistic effect of all the other toxic chemicals that today’s kids are exposed to, in the air, the water, and their food. Some of these factors can be controlled, particularly the food. I cannot recommend enough the advice to switch your children to a 100 percent organic whole foods diet. I realize this takes more effort and costs more, but if you end up protecting your child from one of the many autoimmune and neurological diseases that today’s kids suffer from, it will be well worth it.\n\nIf your child already suffers from asthma, eczema, food allergies, epilepsy, attention deficit hyperactivity disorder (ADHD), autism or anxiety, then you need to be very careful with vaccines. If you don’t feel you can responsibly omit all the vaccines, at least space them out and make sure your child does not have a cold or other illness at the time of a vaccination. I recommend this for any child, but especially for a child who is already suffering from these conditions. Finally, please get your kids outside in the sunlight without sunscreen as much as possible. Sunlight catalyzes the synthesis of sulfate in the skin33 and this is one of the best ways to ensure that your child’s sulfate supplies are adequate. Adequate sulfate will help protect children from disease and make vaccines much less dangerous.\n\nREFERENCES\n\n 1. Varricchio F1, Iskander J, Destefano F, Ball R, Pless R, Braun MM, Chen RT. Understanding vaccine safety information from the Vaccine Adverse Event Reporting System. Pediatr Infect Dis J. 2004;23(4):287-94.\n\n 2. Salzman MB, Sharrar RG, Steinberg S, LaRussa P. Transmission of varicella-vaccine virus from a healthy 12-month-old child to his pregnant mother. J Pediatr. 1997 Jul;131(1 Pt 1):151-4.\n\n 3. Wakefield AJ, Murch SH, Anthony A, Linnell J, Casson DM, Malik M, Berelowitz M, Dhillon AP, Thomson MA, Harvey P, Valentine A, Davies SE, Walker-Smith JA. Ileal-lymphoidnodular hyperplasia, non-specific colitis, and pervasive developmental disorder in children. The Lancet 1998;351: 637-641. (Retracted.)\n\n 4. Wakefield, A.J.; Puleston, J.M.; Montgomery, S.M.; Anthony, A.; OLeary, J.J.; Murch, S.H. Review article: The concept of entero-colonic encephalopathy, autism and opioid receptor ligands. Aliment Pharmacol Ther 2002; 16: 663674.\n\n 5. Seneff S, Davidson RM, Liu J. Is Cholesterol Sulfate Deficiency a Common Factor in Preeclampsia, Autism, and Pernicious Anemia? Entropy 2012; 14: 2265-2290.\n\n 6. Dominique Le Houézec. Evolution of multiple sclerosis in France since the beginning of hepatitis B vaccination. Immunol Res 2014;60:219-225. DOI 10.1007/s12026-014-8574-4\n\n 7. Deisher TA, Doan NV, Omaiye A, Koyama K, Bwabye S. Impact of environmental factors on the prevalence of autistic disorder after 1979. J. Public Health Epidemiol. 2014; 6(9):271-286.\n\n 8. Joshi JG. Aluminum, a neurotoxin which affects diverse metabolic reactions. Biofactors 1990;2(3):163-9.\n\n 9. Fulgenzi A, Vietti D, Ferrero ME. Aluminium Involvement in Neurotoxicity. BioMed Research International Volume 2014 (2014), Article ID 758323.\n\n 10. Bishop NJ, Morley R, Day JP, Lucas A. Aluminum Neurotoxicity in Preterm Infants Receiving Intravenous-Feeding Solutions N Engl J Med 1997; 336:1557-1562.\n\n 11. Ghanizadeh A. Increased glutamate and homocysteine and decreased glutamine levels in autism: a review and strategies for future studies of amino acids in autism. Dis Markers. 2013; 35(5): 281286.\n\n 12. Choi DW. Glutamate neurotoxicity and diseases of the nervous system. Neuron 1988;1(8): 623634.\n\n 13. Bittigau P, Ikonomidou C. Glutamate in neurologic diseases. J Child Neurol. 1997 Nov;12(8):471-85.\n\n 14. Seneff S, Davidson, RM, Liu J. Empirical data confirm autism symptoms related to aluminum and acetaminophen exposure. Entropy 2012; 14: 2227-2253.\n\n 15. Schultz ST, Klonoff-Cohen HS, Wingard DL, Akshoomoff NA, Macera CA, Ji M. Acetaminophen (paracetamol) use, measles-mumps-rubella vaccination, and autistic disorder: the results of a parent survey. Autism. 2008 May;12(3):293-307.\n\n 16. Samsel A, Seneff S. Glyphosate, pathways to modern diseases III: Manganese neurological diseases, and associated pathologies. Surgical Neurology International 2015; 6:45.\n\n 17. Morley WA, Seneff S. Diminished brain resilience syndrome: A modern day neurological pathology of increased susceptibility to mild brain trauma, concussion, and downstream eurodegeneration. Surgical Neurology International 2014; 5:97.\n\n 18. Seneff S, Swanson N, Li C. Aluminum and glyphosate can synergistically induce pineal gland pathology: Connection to gut dysbiosis and neurological disease. Agricultural Sciences 2015; 6:42-70.\n\n 19. Pebody RG, Warburton F, Ellis J, Andrews N, Thompson C, von Wissmann B, Green HK, Cottrell\n\n S, Johnston J, de Lusignan S, Moore C, Gunson R, Robertson C, McMenamin J, Zambon M. Low effectiveness of seasonal influenza vaccine in preventing laboratory-confirmed influenza in primary care in the United Kingdom: 2014/15 midseason results. Eurosurveillance 2015; 20(5):pii=21025.\n\n 20. Cowling BJ, Fang VJ, Nishiura H, Chan K-H, Ng S, Ip DKM, Chiu SS, Leung GM, Malik Peiris JS. Increased risk of noninfluenza respiratory virus infections associated with receipt of inactivated influenza vaccine. Clin Infect Dis. 2012 Jun 15; 54(12): 17781783.\n\n 21. Zimmer C. Our Inner Viruses: Forty Million Years in the Making. National Geographic. phenomena.\n\n nationalgeographic.com/2015/02/01/our-inner-viruses-forty-million-years-in-the-making/[last accessed March 10, 2015].\n\n 22. Compans RW, Pinter A. Incorporation of sulfate into influenza virus glycoproteins. Virology 1975;66(1):151160.\n\n 23. Kucukosmanoglu E, Cetinkaya F, Akcay F, Pekun F. Frequency of allergic diseases following measles. Allergol Immunopathol (Madr). 2006 Jul-Aug;34(4):146-9.\n\n 24. Rosenlund H, Bergström A, Alam JS, Swartz J, Scheynius A, van Hage M, Johansen K, Brunekreef B, von Mutius E, Ege MJ, Riedler J, Braun-Fahrlander C, Washer M, Pershagen G. Allergic disease and atopic sensitization in children in relation to measles vaccination and measles infection. Pediatrics 2009;123(3):771-8.\n\n 25. Yamamoto H, Yamano T, Niijima S, Kohyama J, Yamanouchi H. Spontaneous improvement of intractable epileptic seizures following acute viral infections. Brain Dev. 2004 Sep;26(6):377-9.\n\n 26. Simpanen E, van Essen R, Isomki H. Remission of juvenile rheumatoid arthritis (Still’s disease) after measles. Lancet. 1977;2(8045):987-8.\n\n 27. Fomin KF. [Cure of psoriasis after co-existing measles]. Vestn Dermatol Venerol. 1961 Jun;35:66-8. [Article in Russian].\n\n 28. Mota HC. Infantile Hodgkin’s disease: remission after measles. Br Med J. 1973;2(5863):421.\n\n 29. Grote D, Cattaneo R, Fielding AK. Neutrophils contribute to the measles virus-induced antitumor effect: Enhancement by granulocyte macrophage colony-stimulating factor expression. Cancer Research 2003; 63:6463-6468.\n\n 30. Elankumaran S, Rockemann D, Samal SK. Newcastle disease virus exerts oncolysis by both intrinsic and extrinsic caspase-dependent pathways of cell death. Journal of Virology 2006;80 (15): 7522-34.\n\n 31. Reichard KW, Lorence RM, Cascino CJ, Peeples ME, Walter RJ, Fernando MB, Reyes HM, Greager JA. Newcastle disease virus selectively kills human tumor cells. Journal of Surgical Research 52(5), May 1992, 448-453.\n\n 32. Toyoda H, Yin J, Mueller S, Wimmer E, Cello J. Oncolytic treatment and cure of neuroblastoma\n\n by a novel attenuated poliovirus in a novel poliovirus-susceptible animal model. Cancer Res 2007; 67 (6):2857-64.\n\n 33. Seneff S, Lauritzen A, Davidson RD, Lentz-Marino L. Is endothelial nitric oxide synthase a moonlighting protein whose day job is cholesterol sulfate synthesis? Implications for cholesterol transport, diabetes and cardiovascular disease. Entropy 2012; 14: 2492-2530.\n\nThis article appeared in Wise Traditions in Food, Farming and the Healing Arts, the quarterly journal of the Weston A. Price Foundation, Summer 2015", "opengraph": {"locale": "en_US", "type": "article", "title": "Why We Need to Reexamine the Risk/Benefit Tradeoffs of Vaccines", "description": "Stephanie Seneff looks at rising rates of autism", "url": "https://www.westonaprice.org/health-topics/vaccinations/why-we-need-to-reexamine-the-riskbenefit-tradeoffs-of-vaccines/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:modified_time": "2022-05-05T19:28:33+00:00", "image": "http://www.westonaprice.org/wp-content/uploads/Sum2015-seneff1.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "http://www.westonaprice.org/wp-content/uploads/Sum2015-seneff1.jpg", "http://www.westonaprice.org/wp-content/uploads/Sum2015-senefftab11.jpg", "http://www.westonaprice.org/wp-content/uploads/Sum2015-senefftab2.jpg", "http://nationalgeographic.com/2015/02/01/our-inner-viruses-forty-million-years-in-the-making/", "http://www.westonaprice.org/journal/journal-summer-2015-vaccination-issue/", "javascript:window.print()"], "authors": [], "publish_date": "July 29, 2015"}