{"result_id": "339025", "URL": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-arizona/", "timestamp": "2023-04-25 18:11:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-arizona/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support an important vaccine bill in Arizona!", "cleaned_text": "Speak up for a good bill in the Arizona legislature that would prohibit Emergency Use Authorization (EAU) vaccine mandates for students.\n\nHB 2474 would prohibit EAU vaccines from being required for school attendance by adding EAU vaccines to current Arizona State law, 36-672(c), which reads:\n\nThe following immunizations are not required for school attendance:\n• The immunization against the human papillomavirus.\n• An immunization for Covid-19 or any variant of Covid-19\n\nEUA vaccines are always fast-tracked and potentially dangerous for all people. Forcing parents to subject their children to experimental medical products to attend school is immoral.\n\nHB 2474 passed the House and is scheduled for a Senate Health & Human Services Committee hearing on 3/7/2023.\n\nWe need your help to be sure HB 2474 gets through the Senate!\n• Contact your Arizona State Senator and ask him/her to SUPPORT HB 2474.\n\nYou can look up who represents you at: https://www.azleg.gov/findmylegislator/\n• Contact Senate Health & Human Services Committee members and ask them to SUPPORT HB 2474 on Tuesday, March 7th at 2 P.M. The public can livestream the meeting by clicking here and following the link: https://www.azleg.gov/getcurrentPDF/?doctype=A&docid=16021\n\nYou may copy/paste this block to email all the committee members at once:\n\nCalls are more effective than emails and only take a few minutes. Below is a Sample Script along with additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“Hi, my name is ____, and I am a constituent. I am asking Senator/Committee Member ____ to support HB 2474, which would prohibit mandating Emergency Use Authorization (EAU) vaccines for students in Arizona.\n\nThis bill is especially important to ensure that students are not discriminated against for choosing not to receive fast-tracked, experimental vaccines.\n\nPeople should not be forced to be injected with an experimental substance that could cause serious side effects – especially when there have been no long-term studies on the safety of the shots.\n\nEAU Covid-19 injections, for example, have caused many side effects, including death. As of 2/24/23, 2,435,775 injuries and 34,387 deaths were reported in connection with the Covid shots to the CDC’s Vaccine Adverse Events Reporting System (VAERS) — and it is estimated that only 1-10 percent of adverse reactions are ever reported. And yet the manufacturers are shielded from liability for any harm they cause.\n\nVaccine mandates are justified by the idea of the “greater good” and protecting others. But no individual, especially not a child, should be forced to take any medical treatment for someone else’s benefit.\n\nI urge Senator/Committee Member _____to SUPPORT HB 2474, which would protect students and their rights to bodily autonomy.”\n• No one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• Emergency Use Authorization shots have no long-term studies on the safety, genotoxicity, carcinogenicity, or effect on reproduction.\n• No one knows if future Emergency Use Authorization (EAU) vaccines will be effective. For example, manufacturers originally claimed their Covid shots were 95 percent effective. The Director of the CDC now admits Covid shots do not prevent Covid. For this reason alone, children should not be forced to submit to EAU injections. https://edition.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/h_d2accec79fdc37f422d02c536828ea1e\n• There have already been 2,435,775 COVID-19 vaccine adverse events and 34,387 COVID-19 vaccine deaths reported in the U.S. to the Vaccine Adverse Events Reporting System (per data released 2/24/23).\n• It is highly likely that future EUA vaccines would be protected by the Public Readiness and Emergency Preparedness Act or PREP Act in the same way that Covid shot manufacturers and providers are shielded from liability. The only option for compensating people injured by Covid-19 vaccines is the Countermeasures Injury Compensation Program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medical expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000 per year, and there is no judicial appeal. In other words, the victims will be severely under-compensated while the pharmaceutical companies get rich. https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising [1,2]. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations [3].\n\nView the text, status, and history of the bills here:\n\nRead these articles for more information on the dangers of EUA Covid shots:", "opengraph": {"locale": "en_US", "type": "article", "title": "Support an important vaccine bill in Arizona!", "description": "🖨️ Print post Speak up for a good bill in the Arizona legislature that would prohibit Emergency Use Authorization (EAU) vaccine mandates for students. HB 2474 would prohibit […]", "url": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-arizona/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-03-06T14:45:28+00:00", "article:modified_time": "2023-03-06T15:12:22+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.azleg.gov/findmylegislator/", "https://www.azleg.gov/getcurrentPDF/?doctype=A&docid=16021", "https://edition.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/h_d2accec79fdc37f422d02c536828ea1e", "https://mail.google.com/mail/u/7/#m_-99850368474108958_m_-1767805289762624242_", "https://www.medalerts.org/vaersdb/index.php", "https://www.medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5B%5D=COVID19&DIED=Yes", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://www.corp-research.org/merck", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "https://apps.azleg.gov/BillStatus/BillOverview/78605?SessionId=127", "https://apps.azleg.gov/BillStatus/CommitteeOverView?SessionID=127", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/", "https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/", "https://www.azleg.gov/emailazleg/?legislatorId=2118", "https://www.azleg.gov/emailazleg/?legislatorId=2119", "https://www.azleg.gov/emailazleg/?legislatorId=2126", "https://www.azleg.gov/emailazleg/?legislatorId=2128", "https://www.azleg.gov/emailazleg/?legislatorId=2141", "https://www.azleg.gov/emailazleg/?legislatorId=2142", "https://www.azleg.gov/emailazleg/?legislatorId=2145", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-03-06T14:45:28+00:00"}