{"result_id": "339033", "URL": "https://www.westonaprice.org/help-stop-a-dangerous-vaccine-bill-in-california-action-needed-today/", "timestamp": "2023-04-25 18:11:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/help-stop-a-dangerous-vaccine-bill-in-california-action-needed-today/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Help stop a dangerous vaccine bill in California! Action needed today!", "cleaned_text": "The California legislature is once again considering a bill that would endanger children while keeping parents in the dark!\n\nS.B. 1419 would prohibit parents from accessing vaccination records for any vaccine for which a minor can consent on their own.\n\nUnfortunately, current law allows children 12 and older to consent to vaccines for sexually transmitted diseases (HPV, Hepatitis A and B) without parental knowledge or consent.\n\nWhile we do not take a position on the parts of the bill that do not pertain to vaccination, we here at the Weston A. Price Foundation are strongly opposed to minors consenting to vaccination on their own and parents being denied access to those records.\n\nS.B. 1419 passed the full Senate on 5/24/22. It is currently scheduled for another hearing on Wednesday. Please help us protect parental rights today!\n• Submit written testimony to the Assembly Appropriations Committee stating your opposition to the vaccination section of SB 1419, as well as your opposition to SB 1419 as a whole if this section is not removed. This must be done before the hearing, on Wednesday, August 3rd, at 9:00 AM at 1021 O Street in Room 1100.\n\nYou may also visit the Assembly Appropriations Committee website and click on the “Submit Position Email” button.\n• Contact your California State Assembly Member and ask him or her to oppose S.B. 1419. You can find out who represents you at: http://findyourrep.legislature.ca.gov\n\nCalls are more effective than emails, and only take a few minutes.\n\n“Hi, my name is ____ and I am a constituent. I am calling to ask Assembly Member ____ to oppose S.B. 1419 as written.\n\nSB 1419 contains a bad provision which comes between parents and their children by blocking parents from being able to view their children’s vaccination records for vaccines received without parental consent.\n\nSB 1419 should be amended to remove this harmful section. If it is not removed, then SB 1419 should be opposed.\n\nThis bill is especially dangerous since another bill in California, SB 866, is also advancing through the legislature. It would allow minor children to consent on their own to all childhood vaccines without parental knowledge or consent.\n\nVaccines are pharmaceutical products that carry a risk of injury and death. Minor children may not be aware of family medical histories, and even their own young childhood history of vaccine reactions, and this section would prohibit parents from being able to trace what may be symptoms of vaccine reactions back to a particular vaccine.\n\nI urge Assembly Member _______ to oppose this dangerous bill unless it is amended.\n\nBe sure to explain why this issue is important to you. You may wish to use a couple of the talking points below. Don’t copy all of them – just use them as ideas to help structure your own message.\n• If passed, SB 1419 would jeopardize the health and wellbeing of children in California. If a minor child consents to vaccination without parental knowledge and has a reaction, the parent may not recognize vaccine reaction symptoms. This lack of knowledge could be life threatening for the child and may prevent the parent from seeking the appropriate medical care.\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program – presumably with little or no understanding of what that means. It is also much less likely that vaccine reactions will be recognized and connected to the vaccine by a child on their own and filed with the Vaccine Adverse Event Reporting System.\n• Medical practitioners, schools, and others should never be permitted to coerce impressionable minor children into a medical procedure that is capable of causing injury or death behind their parents’ backs. Providers should not be allowed to conceal the vaccination from caring parents who may need this information to best manage their child’s healthcare.\n• Congress never intended for minor children to make decisions to get vaccines without parental knowledge or consent. When the National Childhood Injury Act of 1986 was passed, the Act clearly stated that before the administration of vaccines to a child, a health care provider shall give a copy of the CDC’s vaccine information materials to the “parent or legal representative of any child to whom the provider intends to administer such vaccine…” Children should only be vaccinated with parental consent, but since current law allows for children to consent to some vaccines are their own, providers should never be allowed withhold this information.\n\nView text, status and history of the bill (SB 1419) here: https://leginfo.legislature.ca.gov/faces/billStatusClient.xhtml?bill_id=202120220SB1419", "opengraph": {"locale": "en_US", "type": "article", "title": "Help stop a dangerous vaccine bill in California!  Action needed today!", "description": "🖨️ Print post The California legislature is once again considering a bill that would endanger children while keeping parents in the dark! S.B. 1419 would prohibit parents from […]", "url": "https://www.westonaprice.org/help-stop-a-dangerous-vaccine-bill-in-california-action-needed-today/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2022-08-02T15:59:44+00:00", "article:modified_time": "2022-08-02T15:59:45+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=6926.&nodeTreePath=13.5.3&lawCode=FAM", "https://apro.assembly.ca.gov", "mailto:approps.committee@assembly.ca.gov", "https://apro.assembly.ca.gov", "http://findyourrep.legislature.ca.gov/", "https://nvicadvocacy.org/members/State-Teams/My-State/Action-Alert-Details/itemid/2778/State/CA?Page=True", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://www.hrsa.gov/sites/default/files/hrsa/vaccine-compensation/vaccine-injury-table-01-03-2022.pdf", "https://www.cdc.gov/vaccines/hcp/vis/about/required-use-instructions.html", "https://leginfo.legislature.ca.gov/faces/billStatusClient.xhtml?bill_id=202120220SB1419", "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=6926.&nodeTreePath=13.5.3&lawCode=FAM", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2022-08-02T15:59:44+00:00"}