{"result_id": "339028", "URL": "https://www.westonaprice.org/we-still-need-to-stop-4-dangerous-vaccine-bills-in-california/", "timestamp": "2023-04-25 18:11:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/we-still-need-to-stop-4-dangerous-vaccine-bills-in-california/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "We still need to STOP 4 dangerous vaccine bills in California!", "cleaned_text": "Previously we sent you alerts letting you know about several bad vaccine and/or Covid related bills that needed your action. While we have some good news, we still desperately need your immediate help!\n\nFirst the good news. S.B. 866 is dead! This terrible bill would have allowed minors 15 years and older to consent to any vaccine approved by U.S. Food and Drug Administration (FDA) and recommended by the Advisory Committee on Immunization Practices (ACIP). Disturbingly the bill also would have prohibited the vaccine administrator from providing “any service” beyond their “scope of practice” which means that the provider may not be authorized to give adequate care if the minor suffers an immediate reaction or adverse effect.\n\nIf S.B. 866 had passed, it would have granted vaccine providers permission to vaccinate our children without parental consent!\n\nNow the bad news. A.B. 2098, A.B. 1797, A.B. 1940 and S.B. 1419 passed the House and Senate and are headed to the Governor’s desk!\n\nA.B. 2098 would designate the dissemination or promotion of “misinformation” related to COVID-19 by a physician or surgeon as “unprofessional conduct,” thus allowing the Medical Board to act against such doctors. If signed this bill will prohibit doctors from telling patients what they really think about COVID-19 vaccines, treatments, and more.\n\nA.B. 1797 would require health care providers and other agencies to disclose all immunization information to a state database, would add the patient’s race or ethnicity to the list of information being disclosed, and authorize schools, childcare facilities, family childcare homes, and county human services agencies to use the specified immunization information, in the event of a public health emergency, to perform immunization status assessments of pupils, adults, and clients.\n\nA.B. 1940 wouldallow state and school boards to facilitate vaccinations (as well as abortions and drug abuse treatment) for children without parental consent in healthcare clinics in the state’s K-12 public schools.\n\nS.B. 1419 would prohibit parents from accessing vaccination records for any vaccine for which a minor can consent on their own. Unfortunately, current law allows children 12 and older to consent to vaccines for sexually transmitted diseases (HPV, Hepatitis A and B) without parental knowledge or consent.\n\nWhile we do not take a position on the parts of the bill that do not pertain to vaccination, we here at the Weston A. Price Foundation are strongly opposed to minors consenting to vaccination on their own and parents being denied access to those records.\n\nAll of these bills are an overreach and an infringement on constitutional and parental rights, as well as bodily autonomy.\n• Contact Governor Newsom and ask him to VETO A.B. 2098, A.B. 1797, A.B. 1940 and S.B. 1419. See the sample script and related talking points below.\n\nYou can call the Governor’s office and leave a message at: (916) 445-2841.\n\nOr send him at message at: https://govapps.gov.ca.gov/gov40mail/\n\nCalls are more effective than emails. Be sure to explain why this issue is important to you. You may wish to use a couple of the talking points below. Don’t copy all of them – just use them as ideas to help structure your own message.\n\n“Hi, my name is ____ and I am a constituent. I am calling to ask Governor Newsom to VETO A.B. 1797, which would expand vaccine tracking. This unnecessary bill claims to make enhancements to the California Immunization Registry, but what it really does is create significant privacy issues, which circumvent federal privacy laws for doctors and schools. For example, current laws do not allow schools access to students’ COVID-19 vaccination status, yet this legislation would add the vaccine to the registry for all to see.\n\nI am also calling to ask Governor Newsom to VETO A.B. 2098, which would\n\nnegatively impact the California healthcare system by making it easy to punish\n\ndoctors for going against any “contemporary scientific consensus” for treating COVID-19. Only a small handful of treatments have been authorized by the FDA, yet doctors worldwide are having great success with many safe treatment protocols. It is unfair to punish well-intended doctors for doing what they believe is best for their patients. If dedicated doctors hadn’t tried different approaches over the past two years, many more people would have died from the use of ventilators and Remdesivir.\n\nLast of all, I ask that Governor Newsom VETO A.B. 1940 and S.B. 1419.\n\nA.B. 1940 would fund on-site school clinics in K-12th grade to facilitate vaccinations (and abortions and drug treatments) for children WITHOUT parental consent. As recognized by the U.S. Supreme Court, vaccines are pharmaceutical products that carry risk of injury or death. It is irresponsible to allow children to make medical decisions that may injure or kill them without the knowledge of their parents.\n\nS.B. 1419 contains a bad provision that comes between parents and their children by blocking parents from being able to view their children’s vaccination records for vaccines received without parental consent. SB 1419 should be amended to remove this harmful section. If it is not removed, then SB 1419 should be VETOED.\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines, without having to pay for any of the injuries or harm.\n• The U.S. Supreme Court recognizes vaccines to be “unavoidably unsafe” and to cause injury and death in some recipients. The US Government has paid out more than $4.7 billion to the victims of vaccine injury. Hundreds of thousands have reported an adverse reaction to vaccination to VAERS.\n• COVID-19 vaccines carry the risk of injury and death for some so there has to be informed consent and the right to refuse the vaccine without penalty. As of August 19th, there have already been 1,390,597 COVID-19 Vaccine adverse events and 30,479 COVID-19 Vaccine deaths reported in the U.S. to the Vaccine Adverse Events Reporting System (VAERS). https://www.medalerts.org/vaersdb/index.php\n• Young adults and teens (especially males) vaccinated against COVID-19 have been shown to have a higher risk for myocarditis (heart inflammation) than other populations. There has simply not been enough time to see what the risks of myocarditis and other potentially serious side effects of the vaccine are for younger children.\n• The CAIR2 database should be an opt in system, not an opt out system. All personal medical information should only be stored and shared with the express written permission of the patient or parent/guardian.\n• The risk of violating patient privacy is significant. Take for example the fact that in 2018, the California Department of Developmental Services notified 582,174 patients that their protected health information had potentially been compromised. The California Constitution gives each citizen the “inalienable right” to pursue and obtain “privacy.”\n• Supporters of vaccine tracking systems claim they are a way to protect patients by guaranteeing patients don’t receive multiple doses of the same vaccinations by different providers. According to CDC’s own statements, though, it’s clear that a key purpose of these registries is to create pressure on people who are unvaccinated or partially vaccinated. CDC openly stated that vaccine registries are a tool to identify areas of “undervaccination” so they can be “addressed” and brought into “compliance.” https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6133a2.htm\n• Using Immunization Information Systems in general costs states millions of dollars. The money spent on expanding California’s vaccine tracking system would be better spent on measures that better address public health.\n• Censoring doctors (or any medical professional) does not better public health. A.B. 2098 is anti-doctor, anti-public health, anti-science, and anti-free speech and we urge you to oppose it.\n• A.B. 2098 blatantly violates doctors’ freedom of speech under the first amendment of the U.S. Constitution.\n• The doctor/patient relationship is a trusted one. Doctors must not face retribution for trying to do what they believe is best for their patients.\n• Many doctors have had great success with alternative treatments, and some have even seen large numbers of COVID-19 vaccine injuries. Silencing doctors’ professional opinions is unethical.\n• The Director of the CDC admits COVID-19 shots do not prevent transmission. https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html#\n• Vaccines are pharmaceutical products that carry a risk of injury or death. Minor children may not be aware of family and their own personal history of vaccine reactions or personal contraindications to relay to the vaccine administrator.\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program – presumably with little or no understanding of what that means. It is also much less likely a child would recognize a vaccine reaction on their own and file a report with the Vaccine Adverse Event Reporting System.\n• Share a personal story if you have relevant experience. Do you have a vaccine-injured child, and you weren’t told about the risks before vaccinating or were pressured into vaccinating despite your concerns about the risks?\n• If signed into law, SB 1419 would jeopardize the health and wellbeing of children in California. If a minor child consents to vaccination without parental knowledge and has a reaction, the parent may not recognize vaccine reaction symptoms. This lack of knowledge could be life threatening for the child and may prevent the parent from seeking the appropriate medical care.\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program (VICP)– presumably with little or no understanding of what that means. It is also much less likely that vaccine reactions will be recognized and connected to the vaccine by a child on their own and filed with the Vaccine Adverse Event Reporting System (VAERS).\n• Medical practitioners, schools, and others should never be permitted to coerce impressionable minor children into a medical procedure that is capable of causing injury or death behind their parents’ backs. Providers should not be allowed to conceal the vaccination from caring parents who may need this information to best manage their child’s healthcare.\n• Congress never intended for minor children to make decisions to get vaccines without parental knowledge or consent. When the National Childhood Injury Act of 1986 was passed, the Act clearly stated that before the administration of vaccines to a child, a health care provider shall give a copy of the CDC’s vaccine information materials to the “parent or legal representative of any child to whom the provider intends to administer such vaccine…” Children should only be vaccinated with parental consent, but since current California law allows for children to consent to some vaccines on their own, providers should never be allowed to withhold this information.\n\nView text, status, and history of the bills here:", "opengraph": {"locale": "en_US", "type": "article", "title": "We still need to STOP 4 dangerous vaccine bills in California!", "description": "🖨️ Print post Previously we sent you alerts letting you know about several bad vaccine and/or Covid related bills that needed your action.  While we have some good […]", "url": "https://www.westonaprice.org/we-still-need-to-stop-4-dangerous-vaccine-bills-in-california/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2022-09-02T22:45:47+00:00", "article:modified_time": "2022-09-02T22:45:49+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=6926.&nodeTreePath=13.5.3&lawCode=FAM", "https://govapps.gov.ca.gov/gov40mail/", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19", "http://ow.ly/OxTu50Da2zN", "https://www.medalerts.org/vaersdb/index.php", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-11-2-3/04-COVID-Oster-508.pdf", "https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6133a2.htm", "https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html", "https://www.theguardian.com/world/2021/oct/28/covid-vaccinated-likely-unjabbed-infect-cohabiters-study-suggests", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vaccine-injury-table-01-03-2022.pdf", "https://www.cdc.gov/vaccines/hcp/vis/about/required-use-instructions.html", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB2098&emci=7fcc1932-c6f5-ec11-b47a-281878b83d8a&emdi=1f6533eb-d4f5-ec11-b47a-281878b83d8a&ceid=11866090", "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB1797&emci=7fcc1932-c6f5-ec11-b47a-281878b83d8a&emdi=1f6533eb-d4f5-ec11-b47a-281878b83d8a&ceid=11866090", "https://www.sandiegouniontribune.com/news/education/story/2022-02-04/san-diego-leaders-educators-unveil-new-legislation-to-update-vaccination-registry", "https://leginfo.legislature.ca.gov/faces/billHistoryClient.xhtml?bill_id=202120220AB1940", "https://californiaglobe.com/articles/ca-senate-passes-healthcare-clinics-for-k-12-students-along-party-lines/", "https://leginfo.legislature.ca.gov/faces/billStatusClient.xhtml?bill_id=202120220SB1419", "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?sectionNum=6926.&nodeTreePath=13.5.3&lawCode=FAM", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2022-09-02T22:45:47+00:00"}