{"result_id": "339032", "URL": "https://www.westonaprice.org/health-topics/vaccines-unsafe-since-the-very-beginning/", "timestamp": "2023-04-25 18:11:21 CEST+0200", "meta": {"description": "history of vaccines, aluminum-containing vaccines children receive and the rate of autism spectrum disorder (ASD), vaccine safety concerns", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/health-topics/vaccines-unsafe-since-the-very-beginning/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Vaccines—Unsafe Since The Very Beginning", "cleaned_text": "The word “vaccine” originates from the Latin word vacca for “cow.” According to legend, the term was coined after Dr. Edward Jenner’s 1796 experimentation with smallpox inoculations. To test his hypothesis that people who contracted cowpox could not get smallpox, he exposed a young boy to disease matter from lesions on the hands of a dairymaid said to be infected with cowpox. Allegedly, the child developed cowpox. Jenner later deliberately exposed him to smallpox, and when the boy did not develop the disease, Jenner proclaimed his cowpox inoculation a success.1\n\nJenner’s vaccination program became compulsory in several countries worldwide and as a result, vaccinated populations experienced unprecedented smallpox epidemics that harmed and killed thousands of people. With vaccination, the outbreaks were no longer small and isolated. Conversely, smallpox deaths plummeted in countries that forbade the vaccinations or rescinded the laws, especially in places that implemented nutrition and sanitation improvements.2\n\nThroughout the history of smallpox vaccines, many people from all walks of life spoke out against them, including doctors as well as the spiritual leader, Mahatma Gandhi. In support of these sentiments, studies and official declarations confirmed that smallpox vaccines were ineffective and dangerous.2 The vaccines have been linked to epidemics of the childhood illness dubbed “hand, foot and mouth disease,” brain and spinal cord inflammation (encephalomyelitis), neurological disorders—including epilepsy, peripheral nerve damage (polyneuritis) and multiple sclerosis—and death.2\n\nStrangely enough, with the birth of the first impure vaccines christened after a cow came the belief that vaccines are the “sacred cow” of medicine. One cannot ignore the irony. Despite their failure from the outset, a consensus prevails among the medical community and the public at large that vaccines are unilaterally “effective and safe.” For some, vaccination has become a religion. Those who question the efficacy and safety of vaccines are viewed as heretics, with entities like the World Health Organization (WHO) even pronouncing so-called “vaccine hesitancy” a major global health threat.3 The vaccine religion persists even though the efficacy and safety of vaccines have never been adequately studied nor proven. Jenner did not conduct proper research on the first inoculations in 1796, and authorities do not study them correctly today, despite advances in technology and medical knowledge.\n\nInstead, vaccine trials are “defective by design.”4 Medicine considers randomized, double-blind placebo-controlled trials the “gold standard”; such trials compare two groups of people who are alike except for one factor. In the case of vaccines, that comparison should be between those who receive the vaccine and those who receive an inert placebo. However, the vast majority of vaccine safety trials use comparison groups whose participants either receive other vaccines or false (non-inert) “placebos” that contain aluminum or other toxic adjuvants.5 No clinical trial studying the safety of vaccines given to infants and toddlers has ever used a neutral placebo.6 Without a harmless placebo, it is impossible to determine true cause-effect relationships between the vaccine and the observed outcomes.\n\nVaccine clinical trials are fraught with other methodological problems as well. Consider the fact that most pre-licensure clinical trials exclude the participants who would be most at risk of serious adverse events—such as pregnant women or children with cancer or diabetes—but after licensure, the same vaccines are routinely administered to those vulnerable groups. Another concern involves the fact that most safety studies last only weeks, with adverse events sometimes monitored for as little as a few days.7 Often, manufacturers also limit the number of participants in vaccine trials. For example, the pre-licensure trials for Gardasil, a vaccine that is supposed to prevent human papillomavirus (HPV), appears to have studied fewer than twelve hundred girls under age sixteen, and it is unclear how long they were followed.8\n\nPost-licensure monitoring studies are also derisory.4 Thousands of independent studies demonstrate the dangers of vaccines. However, buttressed by grossly flawed, biased and self-interested science, manufacturers and government agencies persist in asserting that vaccines are completely safe. Dr. Marcia Angell, former editor-in-chief of the New England Journal of Medicine, famously said in 2009, “It is simply no longer possible to believe much of the clinical research that is published or to try and rely on the judgment of trusted physicians or authoritative medical guidelines.”9\n\nDoctors, researchers, medical societies and other organizations also have an infuriating habit of categorically dismissing vaccine injuries, claiming they are “one in a million.” The data show otherwise. A meticulous machine cluster analysis of health data collected from over three hundred seventy-six thousand individuals who received a total of 1.4 million doses of forty-five vaccines showed that an astonishing one in thirty-eight doses (2.6 percent) resulted in injuries.10 The federal government’s own Vaccine Adverse Event Reporting System (VAERS) likewise shows that temporal associations between vaccine administration and subsequent deterioration in health are real and not rare. Established by Congress as a post-marketing surveillance system under the National Childhood Vaccine Injury Act of 1986 (the “1986 Act”), VAERS receives adverse event reports from vaccine manufacturers, health care professionals and the general public. Over the past thirty-plus years, VAERS has accumulated over half a million reports, with an average of twenty thousand to thirty thousand new case records added yearly over the last decade.\n\nOver the past two years, the number of injuries reported to VAERS has surged, with Covid shots contributing to more injuries and deaths than all other previous vaccines combined.6 As of mid-November 2022, VAERS displayed more than 1.4 million adverse events following Covid “vaccination,”11 including more than thirty-two thousand reported deaths.12\n\nVAERS is a passive surveillance system, and underreporting is its most significant limitation. According to a Department of Health and Human Services study, the database captures fewer than 1 percent of all vaccine-related adverse reactions and deaths.10 There is also evidence of illegal deletion of adverse events from the database.13 Moreover, the government’s own National Vaccine Injury Compensation Program (NVICP) puts the lie to the claim that vaccines are unilaterally safe. Since 1988, this program has paid out almost five billion dollars to children and adults injured or killed by vaccines (or their families)14—and that figure represents awards to only one out of three petitioners.15 Most people are unaware of the program, for which a three-year statute of limitations exists to file a claim.16\n\nOver the years, manufacturers of drugs and vaccines have paid out extraordinary sums in criminal penalties and settlements for failure to report safety problems, falsification of safety studies, other forms of research fraud, bribery, kickbacks and false advertising. Merck’s efforts in the early 2000s to suppress evidence of safety problems with its arthritis medication Vioxx represent a prime example, with the company paying billions of dollars to governments and individuals to resolve thousands of lawsuits related to its actions. Well before the Covid shots, every manufacturer of pediatric vaccines had pled guilty to fraud.17\n\nGovernment agencies are little better, with rampant conflicts of interest. In May 2022, the nonprofit government watchdog organization Open the Books described three hundred fifty million dollars in secret payments made by pharmaceutical companies or other payers to scientists and leaders at the National Institutes of Health (NIH) from 2010 to 2020, including Dr. Anthony Fauci, Dr. Francis Collins and hundreds of others.18 What’s more, the conflicts of interest of researchers who publish the studies cited as proof of vaccine safety—who generally owe their funding to government or pharmaceutical sources—are never mentioned.\n\nIt is the job of the U.S. Food and Drug Administration (FDA) to approve vaccines. Remarkably, though, the FDA does not conduct any safety trials of its own. Instead, vaccine clinical trials are carried out by the manufacturers, who enjoy several different layers of protection from liability for their products. These include the 1986 Act as well as the 2011 U.S. Supreme Court decision in the case of Bruesewitz v. Wyeth, which blocked the legal right of vaccine-injured persons to hold drug companies liable for design defects or failure to make approved drugs safer.19 In the case of emergency use authorization (EUA) Covid-19 injections, manufacturers are immune from liability under the Public Readiness and Emergency Preparedness (PREP) Act. According to U.S. law, if you are injured by an EUA vaccine, you cannot sue.20\n\nThe Centers for Disease Control and Prevention (CDC) is in charge of recommending vaccines for the childhood and adult schedules and monitoring post-marketing safety. This is akin to the fox guarding the hen house.21 What most people fail to recognize is the fact that the CDC is not an independent government agency. It is a for-profit organization22 with dozens of vaccine patents, and it sells more than four billion dollars of vaccine products annually.23 If the CDC were to raise safety concerns about a particular vaccine, that would affect its bottom line. Remember, CDC is the same corrupt health agency that killed a vaccine safety commission proposed by Children’s Health Defense founder Robert F. Kennedy, Jr. after Pfizer gave President Trump a one-million-dollar contribution.24\n\nSince the days of Jenner, vaccine programs have assumed that injecting foreign substances into the human body is a protective means of preventing disease. Vaccine scientists pin their evidence for this assumption on vaccines’ ability to stimulate antibody (protein) production in the recipient, but antibody production has proved to be a poor proxy for the far more complex detoxification and regeneration systems that nature provides to keep people healthy.\n\nA growing body of independent research shows that vaccines and their ingredients can have synergistic effects and thus result in exponentially more significant toxicity when combined.25,26 In nature, our bodies do not readily encounter multiple disease agents simultaneously, yet we are told that our children will be okay when we inject them with many toxins in a single pediatric visit. CDC has never studied the effects of administering multiple vaccines simultaneously, including to infants.\n\nNeil Z. Miller, author of the book Miller’s Review of Critical Vaccine Studies, has commented: “The safety of CDC’s childhood vaccination schedule was never affirmed in clinical studies. Vaccines are administered to millions of infants every year, yet health authorities have no scientific data from synergistic toxicity studies on all combinations of vaccines that infants are likely to receive. National vaccination campaigns must be supported by scientific evidence. No child should be subjected to a health policy that is not based on sound scientific principles and, in fact, has been shown to be potentially dangerous.”27\n\nIn his 2016 article titled “Combining childhood vaccines at one visit is not safe,”27 Miller demonstrated that there is a “dose-dependent association between the number of vaccines administered simultaneously and the likelihood of hospitalization or death” following an adverse reaction; moreover, the younger a child is at the time of the adverse reaction, the higher the risk of hospitalization or death. Earlier, Miller showed a linear relationship between the number of vaccine doses administered and the percentage of hospitalizations and deaths reported to VAERS, with younger infants significantly more likely than older infants to be hospitalized or to die after receiving vaccines.28\n\nVaccine scientists and policymakers promote a “one-size-fits-all” approach for vaccine dosage and the vaccine schedule. Variables such as age, sex, weight, genetics, family history and medical history are not considered, nor are vaccine recipients screened for allergies, prior reactions, illness or other contraindications. As Barbara Loe Fisher, president of the National Vaccine Information Center, says, “This mandatory one-size-fits-all approach to vaccination is a de facto state-sanctioned selection of the genetically and biologically vulnerable for sacrifice.”29\n\nThe human body is designed to encounter toxins and pathogens through inhalation and ingestion, not via injection. When vaccine ingredients are injected directly into the body, they bypass natural protective filters, making their way into the bloodstream, organs, bones and brain.30\n\nWhat are some of the vaccine ingredients injected into children at pediatric visits? Known ingredients include neurotoxic heavy metals such as mercury (in the form of thimerosal); aluminum adjuvants; gene DNA fragments; carrier proteins; metallic particles of varying sizes; other nanoparticles; the herbicide glyphosate; antibiotics such as neomycin; squalene; polysorbate 80; and carcinogenic formaldehyde; as well as unknown ingredients and contaminants.31 To quote Dr. Richard Moskowitz, MD, “The CDC’s repeated assurances that all of these ingredients are safe are hardly persuasive or even credible since they have failed to provide any evidence of the slightest attempt to investigate them.”30\n\nLet us examine two key offending ingredients, thimerosal and aluminum. Before 1999 when Congress and the public pressured the U.S. Public Health Service and the American Academy of Pediatrics to phase out thimerosal, children received large amounts of mercury in their vaccines. Those born in the 1990s were typically injected with up to two hundred thirty-seven micrograms of mercury by their second birthday and over sixty micrograms at a single doctor’s visit. When public health authorities launched new recommendations for thimerosal-containing influenza vaccines, they essentially negated the “phase-out” of mercury-containing vaccines said to have been completed in 2003.32 Additionally, pharmaceutical companies still use thimerosal to impede bacterial growth during the manufacturing process for certain vaccines.33\n\nIn America, the acceptable limit of mercury in drinking water is two parts per billion (ppb), and a liquid with two hundred ppb is considered toxic waste. Nevertheless, infant influenza vaccines can contain twenty-five thousand ppb of mercury, and several adult flu vaccines contain fifty thousand ppb—despite the consistent finding from in vitro and animal studies “that even low doses of thimerosal are active against brain cells and that thimerosal’s toxic effects are cumulative.”31 As evidenced by over one hundred eighty studies, mercury-containing vaccines significantly increase the risks of adverse neurodevelopmental outcomes, including speech and sleep disorders, developmental delays, autism and attention deficit disorder as well as premature puberty.2\n\nAluminum adjuvants are added to many vaccines to hyperstimulate a response in the recipient. Like mercury, aluminum was grandfathered into the vaccine program without any human safety testing by the FDA. Infants and children are at particular risk from aluminum’s neurotoxic effects, which include the destruction of neurons necessary for proper cognitive and motor functions. Aluminum in vaccines has been associated with a multitude of ailments, including autoimmune and neurological damage, amyotrophic lateral sclerosis, chronic fatigue and sleep disturbances. A recent CDC-funded study linked aluminum in vaccines to a 36 percent higher risk of persistent asthma.34 Clinical studies demonstrate that aluminum in vaccines can trigger neuron death and motor and memory deficits such as those seen in Gulf War syndrome.35 In addition, aluminum is a primary causative factor in dementia and Alzheimer’s disease.36\n\nThere is a significant correlation between the number of aluminum-containing vaccines children receive and the rate of autism spectrum disorder (ASD). Western countries that mandate the most aluminum-adjuvant-containing vaccines for preschool children have the highest rates of autism.37 World-renowned aluminum expert Dr. Christopher Exley, PhD, conducted autopsy studies in 2017 in which he found some of the highest-ever-recorded quantities of aluminum in the brains of autistic individuals, some of whom were in their twenties or younger when they died.38 Exley’s findings have shocking implications for today’s generation of children who receive five thousand micrograms of aluminum in vaccines by eighteen months, and over five thousand additional micrograms if they receive all recommended boosters as well as the HPV and meningitis vaccines.\n\nIn addition to the long list of toxic vaccine ingredients, some “live virus” vaccines use aborted fetal cell lines in the manufacturing process. The measles-mumps-rubella (MMR), chickenpox and shingles vaccines are grown in cell lines that include WI-38 (cell cultures from a female fetus aborted in 1964) and MRC-5 (cell cultures from a fourteen-week male fetus aborted in 1966). Using these cell lines to grow vaccines poses ethical and religious concerns for many people. The method also may be dangerous. For example, research points to a causal relationship between human-DNA-containing cell lines and autism prevalence.39\n\nThe four most widely used Covid-19 shots across the globe—Pfizer/BioNTech, Moderna, Janssen/Johnson & Johnson (J&J) and Oxford/AstraZeneca—all used or use abortion-derived fetal cell lines during their research, development, production and/or testing stages. For example, the manufacturing process for Pfizer’s Covid-19 injection includes the use of the HEK293T human embryonic cell line.40 The J&J injections are grown in a continuous “immortalized” human embryotic cell line called PER.C6 derived from the abortion of a healthy eighteen-week-old fetus.\n\nThe mRNA Covid shots also contain dangerous ingredients like polysorbate 80 and polyethylene glycol (PEG), an immunogenic chemical compound associated with severe and potentially fatal allergic reactions.41 While no one seems to know exactly what is in the Covid injections, some batches have been found to contain metallic particles.42 The mRNA shots contain dangerous lipid nanoparticles, which can create a series of toxic reactions, including damage to DNA.41\n\nThe FDA granted EUA status to the experimental Covid-19 mRNA shots manufactured by Pfizer and Moderna in December 2020, doing the same for J&J’s shot in March 2021 and for the Novavax-manufactured shot in July 2022. As of August 31, 2022, a U.S. coronavirus vaccine tracker claimed that about 79 percent of the U.S. population had received at least one dose, with 68 percent of the population considered “fully vaccinated” and a third having received at least one booster dose.43\n\nHistorians will write about how the world administered these fast-tracked, experimental, DNA-altering jabs to billions of people without genuine evidence regarding efficacy or safety. Regarding efficacy, Dr. Joseph Mercola has written,44 “ Both Moderna and Pfizer/BioNTech’s clinical data failed to provide a multitude of crucial information, and the efficacy these companies boast is a fairytale.” Pfizer’s “fairytale” claim—that its Covid shot was 95 percent effective—referred to relative risk reduction, but made no mention of its absolute risk reduction, which amounted to less than 1 percent.45 Pfizer’s studies showed that two hundred fifty-six individuals would need to be vaccinated to reportedly prevent just one case of Covid-19; the remaining two hundred fifty-five individuals would experience no benefit, yet would risk succumbing to adverse side effects.46\n\nAlthough the entire premise behind the marketing and mandating of Covid shots—and subsequent vaccine passports—was that the jabs were necessary to protect others, Pfizer’s president of international developed markets, Janine Small, told the European Parliament in October 2022 that the company did not even examine this question before the mRNA jab’s rollout. When asked, Small told an incredulous parliamentarian, “No. We had to really move at the speed of science.”47 As the scandalized member of parliament commented afterward, “Millions of people worldwide felt forced to get vaccinated because of the myth that ‘you do it for others.’ Now this turned out to be a cheap lie.”\n\nCDC director Rochelle Walensky has made similar admissions, yet she steadfastly continues to recommend the injections, including boosters, reiterating the mantra that the shots prevent severe illness, hospitalization and death.48 In June 2022, however, a Lancet study49 inadvertently highlighted just the opposite, showing a “disturbing spike” in hospitalizations within weeks of the first dose.50 Critics argue that the Covid shots seem to be destroying “immune competence” and warn that “repeated booster shots can reliably be anticipated to amplify adverse effects.”51\n\nAccording to internist and biological warfare epidemiologist Dr. Meryl Nass, FDA and CDC granted manufacturers special permission to forgo human testing for the Covid booster shots, “bending the rules [and] creating a new regulatory playbook.”52 Internal emails obtained by Judicial Watch suggest the CDC pressured FDA to authorize the boosters without any clinical trials.53 Grandfathering all future Covid shots in this manner was such a blatant and reckless act of medical malfeasance that even famous vaccine apologist Dr. Paul Offit, as a member of the FDA’s advisory panel, voted against recommending the booster shots.54\n\nManufacturers of Covid jabs conducted no long-term safety testing, nor were any studies done on drug interactions, vaccine interactions, toxicity, toxicokinetics, genotoxicity, teratogenicity, carcinogenicity, effects on pregnant women, postnatal effects on mothers or newborns or effects on animal offspring.55 Yet, after less than a year, public health authorities went ahead and unleashed a technology they had never previously licensed in humans.\n\nBy the summer and early fall of 2021, hospitalizations and fatalities were spiking in the vaccinated, with a 31 percent increase in deaths across one hundred forty-five of the most vaccinated countries.56 In the UK, government data showed that “double vaccinated” individuals in certain age groups were three times more likely to die of “Covid” than unvaccinated individuals and twice as likely to be hospitalized.57 In the UK, up to 80 percent of hospital deaths labeled as “Covid” occurred among the vaccinated.58 Israel reported record numbers of hospitalizations, with 95 percent of those hospitalized for serious illness having been vaccinated.59 Australia witnessed similar patterns in hospitalizations and deaths after the country mandated the shots.59 Similar trends even occurred in Sweden, a country that refused to implement lockdowns or masking but nevertheless rolled out the shots; government data from September 2021 showed that 70 percent of deaths attributed to “Covid” were in “fully vaccinated” individuals.60\n\nManufacturers knew there was cause for concern from the outset. In Moderna’s Phase 1 trials, 80 percent of participants in the group who received a one-hundred-microgram dose suffered systemic side effects. After the second dose, 100 percent of participants experienced side effects, including high fever, chills, muscle pain and headaches. Despite these results, this is the dose Moderna chose to move forward with in later-phase trials. For both the Moderna and Pfizer injections, the later-phase trials showed high “grade 3” adverse events, defined as interfering with daily activity.61 Some participants reported severe reactions that required hospitalization and invasive treatment; others died.\n\nAn internal Pfizer document released by the FDA in March 2022 revealed that the company knew its injections were linked to an extremely high number of illnesses, injuries and deaths.62 In the first three months of the Covid-19 injection rollout, Pfizer received over forty-two thousand case reports capturing nearly one hundred fifty-nine thousand different adverse events, including over twelve hundred deaths. The average person (case) suffered from about four different symptoms,63 and one in thirty-five persons who reported adverse events died.64\n\nApproximately ten million individuals have reported to V-safe, a smartphone-based CDC app for which individuals who got Covid shots were encouraged to register; on average, seven adverse symptoms have been reported per V-safe registrant.65 More than 7.7 percent (nearly eight hundred thousand individuals) “had a health event requiring medical attention, emergency room intervention, and/or hospitalization.” According to an analysis of VAERS data, the adverse events most often reported following Covid “vaccination” have been irregular menstruation, blood clots, inflammation and cardiovascular and neurological damage.66\n\nCDC released the V-safe data only after extensive “legal wrangling” by the Informed Consent Action Network (ICAN) and a court order to produce the data.65 New evidence suggests the CDC also has been hiding cancer deaths caused by Covid shots. Analysis of weekly morbidity and mortality data shows that CDC has been mislabeling cancer deaths as Covid deaths since April 2021, probably to mask the explosion in cancer signals.67 The Defense Medical Epidemiology Database also revealed a tripling of cancer rates among military personnel and their families who had received the jabs—until manipulation of the database made the signal disappear. Pathologist Dr. Ryan Cole reports seeing a twenty-fold increase in cancer in vaccinated individuals, including endometrial cancer and melanomas.68\n\nDeaths caused by the Covid shots are being disguised or hidden in other ways, too. For example, when European pathologists examined the bodies of fifteen people who died after Covid “vaccination,” they concluded that the shots had caused fourteen of the deaths, but the coroner did not implicate the “vaccine” in any of the deaths.69 In the U.S., the FDA is refusing to cooperate with a Freedom of Information Act request for autopsy reports of individuals whose deaths were reported to VAERS following Covid “vaccination.”70 Meanwhile, since 2021, the death rate for Americans under forty-five years of age—and, even more worryingly, for those under age twenty-five—has been soaring.71\n\nGOING AFTER THE CHILDREN\n\nIn late October 2021, the FDA authorized Pfizer’s Covid-19 injection on an emergency basis for children five to eleven years old, doing so even after the agency noted “increased risks of myocarditis (inflammation of the heart muscle) and pericarditis (inflammation of tissue surrounding the heart) following vaccination with Pfizer/BioNTech COVID-19 Vaccine, particularly following the second dose, and with the observed risk highest in males 12 through 17 years of age.”72 The CDC’s Advisory Committee on Immunization Practices (ACIP) followed up right away with a unanimous endorsement.73 In June 2022, FDA authorized the deadly shots for babies as young as six months of age,74 allowing doctors to administer Covid shots concurrently with other childhood vaccines despite the lack of any studies showing it is safe to do so.\n\nStill worse, ACIP voted fifteen-to-zero in October 2022 to add the Covid jabs to the Childhood and Adolescent Immunization Schedule to be rolled out in February 2023—the first time such a recommendation has been made for an EUA “vaccine.” The recommendation includes the Moderna and Pfizer shots for children as young as six months, and the Novavax shot for children as young as twelve. In response, CHD’s Kennedy said: “This reckless action is final proof of the cynicism, corruption, and capture of a once exemplary public health agency. ACIP members have again demonstrated that fealty to their pharma overlords eclipses any residual concerns they may harbor for child welfare or public health.” Kennedy then added, “This is an act of child abuse on a massive scale.”75\n\nAs of mid-October, VAERS had received nearly forty-three hundred adverse event reports related to the Covid shots for children under age five, including seven deaths.75 For children between the ages of five and eleven, almost fifteen thousand adverse events had been reported, including twenty-nine deaths.\n\nOrdinarily, placing shots on the childhood vaccine schedule ensures manufacturer protection from liability under the compensation program established by the 1986 Act. However, ACIP specified that the EUA Covid shots (as well as a newly added pneumococcal polysaccharide jab) would not be covered under the NVICP. Instead, they will remain covered by the Countermeasures Injury Compensation Program (CICP)—an intentionally dysfunctional program that as of November 1 had only approved—but not yet compensated—nine Covid-shot-related claims.76\n\nScientists have been exploring the potential for “self-spreading” or “transmissible” vaccines for some time,77 waxing enthusiastic about their potential to “dramatically increase vaccine coverage in human. . . populations without requiring each individual to be inoculated.”78 Although it is not currently possible to know whether the Covid injections include some form of technology intended to be “self-spreading,” the fact is that people who haven’t received any shots but have close contact with “vaccinated” individuals have reported symptoms suggestive of some kind of “shedding” effect.79\n\nPfizer’s own clinical trial protocol acknowledged the possibility of exposure via inhalation or skin contact.80 In addition, evidence points to the potential for Covid “vaccine” material to get passed on via body fluids. An autopsy report of a Covid-19-injected person revealed trillions of copies of spike protein in every organ system, including the salivary glands.81 And a September 2022 research letter published in JAMA Pediatrics reported mRNA from the Covid shots in breast milk for up to forty-eight hours post-jab.82,83 The JAMA authors speculated that “lipid nanoparticles containing the vaccine mRNA are carried to mammary glands” via the blood or the lymphatic system.\n\nMORE OF THE SAME—OR WORSE\n\nOccasionally, the flaws in the vaccine program rise to the surface enough to force vaccine manufacturers to withdraw their products—although officials remain willfully blind to the historically unprecedented damage caused by the Covid shots. In the past, a number of vaccines have been pulled from the U.S. market, including vaccines against smallpox, swine flu, diphtheria-tetanus-pertussis (DTP), MMR and polio, among others.84 Nevertheless, the vaccine gravy train keeps on rolling, with ever more ambitious targets. Currently, both Pfizer and Moderna are working on mRNA-based flu shots.85,86 The same two companies plus others also have more mRNA and other shots within their sights for infants and pregnant women.87-89\n\nIn September 2022, President Biden signed an executive order (EO) focused on “advancing biotechnology and biomanufacturing innovation for a sustainable, safe, and secure American bioeconomy.”90 The EO calls for the development of “genetic engineering technologies and techniques to be able to write circuitry for cells and predictably program biology in the same way in which we write software and program computers.” It also delineates plans to “unlock the power of biological data” using “computing tools and artificial intelligence.” Developments in the vaccine industry—ncreasingly transitioning toward biotech-reliant biopharmaceuticals91—are consistent with this ominous government and industry vision of humans as programmable biology.\n\nWe might go back to 1796 and Dr. Jenner’s “successful” cowpox vaccination program and ask ourselves where we are today with vaccination having become the sacred cow of scientism—and a tool for tyranny. We cannot overlook the overwhelming and heartbreaking number of children and adults who have been injured and killed by vaccines both old and new. How many more people must be injured and lives lost before we find our way to a new medical paradigm?\n\nWith their nearly unique liability-free status, vaccines also raise vital questions of accountability. The parties responsible for deliberate and systemic efforts to hide the truth about vaccination’s damaging consequences should be prosecuted and held accountable in a court of law. Those who are knowingly pushing fake narratives about the Covid injections—and openly sacrificing our youngest children—should be jailed for life, with their wealth used as reparations for those whose lives they have ruined. And “amnesty” should be refused to those who are now pleading for it—because the same perpetrators, if granted forgiveness, will continue to commit crimes: enacting endless states of emergency to amass power; mandating useless testing; masking children; imposing economically devastating lockdowns and quarantines; keeping relatives away from hospitalized loved ones; and engineering increased central control through vaccine passports and digital IDs.92 (For information about the control agenda, see my article, “Covid-19 Injections and the Global Control Grid—Just Say No” in Wise Traditions, Spring 2022.93) For the sake of our children, we must stop tolerating shoddy science, censorship and the wasting of billions of tax dollars on deadly treatments and “vaccines” that kill.\n\nCountless parents of autistic children can attest that their children were perfectly healthy before going to the pediatrician’s office to be vaccinated. One of the biggest ongoing frauds has to do with the CDC’s assertion that the vaccine-autism link has been thoroughly studied and the denial of any correlation between the two. These claims largely rely on sixteen industry-funded studies that considered only one vaccine (MMR) and one vaccine ingredient (mercury-containing thimerosal). Against this handful of epidemiological studies meant to disprove the vaccine-autism hypothesis, there are now at least one hundred sixty independent research papers that support a link.94 Senior CDC scientist Dr. William Thompson helped blow the whistle on the government’s fraudulent claims of vaccine safety when he exposed the fact that CDC withheld data in a 2004 study—one of the sixteen—with the express intention of misleading the public about the vaccine-autism link. The manipulated study showed that the risk of autism was 340 percent higher for African American boys who got the MMR vaccine before age three.95 Thompson confessed to Dr. Brian Hooker that he and his colleagues had been instructed to destroy documents, but because he believed discarding the reports was illegal, he privately kept hard copies and later turned over some ten thousand CDC files to Congressman Bill Posey.96 Thompson’s documents proved that for twelve years, the CDC had been covering up vaccine injury, including brain, central nervous system and immune system damage caused by toxins used as preservatives, emulsifiers and adjuvants in childhood vaccines. The CDC has refused to allow Thompson to testify in court.\n\nBefore the rollout of the experimental Covid shots, children received seventy-two doses of sixteen different vaccines by age eighteen.97 Fifty-three of those vaccines are administered before age six, making the U.S. vaccine schedule one of the most aggressive in the world.98 The number of vaccines recommended for children has tripled since 1980—and with the increase has come skyrocketing childhood disease and disability. As of more than a decade ago, upwards of 54 percent of American children suffer from one or more chronic illness.99 One in twelve children is disabled due to a chronic illness, and one in four takes routine medication.6 Statistics on specific conditions provide an equally dismal portrait:100\n• As of 2010, one in two American adolescents (49.5 percent) had been diagnosed with at least one type of mental disorder (anxiety, behavior, mood or substance use disorders).101\n• One in six children (17 percent) in the U.S. has at least one developmental disability or developmental delay.102\n• One in seven children (15 percent) has eczema.103\n• One in seven students ages three to twenty-one (15 percent) receives special education services.104\n• One in ten children (10 percent) has asthma.105\n• About one in ten children has been diagnosed with attention-deficit/hyperactivity disorder (ADHD).106\n• One in thirteen (8 percent) has at least one food allergy.107\n• One in twenty (5 percent) children under five has a seizure disorder.108\n• An estimated one in twenty-nine children (3.5 percent) ages three to seventeen had been diagnosed with autism spectrum disorder (ASD) as of 2020, with a reported 53 percent increase in ASD in children since 2017.109\n• Roughly one in every two hundred eighty-five children will receive a cancer diagnosis before they turn twenty.110\n\nWhile vaccines are not the sole reason for these abysmal statistics, studies show that developed nations that require the most vaccines tend to have the worst infant mortality rates. Thirty-three nations have better infant mortality rates than ours.111 No government studies have ever compared the health of fully vaccinated children to unvaccinated children, but independent studies show that unvaccinated children are far healthier.112,113 One groundbreaking study of homeschooled children found that partially or fully vaccinated children had significantly higher odds of developing chronic illnesses, eczema, neurodevelopmental disorders, autism, attention-deficit/hyperactivity disorder and learning disabilities.114\n\nIncreasingly, honorable doctors are pressured to keep silent if they have dissenting professional opinions about the Covid injections. In California, it is now illegal for doctors to communicate what authorities deem Covid-19 “misinformation” to their patients;115 Children’s Health Defense is mounting a legal challenge. Information technology companies and the media also have worked together to censor doctors and medical experts who oppose and challenge the official Covid-19 narrative. A recent study published in the sociological journal Minerva found those who dared to speak out were hit with lawsuits, revocation of medical licenses, dismissal by employers, retraction of scientific papers and more.116\n• History of smallpox. Centers for Disease Control and Prevention, last reviewed Feb. 20, 2021.https://www.cdc.gov/smallpox/history/history.html\n• Miller NZ. Vaccines: Are They Really Safe & Effective? Santa Fe, NM: New Atlantean Press, 2006, pp. 76-80.\n• Ten threats to global health in 2019. World Health Organization, n.d.\n• Margulis J. A new book exposes hard truths about vaccines. The Epoch Times, Sep. 21, 2022.\n• Exley C. Aluminium-based adjuvants should not be used as placebos in clinical trials. Vaccine. 2011;29(50):9289.\n• Anonymous. Turtles All the Way Down: Vaccine Science and Myth (Zoey O’Toole and Mary Holland, Eds.). The Turtles Team, 2022.\n• Gardasil and HPV infection: get the facts. National Vaccine Information Center, Feb. 21, 2007.\n• Angell M. Drug companies & doctors: a story of corruption. The New York Review, Jan. 15, 2009.\n• Lazarus R, Klompas M. Electronic Support for Public Health—Vaccine Adverse Event Reporting System (ESP:VAERS). Harvard Pilgrim Health Care,Inc., 12/01/07 – 09/30/10. Final report submitted to the Agency for Healthcare Research and Quality.\n• Overview of the National Childhood Vaccine Injury Act of 1986. National Vaccine Information Center, n.d.\n• Tapscott M. Nonprofit watchdog uncovers $350 million in secret payments to Fauci, Collins, others at NIH. The Epoch Times, May 9, 2022.\n• Children’s Health Defense. The FDA, CDC, media and politicians receive money from vaccine makers. Vaccine Secrets, Chapter 18, n.d.\n• Taylor G. Examining RFK Jr.’s claim that the CDC “owns over 20 vaccine patents.” GreenMedInfo, Jan. 17, 2017.\n• Burdick S. Megyn Kelly interviews RFK, Jr.: How Pfizer killed the vaccine safety commission. The Defender, Oct. 27, 2022.\n• Goldman GS. Comparison of VAERS fetal-loss reports during three consecutive influenza seasons: was there a synergistic fetal toxicity associated with the two-vaccine 2009/2010 season? Hum Exp Toxicol. 2013;32(5):464-475.\n• Miller NZ. Combining childhood vaccines at one visit is not safe. Journal of American Physicians and Surgeons. 2016;21(2):47-49.\n• Goldman GS, Miller NZ. Relative trends in hospitalizations and mortality among infants by the number of vaccine doses and age, based on the Vaccine Adverse Event Reporting System (VAERS), 1990–2010. Hum Exp Toxicol. 2012;31(10):1012-1021.\n• Kuntz T. Dare to Question: One Parent to Another. CreateSpace Publishing, 2018.\n• Children’s Health Defense. The Sickest Generation: The Facts Behind the Children’s Health Crisis and Why It Needs to End [eBook]. September 2018.\n• Kennedy RF Jr. The ongoing thimerosal travesty needs to end. Wise Traditions. Spring 2018;19(1):29-35.\n• Thimerosal and vaccines. Centers for Disease Control and Prevention, last reviewed Aug. 25, 2020.\n• Mercola J. Aluminum in vaccines linked to 36% higher risk of asthma. The Defender, Oct. 24, 2022.\n• Aluminium DOES cause Alzheimer’s: Expert says new findings confirm the metal plays a role in the devastating brain disease. Daily Mail, Dec. 19, 2016.\n• Shaw CA, Tomljenovic L. Aluminum in the central nervous system (CNS): toxicity in human and animals, vaccine adjuvants, and autoimmunity. Immunol Res. 2013;56(2-3):304-316.\n• High aluminum found in autism brain tissue. Children’s Health Defense, Nov. 28, 2017.\n\n 39. Deisher TA, Doan NV, Koyama K, Bwabye S. Epidemiologic and molecular relationship between vaccine manufacture and autism spectrum disorder prevalence. Issues in Law & Medicine. 2015;30(1):47-70.\n• Swift R, O’donnell C. Moderna to recall COVID-19 doses in Japan after stainless steel contaminants found. Reuters, Sep. 1, 2021.\n• Mercola J, Cummins R. The Truth About COVID-19: Exposing The Great Reset, Lockdowns, Vaccine Passports, and the New Normal. White River Junction, VT: Chelsea Green Publishing, 2021.\n• Doshi P. Peter Doshi: Pfizer and Moderna’s “95% effective” vaccines—let’s be cautious and first see the full data. BMJ Opinion, Nov. 26, 2020.\n• Cunningham AS. COVID-19 vaccine candidate is unimpressive: NNTV is around 256. Nov. 13, 2020 comment on Elisabeth Mahase, Covid-19: Vaccine candidate may be more than 90% effective, interim results indicate. BMJ. 2020;371:m4347.\n• Chung F. Pfizer did not know whether Covid vaccine stopped transmission before rollout, executive admits. News.com.au, Oct. 13, 2022.\n• Berenson A. No, the vaccines never worked all that well against severe Covid. Unreported Truths, Substack, Sep. 23, 2022.\n• Peirnas C, Patone M, Astbury NM, et al. Associations of BMI with COVID-19 vaccine uptake, vaccine effectiveness, and risk of severe COVID-19 outcomes after vaccination in England: a population-based cohort study. Lancet. 2022;10(8):571-580.\n• Nass M. Rapid rollout of new COVID boosters with no human trials—“a tale of recklessness.” The Defender, Sep. 6, 2022.\n• Stieber Z. Bombshell emails: CDC pressured FDA to authorize COVID boosters without clinical trials. The Defender, Oct. 27, 2022.\n• Burdick S. CDC, FDA are deliberately “breaking the law,” Dr. Meryl Nass tells RFK, Jr. The Defender, Nov. 4, 2022.\n• Beattie K. Worldwide Bayesian causal impact analysis of vaccine administration on deaths and cases associated with COVID-19: a BigData analysis of 145 countries. ResearchGate, November 2021.\n• Official government data suggests the fully vaccinated are suffering antibody-dependent enhancement; and the newly published Pfizer documents prove Pfizer & the FDA knew it would happen. The Exposé, Apr. 3, 2022.\n• Johnson LD. UK hospital data shocks the world: 80% of COVID deaths are among the vaccinated. . . COVID deaths up 3,000% after vaccine wave. Newstarget, Sep. 28, 2021.\n• Wolfe R. “Fully vaccinated” were the majority of COVID deaths in Sweden, UK in September. LifeSiteNews, Oct. 20, 2021.\n• Kirsch S. New VAERS analysis reveals hundreds of serious adverse events that the CDC and FDA never told us about. Steve Kirsch’s newsletter, Substack, Nov. 9, 2021.\n• Mercola J. How cancer deaths from the COVID jabs are being hidden. The Epoch Times, Oct. 14, 2022.\n• UK report shows immune systems are failing at a rate of 5% a week. https://www.brighteon.com/bfaeb7a9-ea86-4be8-97f6-70b30fe9c426\n• Kirsch S. Bhakdi/Burkhardt pathology results show 93% of people who died after being vaccinated were killed by the vaccine. Steve Kirsch’s newsletter, Substack, Dec. 28, 2021.\n• Cáceres M. FDA withholds autopsy results of those who died after COVID shots. The Vaccine Reaction, Oct. 9, 2022.\n• TVR staff. FDA, CDC green light Pfizer’s experimental COVID biologic for children 5 to 11 years old. The Vaccine Reaction, Nov. 7, 2021.\n• Associated Press. CDC gives final approval for Pfizer’s COVID shot for kids 5-11. MarketWatch, Nov. 2, 2021.\n• Coronavirus (COVID-19) update: FDA authorizes Moderna and Pfizer-BioNTech COVID-19 vaccines for children down to 6 months of age. U.S. Food and Drug Administration, Jun. 17, 2022.\n• Burdick S. “Child abuse on a massive scale”: CDC advisers recommend adding COVID vaccines to childhood schedule. The Defender, Oct. 20, 2022.\n• Children’s Health Defense Team. “Self-spreading” vaccines pose multiple risks to society—including the end of informed consent. The Defender, Jun. 2, 2021.\n• Watson C, Sell TK, Watson M, et al. Technologies to Address Global Catastrophic Biological\n• Hansen T, Titze U, Kulamadayil-Heidenreich NSA, et al. First case of postmortem study in a patient vaccinated against SARS-CoV-2. Int J Infect Dis. 2021;107:172-175.\n• Hanna N, Heffes-Doon A, Lin X, et al. Detection of messenger RNA COVID-19 vaccines in human breast milk. JAMA Pediatr. 2022 Sep 26;e223581.\n• Moderna announces first participants dosed in phase 3 study of seasonal influenza vaccine candidate (mRNA-1010). Moderna, Jun. 7, 2022.\n• Children’s Health Defense Team. Pfizer works to fast-track more vaccines for pregnant moms, despite mounting evidence rushed COVID shots harmed babies. The Defender, Nov. 9, 2022.\n• Nevradakis M. First RSV emergency declared as Pfizer and GSK race to get vaccines approved. The Defender, Nov. 8, 2022.\n• Children’s Health Defense Team. Big pharma eyes next childhood vaccine cash cow—mRNA vaccines for RSV. The Defender, Aug. 19, 2021.\n• Executive order on advancing biotechnology and biomanufacturing innovation for a sustainable, safe, and secure American bioeconomy. The White House, Sep. 12, 2022.\n• Children’s Health Defense Team. A “vaccinepalooza” is underway, thanks to COVID—but will public accept endless jabs? The Defender, Jul. 12, 2022.\n• Teller M. Parsing the digital identity agenda—or, why QR codes are not your friend. Wise Traditions. Summer 2022;23(2):44-49.\n• Nelson K. Covid-19 injections and the global control grid—just say no. Wise Traditions. Spring 2022;23(1):83-92.\n• Kristen K. Japan leads the way: no vaccine mandates and no MMR vaccine = healthier children. Children’s Health Defense, Apr. 23, 2019.\n• Bethell CD, Kogan MD, Strickland BB, et al. A national and state profile of leading health problems and health care quality for US children: key insurance disparities and across-state variations. Acad Pediatr. 2011;11(3 Supple):S22-33.\n• Kennedy RF Jr. 10 facts every parent needs to know about vaccinations. Children’s Health Defense, Feb. 28, 2020.\n• Merikangas KR, He JP, Burstein M, et al. Lifetime prevalence of mental disorders in US adolescents: results from the National Comorbidity Study-Adolescent Supplement (NCS-A). J Am Acad Child Adolesc Psychiatry. 2010;49(10):980-989.\n• Fluegge M. Vaccines blamed for alarming increase in seizure disorders among children. Vactruth, Ju. 25, 2016.\n• Burdick S. 1 in 30 U.S. kids diagnosed with autism in 2020—what’s behind the surge? The Defender, Jul. 14, 2022.\n• Miller NZ, Goldman GS. Infant mortality rates regressed against number of vaccine doses routinely given: is there a biochemical or synergistic toxicity? Hum Exp Toxicol. 2011;30(9):1420-1428.\n• Mawson AR, Ray BD, Bhuiyan AR, et al. Pilot comparative study on the health of vaccinated and unvaccinated 6- to 12-year old U.S. children. J Transl Sci 3: DOI: 10.15761/JTS.1000186.\n• Zinberg J. California makes it illegal for doctors to disagree with politicians. New York Post, Oct. 10, 2022.\n• Shir-Raz Y, Elisha E, Martin B, et al. Censorship and suppression of Covid-19 heterodoxy: tactics and counter-tactics. Minerva. 2022 Nov 1;1-27.\n\nThis article appeared in Wise Traditions in Food, Farming and the Healing Arts, the quarterly journal of the Weston A. Price Foundation, Winter 2022", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccines—Unsafe Since The Very Beginning", "description": "history of vaccines, aluminum-containing vaccines children receive and the rate of autism spectrum disorder (ASD), vaccine safety concerns", "url": "https://www.westonaprice.org/health-topics/vaccines-unsafe-since-the-very-beginning/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:modified_time": "2023-03-13T19:09:25+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.phe.gov/Preparedness/legal/prepact/Pages/default.aspx", "https://www.westonaprice.org/journal-winter-2022-optimal-hormonal-development/#gsc.tab=0", "javascript:window.print()"], "authors": [], "publish_date": "February 10, 2023"}