{"result_id": "339002", "URL": "https://www.westonaprice.org/support-three-important-vaccine-bills-in-rhode-island/", "timestamp": "2023-04-25 18:10:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-three-important-vaccine-bills-in-rhode-island/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support three important vaccine bills in Rhode Island!", "cleaned_text": "Speak up for three good bills in the Rhode Island legislature that would prohibit Covid-19 shot and other vaccine mandates and discrimination.\n\nH 5884 would prohibit discriminationbased on vaccination status with regard to employment, public accommodations, and credit. This bill also prohibits the Governor from ordering any type of vaccine during an emergency.\n\nH 5916 would prohibit government entities from implementing or enforcing Covid-19 shot mandates. This bill also requires the Attorney General to investigate violations and provides for a penalty.\n\nH 5565 would prohibit discrimination based on Covid-19 shots in employment, public accommodations, and lending.\n\nIn addition, any public or private employer who discharged, terminated, penalized or otherwise discriminated against any former or current employee as a result of the individual’s refusal to receive a Covid injection or provide proof of Covid “vaccination,” shall, upon the effective date of this subsection, immediately offer the employee reinstatement to their former position and/or reinstate any benefits, vacation pay, personal time, paid time off, or other benefits that the employee lost as a result of the employer’s actions in discharging, terminating or penalizing the employee.\n\nThis bill also prohibits the Governor from issuing an executive order mandating Covid shots or punishing those who refuse.(A better solution would be to prohibit discrimination based on any vaccine, not just Covid vaccines, but this bill would still help.)\n\nEvery person has the right to bodily autonomy – especially when science clearly demonstrates that unvaccinated people do not pose a risk to others.\n\nPlease speak up! We need YOUR voice to help pass bills H 5884, H 5916 and H5565 today!\n\n1) Contact your Rhode Island State Representative and ask him/her to SUPPORT H 5884, H 5916 and H 5565. A list of the House members with their email addresses and phone numbers is shown at:\n\nYou can look up who represents you here: https://vote.sos.ri.gov/Home/PollingPlaces?ActiveFlag=3\n\n2) Contact members of the House Judiciary Committee asking them to move the bills forward. Phone numbers for each are listed at the end under House Committee Members; many of them are already sponsors of H5884 and/or H5916.\n\nYou may copy/paste the following block to email the full committee:\n\nCalls are more effective than emails and only take a few minutes. Below is a Sample Script along with additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“Hi, my name is ____, and I am a constituent. I am asking Representative ____ to support H 5884, H 5916 and H5565, which would prohibit Covid-19 shots and other vaccine mandates and discrimination against people in Rhode Island.\n\nThese bills are especially important to ensure people are not discriminated against for choosing not to receive fast-tracked Covid-19 injections.\n\nThere have been no long-term studies on the safety of these shots. People should not be forced to be injected with an experimental substance that could cause serious side effects. As of 3/3/23, 2,439,553 injuries and 34,455 deaths were reported in connection with the Covid shots to the CDC’s Vaccine Adverse Events Reporting System (VAERS) — and it is estimated that only 1-10 percent of adverse reactions are ever reported. And yet the manufacturers are shielded from liability for any harm they cause.\n\nVaccine mandates are being justified by the idea of the “greater good” and protecting other people. But no individual should be forced to take a medical treatment for someone else’s benefit.\n\nIf Covid-19 injections are mandated many people will be forced to take the shot against their will. Many individuals have already suffered bad reactions with the first dose or have already recovered from the disease and thus have natural immunity.\n\nI urge Representative _____to SUPPORT H 5884, H 5916 and H5565, which would protect people’s rights to bodily autonomy, protect against discrimination, and even offer benefits to employees previously terminated for refusing a Covid shot.”\n• Share why this is personal to you. Do you have philosophical or religious beliefs that conflict with vaccination? Have you or someone you know had a vaccine reaction?\n• No one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• Data from 145 of the most vaccinated countries show that Covid shots are associated with a 31 percent increase in deaths.\n• The mRNA Covid shots include polyethylene glycol (PEG), an immunogenic chemical compound associated with severe allergic reactions that can lead to death.\n• Some Covid shot batches have been found to contain metallic particles, and all mRNA shots contain dangerous lipid nanoparticles, which can create a series of toxic reactions, including damage to DNA.\n• Manufacturers originally claimed their Covid shots were 95 percent effective. The Director of the CDC now admits Covid shots do not prevent Covid. For this reason alone, people should not be forced to submit to the injections. https://edition.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/h_d2accec79fdc37f422d02c536828ea1e\n• Covid shot manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 vaccines is the Countermeasures Injury Compensation Program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medical expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000 per year, and there is no judicial appeal. In other words, the victims will be severely under-compensated while the pharmaceutical companies get rich. https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx\n• There have already been 2,439,553 COVID-19 Vaccine adverse events and 34,455 COVID-19 vaccine deaths reported in the U.S. to the Vaccine Adverse Events Reporting System (per data released 3/3/23).\n• There are no long-term studies of Covid-19 shots on the safety, genotoxicity, carcinogenicity, or effect on reproduction.\n• COVID injections were not properly tested and are dangerous, as confirmed by Pfizer’s own documents.\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising [1,2]. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations [3].\n\nView the text, status, and history of the bills click here and enter the bill number: https://status.rilegislature.gov\n\nA more user-friendly website that tracks legislation for all states is LegiScan.com –\n\nRead these articles for more information on the dangers of Covid shots:\n\nRead this new article on the lack of safety for all vaccines: https://www.westonaprice.org/health-topics/vaccines-unsafe-since-the-very-beginning/#gsc.tab=0\n\nHouse Judiciary Committee Members are listed below as found at this link\n\nMany of the committee members are noted below as sponsors of H5884 and/or H5916; so after sending an email to all, follow-up calls to the others would be best use of your time.", "opengraph": {"locale": "en_US", "type": "article", "title": "Support three important vaccine bills in Rhode Island!", "description": "🖨️ Print post Speak up for three good bills in the Rhode Island legislature that would prohibit Covid-19 shot and other vaccine mandates and discrimination. H 5884 would […]", "url": "https://www.westonaprice.org/support-three-important-vaccine-bills-in-rhode-island/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-03-18T15:04:49+00:00", "article:modified_time": "2023-03-19T13:27:00+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://legiscan.com/RI/bill/H5884/2023", "https://legiscan.com/RI/bill/H5916/2023", "https://legiscan.com/RI/bill/H5565/2023", "http://webserver.rilegislature.gov/Email/RepEmailListDistrict.asp", "https://vote.sos.ri.gov/Home/PollingPlaces?ActiveFlag=3", "http://webserver.rilin.state.ri.us/ComMembers/ComMemr.asp?ComChoiceR=HJUD", "https://edition.cnn.com/us/live-news/coronavirus-pandemic-vaccine-updates-08-05-21/h_d2accec79fdc37f422d02c536828ea1e", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://www.medalerts.org/vaersdb/index.php", "https://www.medalerts.org/vaersdb/index.php", "https://www.medalerts.org/vaersdb/findfield.php", "https://www.medalerts.org/vaersdb/findfield.php", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5B%5D=COVID19&DIED=Yes", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5B%5D=COVID19&DIED=Yes", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/", "https://www.corp-research.org/merck", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "https://status.rilegislature.gov", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/", "https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/", "https://www.westonaprice.org/health-topics/vaccines-unsafe-since-the-very-beginning/#gsc.tab=0", "http://webserver.rilin.state.ri.us/ComMembers/ComMemr.asp?ComChoiceR=HJUD", "mailto:HouseJudiciary@rilegislature.gov", "mailto:rep-craven@rilegislature.gov", "mailto:rep-mcentee@rilegislature.gov", "mailto:rep-knight@rilegislature.gov", "mailto:rep-ajello@rilegislature.gov", "mailto:rep-batista@rilegislature.gov", "mailto:rep-bennett@rilegislature.gov", "mailto:rep-caldwell@rilegislature.gov", "mailto:rep-casimiro@rilegislature.gov", "mailto:rep-corvese@rilegislature.gov", "mailto:rep-cruz@rilegislature.gov", "mailto:rep-dawson@rilegislature.gov", "mailto:rep-felix@rilegislature.gov", "mailto:rep-noret@rilegislature.gov", "mailto:rep-place@rilegislature.gov", "mailto:rep-roberts@rilegislature.gov", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-03-18T15:04:49+00:00"}