{"result_id": "339037", "URL": "https://www.westonaprice.org/help-stop-a-dangerous-vaccine-bill-in-the-connecticut-legislature-2/", "timestamp": "2023-04-25 18:11:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/help-stop-a-dangerous-vaccine-bill-in-the-connecticut-legislature-2/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Help stop a dangerous vaccine bill in the Connecticut Legislature!", "cleaned_text": "Connecticut is considering a bill, House Bill 5480 (HB 5480), that would allow children to consent to vaccines without any notification to their parents.\n\nThis bill would amend current law that protects parental rights and rightfully requires a parent or guardian to consent to vaccination for their children.\n\nHB 5480 goes further than many similar bills by allowing minors to consent to any vaccines, not just those for sexually transmitted diseases.\n\nMedical practitioners and schools frequently put extreme pressure on parents to vaccinate their children. We have numerous reports of parents who decided to vaccinate because they felt coerced into doing so despite their concerns about the risks. When many adults can’t stand up to this pressure, it’s unfair and dangerous to allow children to be placed in the role of the decisionmaker.\n\nMedical practitioners, schools, and others should never be permitted to coerce impressionable minor children into a medical procedure that is capable of causing injury or death behind their parent’s backs.\n\nThe bill was introduced by Representative Kevin Ryan and was referred to the Joint Committee on Public Health on 1/17/2023.\n\nPlease help us today to stop HB 5480 today!\n\nContact your Connecticut State Representative today and ask him or her to OPPOSE H.B. 5480.\n\nYou can find out who represents you at: https://www.cga.ct.gov/asp/menu/cgafindleg.asp\n\nCalls are more effective than emails and only take a few minutes. Below is a Sample Script, and there are additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“Hi, my name is ____, and I am a constituent. I am calling to ask ____ to OPPOSE HB 5480.\n\nI oppose any legislation that would allow minors to consent to vaccines without parental consent.\n\nAs recognized by the U.S. Supreme Court, vaccines are pharmaceutical products that carry the risk of injury or death. It is irresponsible to allow children to make medical decisions that may injure or kill them without the knowledge of their parents.\n\nUnlike other procedures that are allowed in various states without parental consent, such as contraception or mental health services, vaccines are not typically something a minor seeks out – but rather something that medical practitioners and schools seek to push onto them. The risk of pressuring a child into a medical procedure that they don’t actually want is all too real with vaccinations.\n\nThe U.S. Federal Vaccine Injury Compensation Program has awarded nearly $4.9 billion dollars to vaccine victims.\n\nMinor children may not be aware of family medical histories and even their own history of vaccine reactions, which would be relevant to deciding if a particular vaccine’s risks outweigh the benefits.\n\nBe sure to explain why this issue is important to you. You may wish to use a couple of the Talking Points below. Don’t copy all of them –use them as ideas to help structure your own message.\n• A child may not know their personal or family medical history, including vaccine reactions, allergies, and autoimmune or neurological disorders, all of which contribute to the chances that they may have a serious reaction to a vaccine.\n• Children do not have the same kind of critical thinking skills or emotional maturity to make a vaccine benefit-risk decision as adults. Additionally, children and adolescents are vulnerable to authority-figure persuasion.\n• If a child consents to vaccination without their parent knowing and has a reaction, the parent may not recognize the reason for their child’s decline in health, and this lack of knowledge could be life-threatening for the child.\n• Share a personal story if you have relevant experience. Do you have a vaccine-injured child, and you weren’t told about the risks before vaccinating or were pressured into vaccinating despite your concerns about the risks? Do you have family members with medical conditions that would be relevant to assessing the risks, and your child doesn’t know the details?\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines without having to pay for any of the injuries or harm.\n• Vaccines are medical procedures that carry a risk of serious injury. Hundreds of thousands have reported an adverse reaction to vaccination to the Vaccine Adverse Event Reporting System (VAERS). The U.S. Government has paid out nearly $4.9 billion as of 2/1/2023 to the victims of vaccine injury, per VICP Data Reports [see link at https://www.hrsa.gov/vaccine-compensation/data]\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program (VICP) – presumably with little or no understanding of what that means. It is also much less likely that vaccine reactions will be recognized and connected to the vaccine by a child on their own; furthermore, it’s unlikely the child will file a report with the Vaccine Adverse Event Reporting System (VAERS).\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising [1,2]. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations [3].\n\nView the text, status, and history of the bill here:\n\nVaccine makers and the healthcare providers who administer them bear zero liability –", "opengraph": {"locale": "en_US", "type": "article", "title": "Help stop a dangerous vaccine bill in the Connecticut Legislature!", "description": "🖨️ Print post Connecticut is considering a bill, House Bill 5480 (HB 5480), that would allow children to consent to vaccines without any notification to their parents. This […]", "url": "https://www.westonaprice.org/help-stop-a-dangerous-vaccine-bill-in-the-connecticut-legislature-2/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-02-14T16:51:43+00:00", "article:modified_time": "2023-02-14T18:05:57+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.cga.ct.gov/asp/cgabillstatus/cgabillstatus.asp?selBillType=Bill&which_year=2023&bill_num=HB5480", "https://www.cga.ct.gov/asp/menu/cgafindleg.asp", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-02-01-23.pdf", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-02-01-23.pdf", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-02-01-23.pdf", "https://www.hrsa.gov/vaccine-compensation/data", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://vaers.hhs.gov/", "https://www.corp-research.org/merck", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "https://www.cga.ct.gov/asp/cgabillstatus/cgabillstatus.asp?selBillType=Bill&which_year=2023&bill_num=HB5480", "https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-02-01-23.pdf", "https://www.hrsa.gov/vaccine-compensation/data", "https://vaers.hhs.gov/", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-02-14T16:51:43+00:00"}