{"result_id": "339005", "URL": "https://www.westonaprice.org/support-4-important-vaccine-bills-in-missouri/", "timestamp": "2023-04-25 18:10:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-4-important-vaccine-bills-in-missouri/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support 4 Important Vaccine Bills In Missouri!", "cleaned_text": "This week we’d like to tell you about four Missouri bills that would specifically protect the rights of employees regarding COVID-19 vaccines.\n• S.B. 636 makes it unlawful for any employer to mandate COVID-19 vaccines.\n• S.B. 651 prohibits employers from mandating COVID-19 vaccines and creates a cause of action.\n• S.B. 693 and S. B. 702 allow COVID-19 mandates, but with certain exemptions.\n\nThere are several other good bills that have been filed – but these 4 are the focus right now because they are up for a hearing this week.\n\nThe introduction of these bills is good news – but they are unlikely to pass unless Missouri residents make your voices heard!\n• Show up and testify at the hearing. These four bills will be heard in the Missouri Senate Commerce, Consumer Protection, Energy and Environment Committee on Wednesday, February 9th at 8:30 AM.\n\nGo here to register as a witness for the committee hearing: https://www.senate.mo.gov/senatewitnesssystem/\n\nHere are instructions on how to register as a witness: https://www.senate.mo.gov/22info/WitnessSystemInstructions.pdf\n\nNote that while you can register online, you must be there in person to testify and be included in the official record.\n• Contact your State Senator and urge him or her to support these bills.\n\nYou can look up who represents you at: https://www.senate.mo.gov/LegisLookup/Default.aspx\n\nSample script for email or calls is below. Personalize it by adding your own sentences and/or changing the wording – personal letters are far more effective than form letters!\n\n“My name is ____ and I live in (town.) I am calling to ask Senator ___ to support four important vaccine bills – S.B. 636, S.B. 651, S.B. 693 and S.B. 702.\n\nS.B. 636 and S.B. 651 both prevent employers from mandating COVID-19 vaccines. S.B. 651 goes further and allows for civil action.\n\nS.B. 693 and S.B. 702 require employees who mandate COVID-19 vaccines to permit exemptions. These bills are a good start, although the better solution is to prohibit vaccine mandates entirely.\n\nI am particularly concerned about COVID-19 vaccine safety. To date over 747,000 people have reported adverse reactions and over 10,500 have died after the COVID vaccine – and many more have likely suffered reactions, since it is estimated that only between 1 and 10 percent of reactions are reported. And yet the manufactures are shielded from liability for any harm they cause.\n\nI urge Senator _____ to support these vaccine rights bills to safeguard employees, especially S.B. 636 and S.B. 651.\n\nKeep your call or email short! Pick the 2 or 3 talking points that are most important to you, and be sure to explain why this issue matters to you personally.\n• Share why this is personal to you. Do you or a family member have a history of vaccine reactions? Are you at risk for autoimmune conditions or other potential side effects of COVID-19 shots?\n• No one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• One of the most basic human rights is that of bodily autonomy, as recognized by the Nuremburg Code. Ethical medicine requires prior, completely voluntary, and fully informed consent.\n• Vaccines are medical procedures that carry risk of serious injury. The U.S. Supreme Court recognizes vaccines to be “unavoidably unsafe” and to cause injury and death in some recipients. The U.S. Government has paid out $4.4 billion to the victims of vaccine injury. Hundreds of thousands have reported an adverse reaction to vaccination to VAERS. http://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/\n• COVID-19 vaccine manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 shots is the Countermeasures Injury Compensation program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medial expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000, and there is no judicial appeal. In other words, the victims will be severely undercompensated while the pharmaceutical companies get rich.\n• The claimed justification for vaccine mandates– that unvaccinated individuals pose a health risk to others – has been shown to be false. Vaccinated individuals can become infected and transmit COVID to others.\n• COVID-19 vaccines carry the risk of injury and death for some so there must be informed consent and the right to refuse the vaccine without penalty. As of January 28th, there had already been 747,760 COVID-19 vaccine adverse events and 10,527 COVID-19 vaccine deaths in the U.S. reported to the Vaccine Adverse Events Reporting System.\n• Vaccine manufacturers such as Pfizer, Merck and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising.[i],[ii] Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations. [iii]", "opengraph": {"locale": "en_US", "type": "article", "title": "Support 4 Important Vaccine Bills In Missouri!", "description": "🖨️ Print post ACTION ALERT 2-8-22 Support 4 Important Vaccine Bills In Missouri! This week we’d like to tell you about four Missouri bills that would specifically protect […]", "url": "https://www.westonaprice.org/support-4-important-vaccine-bills-in-missouri/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2022-02-08T16:51:18+00:00", "article:modified_time": "2022-02-08T16:51:19+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.senate.mo.gov/senatewitnesssystem/", "https://www.senate.mo.gov/22info/WitnessSystemInstructions.pdf", "https://www.senate.mo.gov/LegisLookup/Default.aspx", "http://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/", "#_edn1", "#_edn2", "#_edn3", "https://www.senate.mo.gov/22info/BTS_Web/Bill.aspx?SessionType=R&BillID=71259709", "https://www.senate.mo.gov/22info/BTS_Web/Bill.aspx?SessionType=R&BillID=71259775", "https://www.senate.mo.gov/22info/BTS_Web/Bill.aspx?SessionType=R&BillID=71259879", "https://www.senate.mo.gov/22info/BTS_Web/Bill.aspx?SessionType=R&BillID=71259835", "#_ednref1", "http://www.corp-research.org/merck", "#_ednref2", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "#_ednref3", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-mar", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2022-02-08T16:51:18+00:00"}