{"result_id": "339020", "URL": "https://www.westonaprice.org/help-stop-a-terrible-vaccine-bill-in-the-d-c-legislature-2/", "timestamp": "2023-04-25 18:11:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/help-stop-a-terrible-vaccine-bill-in-the-d-c-legislature-2/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Help stop a terrible vaccine bill in the D.C. Legislature!", "cleaned_text": "The District of Columbia is about to pass a bill that would allow children to consent to vaccination without parental consent. Your immediate action is needed TODAY!\n\nB24-0942 would allow minors to consent to all vaccines recommended by the U.S. Advisory Committee on Immunization Practices (ACIP) after “a reasonable attempt to notify” parents/or legal guardians has been made.\n\nThis bill is EXTREMELY dangerous as many children may not know their personal and family medical history which could impact their risk of having a serious reaction to a vaccine. Moreover, parents may not know to get their children medical help if a vaccine reaction occurs.\n\nThe “Consent for Vaccinations of Minors Amendment Act of 2022” (B24-0942) is a regular version of the same bill that was previously introduced as “emergency” (See B24-0890) and “temporary” (See B24-0891) legislation. Unlike the emergency and temporary versions, this bill will undergo the normal legislative process for D.C. bills, and its provisions do not have an expiration date.\n\nB24-0942 repeals a law that went into effect in 2021 (Passed as bill B23-0171) which allowed minors 12 and older to consent to any ACIP-recommended vaccine without parental consent or knowledge and requires schools, providers, and insurance companies to conceal this information from parents (Subsection 600.9 of Title 22-B of the District of Columbia Municipal Regulations 51 (22-B DCMR § 600.9)). This law was challenged in court and in March 2022 the court issued a preliminary injunction prohibiting the law from taking effect.\n\nB24-0942 applies to any child in D.C. and does not require the child to reside in D.C., so visiting families will have children at risk of being vaccinated without parental consent if this bill passes.\n\nB24-0942 was passed by the DC Council in a final reading on 12/20/2022. It was transmitted to DC Mayor Muriel Bowser on 12/28/2022. Her response is due 1/12/2023.\n\nPlease help us stop this bill by asking Mayor Bowser to VETO it!\n\nTAKE IMMEDIATE ACTION if you live in DC:\n• Contact Mayor Bowser and ask her to VETO B24-0942. https://mayor.dc.gov/page/invite-mayor\n\nTAKE ACTION if you live in Virginia or Maryland\n\nSpread the word! Share this alert with people you know in the region so that more D.C. residents know about this dangerous bill.\n\n“Hi, my name is ____ and I am a constituent. I am calling to ask Mayor Bowser to VETO B24-0942.\n\nI oppose any legislation that would allow minors to consent to vaccines without parental consent after simply attempting to contact the parents.\n\nAs declared by the U.S. Supreme Court, vaccines are pharmaceutical products that carry risk of injury or death. It is irresponsible to allow children to make medical decisions that may injure or kill them without the knowledge of their parents.\n\nUnlike other procedures that are allowed without parental consent, such as contraception or mental health services, vaccines are not typically something a minor seeks out – but rather something that medical practitioners and schools seek to push onto them. The risk of pressuring a child into a medical procedure that they don’t want is all too real with vaccinations.\n\nThe U.S. Federal Vaccine Injury Compensation Program has awarded over 4.4 billion dollars to vaccine victims.\n\nMinor children may not be aware of family medical histories, and even their own young childhood history of vaccine reactions, which would be relevant to deciding if a particular vaccine’s risks outweigh the benefits.\n\nBe sure to explain why this issue is important to you. You may wish to use a couple of the talking points below. Don’t copy all of them – just use them as ideas to help structure your own message.\n• A child may not know their personal or family medical history, including vaccine reactions, allergies, and autoimmune or neurological disorders, all of which contribute to the chances that they may have a serious reaction to a vaccine.\n• Children do not have the same kind of critical thinking skills or emotional maturity to make a vaccine benefit-risk decision as adults. Additionally, children and adolescents are vulnerable to authority-figure persuasion.\n• If a child consents to vaccination without their parent knowing and has a reaction, the parent may not recognize the reason for their child’s decline in health, and this lack of knowledge could be life-threatening for the child.\n• Share a personal story if you have relevant experience. Do you have a vaccine-injured child, and you weren’t told about the risks before vaccinating or were pressured into vaccinating despite your concerns about the risks? Do you have family members with medical conditions that would be relevant to assessing the risks, and your child doesn’t know the details?\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines, without having to pay for any of the injuries or harm. https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates\n• The U.S. Supreme Court recognizes vaccines to be “unavoidably unsafe” and to cause injury and death in some recipients. The US Government has paid out more than $4.4 billion to the victims of vaccine injury. Hundreds of thousands have reported an adverse reaction to vaccination to VAERS. http://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program – presumably with little or no understanding of what that means. It is also much less likely that vaccine reactions will be recognized and connected to the vaccine by a child on their own; furthermore, it’s unlikely the child will file a report with the Vaccine Adverse Event Reporting System (VAERS).\n\nView the text, status, and history of the bill here: https://lims.dccouncil.us/Legislation/B24-0942?FromSearchResults=true", "opengraph": {"locale": "en_US", "type": "article", "title": "Help stop a terrible vaccine bill in the D.C. Legislature!", "description": "🖨️ Print post The District of Columbia is about to pass a bill that would allow children to consent to vaccination without parental consent.  Your immediate action is […]", "url": "https://www.westonaprice.org/help-stop-a-terrible-vaccine-bill-in-the-d-c-legislature-2/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-01-09T19:20:36+00:00", "article:modified_time": "2023-01-09T19:21:14+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://lims.dccouncil.us/Legislation/B24-0890?FromSearchResults=true", "https://lims.dccouncil.us/Legislation/B24-0891?FromSearchResults=true", "https://lims.dccouncil.us/Legislation/B23-0171?FromSearchResults=true", "https://code.dccouncil.us/us/dc/council/laws/23-193", "https://parentalrightsfoundation.org/wp-content/uploads/2022/03/Booth-DC-Memorandum-Opinion-18-Mar-22.pdf", "https://lims.dccouncil.us/Legislation/B24-0942?FromSearchResults=true", "https://mayor.dc.gov/page/invite-mayor", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates", "http://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://lims.dccouncil.us/Legislation/B24-0942?FromSearchResults=true", "https://lims.dccouncil.us/Legislation/B24-0890", "https://lims.dccouncil.us/Legislation/B24-0891", "https://lims.dccouncil.us/Legislation/B23-0171", "https://code.dccouncil.us/us/dc/council/laws/23-193", "https://parentalrightsfoundation.org/wp-content/uploads/2022/03/Booth-DC-Memorandum-Opinion-18-Mar-22.pdf", "https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates", "https://www.hrsa.gov/vaccine-compensation", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-01-09T19:20:36+00:00"}