{"result_id": "339049", "URL": "https://www.westonaprice.org/health-topics/vaccinations/chronic-disease-a-study-of-vaccinated-and-unvaccinated-children/", "timestamp": "2023-04-25 18:11:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/health-topics/vaccinations/chronic-disease-a-study-of-vaccinated-and-unvaccinated-children/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Chronic Disease: A Study of Vaccinated and Unvaccinated Children", "cleaned_text": "Chronic health conditions occur in more than half of American schoolchildren,1 with rising rates of allergies, asthma, ear infections, learning and behavioral issues and autism spectrum disorder, among others. The cause of these increasing health problems in our children is not clear. Vaccination has been both blamed and exonerated in this debate.2\n\nTo determine whether the burgeoning vaccine schedule has any association with the increase in chronic childhood disabilities, we undertook a preliminary fact-finding mission to assess the difference in health status between vaccinated and unvaccinated children. Further studies are planned.\n\nTHE STUDY\n\n The study sought to include families in which some of the children were fully or partially vaccinated, while other children in the same household were completely unvaccinated. We identified the families through flyers left in doctors’ offices and emails to home-school groups. We included any family that met the criteria and was willing to participate.\n\nMost of the participating families lived in Michigan, but there were also families from three other states (Virginia, Colorado and Indiana). The research team carried out conversations with the parents by telephone or in person, recording each child’s birth year and sex. In addition, the interviews gathered the following information for each child: whether the child was vaccinated according to the Centers for Disease Control and Prevention’s (CDC’s) vaccine recommendations for children born in that year; whether the family had modified the vaccine schedule in any way; and what chronic health conditions, if any, had arisen before age eighteen (see example in Table 1). We did not verify reported medical conditions from medical records.\n\nWe included participants with birth years spanning four decades (1970–2017) because we wanted to consider the impact on children’s health of the changes in the CDC vaccine schedule over time. Except those born in the 1970s and early 1980s when the number of required vaccines was fewer, very few participants were fully vaccinated, and no one had elected to receive the human papillomavirus (HPV) vaccine.3\n\nOVERVIEW OF RESULTS\n\n Thirty-five families—totaling two hundred children—participated in the project. One hundred and twenty-four children (62 percent) were fully or partially vaccinated, while the remaining seventy-six children (38 percent) were completely unvaccinated. A common trend within families was to vaccinate the first child or children and then vaccinate less and less, until finally abandoning vaccines altogether.\n\nWe considered four subgroups: “vaccinated-sick,” “vaccinated-healthy,” unvaccinated-sick” and “unvaccinated-healthy.” Over two-thirds (68 percent) of the vaccinated children fell into the “vaccinated-sick” group and were reported as having at least one chronic health condition diagnosed in childhood, compared to 20 percent of the unvaccinated children (Table 2). Fourteen of the eighty-four vaccinated children with health issues (17 percent) were fully vaccinated; seven of these were born before 1983, when fewer vaccines were on the CDC vaccine schedule. Forty vaccinated children had no chronic health complaints; most of these (90 percent) were partially rather than fully vaccinated.\n\nAmong the seventy-six unvaccinated children, the vast majority (80 percent) were healthy (Table 2), including some described as “super healthy kids.” In a few families, the parents reported that the unvaccinated children caught acute illnesses easily but always recovered completely. One-fifth of the unvaccinated children had some type of chronic health condition.\n\nMANY CHRONIC CONDITIONS\n\n Most of the children (both vaccinated and unvaccinated) who suffered from a chronic health condition had more than one chronic complaint but were living relatively “normal” lives, with the exception of the most severely autistic children. Allergies or food intolerances were the most common chronic complaints for vaccinated and unvaccinated children alike (Table 3). The parents of two vaccinated children described severe reactions to peanuts and tree nuts. There were many reports of difficulties tolerating gluten and dairy products among both the vaccinated and the unvaccinated. Several families of both vaccinated and unvaccinated children described what sounded like phenol intolerances, which are not uncommon in children with behavioral and attention problems and children on the autism spectrum. Some parents also reported allergies to inhalants such as pollens and petrochemicals. Allergies and intolerances of all kinds are associated with many other conditions, including attention deficit hyperactivity disorder (ADHD), asthma, otitis media (ear infections), digestive issues, autism and others.4-7\n\nIt can be difficult to distinguish between children with “behavioral disorders” and mildly affected children on the autism spectrum. For the purposes of our study, we used the diagnosis reported by the parent, even in cases where there may have been some diagnostic ambiguity. Based on these parental reports, behavioral, attention, and learning problems—including ADHD and dyslexia—comprised the second most common chronic category affecting vaccinated (16 percent) but not unvaccinated (1 percent) children. Most of the children with learning and behavioral issues had not been professionally evaluated.\n\nAutism spectrum disorders, reported for fifteen children in all, were potentially the most disabling condition of any reported. However, six of the children reported to be on the autism spectrum had relatively mild symptoms corresponding to Asperger’s syndrome rather than severe autism. As with the behavioral disorders, autism affected a larger proportion of vaccinated (10 percent) than unvaccinated (3 percent) children. (However, one vaccinated autistic child received his autism diagnosis before his delayed vaccinations.) Three families had more than one child on the autism spectrum. Among the children with autism, twelve of fifteen were boys, and six were the eldest child in the family.\n\nThe parents of autistic children described two distinct patterns of autism onset. In the first, the parent noticed a problem from birth or early on. For example, the parents of one vaccinated child noticed problems before any vaccination, having chosen to postpone the hepatitis B vaccine ordinarily administered at birth as per the CDC’s 1991 recommendation.8 Six more vaccinated children had abnormal behavior that parents noticed early in life following the hepatitis B vaccine. (One affected child was adopted, and the relevant information about when symptoms first occurred was not available.)\n\nIn the second pattern, reported for five children, a normally developing child regressed in speech and development, often between the ages of one and two, following vaccination. Four of the children who regressed into autism did so after receiving their measles-mumps-rubella (MMR) vaccine, and one regressed after his first set of vaccines at three months of age.\n\nParents of unvaccinated children reported varied but mostly minor conditions such as mild asthma, less severe migraines or allergies. Among the more serious conditions reported for unvaccinated children, one child had Down’s syndrome, another had contracted salmonella in infancy and two were on the autism spectrum— one with significant Asperger’s symptoms and another with a sensory processing disorder but otherwise high-functioning.\n\nIn one case, an unvaccinated child with a vaccinated autistic sibling had developed autistic mannerisms and regressed in speech after receiving an oral antibiotic; however, after his mother discontinued the medication, he returned to normal and was counted as a healthy unvaccinated child in this study.\n\nSUSCEPTIBILITY TO VACCINE INJURY\n\n We observed different patterns of vaccine response among the families in our sample. In ten families, each vaccinated child had a chronic health issue (“vaccinated-sick”), while each unvaccinated child was healthy (“unvaccinated-healthy”). However, several of the seemingly healthy children from these families experienced subsequent health challenges as adults after receiving vaccines required for travel or education. These families could be described as “vaccine-susceptible.” Individuals from such families would do well to approach future vaccines with caution.\n\nAnother group might be called “vaccine-tolerant.” In these families, one or more of the vaccinated children were healthy (“vaccinated-healthy”), and those with chronic conditions had milder complaints such as allergies, rather than more severe conditions such as an autoimmune disease or autism. Seven families met these criteria.\n\nAnother group comprised families—twelve in all—with unvaccinated children who nevertheless had health problems (“unvaccinatedsick”). A number of the parents in this group happened to mention that they had significant health problems of their own. While some parents reported good health, others suffered from cancer, autoimmune diseases, celiac or inflammatory bowel disease or Asperger’s disorder—or they reported past histories of alcoholism and eating disorders such as anorexia or bulimia. Five of the nine families with children on the autism spectrum were in this group, while the other four were in the “vaccine-susceptible” group.\n\nTHE VACCINE SCHEDULE\n\n In 1983, the CDC recommended twenty-three doses of seven vaccines for school and daycare attendance. In 1986, Congress passed the National Childhood Vaccine Injury Act, which virtually eliminated vaccine manufacturers’ liability for vaccine injuries9 and opened the floodgates for the addition of many more vaccines to the schedule,10 particularly around the year 1991. By 2017, many states were mandating sixty-nine doses of sixteen vaccines by age eighteen as per the CDC’s expanded recommendations.11\n\nFor comparison purposes, our study divided the participating families into three groups: eight families of forty-one children in which all of the vaccinated children were born before 1991; twenty-two families with one hundred and eight children in which all of the vaccinated children were born after 1991; and five families with fifty-one children born both before and after 1991 (not shown). This analysis indicated that while the percentage of children with chronic illness was similar across birth year groups, the frequency of specific conditions varied. In this small study, all but one of the children on the autism spectrum were born after 1991, as were the children with previously uncommon autoimmune conditions such as Crohn’s disease and Kawasaki syndrome.\n\nPRO-SAFETY\n\n It is important to state that none of the parents who participated in our study were initially opposed to vaccination. Nearly all of them began by following their pediatrician’s recommendations. Although a few refused the hepatitis B vaccine at birth or followed a delayed vaccination schedule, most observed the standard schedule. When asked why they had stopped vaccinating their children, parents’ most common answer was that they had begun to educate themselves about vaccine components and safety. Some described a case of autism in a family known to them, which that family had ascribed to a vaccine. Some had moral objections to using vaccines containing aborted fetal tissue. Finally, some reported severe and frightening reactions to vaccines in their older vaccinated children, even if the reactions turned out to be temporary.\n\nIn this small study, vaccines were associated with chronic health conditions, but it was also apparent that different children react differently to the same vaccines. More and larger studies comparing vaccinated and unvaccinated children are needed. In today’s legal climate, this is easier said than done. With fewer exemptions available in many states and more concerns about being harassed for not vaccinating, it is difficult to find parents willing to volunteer for and consent to participate in a study, particularly if it involves analysis of their children’s medical records.\n\nSome additional needed measures include research that would enable prediction of which children are most likely to react unfavorably to vaccination; these children, at a minimum, should have the option of modifying the vaccine schedule, delaying or spacing vaccines and/or being exempt from vaccination altogether.12 [Editor’s note: For a different perspective on what is needed, see Kendall Nelson’s article on vaccines and autism in this issue.] We must notice and take very seriously the trend of increasing ill health in American children, and thoroughly and objectively investigate any possible contributing factor—including vaccines.\n\nThe authors wish to thank the parents who agreed to participate in and be interviewed for this project.\n\nCONSIDERATIONS FOR PARENTS WHO CHOOSE NOT TO FULLY VACCINATE THEIR CHILD\n\n 1. Parents should be aware that many doctors do not expect to encounter diseases for which there are vaccines and may not, therefore, be able to make a correct diagnosis.\n\n 2. Pertussis risks for infants should be taken seriously. Several of the participating families whose children had experienced pertussis mentioned that they had followed Dr. Suzanne Humphries’ recommendations for using various forms of vitamin C.13\n\n 3. Parents should resurrect the lost art and skill of nursing a sick child at home. Too often, a child is simply given an antibiotic and sent back to school. Sick children need care and rest.\n\n 4. Parents should let acute illnesses run their course and not suppress symptoms such as fever unless dangerously high.14\n\n 5. Parents need to acquire some basic medical knowledge. For example, one of the rationales given by health care providers to justify the rotavirus vaccine is that parents are not able to recognize and deal with dehydration, which may accompany the diarrhea characteristic of rotavirus.\n\n 6. Picky eating is very common but does not serve children’s health. Many children have an inadequate diet. Parents should encourage gradual changes toward a diet that will support the immune system.\n\nREFERENCES\n\n 1. Bethell CD, Kogan MD, Strickland BB, Schor EL, Robertson J, Newacheck PW. A national and state profile of leading health problems and health care quality for US children: key insurance disparities and across-state variations. Acad Pediatr 2011;11(3 Suppl):S22-S33.\n\n 2. Ward BJ. Vaccine adverse events in the new millennium: is there reason for concern? Bull World Health Organ 2000;78(2):205-215.\n\n 3. Jaxen J. American College of Pediatricians latest to warn of Gardasil HPV vaccine dangers. Health Impact News. https://vaccineimpact.com/2016/american-college-of-pediatricians-latest-to-warn-of-hpv-vaccine-dangers/.\n\n 4. Miyazaki C, Koyama M, Ota E, et al. Allergic diseases in children with attention deficit hyperactivity disorder: a systematic review and meta-analysis. BMC Psychiatry 2017;17(1):120.\n\n 5. Jameson ND, Sheppard BK, Lateef TM, Vande Voort JL, He JP, Merikangas KR. Medical comorbidity of attentiondeficit/hyperactivity disorder in US adolescents. J Child Neurol 2016;31(11):1282-1289.\n\n 6. Ibañez MD, Valero AL, Montoro J, et al. Analysis of comorbidities and therapeutic approach for allergic rhinitis in a pediatric population in Spain. Pediatr Allergy Immunol 2013;24(7):678-684.\n\n 7. Lyall K, Van de Water J, Ashwood P, Hertz-Picciotto I. Asthma and allergies in children with autism spectrum disorders: results from the CHARGE study. Autism Res 2015;8(5):567-574.\n\n 8. Schillie S, Vellozzi C, Reingold A, et al. Prevention of hepatitis B virus infection in the United States: recommendations of the Advisory Committee on Immunization Practices. MMWR Recomm Rep 2018;67(1):1-31.\n\n 9. Richey W. Parents can’t sue drug firms when vaccines cause harm, Supreme Court says. The Christian Science Monitor, Feb. 22, 2011.\n\n 10. “How the vaccine schedule in the U.S. has evolved since the 1950s.” https://thetruthaboutvaccines.com/vaccineschedule/.\n\n 11. Mawson AR, Ray BD, Bhuiyan AR, Jacob B. Pilot comparative study on the health of vaccinated and unvaccinated 6- to 12-year-old U.S. children. Journal of Translational Science 2017;3(3):1-12.\n\n 12. Fisher BL. A Guide to Reforming Vaccine Policy & Law. National Vaccine Information Center, 2017. https://www.nvic.org/CMSTemplates/NVIC/pdf/NVIC_Referenced_Vaccine_Law_Reform_Guide.pdf.\n\n 13. Humphries S. Sodium ascorbate/vitamin C treatment of whooping cough. http://drsuzanne.net/2017/10/sodium-ascorbate-vitamin-c-treatment-of-whooping-cough-suzanne-humphries-md/.\n\n 14. Cowan T. Vaccines, Autoimmunity, and the Changing Nature of Childhood Illness. White River Junction, VT: Chelsea Green Publishing; 2018.\n\nThis article appeared in Wise Traditions in Food, Farming and the Healing Arts, the quarterly journal of the Weston A. Price Foundation, Winter 2018", "opengraph": {"locale": "en_US", "type": "article", "title": "Chronic Disease: A Study of Vaccinated and Unvaccinated Children", "description": "Does the current vaccine schedule have any association with the increase in chronic childhood conditions?", "url": "https://www.westonaprice.org/health-topics/vaccinations/chronic-disease-a-study-of-vaccinated-and-unvaccinated-children/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:modified_time": "2022-05-05T19:23:07+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_161548364_xl-2015-1000ox.jpg", "image:width": "1000", "image:height": "667", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://vaccineimpact.com/2016/american-college-of-pediatricians-latest-to-warn-of-hpv-vaccine-dangers/", "https://thetruthaboutvaccines.com/vaccineschedule/", "https://www.nvic.org/CMSTemplates/NVIC/pdf/NVIC_Referenced_Vaccine_Law_Reform_Guide.pdf", "http://drsuzanne.net/2017/10/sodium-ascorbate-vitamin-c-treatment-of-whooping-cough-suzanne-humphries-md/", "https://www.westonaprice.org/journal-winter-2018-toxic-world/", "javascript:window.print()"], "authors": [], "publish_date": "January 29, 2019"}