{"result_id": "339008", "URL": "https://www.westonaprice.org/health-topics/interview-with-david-martin-its-gene-therapy-not-a-vaccine/", "timestamp": "2023-04-25 18:10:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/health-topics/interview-with-david-martin-its-gene-therapy-not-a-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Interview With David Martin: It’s Gene Therapy, Not A Vaccine", "cleaned_text": "HILDA LABRADA GORE: David Martin is an innovator, professor and a man with an extensive resume of accomplishments. In this interview, we focus on the messenger RNA (mRNA) Covid-19 injections and why they constitute gene therapy, not “vaccines” in our usual understanding of the word. We also dis­cuss problems with PCR tests and how fear can make us resist the truth.\n\nDavid, I have a friend who works in the school system who got a letter suggesting that she needs to get one of these new vaccines against the Covid virus. What should she know?\n\nDAVID MARTIN: Let’s unpack your sentence. None of the words in the order that you used them actually exist in reality. First of all, there is no vaccine that is in development that is “a vaccine against the SARS-CoV-2 virus.” That doesn’t exist; that hasn’t been developed; it isn’t even in contemplation. In February, the World Health Organization made it abundantly clear that SARS-CoV-2 (the virus) and Covid-19 (a series of clinical presentations of illness) were two distinct things.\n\nHG: I have heard that SARS-CoV-2 is “the vi­rus” and that Covid-19 is “the disease.” Is that what you’re saying?\n\nDM: No, Covid-19 is not a “disease”; it is a series of clinical symptoms. It is a giant umbrella of things that used to be associated with influenza and with other febrile diseases. In February, the World Health Organization was clear in stating that there should not be a conflation between these two things. One is a virus (in their defi­nition), and one is a set of clinical symptoms. But the illusion in February was that SARS-CoV-2 caused Covid-19. The problem with that definition and with that expectation is that the majority of people who test positive using the RT-PCR method, which tests for fragments of what is associated with SARS-CoV-2, are not ill at all. In other words, the illusion that the virus causes a disease fell apart. That’s the reason why they invented the term “asymptomatic carrier.”\n\nHG: In other words, I might get a positive result from the PCR test and be “asymptomatic,” and the reason for no symptoms is that I’m not actu­ally sick at all. They’ve made a false assumption that SARS-CoV-2 causes Covid-19.\n\nDM: Yes—and that never has been the case and never will be the case. There is a causal state­ment made in the media that has intentionally misled people. For example, the media may cite Johns Hopkins or the Covid tracker (which is a collaboration between the Bloomberg, Gates and Zuckerberg Foundations and others); [and they will say, “there are five thousand new cases in Virginia”], but there are not five thousand new “cases” in Virginia. There potentially may be several thousand positive PCR tests, but most of the people who have a positive test will never have a single symptom, and most of the people who have symptoms do not have positive tests.\n\nHG: I know individuals who have said, “I was feeling sick, and I got a negative test. My sister-in-law who was feeling great got a positive test.”\n\nDM: It will always be the case. When the media and the CDC, using tools like the Covid tracker, cite “official” numbers—the numbers that get draped across the screens of our computers and televisions every morning—they are will­fully lying. They have been willfully lying since the inception of this. There is not a causal link between these things; that has never been established. It has never even been close to es­tablished. We have a situation where the illusion of the problem is that people say, “I don’t want to get Covid-19.” What they mean is, they don’t want to get infected with a virus. The problem is that those two things are not related to each other. A viral infection hasn’t been documented in the majority of what is called “cases.” And there is no basis for that conflation other than the manipulation of the public. That’s the first half of the problem.\n\nThe second half of the problem is what is being touted as a “vaccination.” When some­body says the word “vaccination,” the public understanding is that you are being treated with an attenuated or live virus (or a fragment of an attenuated or live virus) and that the treatment is meant to keep you from (1) getting an infection and (2) transmitting the infection. That is what a vaccine is meant to do, according to the common definition of a vaccine. The problem is that in the case of the Moderna and Pfizer injections, they are not vaccines. They are gene therapy—che­motherapy agents that are gene therapy. What the injections are doing is sending a strand of synthetic RNA into the human being and invok­ing, within the human being, the creation of the S1 spike protein, which is a pathogen. It’s a toxin inside of the human beings. This is not only not keeping you from getting sick, it’s making your body produce the thing that makes you sick. A vaccine is supposed to trigger immunity—it’s not supposed to trigger you to make a toxin. This is a public manipulation of a misrepresentation of clinical treatment. It’s not a vaccination. It’s not a device prohibiting infection or prohibiting transmission; it’s a means by which your body is conscripted to make the toxin that then, allegedly, your body somehow gets used to dealing with. Again, unlike a vaccine, which is supposed to trigger the immune response, this is intended to trigger the creation of a toxin.\n\nHG: The way I’ve heard the companies put it is that this is to teach your body to fight the virus when it comes around.\n\nDM: No. Their clinical trials didn’t include any of that as even a possibil­ity. The clinical trials did not measure the presence or absence of a virus or a virus fragment. The clinical trials did not measure the possibility of transmission suppression. This is a case of misrepresentation of a tech­nology, and it’s done exclusively so that they can get themselves under the umbrella of public health laws that exploit vaccination.\n\nHG: What you’re saying is different from what most of us have heard in the mainstream news and even from the press releases from big companies.\n\nDM: That’s because people aren’t reading the actual clinical trials. If you read the clinical trials, nothing that I’m saying is even remotely different from what is written there. As a matter of fact, the companies themselves have said what I’m saying. They said they could not test for the existence or absence of the virus, and they could not test for the transmissibility because, they said, “it would be impractical.” The companies themselves have admitted to every single thing I’m saying, but they are using the public manipulation of the word “vaccine” to co-opt the public into believing they’re getting a thing which they are not getting. This is not going to stop you from getting the coronavirus. It’s not going to stop you from getting sick. In fact, to the contrary; it will make you sick far more often than the virus itself.\n\nHG: How can you say that so definitively?\n\nDM: Because the data show nothing but that. For people receiving it, by the time they got the second shot, 80 percent of people had one or more clinical presentations of Covid-19. You will get Covid-19 symptoms from getting the gene therapy—passed off as a vaccine—80 percent of the time. Meanwhile, 80 percent of people who have an “infection” or are exposed to SARS-CoV-2 (according to RT-PCR) have no symptoms at all.\n\nHG: Then what is the purpose of getting this “vaccine” or this gene manipulation?\n\nDM: Let’s stick with what they say they are. It’s a gene therapy technology—that’s Moderna’s own definition. To answer your question, the benefit is non-existent. On the risk side, a human being is going to be potentially exposed to un­classified risks of altering their RNA and DNA from exposure to this gene therapy—risks that are both short-term and long-term. And on the benefit side, this is also important to understand: there is no clinical benefit except that in certain instances of CoV infection and/or Covid-19 exposure, there were a few people—by that I mean less than a few hundred out of nearly forty thousand in the clinical trial—who had a few days’ less severe symptoms with the gene therapy when compared to the control group.\n\nBut even in that comparison, if you look at the methodology that’s in the published papers for the clinical trials, they are playing games with the data. What they are doing is separating reactivity—meaning the way in which a person responds to being exposed to the gene therapy. They separated out adverse events from actual Covid symptoms. The problem is that Covid symptoms include things like fever, body aches, muscle pain and muscle weakness. They got rid of a lot of what would have been considered Co­vid symptoms by calling them adverse events. If you pull those data out and you say, “Compare the population that got the gene therapy with the population that didn’t get the gene therapy,” the population that got the gene therapy had way more illness—including Covid-19 symp­toms—than the population that didn’t get the gene therapy. But because they classified an enormous number of things as adverse events, they technically wiggled themselves into being able to make the ridiculous statement that the injection was “90-plus percent effective.” But “effectiveness” here does not mean “effective in blocking illness”; it means “effective in al­legedly shortening the duration of symptoms.”\n\nHG: People are afraid, so they are ready to be­lieve what they want to believe, and they will hold onto that one bit of information: “At least it will tamp down my symptoms and limit the duration of my illness.” They’re holding out hope that this will be their saving grace to help them avoid Covid-19.\n\nDM: Nothing about this will avoid Covid-19, and nothing about this will avoid SARS-CoV-2.\n\nHG: We’ve been talking mostly about the Mod­erna and Pfizer gene therapy. Is there another one in the works that is not using gene therapy?\n\nDM: The AstraZeneca/Oxford trial is using a viral fragment. [Editors’ note: Subsequent to this interview, the FDA granted emergency use authorization to Johnson & Johnson for its Covid injection, which, like the AstraZeneca version, uses a viral fragment. Although the mechanism is different, the AstraZeneca and Johnson & Johnson injections do the same thing as the mRNA injections, namely, get genetic material into the cells intended to trigger the cells to produce copies of the spike protein.]\n\nThe AstraZeneca/Oxford trial has been an interesting one to watch because they have a methodology problem that is quite challenging in terms of trying to pool data and understand what’s happening either on the safety or efficacy side. The reason is simple: in certain instances, the AstraZeneca/Oxford trial has not used just a saline control group; they’ve used another vaccine as the control. In other words, they’ve stacked the deck. They’re making it look like the Covid injection is somehow neutral com­pared to another vaccination in several of their data collection efforts. As a result, we have a methodology problem, which by the way has been criticized by a number of clinical scientists.\n\nThe bigger problem is that, like Moderna and Pfizer, they’re not measuring viral suscepti­bility and viral transmission. Those are the two legs of the stool that are required for anyone to say that they are vaccinating a population for public health reasons. This is a simple thing to wrap your head around. It’s as if I said, “Ev­erybody needs to take chemotherapy for cancer they might get.” That’s exactly what is happen­ing. This is not prophylactic; it is not helping us. Using careful marketing, manipulation and propaganda and calling these things “vaccines for public health,” we’re being told to take a treatment for a disease we don’t have and most likely will not have.\n\nHG: Historically, we’ve taken vaccines for pre­vention. “I don’t want to get the measles, so I’ll get this measles shot.” We’ve been primed to ac­cept that approach. It’s the narrative everybody expects. Why don’t you expect that, though?\n\nDM: Because that’s not what’s being measured. That’s not what’s being done, and that’s not what this technology is about. mRNA is not a vac­cination. It’s a gene therapy that was originally developed for cancer treatment. That’s why I’m using the chemotherapy analogy.\n\nHG: I know many people who are planning to get the injections. What can we tell these people that might wake them up?\n\nDM: That’s a complex issue. I chose a long time ago not to engage in the energy of this “waking/ sleeping” metaphor. Because the fact of the mat­ter is that if people are conditioned to react to fear, this is reflexive, and it’s not conscious. We engage in self-harm because we are convinced that somehow there’s a worse future ahead of us if we don’t. That’s something that facts are not ever going to overcome. I have yet to meet someone who allowed a fact to overwhelm a belief. Once you’ve adopted a belief, facts are not welcome, because facts not only indict your belief but indict the energy that you hold that says, “I have to believe what I’m told.” The minute you try to engage with facts, all you do is trigger conflict.\n\nWhat I do is try to take the complex science and the complex reporting and make it acces­sible and easily understood. In certain instances, people will say, “I can’t even believe that what he said was true.” The cool thing is that you don’t have to believe what I’m saying is true because I don’t value belief. I value the objective reality of facts. It turns out that in this particular case, it is simple and straightforward to say to any person that Moderna’s own SEC filings make it abundantly clear that their technology is a gene therapy technology. In their clinical trials, they made it abundantly clear that they could not measure the presence or absence of the virus, and they could not measure the presence or ab­sence of transmission of the virus. Every single thing that they represented to be doing—things that prey on the public understanding of what vaccination is—they in fact explicitly said, “We’re not doing that.”\n\nHG: You have been careful to lay out the facts and we’re thankful. Would you take the PCR test if you had to for travel?\n\nDM: I’m actively involved with many of the significant pieces of litigation that are going on to try to unmask the conspiracy that is driving both the PCR test as well as the medical coun­termeasure interventions. I’m in the vanguard with a few other souls who are fighting for the rights of citizens to make decisions informed by facts, not propaganda. The fact of the matter is that the PCR test has never been approved as a diagnostic. It is not a diagnostic. There’s nothing about taking a PCR test that does anything other than reinforce a propaganda narrative. It doesn’t tell you anything. The reason why we’re not do­ing influenza testing now is that we don’t want to admit the fact that the majority of people in hospitals—who are sick and dying—are expe­riencing exactly the same thing that’s happened every year, which is influenza-like, flu-like and pneumonia-like illness, which, in many cases— when someone is immune-compromised or has other comorbidities—leads to fatalities. It’s a sad reality that it happens, but it is part of the human experience. The fact is that a PCR test is not going to make or not make a confirmed diagnosis of anything because PCR tests cannot confirm a diagnosis.\n\nHG: I’ve interviewed Dr. Tom Cowan and Dr. Andy Kaufman, and they say the same thing. The person who came up with the PCR test said it was not to be used to diagnose anything.\n\nDM: So does the FDA; so does everybody else. The only reason we are using PCR tests is be­cause governors and the Department of Health and Human Services are maintaining a state of emergency. The second that the state of emer­gency is lifted in any state or in the country, the PCR test won’t be allowed. We’re maintaining a state of emergency so that manufacturers can keep selling a thing that would never be ap­proved if it was subject to a clinical trial. The same goes for what’s being called vaccines, too. The gene therapy that Moderna and Pfizer are doing would be suspended immediately if the state of emergency got lifted. People don’t understand that if you lift the state of emer­gency, the whole house of cards falls apart. The injections are in use because the emergency use authorization (EUA) falls within the state of emergency.\n\nHG: Do you think this is one of the reasons why they have cast aspersions on hydroxychlo­roquine and other protocols that could possibly treat the symptoms of SARS-CoV-2?\n\nDM: There’s no question. If you look historical­ly, for many years Dr. Anthony Fauci at NIAID [National Institute for Allergy and Infectious Diseases] has held his annual advisory commit­tee meetings and every year, he laments the fact that they’re trying to build a universal influenza vaccine—they have been trying for years—and it hasn’t worked. This is an opportunity for Fauci to get what he has not been able to get through legal means; he wants to get to a place where he forces a vaccine on an entire population. He’s manipulating this Covid situation to force a vac­cine on the population. However, he forgot that if he’s going to force a vaccine on a population, it should at least be a vaccine.\n\nHG: What would his motives be?\n\nDM: It always has been financial. There are billions of dollars at stake, and NIAID is es­sentially the incubator for the pharmaceutical industry. He’s serving the paymasters who have let him manage one hundred ninety-one billion dollars in his career at NIAID.\n\nHG: Let’s say I’m an individual reading all these facts, and I’ve been persuaded. I do not want to get the gene therapy technology or the Astra­Zeneca [or Johnson & Johnson] injections. I don’t want to get any of this, but I’m under pressure, either because of my job or for travel purposes. What would you advise me to do?\n\nDM: I can’t advise a person at all; that’s not my role. What I can tell you is that this is a decision that every human being is ultimately going to have to make based on whether they choose to live or choose to be enslaved. This is like any point in history where you have to make decisions that are based on what is moral, ethical and right with respect to your own sense of responsibility and accountability. Like wearing a seat belt or doing a whole bunch of other things, your choice to engage in an activity is ultimately going to be a decision that you have to live with. I will not touch a thing and will not allow my body to be invaded by a thing that has been developed in an unethical and illegal way. I am not going to let anybody have the opportunity to manipulate my genetic code. It’s not go­ing to happen. If that means it comes at the cost of a particular employer or a particular relationship or whatever else, my life happens to be worth more than that. We’ve been conditioned to fall into this trap, which is: “Oh my, we might not be able to get on a plane.” Okay, so drive. I’m not going to let my future and my well-being be enslaved to a commercial interest that is trying to extort or blackmail me into something.\n\nHG: That does sound like living. That sounds like freedom as opposed to slavery. We at the Weston A. Price Foundation want people to live their best lives—to take responsibility for their own health and look for ways to nurture it that may not be the most modern or the most profitable for health companies but will be best for them. Let me wrap up by asking, if readers could do one thing to improve or sustain their health, what would you recommend that they do?\n\nDM: Pick a lifestyle modification, and pick it with someone else. Begin exercising or find a more wholesome way of engaging with the food you consume. Do anything that involves bringing together the sense of well-being, which involves fellowship, nutrition and vitality and empowers you to become a person who not only has a conceptual idea of what health is but has a lived experience of it. The more you have the lived experience of health, the less you can be told you’re unwell when you’re perfectly fine.\n\nThis article appeared in Wise Traditions in Food, Farming and the Healing Arts, the quarterly journal of the Weston A. Price Foundation, Spring 2021", "opengraph": {"locale": "en_US", "type": "article", "title": "Interview With David Martin: It’s Gene Therapy, Not A Vaccine", "description": "🖨️ Print post HILDA LABRADA GORE: David Martin is an innovator, professor and a man with an extensive resume of accomplishments. In this interview, we focus on the […]", "url": "https://www.westonaprice.org/health-topics/interview-with-david-martin-its-gene-therapy-not-a-vaccine/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:modified_time": "2022-05-05T19:15:28+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.westonaprice.org/journal-spring-2021-toxins/", "javascript:window.print()"], "authors": [], "publish_date": "May 3, 2021"}