{"result_id": "339045", "URL": "https://www.westonaprice.org/support-two-important-vaccine-bills-in-alabama/", "timestamp": "2023-04-25 18:11:35 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-two-important-vaccine-bills-in-alabama/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support two important vaccine bills in Alabama!", "cleaned_text": "Speak up for two good bills in the Alabama legislature that would protect parents and visitors of healthcare facilities.\n\nHB 187 changes the law to require parental consent for unemancipated minors to be administered a vaccine. Current state law Section 22-8-4 allows any minor who is 14 years of age or older to consent to any legally authorized medical services without parental consent. HB187 passed out of the House Health Committee on 4/5/2023 and is up for a vote in the House.\n\nHB 3 and its identical companion bill SB 2 require healthcare facilities to adopt visitation policies that prohibit vaccination requirements for visitors.\n\nHB3 was introduced and referred to the House Health Committee on 3/9/2023. SB2 passed the Senate Healthcare Committee on 3/9/2023 and is awaiting vote in the Senate.\n\nEvery parent has the right to make medical decisions for their minor children and every person has the right to bodily autonomy – especially when science clearly demonstrates that unvaccinated people do not pose a risk to others.\n\nPlease speak up! We need YOUR voice to help pass bills HB 187 and HB 3/SB 2 today!\n\n1) Contact your Alabama State Representative and State Senator and ask him/her\n\nYou can enter your address here to look up who represents you (then scroll down to see your legislators listed under “State House District” and “State Senate District”):\n\nCalls are more effective than emails and only take a few minutes. Below are two sample scripts along with additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“Hi, my name is ____, and I am a constituent. I am asking Representative ____ to support HB 187, which would require parental consent for unemancipated minors prior to administering a vaccine.\n\nThis bill is especially important because current law allows minors as young as 14 to consent to medical care without parental consent.\n\nI oppose any legislation that allows minors to consent to vaccines without parental consent.\n\nAs recognized by the U.S. Supreme Court, vaccines are pharmaceutical products that carry the risk of injury or death. It is irresponsible to allow children to make medical decisions that may injure or kill them without the knowledge of their parents.\n\nUnlike other procedures that are allowed in various states without parental consent, such as contraception or mental health services, vaccines are not typically something a minor seeks out – but rather something that medical practitioners and schools seek to push onto them. The risk of pressuring a child into a medical procedure that they don’t actually want is all too real with vaccinations.\n\nThe U.S. Federal Vaccine Injury Compensation Program has awarded nearly $4.9 billion dollars to vaccine victims.\n\nMinor children may not be aware of family medical histories and even their own history of vaccine reactions, which would be relevant to deciding if a particular vaccine’s risks outweigh the benefits.\n\nI urge Representative _____to SUPPORT HB 187, which would protect parental rights.\n\n“Hi, my name is ____, and I am a constituent. I am calling to ask Representative/Senator ____ to support an important bill (HB 3 for Representatives and SB 2 for Senators) that would protect residential care, assisted living residents, and hospitalized patients by ensuring visitation rights in all healthcare facilities regardless of the visitor’s vaccination status.\n\nHB 3 (or SB 2) is especially important as people have been denied access to their loved ones for not having a Covid-19 vaccination.\n\nNo one should be discriminated against based on their Covid-19 vaccination status, especially when the CDC admits that Covid vaccines do not prevent transmission. Unvaccinated visitors do not pose any greater risk than vaccinated visitors.\n\nI urge Representative/Senator _____to SUPPORT HB 3 (or SB 2), which would protect residential care residents and their loved ones.\n• A child may not know their personal or family medical history, including vaccine reactions, allergies, and autoimmune or neurological disorders, all of which contribute to the chances that they may have a serious reaction to a vaccine.\n• Children do not have the same kind of critical thinking skills or emotional maturity to make a vaccine benefit-risk decision as adults. Additionally, children and adolescents are vulnerable to authority-figure persuasion.\n• If a child consents to vaccination without their parent knowing and has a reaction, the parent may not recognize the reason for their child’s decline in health, and this lack of knowledge could be life-threatening for the child.\n• Share a personal story if you have relevant experience. Do you have a vaccine-injured child, and you weren’t told about the risks before vaccinating or were pressured into vaccinating despite your concerns about the risks? Do you have family members with medical conditions that would be relevant to assessing the risks, and your child doesn’t know the details?\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines without having to pay for any of the injuries or harm. [See “No Pharma Liability? No Vaccine Mandates” (2011) – https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates]\n• Vaccines are medical procedures that carry a risk of serious injury. Hundreds of thousands have reported an adverse reaction to vaccination to the Vaccine Adverse Event Reporting System (VAERS). The U.S. Government has paid out nearly $4.9 billion as of 2/1/2023 to the victims of vaccine injury, per VICP Data Reports [see link at https://www.hrsa.gov/vaccine-compensation/data]\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program (VICP) – presumably with little or no understanding of what that means. It is also much less likely that vaccine reactions will be recognized and connected to the vaccine by a child on their own; furthermore, it’s unlikely the child will file a report with the Vaccine Adverse Event Reporting System (VAERS).\n• One of the most basic human rights is that of bodily autonomy, as recognized by the Nuremburg Code. Ethical medicine requires prior, completely voluntary and fully informed consent.\n• Vaccine package inserts warn of the risk of brain damage, life-threatening allergy, and death and no one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• On July 27, 2021, Rochelle Walensky, director of the CDC, went on CNN and acknowledged that COVID-19 injections do not stop people from catching or transmitting SARS-CoV-2. So mandating vaccination does not limit the spread of Covid. https://www.cnn.com/2021/08/05/health/us-coronavirus-thursday/index.html\n• Covid vaccine manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by Covid-19 vaccines is the Countermeasures Injury Compensation program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medial expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000 per year, and there is no judicial appeal. In other words, the victims will be severely undercompensated while the pharmaceutical companies get rich. [See Oct 2021 update for comparison of coverage by CCIP vs VICP (p. 7) – https://crsreports.congress.gov/product/pdf/LSB/LSB10584]\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising [1,2]. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations [3].\n\nView the text, status, and history of the bills under Tab3, “Bills – Search All Sessions” (type in the bill number without spaces):\n\nRead these articles for more information on the dangers of Covid shots:\n\nPfizer Documents Confirm What We Already Knew: Covid Injections Are Dangerous – https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/#gsc.tab=0\n\nCovid-19 Injections And The Global Control Grid—Just Say No – https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/#gsc.tab=0", "opengraph": {"locale": "en_US", "type": "article", "title": "Support two important vaccine bills in Alabama!", "description": "🖨️ Print post Speak up for two good bills in the Alabama legislature that would protect parents and visitors of healthcare facilities. HB 187 changes the law to […]", "url": "https://www.westonaprice.org/support-two-important-vaccine-bills-in-alabama/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-04-13T14:21:07+00:00", "article:modified_time": "2023-04-13T14:21:09+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "http://alisondb.legislature.state.al.us/alison/CodeOfAlabama/1975/Coatoc.htm", "http://alisondb.legislature.state.al.us/alison/CodeOfAlabama/1975/Coatoc.htm", "https://www.legislature.state.al.us/pdf/SearchableInstruments/2023RS/HB187-int.pdf", "https://www.legislature.state.al.us/pdf/SearchableInstruments/2023SS/HB3-int.pdf", "https://www.legislature.state.al.us/pdf/SearchableInstruments/2023SS/SB2-int.pdf", "https://alabama.maps.arcgis.com/apps/InformationLookup/index.html?appid=7edc0e327b6b4f128e0dd7492faeb61c", "https://alabama.maps.arcgis.com/apps/InformationLookup/index.html?appid=7edc0e327b6b4f128e0dd7492faeb61c", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-02-01-23.pdf", "https://www.hrsa.gov/vaccine-compensation/data", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://vaers.hhs.gov/", "https://www.cnn.com/2021/08/05/health/us-coronavirus-thursday/index.html", "https://crsreports.congress.gov/product/pdf/LSB/LSB10584", "https://www.politico.com/news/2022/06/01/vaccine-injury-compensation-programs-overwhelmed-as-congressional-reform-languishes-00033064", "https://www.corp-research.org/merck", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "https://alison.legislature.state.al.us/bill-search?tab=3", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/#gsc.tab=0", "https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/#gsc.tab=0", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/#gsc.tab=0", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-04-13T14:21:07+00:00"}