{"result_id": "339024", "URL": "https://www.westonaprice.org/sv/podcast/its-gene-therapy-not-a-vaccine/", "timestamp": "2023-04-25 18:11:16 CEST+0200", "meta": {"description": "What are the new COVID-19 vaccines made of? What would they do to us? Why are they being promoted and by whom? Dr. David Martin explains", "lang": "sv", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/podcast/its-gene-therapy-not-a-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "It's Gene Therapy, Not a Vaccine", "cleaned_text": "Let’s start with your opening sentence. None of the words in the order that you use exist in reality. Let’s unpack that. First of all, there is no vaccine that is in development or contemplated that is a vaccine against the SARS-CoV-2 virus. That doesn’t exist. That hasn’t been developed. It isn’t even, in 2021, in contemplation. It’s one of the unfortunate things about what’s going on in the propaganda war, which is in February, the World Health Organization made it abundantly clear that SARS-CoV-2 or the virus and COVID-19, which is a series of clinical presentations of illness were two distinct things.\n\nCOVID 19 is not a disease. It is a series of clinical symptoms. It is a giant umbrella of things associated with what used to be associated with influenza and with other febrile diseases. The problem that we have is that in February, the World Health Organization was clear in stating that there should not be a conflation between the two of these things. One is a virus, in their definition and one is a set of clinical symptoms. The illusion in February was that SARS-CoV-2 caused COVID-19. The problem with that definition and with the expectation is that the majority of people who test positive using the RT-PCR method for testing, for fragments of what is associated with SARS-CoV-2 are not ill at all. The illusion that the virus causes a disease fell apart. That’s the reason why they invented the term asymptomatic carrier.\n\nThat’s never been the case, never has been the case and never will be the case. There is a causal statement that is made in the media where, for example, Johns Hopkins or the COVID tracker platform or any of these things has intentionally misled the people. There are not 5,000 new cases in Virginia. There potentially may be several thousand positive PCR tests but most of the people who have a positive test will never have a single symptom. Most of the people who have symptoms do not have positive tests.\n\nIt’s a gene therapy technology. That’s Moderna’s own definition. Let’s stick with what they say they are. The benefit is non-existent. A human being is going to be potentially exposed to unclassified, both short-term and long-term risks of altering their RNA and DNA from exposure to this gene therapy. This is important to understand, there is no clinical benefit except that in certain instances of CoV infection and/or COVID-19 exposure, there were a few. By that, I mean less than a few hundred out of nearly 40,000 in the clinical trial. A few hundred people had a few days less severe symptoms with the gene therapy when compared to the other control group. Even in that comparison, if you look at the methodology that’s in the published papers for the clinical trials, they play games with the data because what they’re doing is, they’re separating reactivity, meaning the way in which a person responds to being exposed to the gene therapy, they separate out adverse events from actual COVID symptoms.\n\nThe problem is that COVID symptoms include things like fever, body ache, muscle pain, muscle weakness and things like that. They got rid of a lot of what would have been considered to be COVID symptoms by calling them adverse events. If you pull that data out and you say, “Compare the population that got the gene therapy with the population that didn’t get the gene therapy.” The population that got the gene therapy had way more illness, including COVID-19 symptoms, than the population that didn’t get the gene therapy but because they classified an enormous number of things as adverse events, they technically wiggled themselves into what was this ridiculous 90% plus effectiveness. Effectiveness was not effective in blocking illness. It was effective in allegedly shortening the duration of symptoms.\n\nThe AstraZeneca Oxford trial is using a viral fragment. It is more along the technological lines of what you and I might consider historically, to be a vaccine. The AstraZeneca Oxford trial has been an interesting one to watch because they have a methodology problem that is quite challenging in terms of trying to fool data and understand what’s happening either on the safety or efficacy side. The reason is simple, that in certain instances, the AstraZeneca Oxford trial has not used a saline control group. They’ve used another vaccine as the control. In other words, they’ve stacked the deck. They’re making it look like they are somehow neutral compared to another vaccination in several of their data collection efforts.\n\nThat’s a complex issue and I have chosen a long time ago to not engage in the energy of this waking sleeping metaphor because the fact of the matter is if people are conditioned to react to fear, this is reflexive and it’s not conscious. If we examine our behavior and what we do is engage in self-harm because we are convinced that somehow or another, there’s a worse future ahead of us, that’s something that I don’t have an ability to say facts are going ever to overcome. I have yet to meet in my life someone who allowed a fact to overwhelm a belief. Once you’ve adopted a belief, facts are not welcome because what they do is, they not only indict your belief but they indict the energy that you hold that says, “I have to believe what I’m told.”\n\nThe minute you try to engage with facts, all you do is trigger conflict. What I do is I try to take the complex science and the complex reporting, and I try to make it accessible and easily understood. The goal is that in certain instances, people will go, “I can’t even believe that what he said was true.” The cool thing is you don’t have to believe what I’m saying is true because I don’t value belief. I value the objective reality of facts. It turns out that in this particular case, it is simple and straightforward to say to any person in Moderna’s own SEC filings, they make it abundantly clear that their technology is a gene therapy technology. In their clinical trial, they’ve made it abundantly clear that they could not measure the presence or absence of the virus and they could not measure the presence or the absence of the transmission of the virus. Every single thing that they represented to be doing that preys on the public understanding of what vaccination is, they explicitly said, “They’re not doing that.”\n\nSo does the FDA so does everybody else. The only reason we are using PCR tests is that governors and the Department of Health and Human Services are maintaining a state of emergency. The second that that state of emergency is lifted in any state or in the country, the PCR test won’t be allowed to be used. We’re maintaining a state of emergency so that manufacturers can keep selling a thing that would never be approved if it was subject to a clinical trial. It goes for what’s being called vaccines too. The gene therapy that Moderna and Pfizer are doing, both of those would be suspended immediately if the state of emergency got lifted. People don’t understand that if you lift the state of emergency, the whole house of cards falls.\n\nThere are lots to consider here. You’ve given us a lot of food for thought. We want to have another conversation with you again but let’s say I’m an individual that was reading all these facts and I’ve been persuaded. I do not want to get this gene therapy technology. I don’t want even to get the AstraZeneca vaccine. I don’t want to get any of this but I’m under pressure either because of my job or for travel purposes to do so, what would you advise me to do?\n\nI can’t advise a person at all. That’s not my role but what I can tell you is that this is a decision that any human being is going to ultimately have to make based on whether or not they choose to live or they choose to be enslaved. This is like any point in history where you have to make decisions that are based on what is moral and ethical and right with respect to your own sense of responsibility and accountability. The fact of the matter is like wearing a seat belt, like doing a whole bunch of other things, your choice to engage in an activity is ultimately going to be a decision that you have to live with.\n\nI will not touch a thing and I will not allow my body to be invaded with a thing that is been developed in an unethical and illegal way. I am not going to let anybody have the opportunity to manipulate my genetic code. It’s not going to happen. If that means that it comes at a cost of a particular employer or a particular relationship or whatever else, my life happens to be worth more than that. We’ve been conditioned to fall into this trap, which is, “We might not be able to get on a plane.” So, drive.\n\nThat does sound like living. That does sound like freedom as opposed to slavery. I appreciate that. I think that’s what we’re about to hear at the foundation. We want people to live their best lives to take responsibility for their own health and look to ways to nurture it that may not be the most modern or the most profitable for health companies but will be best for them. Let me wrap up by asking you the question I often pose at the end. If the reader could do one thing to improve or sustain their health, what would you recommend that they do?", "opengraph": {"locale": "sv_SE", "type": "article", "title": "It's Gene Therapy, Not a Vaccine", "description": "Dr. David Martin, medical and legal expert, challenges our presuppositions about the new mRNA Covid-19 vaccines. Quoting the pharmaceutical companies themselves, David suggests that these are not vaccines, but, in actuality, gene therapy. He explains what the vaccines may do to us, what they are promising they can do for us, and how to distinguish the difference.", "url": "https://www.westonaprice.org/podcast/its-gene-therapy-not-a-vaccine/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:modified_time": "2022-12-03T16:37:50+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/292WTbanner.jpg", "image:width": "940", "image:height": "492", "image:type": "image/jpeg"}, "tags": ["podcast"], "tweets": [], "movies": [], "links": ["javascript:window.print()", "http://davidmartin.world/", "http://davidmartin.world/", "https://www.westonaprice.org/sv/podcast/235-understanding-our-current-health-crisis/", "https://www.westonaprice.org/podcast/242-are-germs-the-enemy/", "http://davidmartin.world/", "https://www.westonaprice.org/sv/podcast/235-understanding-our-current-health-crisis/", "https://www.westonaprice.org/podcast/242-are-germs-the-enemy/", "https://www.nsf.gov/awardsearch/showAward?AWD_ID=0434507", "https://www.ncbi.nlm.nih.gov/books/NBK6338/", "javascript:window.print()"], "authors": [], "publish_date": "januari 25, 2021"}