{"result_id": "339029", "URL": "https://www.westonaprice.org/support-two-important-bills-in-florida/", "timestamp": "2023-04-25 18:11:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-two-important-bills-in-florida/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support Two Important Bills In Florida!", "cleaned_text": "Florida legislators are considering two bills that would protect your medical freedom.\n\nHB 305 and its identical companion bill SB 222, known as the Protection of Medical Freedom Act, would amend current OPT-OUT vaccine tracking systems to:\n• prohibit the health department from requiring anyone to participate in Florida’s existing state vaccine tracking system\n• prohibit the health department from sharing a person’s records out of state to an interstate registry, or federal tracking system written consent\n• require the department to purge records or identifying information for those who refuse to be in the tracking system\n• add the option for the Health Department to also accept OPT-OUT forms\n\nThese bills would also amend the current vaccine passport ban in State Law to:\n• apply to all vaccines for all diseases, not just Covid-19\n• prohibit health care providers from making health care contingent on vaccination or post-recovery status for all diseases\n\nIf these bills do not pass, Florida residents will lose protections, enacted in HB 1B on 11/18/2021, from Covid-19 vaccine mandates – as the protections are set to expire on June 1, 2023.\n\nThe protections in HB 305 and SB 222 do not expire, and they apply to all vaccines, not just Covid-19 injections.\n\nThese are great bills! Please make your voice heard and show your support for bodily autonomy today!\n• Contact your Florida state Representative and ask him/her to SUPPORT HB 305.\n\nTo find your state rep., enter your address at this link: https://www.myfloridahouse.gov/Sections/Representatives/myrepresentative.aspx\n• Contact your Florida state Senator and ask him/her to SUPPORT SB 222\n\nTo find your state senator, enter your address at this link: https://m.flsenate.gov/senators/find\n\nCalls are more effective than emails and only take a few minutes. Below is a Sample Script, and there are additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“My name is ____, and I live in (town.) I am calling Representative (or Senator) ___ to support HB 305 (or SB 222).\n\nThis critical bill amends Florida’s vaccine tracking system and passport ban in good ways!\n\nIt would protect citizens in Florida from vaccine discrimination in the areas of education, employment, and public accommodation while also granting the right to sue for violations.\n\nThis bill is so important because HB 1, which gave temporary protections regarding Covid-19 shots, is about to expire.\n\nAs recognized by the U.S. Supreme Court, vaccines are pharmaceutical products that carry the risk of injury or death.\n\nCovid-19 injections have caused many side effects, including death. As of 2/24/23, 2,435,775 injuries and 34,387 deaths were reported in connection with the Covid shots to the CDC’s Vaccine Adverse Events Reporting System (VAERS) — and it is estimated that only 1-10 percent of adverse reactions are ever reported. And yet the manufacturers are shielded from liability for any harm they cause.\n\nThis terrific bill would allow the citizens of Florida to make decisions about vaccination that are best for themselves and their own families.\n\nCan you let me know where Representative (or Senator) ___ stands on these issues? You can email me at ____ or call me back at ____.”\n• Share why this is personal to you. Have you or someone you know had a vaccine reaction?\n• Vaccine mandates, segregation, and discrimination over vaccination and immunity status happen for all vaccines in many areas of life, not just those for Covid-19.\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines without having to pay for any of the injuries or harm. https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates\n• The claimed justification – that unvaccinated individuals pose a health risk to others – is unproven in scientific research. In fact, vaccinated individuals can pose a greater risk to public health due to a process known as shedding. Scientific evidence demonstrates that individuals vaccinated with live virus vaccines such as MMR (measles, mumps, and rubella), rotavirus, chicken pox, shingles, and influenza can shed the virus for many weeks or months afterward and infect the vaccinated and unvaccinated alike. https://www.westonaprice.org/studies-show-that-vaccinated-individuals-spread-disease/\n• No one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• Vaccines are medical procedures that carry a risk of serious injury. The U.S. Government has paid out nearly $4.9 billion as of 3/1/2023 to the victims of vaccine injury, per VICP Data Reports. Hundreds of thousands have reported an adverse reaction to vaccination to the Vaccine Adverse Event Reporting System (VAERS). https://www.hrsa.gov/vaccine-compensation/data\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising [1,2]. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations [3].\n• Covid shot manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 vaccines is the Countermeasures Injury Compensation Program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medical expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000, and there is no judicial appeal. In other words, the victims will be severely under-compensated while the pharmaceutical companies get rich. https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx\n• There are no long-term studies on the safety, genotoxicity, carcinogenicity, or effect on the reproduction of Covid-19 shots.\n• Covid injections were not properly tested and are dangerous, as confirmed by Pfizer’s own documents. https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/#gsc.tab=0\n• Vaccine tracking systems should always be OPT-IN only. OPT-IN means that your vaccine information will not be shared if you do nothing. If you have not given consent, your vaccine status remains private between you and your healthcare provider, and your vaccine status is not tracked by a state government or released to other healthcare databases.\n• Supporters of vaccine tracking systems claim they are a way to protect patients by guaranteeing patients don’t receive multiple doses of the same vaccinations from different providers. According to CDC’s own statements, though, it’s clear that a key purpose of these registries is to create pressure on people who are unvaccinated or partially vaccinated. CDC openly stated that vaccine registries are a tool to identify areas of “under vaccination” so they can be “addressed” and brought into “compliance.” https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6133a2.htm\n\nLearn more about the bills here:\n\nRead this article to learn more about the lack of safety for all vaccines:\n\nRead these articles for more information on the dangers of Covid shots:", "opengraph": {"locale": "en_US", "type": "article", "title": "Support Two Important Bills In Florida!", "description": "🖨️ Print post Florida legislators are considering two good bills that would protect your medical freedom. HB 305 and its identical companion bill SB 222, known as the […]", "url": "https://www.westonaprice.org/support-two-important-bills-in-florida/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-03-14T18:51:32+00:00", "article:modified_time": "2023-03-17T14:02:52+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.myfloridahouse.gov/Sections/Bills/billsdetail.aspx?BillId=77010", "https://www.flsenate.gov/Session/Bill/2023/222/", "https://nvicadvocacy.org/members/State-Teams/My-State/Legislation-Details/itemid/2262/State/FL?Page=True", "https://www.myfloridahouse.gov/Sections/Representatives/myrepresentative.aspx", "https://m.flsenate.gov/senators/find", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.nvic.org/newsletter/mar-2011/no-pharma-liability-no-vaccine-mandates", "https://www.westonaprice.org/studies-show-that-vaccinated-individuals-spread-disease/", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats.pdf", "https://www.hrsa.gov/vaccine-compensation/data", "https://www.corp-research.org/merck", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "https://aspr.hhs.gov/legal/PREPact/Pages/default.aspx", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/#gsc.tab=0", "https://www.cdc.gov/mmwr/preview/mmwrhtml/mm6133a2.htm", "https://www.myfloridahouse.gov/Sections/Bills/billsdetail.aspx?BillId=77010", "https://www.flsenate.gov/Session/Bill/2023/222", "https://www.westonaprice.org/health-topics/vaccines-unsafe-since-the-very-beginning/", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/", "https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-03-14T18:51:32+00:00"}