{"result_id": "339013", "URL": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-arizona/", "timestamp": "2023-04-25 18:11:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-arizona/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support A Good Vaccine Bill In Arizona!", "cleaned_text": "The Arizona Legislature is considering a bill that prohibits COVID-19 vaccine mandates for students.\n\nHouse Bill No. 2086 would prohibit the Director of Health Services (DHS) from being able to mandate COVID-19 vaccines for schoolchildren.\n\nEvery child has the right to an education regardless of their vaccination status – especially when the science clearly demonstrates that unvaccinated children do not pose a risk to others.\n\nFortunately, a bill passed last year prohibits school districts and charter schools from requiring teachers and students to receive COVID-19 vaccines. But HB 2086 is still needed because it stops the Director of Health Services from mandating the vaccines for schoolchildren.\n\nHB 2086 has already passed the House, but by a narrow vote – now we need your help to get it through the Senate!\n\nContact your Senator and ask him or her to SUPPORT HB 2086.\n\nYou can look up who represents you at: https://www.azleg.gov/findmylegislator/\n\nSample script for email is below. Personalize it by adding your own sentences and changing the wording – personal emails are far more effective than form letters!\n\n“My name is ____ and I live in (town). I am emailing to ask Senator ­­­­____ to support HB 2086, which would prohibit COVID-19 vaccine mandates for students by DHS.\n\nThis bill is especially important to ensure schoolchildren are not discriminated against for choosing not to receive fast-tracked, experimental COVID-19 vaccines.\n\nThere have been no long-term studies on the safety of these shots. Students should not be forced to be injected with an experimental substance that could cause serious side effects. To date, there have been 777,303 injuries and 11,312 deaths reported in connection with the COVID shots to the CDC’s Vaccine Adverse Events Reporting System (VAERS) — and it is estimated that only 10 percent of adverse reactions are ever reported.\n\nVaccine mandates are being justified on the idea of the “greater good” and protecting other people. But no individual, especially not children, should be forced to take a medical treatment for someone else’s benefit.\n\nAnd even if it were possible to justify requiring children to take a shot in order to protect people around them, the data shows that the vaccine fails to prevent transmission of COVID. A recent study in the Lancet found that the peak viral load of COVID patients was similar regardless of vaccination status. The CDC’s data shows that tens of thousands of vaccinated individuals have gotten severe enough cases of COVID to have to be hospitalized – and the agency isn’t even trying to track cases among vaccinated people that don’t result in hospitalization, even though those individuals can spread COVID.\n\nI urge Senator _____to SUPPORT HB 2086, which would ensure children are not forced by DHS to take a shot that carries the risk of serious side effects in order to get an education.\n\nKeep your email short! You may choose to include a couple of these talking points – or none of them — that are most important to you, and be sure to explain why this issue matters to you personally.\n• Share why this is personal to you. Do you or a family member have a history of vaccine reactions? Is your child at risk for autoimmune conditions or other potential side effects of COVID-19 shots?\n• No one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• Young adults and teens (especially males) vaccinated against COVID-19 have been shown to have a higher risk for myocarditis (heart inflammation) than other populations. There has simply not been enough time to see what the risks of myocarditis and other potentially serious side effects of the vaccine are for younger children.\n• The Director of the CDC admits COVID-19 shots do not prevent transmission. For this reason alone, children should not be forced to submit to the injections. https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html#\n• COVID-19 vaccine manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 shots is the Countermeasures Injury Compensation program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medial expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000, and there is no judicial appeal. In other words, the victims will be severely undercompensated while the pharmaceutical companies get rich.\n• COVID-19 vaccines carry the risk of injury and death for some so there must be informed consent and the right to refuse the vaccine without penalty. As of February 25th, there had already been 774,373 COVID-19 vaccine adverse events and 11,312 domestic COVID-19 vaccine deaths in the U.S. reported to the Vaccine Adverse Events Reporting System.", "opengraph": {"locale": "en_US", "type": "article", "title": "Support A Good Vaccine Bill In Arizona!", "description": "🖨️ Print post The Arizona Legislature is considering a good bill that prohibits COVID-19 vaccine mandates for students.  House Bill No. 2086 would prohibit the Director of Health […]", "url": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-arizona/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2022-03-09T18:11:41+00:00", "article:modified_time": "2022-03-10T18:32:42+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.azleg.gov/findmylegislator/", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2021-11-2-3/04-COVID-Oster-508.pdf", "https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html#", "https://www.theguardian.com/world/2021/oct/28/covid-vaccinated-likely-unjabbed-infect-cohabiters-study-suggests", "https://apps.azleg.gov/BillStatus/BillOverview/76482?SessionId=125", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2022-03-09T18:11:41+00:00"}