{"result_id": "339036", "URL": "https://www.westonaprice.org/help-support-a-good-vaccine-bill-in-the-maryland-legislature/", "timestamp": "2023-04-25 18:11:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/help-support-a-good-vaccine-bill-in-the-maryland-legislature/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Help support a good vaccine bill in the Maryland Legislature!", "cleaned_text": "A new bill, HB 1161, would require healthcare providers to inform patients and parents of minors about the risks of Human Papillomavirus (HPV) vaccines by handing out an “information sheet” and to obtain written consent prior to administering any HPV vaccine each time.\n\nThis important bill would also require healthcare providers to apprise about the right to refuse HPV vaccines, that the vaccines may not be effective, and that you cannot sue if you or your child is injured by the shots.\n\nHB 1161 also provides liability protection for healthcare providers from any cause of action for providing the information.\n\nHPV vaccination can carry life-threatening side effects. There have been more than 73,000 adverse reactions, including many deaths, reported to the Vaccine Adverse Events Reporting System (VAERS) related to the HPV vaccine – and it is estimated by the government that only 1% of all reactions are ever reported!\n\nDid you know that the HPV vaccine, called Gardasil 9:\n• only targets a few of the over 100 known human papillomaviruses\n• has not been shown to last longer than 5 years\n\nAnd it has never been properly studied, despite the tens of thousands of adverse reactions that have been reported to the government in connection with the HPV vaccine.\n\nPatients and parents have the right to know about the real and not rare side effects of this high-risk vaccine!\n\nPlease help us support this bill!\n\nContact your Maryland Delegate and ask them to SUPPORT HB 1161.\n\nYou can find out who represents you at: https://mgaleg.maryland.gov/mgawebsite/Members/District\n\nCalls are more effective than emails and only take a few minutes. Below is a Sample Script, and there are additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“Hi, my name is ____, and I am a constituent. I am calling to ask Delegate ____ to SUPPORT HB 1161.\n\nI support any legislation that would inform patients and parents about the risks involved in getting HPV vaccines.\n\nI also support this legislation because it requires healthcare providers to obtain written consent prior to administration of the vaccines.\n\nHPV vaccines carry a high rate of side effects, with tens of thousands of reported adverse reactions and hundreds of reported deaths.\n\nThese vaccines have high levels of aluminum, which has been found to be harmful in numerous peer-reviewed scientific studies.\n\nHPV vaccines were fast-tracked through the FDA and have not been properly studied.\n\nYou cannot sue if you are injured by HPV vaccines. Patients and parents of minors have the right to make informed decisions and this bill will help educate them.\n\nBe sure to explain why this issue is important to you. You may wish to use a couple of the Talking Points below. Don’t copy all of them –use them as ideas to help structure your own message.\n• HPV vaccines have a high incidence of adverse reactions. To date, there have been over 73,000 adverse reactions reported to the Adverse Events Reporting System (VAERS) following HPV vaccination in the United States. Adverse reactions reported include severe neurological damage, stroke, blood clots, joint pain, pancreatitis, autoimmune disorders, and death. [VAERS database searches can be conducted at www.medalerts.org]\n• Many children have died or become severely injured after receiving HPV vaccines. Mandating HPV vaccines for children is dangerous and irresponsible.\n• A study out of Canada shows just how dangerous HPV vaccines are. The study looked at 195,270 girls who received HPV vaccination. Of the vaccinated girls, there were 958 hospitalizations and 19,351 emergency room visits. That means 10% of HPV vaccine recipients studied had a reaction that required an emergency visit or hospitalization. [Liu, X.C., Bell, C.A., et al. Adverse events following HPV vaccination, Alberta 2006–2014. Vaccine 34(15):1800-1805, 4 April 2016.] https://www.sciencedirect.com/science/article/pii/S0264410X16002036\n• HPV vaccines have the potential to trigger life-disabling autoimmune conditions and were shown in a study to likely cause primary ovarian failure. [Colafrancesco, S., Perricone, C., et al. Human papilloma virus vaccine and primary ovarian failure: another facet of the autoimmune/inflammatory syndrome induced by adjuvants. Am J Reprod Immunol. 70(4):309-316, Oct 2013. https://pubmed.ncbi.nlm.nih.gov/23902317/]\n• Whistleblower Dr. Sin Hang Lee reported that the Centers for Disease Control and Prevention (CDC), the World Health Organization (WHO), health officials in Japan and other nations all participated in covering up the dangers of HPV vaccines Gardasil and Cervarix. http://www.greatergoodmovie.org/news-views/officials-cover-up-dangers-of-hpv-vaccines/\n• According to Merck (the maker of Gardasil) if a person has already been exposed to the HPV strains contained in the vaccine prior to injection, Gardasil increases the risk of precancerous lesions by at least 44.6 percent.\n• There is no data that HPV vaccines remain effective beyond 5 years. The vaccine may also give a false sense of security, leading to less compliance with pap screenings.\n• In 2014 the FDA approved a new HPV vaccine (Gardasil 9) containing more than twice as much aluminum (a known neurotoxin, now approx. 500 mcg per 0.5-mL dose) as the previous vaccine despite there being over 1,600 scientific documents and peer-reviewed published papers confirming the dangers of aluminum toxicity to humans. http://www.naturalhealth365.com/hpv-vaccine-side-effects-1752.html\n• The CDC reports: “Most people with HPV never develop symptoms or health problems. Most HPV infections (90%) go away by themselves within two years.” https://www.cdc.gov/std/hpv/stdfact-hpv.htm\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines without having to pay for any of the injuries or harm.\n• By consenting to a vaccine, a child is also consenting to a shortened statute of limitations for any claim of injury under the Vaccine Injury Compensation Program (VICP) – presumably with little or no understanding of what that means. It is also much less likely that vaccine reactions will be recognized and connected to the vaccine by a child on their own; furthermore, it’s unlikely the child will file a report with the Vaccine Adverse Event Reporting System (VAERS).\n\nView text, status and history of the bill HB 1161 here: https://mgaleg.maryland.gov/mgawebsite/Legislation/Details/hb1161?ys=2023RS\n\nRead this article to learn more about HPV vaccines: https://www.westonaprice.org/health-topics/the-troubling-truth-behind-hpv-vaccines-prepare-to-be-outraged/", "opengraph": {"locale": "en_US", "type": "article", "title": "Help support a good vaccine bill in the Maryland Legislature!", "description": "🖨️ Print post A new bill, HB 1161, would require healthcare providers to inform patients and parents of minors about the risks of Human Papillomavirus (HPV) vaccines by […]", "url": "https://www.westonaprice.org/help-support-a-good-vaccine-bill-in-the-maryland-legislature/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-04-04T16:37:13+00:00", "article:modified_time": "2023-04-04T16:37:15+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://mgaleg.maryland.gov/mgawebsite/Legislation/Details/hb1161?ys=2023RS", "https://mgaleg.maryland.gov/mgawebsite/Members/District", "http://www.medalerts.org", "http://www.thevaccinereaction.org/2017/04/12-year-old-girl-left-paralyzed-after-suffering-an-alleged-reaction-to-hpv-vaccine/", "http://www.vaccineimpact.com/2016/american-college-of-pediatricians-latest-to-warn-of-hpv-vaccine-dangers/", "https://www.sciencedirect.com/science/article/pii/S0264410X16002036", "http://www.greatergoodmovie.org/news-views/hpv-vaccines-why-oh-why-are-they-on-the-market-at-all/", "https://pubmed.ncbi.nlm.nih.gov/23902317/", "http://www.greatergoodmovie.org/news-views/officials-cover-up-dangers-of-hpv-vaccines/", "https://sanevax.org/wp-content/uploads/2016/01/Allegations-of-Scientific-Misconduct-by-GACVS.pdf", "http://www.fda.gov/ohrms/dockets/ac/06/briefing/2006-4222B3.pdf", "https://www.wakingtimes.com/gardasil-vaccine-found-to-increase-cervical-cancer-risk-by-44-6-in-women-already-exposed-to-hpv/", "https://web.archive.org/web/20060806134235/http:/www.fda.gov/ohrms/dockets/ac/06/briefing/2006-4222B3.pdf", "https://www.cbsnews.com/news/gardasil-researcher-speaks-out/", "https://www.drugs.com/pro/gardasil-9.html#s-34089-3", "https://www.fda.gov/files/vaccines,%20blood%20&%20biologics/published/Package-Insert---Gardasil.pdf", "http://www.naturalhealth365.com/hpv-vaccine-side-effects-1752.html", "https://www.cdc.gov/std/hpv/stdfact-hpv.htm", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://vaers.hhs.gov/", "https://mgaleg.maryland.gov/mgawebsite/Legislation/Details/hb1161?ys=2023RS", "https://www.westonaprice.org/health-topics/the-troubling-truth-behind-hpv-vaccines-prepare-to-be-outraged/", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.hrsa.gov/vaccine-compensation/index.html", "https://vaers.hhs.gov/", "https://www.fda.gov/files/vaccines,%20blood%20&%20biologics/published/Package-Insert---Gardasil.pdf", "https://www.drugs.com/pro/gardasil-9.html#s-34089-3", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-04-04T16:37:13+00:00"}