{"result_id": "339043", "URL": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-idaho-today/", "timestamp": "2023-04-25 18:11:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-idaho-today/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support An Important Vaccine Bill In Idaho Today!", "cleaned_text": "Start the new year off by speaking up for a bill in the Idaho legislature that would require licensed daycares to notify parents of their right to vaccine exemptions for their children.\n\nSpecifically, SB 1005 will add the exemption notification language to the daycare vaccine mandate section of 39-1118. This bill would require daycare facilities to inform parents of their right to exemptions when discussing mandated vaccines is brought up.\n\nParents have the right to claim medical, religious, or philosophical vaccine exemptions in Idaho, but many do not know they have the option.\n\nSB 1005 is being heard tomorrow! We need you to tell Senators to vote YES on this bill and help us get it moving.\n\nThis is a great bill – but it’s a long road to it becoming law! We need you to make your voice heard!\n• Contact Members of the Senate Health & Welfare Committee before Thursday, Feb. 2nd at 3 PM and urge them to support SB 1005.\n\nEmail or call committee members using this link: https://legislature.idaho.gov/committees/senatecommittees/\n• Contact your Idaho State Senator and ask him or her to SUPPORT SB 1005.\n\nYou can look up who represents you at: https://legislature.idaho.gov/legislators/\n\nCalls are more effective than emails and only take a few minutes. Below is a sample script, and there are additional talking points after the second action item. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“My name is ____, and I live in (town.) I am calling to ask Committee Member/Senator ___ to support SB 1005, which would require daycare facilities to inform parents about available vaccine exemptions for their children.\n\nParents in Idaho have the right to decline vaccines for their children by claiming a medical, religious, or philosophical exemption, but many are unaware that they may do so.\n\nThis protective bill would allow parents to make decisions that are best for their children.\n\nThere are many reasons why parents may choose not to have their children get a particular vaccine or vaccines. There may be a history of negative reactions to vaccines in themselves or other family members, or they may have religious, moral, philosophical, or ethical objections to the production of specific vaccines. As recognized by the U.S. Supreme Court, vaccines are pharmaceutical products that carry the risk of injury or death. To date, billions of dollars have been paid out for vaccine injuries.\n\nCan you let me know where Committee Member/Representative ___ stands on this issue? You can email me at ____ or call me back at ____.”\n• Parents are in the best position to know what is best for their own sons and daughters, and there is a solid constitutional basis for them to be in charge of their children’s healthcare.\n• The fourteenth amendment contains a due process clause, which has been interpreted by the U.S. Supreme Court to apply to parents’ fundamental right to direct the care, custody, and control of their children. The U.S. Supreme Court has held this position for nearly a century.\n• If a parent chooses not to vaccinate a child, this should not be construed as abuse or neglect. A parent in this scenario is not refusing to treat an already-infected child. Instead, the parent has weighed the benefits and risks of vaccinating his or her own son or daughter with a specific vaccine or vaccines and has chosen against it.\n• Vaccines come with a risk of painful or deadly side effects. Some families also have objections to the ingredients or processes used in creating vaccines.\n• Vaccine package inserts warn of the risk of brain damage, life-threatening allergy, and death, and no one knows in advance whom a vaccine will harm. Each of us may respond differently as we have different medical histories, genes, epigenetics, and microbiomes.\n• Vaccine makers and the healthcare providers who administer them bear zero liability for vaccine injuries and deaths. The vaccine manufacturers reap all the profits from vaccines without having to pay for any of the injuries or harm.\n• The claimed justification – that unvaccinated individuals pose a health risk to others – is unsupported in the medical literature. In fact, vaccinated individuals can pose a greater risk to public health due to a process known as shedding. Scientific evidence demonstrates that individuals vaccinated with live virus vaccines such as MMR (measles, mumps, and rubella), rotavirus, chicken pox, shingles, and influenza can shed the virus for many weeks or months afterward and infect the vaccinated and unvaccinated alike. https://www.westonaprice.org/studies-show-that-vaccinated-individuals-spread-disease/\n• Vaccines are medical procedures that carry a risk of serious injury. The U.S. The U.S. Government has paid out nearly $4.9 billion as of 11/1/2022 to the victims of vaccine injury, per VICP Data Reports. Hundreds of thousands have reported an adverse reaction to vaccination to the Vaccine Adverse Event Reporting System (VAERS). https://www.hrsa.gov/vaccine-compensation/data\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising.[i] [ii] Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations. [iii]", "opengraph": {"locale": "en_US", "type": "article", "title": "Support An Important Vaccine Bill In Idaho Today!", "description": "🖨️ Print post Start the new year off by speaking up for a good bill in the Idaho legislature that would require licensed daycares to notify parents of […]", "url": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-idaho-today/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-02-01T17:32:59+00:00", "article:modified_time": "2023-02-01T17:33:02+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://legislature.idaho.gov/committees/senatecommittees/", "mailto:JVanOrden@senate.idaho.gov", "mailto:GZuiderveld@senate.idaho.gov", "mailto:ALee@senate.idaho.gov", "mailto:MHarris@senate.idaho.gov", "mailto:CBjerke@senate.idaho.gov", "mailto:MWintrow@senate.idaho.gov", "mailto:STaylor@senate.idaho.gov", "mailto:shel@senate.idaho.gov", "mailto:shel@senate.idaho.gov", "mailto:shel@senate.idaho.gov", "https://legislature.idaho.gov/legislators/", "http://www.nvic.org/NVIC-Vaccine-News/March-2011/No-Pharma-Liability--No-Vaccine-Mandates-.aspx", "https://www.westonaprice.org/studies-show-that-vaccinated-individuals-spread-disease/", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/11-01-22-VICP-Stats-508%20Compliant.pdf", "https://www.hrsa.gov/vaccine-compensation/data", "#_edn1", "#_edn2", "#_edn3", "https://legislature.idaho.gov/sessioninfo/2023/legislation/S1005/", "#_ednref1", "https://www.corp-research.org/merck", "#_ednref2", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "#_ednref3", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-02-01T17:32:59+00:00"}