{"result_id": "339007", "URL": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-colorado-3/", "timestamp": "2023-04-25 18:10:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-colorado-3/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support A Good Vaccine Bill In Colorado!", "cleaned_text": "Colorado legislators have introduced a good bill that would prohibit employers from discriminating against employees based on COVID-19 vaccination status. Additionally, House Bill 1100 also prohibits government agencies and private businesses, including health insurers, from discriminating against clients, patrons, or customers based on their COVID-19 vaccination status.\n\nThis terrific bill allows for an aggrieved person to file a civil action for any violations of their rights.\n\nHB 1100 is especially important given the pressure that is mounting to mandate COVID-19 injections, even though the shots are experimental, have been fast-tracked, and carry a high rate of side effects.\n\nThe bill is currently under consideration. We need you to speak up and make your voices heard!\n\nYou can find the Committee Members info here or simply cut and paste Member’s emails from the list below: https://leg.colorado.gov/committees/health-insurance/2022-regular-session\n• Contact your State Representative and urge them SUPPORT H.B. 1100.\n\nYou can look up who represents you at: https://leg.colorado.gov/find-my-legislator.\n\nSample script for email or calls is below. Personalize it by adding your own sentences and changing the wording – personal letters are far more effective than form letters!\n\n“My name is ____ and I live in (town). I am calling to ask Representative ____ to support H.B. 1100, which would protect Coloradans from mandatory COVID vaccinations and discrimination.\n\nThis bill protects individuals’ rights to choose whether or not to be injected with an experimental, fast-tracked COVID-19 vaccine.\n\nThere have been no long-term studies on the safety of these shots. People should not be forced to be injected with an experimental substance that could cause serious side effects. To date, there have been 777,303 injuries and 11,312 deaths reported in connection with the COVID shots to the CDC’s Vaccine Adverse Events Reporting System (VAERS) — and it is estimated that only 10 percent of adverse reactions are ever reported.\n\nNo one should be forced to take injections that carry a risk of injury, in order to keep their jobs. Nor should they be forced to submit to vaccination simply to live their day to day lives.\n\nI urge Representative _____to SUPPORT H.B. 1100, and to help it move as quickly as possible.”\n\nKeep your call or email short! Pick the 2 or 3 of these talking points – or none of them — that are most important to you, and be sure to explain why this issue matters to you personally.\n• Share why this is personal to you. Do you or a family member have a history of vaccine reactions? Are you at risk for autoimmune conditions or other potential side effects of the COVID-19 shot?\n• One of the most basic human rights is that of bodily autonomy, as recognized by the Nuremburg Code. Ethical medicine requires prior, completely voluntary and fully informed consent.\n• Vaccines are medical procedures that carry risk of serious injury. The U.S. Supreme Court recognizes vaccines to be “unavoidably unsafe” and to cause injury and death in some recipients. The U.S. Government has paid out $4.4 billion to the victims of vaccine injury. http://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/\n• COVID-19 vaccine manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by COVID-19 vaccines is the Countermeasures Injury Compensation program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medial expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000, and there is no judicial appeal. In other words, the victims will be severely undercompensated while the pharmaceutical companies get rich.\n• As of April 23, there have already been 118,902 COVID-19 Vaccine adverse events and 3,544 COVID-19 Vaccine deaths reported in the U.S. to the Vaccine Adverse Events Reporting System. https://www.medalerts.org/vaersdb/index.php\n• Many of the new vaccines being created use mRNA technology which use a faster and less expensive technology. mRNA vaccines have not been tested in large-scale clinical trials for lengthy periods of time. These new technology platforms have been used to develop experimental vaccines for SARS, MERS, and HIV, but so far, none have been proven effective and safe for humans.", "opengraph": {"locale": "en_US", "type": "article", "title": "Support A Good Vaccine Bill In Colorado!", "description": "🖨️ Print post Colorado legislators have introduced a good bill that would prohibit employers from discriminating against employees based on COVID-19 vaccination status.  Additionally, House Bill 1100 also […]", "url": "https://www.westonaprice.org/support-a-good-vaccine-bill-in-colorado-3/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2022-03-14T14:07:20+00:00", "article:modified_time": "2022-03-14T16:38:12+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/Depositphotos_46177223_xl-2015-e1567648790234.jpg", "image:width": "1000", "image:height": "625", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://leg.colorado.gov/sites/default/files/images/lcs/2021_house_hi_committee_information_and_procedures.pdf", "https://leg.colorado.gov/testimony", "https://leg.colorado.gov/committees/health-insurance/2022-regular-session", "mailto:susan.lontine.house@state.co.us", "mailto:chris.kennedy.house@state.co.us", "mailto:patrick.neville.house@state.co.us", "mailto:brianna.titone.house@state.co.us", "mailto:David.Ortiz.house@state.co.us", "mailto:karen.mccormick.house@state.co.us", "mailto:emily.sirota.house@state.co.us", "mailto:dave.williams.house@state.co.us", "mailto:mark.baisley.house@state.co.us", "mailto:kyle.mullica.house@state.co.us", "mailto:matthew.soper.house@state.co.us", "https://leg.colorado.gov/find-my-legislator", "http://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/", "https://medalerts.org/vaersdb/findfield.php?TABLE=ON&GROUP1=AGE&EVENTS=ON&VAX%5b%5d=COVID19", "http://ow.ly/OxTu50Da2zN", "https://www.medalerts.org/vaersdb/index.php", "https://leg.colorado.gov/bills/hb22-1100", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2022-03-14T14:07:20+00:00"}