{"result_id": "339022", "URL": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-alaska/", "timestamp": "2023-04-25 18:11:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.westonaprice.org/wp-content/uploads/cropped-favicon-150x150.png", "canonical": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-alaska/", "encoding": "UTF-8"}, "image": null, "domain": "www.westonaprice.org", "title": "Support an important vaccine bill in Alaska!", "cleaned_text": "Speak up for a good bill in the Alaska legislature that would give patients the right to have support persons present while also protecting the support person from vaccine mandates.\n\nSpecifically,HB 52 would prevent hospitals, mental health facilities, long-term care facilities, or hospices from requiring a support person to provide proof of the support person’s vaccination or immunization status.\n\nThe Alaska No Patient Left Behind Act (HB 52) is especially important because so many people were denied access to visitation by support persons during Covid. Many patients died alone in hospitals without anyone to advocate for them.\n\nEvery patient has the right to an advocate whether that person is vaccinated or not – especially when science clearly demonstrates that unvaccinated people do not pose a risk to others.\n\nPlease speak up! We need YOUR voice to help pass bill HB 52 today!\n\nContact your Alaska State Representative and ask him/her to SUPPORT HB 52.\n\nYou can look up who represents you at: http://akleg.gov\n\nCalls are more effective than emails and only take a few minutes. Below is a sample script along with additional Talking Points. Use your own words when you call or email – a personal message is always more effective than a form message!\n\n“Hi, my name is ____, and I am a constituent. I am asking Representative ____ to support HB 52, which would protect hospital and care facility patients by ensuring visitation rights regardless of the support person’s vaccination status.\n\nHB 52 is especially important as people have been denied access to their loved ones for not having Covid-19 injections.\n\nNo one should be discriminated against based on their Covid-19 injection status. Especially when the CDC admits that Covid vaccines do not prevent transmission. Unvaccinated visitors do not pose any greater risk than vaccinated visitors.\n\nI urge Representative _____to SUPPORT HB 52, which would protect patients and their advocates.\n• Vaccine mandates, segregation, and discrimination over vaccination and immunity status happen for all vaccines in many areas of life, including for Covid-19.\n• One of the most basic human rights is that of bodily autonomy, as recognized by the Nuremberg Code. Ethical medicine requires prior, completely voluntary and fully informed consent. No one should ever be required to get a vaccine nor denied the right to advocate for loved ones based on their vaccination status.\n• Vaccines are medical procedures that carry a risk of serious injury. Hundreds of thousands have reported an adverse reaction to vaccination to the Vaccine Adverse Event Reporting System (VAERS). The U.S. Government has paid out nearly $4.9 billion as of 2/1/2023 to the victims of vaccine injury, per VICP Data Reports [see link at https://www.hrsa.gov/vaccine-compensation/data]\n• On July 27, 2021, Rochelle Walensky, director of the CDC, went on CNN and acknowledged that Covid-19 injections do not stop people from catching or transmitting SARS-CoV-2. Requiring proof of vaccination does not limit the spread of Covid.\n• Covid vaccine manufacturers and providers are shielded from liability through the Public Readiness and Emergency Preparedness Act, or PREP Act. The only option for compensating people injured by Covid-19 vaccines is the Countermeasures Injury Compensation Program (CICP). Only eight percent of all petitioners since 2010 have been awarded compensation through the CICP. No legal or medical expert fees are covered, no pain and suffering is awarded, lost wages are capped at $50,000/year, and there is no judicial appeal. In other words, the victims will be severely undercompensated while the pharmaceutical companies get rich. [See Oct 2021 update for comparison of coverage by CCIP vs VICP (p. 7) – https://crsreports.congress.gov/product/pdf/LSB/LSB10584]\n• Vaccine manufacturers such as Pfizer, Merck, and GlaxoSmithKline have paid billions of dollars in criminal penalties and settlements for research fraud, faking drug safety studies, failing to report safety problems, bribery, kickbacks, and false advertising [1,2]. Pfizer paid $2.3 billion in 2009 alone to resolve criminal and civil allegations [3].\n\nView the text, status, and history of HB 52 here:\n\nRead these articles for more information on the dangers of Covid shots:\n\nPfizer Documents Confirm What We Already Knew: Covid Injections Are Dangerous – https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/#gsc.tab=0\n\nCovid-19 Injections And The Global Control Grid—Just Say No – https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/#gsc.tab=0", "opengraph": {"locale": "en_US", "type": "article", "title": "Support an important vaccine bill in Alaska!", "description": "🖨️ Print post Speak up for a good bill in the Alaska legislature that would give patients the right to have support persons present while also protecting the […]", "url": "https://www.westonaprice.org/support-an-important-vaccine-bill-in-alaska/", "site_name": "The Weston A. Price Foundation", "article:publisher": "https://www.facebook.com/wisetraditions/", "article:published_time": "2023-04-07T14:27:37+00:00", "article:modified_time": "2023-04-07T20:44:28+00:00", "image": "https://www.westonaprice.org/wp-content/uploads/act-now.png", "image:width": "1000", "image:height": "692", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["javascript:window.print()", "https://www.akleg.gov/basis/Bill/Detail/33?Root=HB%20%2052#tab6_4", "http://akleg.gov", "https://www.hrsa.gov/sites/default/files/hrsa/vicp/vicp-stats-02-01-23.pdf", "https://www.hrsa.gov/vaccine-compensation/data", "https://www.cnn.com/2021/08/05/health/us-coronavirus-thursday/index.html", "https://crsreports.congress.gov/product/pdf/LSB/LSB10584", "https://www.corp-research.org/merck", "https://www.theguardian.com/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals?CMP=share_btn_fb", "https://abcnews.go.com/Business/pfizer-fined-23-billion-illegal-marketing-off-label/story?id=8477617", "https://www.akleg.gov/basis/Bill/Detail/33?Root=HB%20%2052#tab6_4", "https://www.westonaprice.org/health-topics/pfizer-documents-confirm-covid-injections-are-dangerous/#gsc.tab=0", "https://www.westonaprice.org/health-topics/covid-19-injections-global-control-grid/#gsc.tab=0", "https://www.westonaprice.org/health-topics/toxic-nanoparticles-in-vaccines/#gsc.tab=0", "https://www.politico.com/news/2022/06/01/vaccine-injury-compensation-programs-overwhelmed-as-congressional-reform-languishes-00033064", "javascript:window.print()"], "authors": ["Administrator"], "publish_date": "2023-04-07T14:27:37+00:00"}