{"result_id": "340028", "URL": "https://whatreallyhappened.com/WRHARTICLES/binladenprofits.html", "timestamp": "2023-04-25 18:12:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "anthrax, vaccine, profiteering", "favicon": "", "canonical": "https://whatreallyhappened.com/WRHARTICLES/binladenprofits.html", "encoding": null}, "image": null, "domain": "whatreallyhappened.com", "title": "Bin Laden Profits from US Anthrax Vaccine Manufacture?", "cleaned_text": "It's a story straight off the pages of a John Le Carre or Robet Ludlum thriller. A mysterious Lebanese millionaire, who already owns telecoms companies in Venezuela and El Salvador, uses his influence to take over the sole manufacture, production and distribution of one of Americas most sought after defence products. Meanwhile, the world's most wanted terrorist appears to be profiting from his family's investment in the self same manufacturing process, assisted by no less a personage than the father of the President of the United States. Sounds fanciful? Well, on December 1st. last year the Pakistan News Service announced that documents belonging to a United States company called BioPort Corporation were found in the possession of the al-Qaeda in Kabul, Afghanistan. Seven weeks later, on January 16th, the United States Food and Drug Administration, which had, since 1999 prohibited BioPort from manufacture and production at its Michigan laboratories, announced that it had given its conditional approval for BioPort to begin the manufacture, production and shipping of its product to the US military. On February 1st. the US government gave BioPort Corp a green light on to resume production that had been shut down by the Food and Drug Administration for three years. So, exactly what is BioPort, what do they produce and who runs the company? Well, BioPort, based in North Lansing, Michigan, is the only corporation in the United States with a license to make the Anthrax vaccine. Except that BioPort doesn't actually make the vaccine, BioPort simply bought the laboratory that does make the vaccine, Michigan Biologic Products Institute, from the State of Michigan in 1998. Less than a month after it took over the business, BioPort acquired Michigan Biologic Products Institute's sole and exclusive customer for the Anthrax vaccine, the US Department of Defence, and an exclusive $29 million contract with the Department of Defence to \"manufacture, test, bottle and store the anthrax vaccine.\" The Pentagon agreed to pay BioPort $4.70 per shot and each member of the armed forces, that's 2.4 million soldiers, sailors, airmen and Marines, is supposed to get six shots over an 18-month period. That\u0092s a huge, guaranteed market for BioPort\u0092s product. Indeed, according to former Central Intelligence Agency military analyst Patrick Eddington, the estimated $60 million worth of anthrax vaccine BioPort is expected to produce for the Defence Department over the next five years could just be the beginning. \"The Pentagon has a $322 million, 10-year programme to develop at least three, and perhaps as many as a dozen additional biological warfare vaccines, making BioPort a huge profit.\" Eddington told ABCNews. However, since acquiring Michigan Biologic Products Institute, BioPort has only delivered a small amount of the anthrax vaccine to the US Defence Department. In fact, just 4% of the vaccine contracted for has so far been delivered because Food and Drug Administration audits uncovered suspicious record keeping as well as security and contamination problems at BioPort's laboratories, causing the FDA to ban delivery of the product until a few days ago. So now lets look at who owns and runs BioPort Corporation. Let's begin with Admiral William J. Crowe Jr. former Head of the US Joint Chiefs of Staff and a former US ambassador to Great Britain. It seems that back when President George H. W. Bush was setting up Osama Bin Laden as a \"freedom fighter\" (Afghanistan's \"freedom fighters\" were credited with shooting down more than 270 Soviet aircraft using American made Stinger missiles in the 1980's) the good Admiral and his associates on the Joint Chiefs of Staff were, according to some reports, selling American made weapons-grade Anthrax to Saddam Hussein in the hopes that he would use it against Iran. These days Admiral Crowe sits on the Board of Directors and owns 13% of BioPort Corp. According to ABC News reporter Howard L. Rosenberg: \"BioPort Corp. was created solely to take over the assets of Michigan Biologic Products Institute by Admiral Crowe, his partners in a company called Intervac L.L.C. and a group of former managers of the Michigan-based institute.\" It is Intervac that has the most interesting history here. According to Crowe\u0092s associate and spokesman, Jay Coupe, Crowe owns 22.5 percent of Intervac shares, although he hasn\u0092t \"invested a penny\" in the venture. Another 30 percent of Intervac shares are owned by Nancy El-Hibri, a mother and homemaker in suburban Maryland and the rest of the company is in the hands of \"I&F Holdings,\" a company directed by Nancy El-Hibri\u0092s father-in-law, Ibrahim El-Hibri, a Venezuelan citizen, and her husband, Fuad El-Hibri, a German citizen of Lebanese descent. According to Coupe, when Crowe returned from England in 1997, he was approached by Fuad El-Hibri\u0092s father, Ibrahim El-Hibri. The elder El-Hibri, whom the admiral had met a decade before, invited Crowe to serve on the board of Intervac. Fuad El-Hibri appears to be the real day-to-day director of Intervac and is listed by Dun & Bradstreet as the \"chief executive\" of Bioport. The reclusive Ibrahim El Hibri, who grants no interviews, has homes in Caracas, Maryland, Paris and Beirut, which he visits all year around, being careful of avoiding tax residence in any of them. Where he got his millions is a mystery. He invested in Porton International, a British pharmaceutical firm where his son worked, in the early 90\u0092s and according to a US Congressional review, Porton International sold anthrax vaccines to the Saudi Arabian Government. In Venezuela, Ibrahim El Hibri runs the country\u0092s third largest cell phone operator Digitel, despite having sold control of the company to Telecom Italia Mobile. Meanwhile in El Salvador, his son Fuad El Hibri, finds the time to run Digicel, a cellular telephone concession which the family bought two years ago. After the attacks of September 11th. President Bush placed BioPort's North Lansing laboratory under protection, invoking the national interest. Interestingly enough, the Italian magazine Il Manifesto reported, in its October issue, that this happened at the same time that the FBI also placed the El Hibri\u0092s at the top of their list of suspects for sending anthrax spores through the mail system. So, it seems that Admiral Crowe, the El-Hibris and their fellow investors in BioPort are set to make a nice profit from the Anthrax scare. And who are those fellow investors? Reports in the US media, denied by BioPort, have suggested that one major investor in the company is the Carlyle Group, one of America's most successful investment companies, well known for generating \"extraordinary returns\" for its customers through investments in the US defence industry. Because the Carlyle Group remains privately held, it is not required to disclose details of its investments or business activities, it has, however, an impressive array of board members. Former President George Bush Sr. and former UK Prime Minister John Major are directors of The Carlyle Group, as are other top US Republicans including former Secretary of State James A. Baker, and former Defence Secretary and deputy CIA Director Frank Carlucci. Now comes the interesting part of this story. According to reports in the US media, until October last year a major investor with The Carlyle Group was (and you had better sit down before you read this) the bin Laden family! For many years The Carlyle Group has maintained financial ties with the family of Osama bin Laden, but those links were supposedly severed after September 11th. when it was agreed that the relationship was becoming a tad embarrassing for all concerned. The story behind the Carlyle Group and the links between George Bush Sr. and the bin Ladens is fascinating to say the least. In the 1970's, Salem Bin Laden, the eldest of Osama Bin Laden's 55 brothers and sisters, invested heavily in George H. W. Bush's first business venture, Arbusto Energy. Salem became Bush's business partner through James Bath, a close friend of the future American president. Salem appointed Bath as his representative in Houston, Texas. It was Bath who invested $50,000 in Bush's company Arbusto and also bought Houston Gulf Airport on behalf of Osama's elder brother. Since then business links between Bush Sr. and the Bin Laden family have flourished, particularly since Bush Sr. joined the Carlyle Group. On September 27th. last year The Wall Street Journal reported that: \"George H.W. Bush, the father of President Bush, works for the bin Laden family business in Saudi Arabia through the Carlyle Group, an international investment consulting firm. The senior Bush has met with the bin Laden family at least twice. Osama bin Laden has supposedly been \"disowned\" by his family, which runs the Saudi Bin Laden Group, a multi-billion dollar construction business in Saudi Arabia. However, Osama's sister-in-law, in a recent interview with America's ABC News, said that she believed that members of her family still supported Osama bin Laden. If the rumours are correct about the Carlyle Group's investment in BioPort, then it's quite possible the bin Laden family is an investor in the only company able to make Anthrax vaccine in the United States, and because their beloved Osama might have some of the stuff, the family will make a fortune. In fact, the shortage of vaccine created by the now withdrawn FDA ban will make all those involved in BioPort extremely wealthy, as market forces drive the price of the vaccine up. A very cosy arrangement. The Bushes, El Hibri's and bin Ladens (and the occasional complicit Admiral) could all be making money off the fear and death of Americans. Is it any wonder, then, that documents relating to BioPort were found in the possession of bin Laden's al-Qaeda network in Kabul?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}