{"result_id": "340031", "URL": "https://whatreallyhappened.com/WRHARTICLES/flu.php", "timestamp": "2023-04-25 18:12:03 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://whatreallyhappened.com/WRHARTICLES/flu.php", "encoding": null}, "image": null, "domain": "whatreallyhappened.com", "title": "\"THE \"WHEN PIGS FLY\" FLU - IS THIS REALLY \"SWINE\" 11?\")", "cleaned_text": "The H1N1 virus is a hybrid of swine flu, which is highly contagious, and avian flu, which is similar in effect to the 1918 so-called \"Spanish\" flu, plus human influenza. (Maybe it should be called the \"When Pigs Fly\" flu.) The fatalities are mostly within the 25 to 45 age grouping. Ironically, it is the good health of this young adult population which causes the fatalities as the avian flu triggers a severe immune response which leads to excessive edema. This in turn ruptures the cell walls leading to hemorrhagic symptoms. Patients bleed out into their lungs and drown.\n\nUPDATE: At this time the numbers of infected and dead do not appear to support the excessive media hype about this disease. This appears to be another case of the government that cried \"wolf\", whether to distract the world from the plunging economy, torture scandal, AIPAC-gate, or simply to sell some of the vaccines sold by companies Congressmembers are invested in. Already we are seeing the financial reporters try to link the continuing economic decline to the flu. We are seeing \"Obama was just about to turn this economy around and THIS had to happen\" pap start to pour from the same TV media that told us Saddam had 'nookular' bombs!\n\nThere is no vaccine known to the public for this particular virus. There are vaccines for related viruses thought to possibly be effective, but this is unreliable information. In response to the problems of the 1976 Swine Flu vaccine which caused neurological damage in patients as well as the more recent Baxter scandal in which live H5N1 virus was mixed in with vaccine materials, the government of Sweden has advised their population NOT to obtain vaccinations at this time. As was demonsterated in the 1976 case, the decision to force vaccines on the public are often made more from a commercial for-profit concern than what is actually best for the population.\n\nIn the 1976 Swine Flu outbreak, the vaccine killed fifty times as many people as the flu did!\n\nAt this time it is being claimed that primary infection is skin-to-skin contact, so wash your hands often with a good bacteriological soap. Avoid touching other people. While risk of direct transfer by air is low, according to CDC, the reality is that coughs and sneezes can produce aerosolized secretions in which the virus is surrounded by liquids and able to survive for prolonged periods of time outside the body. If this virus has a lipid coating, that time will be longer.\n\nDisinfection of household surfaces can be accomplished with a dilute (10%) solution of chlorine bleach and water which will kill the virus. So will strong light, especially ultra-violet light.\n\nGiven the similarity between the avian flu component of this new virus and the 1918 Spanish flu, a possible precaution to take is common household cinnamon from the spice rack. During the 1918 outbreak it was noticed that people who worked at a cinnamon processing factory did not catch the disease. Cinnamon in high doses can be toxic, but a gram a day for adults seems like a reasonable dose.\n\nIt is entirely possible that this three-way hybrid virus occurred by chance, but there is compelling reason to wonder if maybe this virus is a laboratory accident, or worse, an intentional attempt at de-population.\n\nHere are some of the relevant facts.\n\nIn 1974, a document entitled National Security Study Memorandum 200: Implications of Worldwide Population Growth for U.S. Security and Overseas Interests was released by the United States National Security Council under the direction of Henry Kissinger. This document, National Security Study Memorandum 200, declared overpopulation, especially in the third world to be a strategic threat to the United States because of resource depletion and popular uprisings against US foreign policy.\n\nIn the 1990s, scientists exhumed the body of a victim of the 1918 flu pandemic buried and preserved in the Alaskan permafrost, and recovered the DNA of the virus.\n\nThere then followed a series of mysterious deaths of notable microbiologists.\n\nBack in 2004, we were being propagandized that Bird Flu was the next pandemic.\n\nCDC was talking about recombinant viruses back in 2005.\n\nGene studies showed that so-called Bird Flu appeared to be similar to the 1918 Spanish Flu. Other studies showed it was almost identical!\n\nWhich is rather nerve-wracking because in 2005 it was admitted that scientists were intentionally recreating the 1918 Spanish Flu virus!\n\nBut the predicted pandemic didn't happen because Bird Flu isn't that contagious. It needed to be blended with a more infectious form of flu, like swine flu (Used as a bio-weapon by the CIA against Cuba), to became a real slate-wiper!\n\nIn 2006, it was reported that scientists were intentionally creating bird flu and swine flu hybrids in the labs!\n\nWhich leads to asking how it is that this new flu epidemic explodes into view right after Fort Detrick admits that some of the nasty little beasties they have been working on went missing! And just other drugs might be on those vaccines that we do not know about?\n\nClorox Clean-up Spray (use according to label instructions)", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.google.org/flutrends/us/#US", "http://www.whfoods.com/genpage.php?tname=foodspice&dbid=68#healthbenefits", "http://en.wikipedia.org/wiki/National_Security_Study_Memorandum_200", "http://en.wikipedia.org/wiki/1974", "http://www.sciencedaily.com/releases/2007/07/070702145610.htm", "http://www.whatreallyhappened.com/WRHARTICLES/deadbiologists.html", "http://news.nationalgeographic.com/news/2004/12/1207_041207_birdflu.html", "http://www.cdc.gov/flu/avian/gen-info/transmission.htm", "http://news.nationalgeographic.com/news/2005/10/1005_051005_bird_flu.html", "http://www.yellow-llama.com/bird-flu-is-spanish-flu/", "http://www.abc.net.au/news/newsitems/200510/s1475608.htm", "http://www.maebrussell.com/Health/CIA%20Pig%20Virus.html", "http://www.dinocrat.com/archives/2006/12/18/of-ferrets-handkerchiefs-and-bird-flu/", "http://www.fredericknewspost.com/sections/news/display.htm?StoryID=89293", "http://www.lifesitenews.com/ldn/2004/mar/04031101.html"], "authors": [], "publish_date": null}