{"result_id": "340006", "URL": "https://whatreallyhappened.com/NEW/taxonomy/term/17", "timestamp": "2023-04-25 18:11:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/NEW/sites/default/files/favicon_0.ico", "canonical": "https://whatreallyhappened.com/NEW/taxonomy/term/17", "encoding": "utf-8"}, "image": null, "domain": "whatreallyhappened.com", "title": "COVER-UP/ DECEPTIONS/ PROPAGANDA | What Really Happened", "cleaned_text": "about Public Health Agency of Canada report calls for toppling of 'capitalism and liberty' to combat climate change.\n\nThe report concludes that climate change and poor public health are caused by many of the same things: “White supremacy, capitalism, colonialism, and racism.” PHOTO BY PUBLIC HEALTH AGENCY OF CANADA\n\nA new Health Canada report suggests public health officials should be openly advocating for the toppling of capitalism, Western society and even the very concept of “liberty and individualism.”", "opengraph": {}, "tags": ["Read more about 81-minute video: Need to Know News: lucid analysis of current events (April 24, 2023)", "Read more about The Origin Of Gas Chamber Myth 1916 Allied Propaganda Accusing Germany Of Gassing 700,000 Serbs", "Read more about Did Biden Steal the Election?", "Read more about Now be prepared for DOG FLU! Mutated form of avian influenza that strikes canines is 'creeping' towards being able to infect humans, scientists say", "Read more about Ex-CIA Director Says Blinken COLLUDED in Hunter Coverup Letter", "Read more about Power Over Profits: Heres the Dirty Little Secret Behind the Medias True Business Model", "Read more about Freedom of Religion and Other Lies", "Read more about Desperate Ray Epps Enlists Notorious Dem-Clinton Operatives to Threaten Tucker and Revolver News for J6 Reporting", "Read more about Ex-FBI Agents Accuse Top CIA, FBI Officials of 9/11 Coverup; CIA Said to Use Saudis, Others for Illegal Domestic Spy Operations", "Read more about Public Health Agency of Canada report calls for toppling of 'capitalism and liberty' to combat climate change."], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}