{"result_id": "340021", "URL": "https://w.whatreallyhappened.com/WRHARTICLES/anthrax_swindle.html", "timestamp": "2023-04-25 18:11:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://w.whatreallyhappened.com/WRHARTICLES/anthrax_swindle.html", "encoding": "iso-8859-1"}, "image": null, "domain": "w.whatreallyhappened.com", "title": "THE GREAT ANTHRAX STOCK SWINDLE!", "cleaned_text": "Where, oh where to begin! Well, let's begin with Adm. William J. Crowe Jr. It seems that back when Goerge H. W. Bush was setting up Osama Bin Laden as a Freedom fighter (A \"freedom fighter\" is the same thing as a terrorist, only aimed at someone you don't like) , the good Admiral and his buddies on the Joint Chiefs were selling American made weapons-grade Anthrax to Saddam Hussein in the hopes that he would use it on Iran (and then we wonder why the Iranian people don't much like Americans). Who knows who else got these American-made weapons of mass destruction either from Admiral Crowe or Saddam. But that was then and this is now. Admiral Crowe is retired. Admiral Crowe is quite wealthy, far beyond what one might expect on even an Admiral's salary. In fact, Admiral Crowe sits on the Board of Directors and owns 13% of BioPort Corporation. What is the BioPort Corporation, I hear you ask? Well, it's the only corporation in the United States with a license to make Anthrax Vaccine. Except that BioPOrt doesn't actually make the vaccine, BioPOrt simply bought the lab that does make the vaccine, Michigan Biologic Products Institute, from the State of Michigan in 1998, oddly enough at the same time John J. Maresca, Vice President of International Relations, UNOCAL Corporation, was telling congress that access to the oil reserves under the Caspian Sea required a new government in Afghanistan. Along with the actual Anthrax Vaccine, BioPort acquired Michigan Biologic Products Institute's sole and exclusive customer for the vaccine, the U.S. Department of defense. And here is the kicker. Since acquiring Michigan Biologic Products Institute, BioPort has not delivered a drop of the stuff! Only 4% of the vaccine contracted for has been delivered. FDA audits have uncovered suspicious record keeping and contamination problems, causing the FDA to ban delivery of the product. Despite this ban, the U.S. Government has continued to front BioPort millions of dollars to kep the operation going. And, given the \"State of Emergancy\", it is likely that FDA concerns for the product will soon be set aside and the vaccine delivered, not to the citizens whose taxes paid for it all, but to the military and to the government. So, good old Admiral Crowe and his fellow investors in BioPort are set to make a bundle off of the Anthrax scare. Especially when market demand pushes the price of the product high up above the contracted for $3.50 an ounce. And who are those fellow investors? Well, another part of BioPort is owned by the Carlyle Group. That's George H. W. Bush's current occupation. Yet another portion is rumored to be owned by the Bin Laden family, although this has not yet been confirmed! That's right. Just as the Bin Laden family made a fortune with the contract to rebuild the Khobar Towers supposedly blown up by Osama, the Bin Ladens will again make a fortune from their part ownership of the only company able to make an Anthrax Vaccine in the United States, because Osama might have some of that Anthrax that the United States sold to Saddam. In fact, the shortage created by the FDA bans will make all the players instant billionaires as market forces drive the price of the vaccine up to thousands of dollars per ounce. (At the time this article was written the same amount of the Anthrax treatment Cipro which sold for $20 in India sold for $690 in the US). A very cozy arrangement. The Bushes and Bin Ladens (and the occasional complicit Admiral) are all making money off of the fear and death of Americans. It's called conspiracy with a foreign power against the interests of the people of the nation. This sort of thing got Charles the First into trouble!", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}