{"result_id": "341016", "URL": "https://www.whatdoesitmean.com/index3738.htm", "timestamp": "2023-04-25 18:12:22 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3738.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "New York Times “Quacks Up” After CDC Secretly Admits Covid Jabs Don't Work", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA riveting new Security Council (SC) report circulating in the Kremlin today first noting Chairman Alexei Kudrin of the Accounts Chamber of the Russian Federation revealing: “According to various estimates, the losses of the world economy from the pandemic total from $4 trillion to $10 trillion, with the bulk of those losses accounting particularly for budgets of regions and municipalities...Health, social support systems have demonstrated unreadiness for global shocks… Today’s task of state bodies and supervisory agencies at all levels is to draft mechanisms that will enable those systems to become more stable and efficient”, says in response to this “global shock”, it sees American leftist tech multi-billionaire Bill Gates calling for the United States and United Kingdom to invest billions-of-dollars into a global pandemic task force running “germ games” to prepare for future outbreaks or biological attacks.\n\nThis transcript sees Security Council Members agreeing that instead of running “germ games”, the United States would be better served playing a “truth game”—most particularly like the “truth game” played by famed National Football League legend Aaron Rodgers this past week, who during what’s called an “explosive vax interview” laid waste to the Covid scamdemic—was an interview wherein Rodgers said he didn’t need an experimental Covid jab because of his good health, lifestyle and natural immunity—saw Rodgers revealing that he’s been tested over 300 times for Covid, and whose positive test this week came from him being in contact with a vaccinated person—saw Rodgers saying that the idea that “unvaccinated people are the most dangerous people in society” is the leftist media’s “propaganda narrative”—then it saw Rodgers stating and asking: “This idea that it’s a pandemic of the unvaccinated, it’s a just a total lie...If the vaccine is so great, then how come people are still getting Covid and spreading Covid and unfortunately dying from Covid?...If the vaccine is so safe, then how come the manufactures of the vaccine have full immunity from lawsuits?”—\n\nSecurity Council Members in this transcript examining the issue of the socialist Biden Regime giving Covid experimental vaccine makers “full legal immunity from lawsuits”, note that injury and/or death claims from all vaccines in America are adjudicated through the Countermeasures Injury Compensation Program (CICP), that in fiscal year 2021, caused the US government to pay out $246.9-million in claims for vaccine-related injuries and deaths—but for Covid experimental vaccine injuries and deaths, the CICP hasn’t paid anything—a strange occurrence when noticing that the US government logged more than 726,000 Covid vaccine injuries and deaths between 14 December 2020 and 17 September 2021—but whose strangeness disappears because the Biden Regime quietly changed the law, and today sees it being: “The Covid fund is not authorized to provide reimbursement for attorneys’ fees...A Covid vaccine-injured child would only be reimbursed for “reasonable medical expenses”...Since the child survived and isn’t employed, there’s no other compensation...The Covid fund allows a one-year window to file a claim whereas the regular vaccine fund has a three-year window”.\n\nWhile the socialist Biden Regime was quietly changing US law so those injured or killed by experimental Covid vaccines can’t be fully compensated, this report continues, the investigative journalists at Technofog-Substack uncovered secret US government emails shockingly proving that the CDC changed to definition of vaccine when they discovered that experimental Covid jabs weren’t working—in August-2021, saw the CDC stating: “Vaccine– a PRODUCT that stimulates a person’s immune system to produce immunity to a SPECIFIC DISEASE”—but in September-2021, after the definition was changed, saw the CDC stating; “Vaccine– a PREPARATION that is used to stimulate the body’s immune response against DISEASES”—is a CDC definition change of vaccine designed to protect Covid jab makers, and when noticed by Republican Party leader US Congressman Thomas Massie, saw him posting the message: “Check out @CDCgov’s evolving definition of “vaccination”…They’ve been busy at the Ministry of Truth”.\n\nThis transcript sees Security Council Members noting that the “newspaper of record” leftist publication New York Times failed to inform its readers that CDC downgraded its definition of vaccine from “prevent” to “immunity” to “prevention” to protect experimental Covid jab makers—a failure to inform the New York Times was forced to do, otherwise its readers would rightly accuse the CDC of “medical quackery”, a term that’s branded on those who pretend, professionally or publicly, to have skill, knowledge, qualification or credentials they do not possess; otherwise called charlatans or snake oil salesman.\n\nAt the same time the New York Times is protecting the “medical quacks” at the CDC, however, this report notes, it bears noticing that its famed columnist Ross Douthat just published in the New York Times his gobsmacking article “How I Became Extremely Open-Minded”, wherein he describes his painful multi-year battle with Lyme Disease no medicine or prescribed treatment is able to cure—a battle against this disease Douthat says drove him outside the boundaries of acceptable and approved modern medicine, and into the waiting arms of alternative medicine—specifically a Rife Machine, that after using for the first time saw Douthat proclaiming: “Naturally, it worked”—and in explaining why he’s risking his career by telling a truth being kept hidden, saw Douthat stating: “There are two good reasons to share this sort of story. The first is that it’s true, it really happened, and any testimony about what it’s like to fight for your health for years would be dishonest if it left the weird stuff out...The second is that this kind of experience — not the Rife machine specifically, but the experience of falling through the solid floor of establishment consensus and discovering something bizarre and surprising underneath — is extremely commonplace...And the interaction between the beliefs instilled by these experiences and the skepticism they generate (understandably) from people who haven’t had them, for whom the floor has been solid all their lives, is crucial to understanding cultural polarization in our time”.\n\nInvented by the late American inventor and early exponent of high-magnification time-lapse cine-micrography Royal Raymond Rife, this report explains, the Rife Machine is a device that uses the resonance frequency of a pathogen to destroy it within the human body—and as to why the Rife Machine isn’t more popular, sees it being said:\n\nUnfortunately, research with the rife machine abruptly stopped when the American Medical Association (AMA) refused to publish any paper supporting the rife technology.\n\nIt’s commonly thought that the AMA was directly responsible for the suppression of the rife device, which was considered “new medical technology.”\n\nIn fact, in 1942 the Court of Appeals found the AMA guilty of suppressing new medical technologies in favor of drug companies.\n\nIt wasn’t until the 1980s that research with the rife machine resumed. In 1987, Barry Lynes wrote and published a book titled The Cancer Cure that Worked, which revived the subject in alternative therapy circles.\n\nToday, researchers are still experimenting with the rife machine.\n\nWhile there are no long-term studies on its effects, scientists have concluded that low rife frequency electromagnetic waves do affect tumors while leaving healthy cells untouched.\n\nWhile studies on its effectiveness are still being conducted, the rife machine has become a well-known alternative to traditional cancer therapies.\n\nIn April-2020, this report concludes, the United States Federal Trade Commission began sending out “warning letters” to Rife Machine makers that had discovered and programmed into their devices the resonant frequency for the Covid virus, and stated: “For COVID-19, no such study is currently known to exist for the product identified above...Thus, any coronavirus-related prevention or treatment claims regarding such product are not supported by competent and reliable scientific evidence”—US government “warning letters” that were followed by The Energy and Resources Institute (TERI) in India announcing it had found a way to cure the COVID-19 by using an extraordinary sound therapy using electro-frequency vibration, exactly like the Rife Machine does—and is astonishing research joined with that conducted by Dr. Minghui Yao and Dr. Hongbo Wang at the School of Artificial Intelligence, Tiangong University in Tianjin-China, who in their critical to the world scientific paper being kept hidden from the American people titled “A Potential Treatment For COVID-19 Based On Modal Characteristics And Dynamic Responses Analysis Of 2019-nCoV”, revealed: “The 2019-nCoV is ravaging the world, taking lots of lives, and it is emergent to find a solution to deal with this novel pneumonia…This paper provides a potential treatment for COVID-19 utilizing resonance to destroy the infection ability of 2019-nCoV”. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nNovember 7, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nThe Secret Government Ruling America—Is Trump Still In Power?", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/mBL9pS6GMdA\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/mBL9pS6GMdA"}], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://ach.gov.ru/en/about/", "https://tass.com/economy/1358275", "https://www.rt.com/news/539398-bill-gates-germ-games-pandemic/", "http://en.kremlin.ru/structure/security-council/members", "https://thefederalist.com/2021/11/05/9-truths-from-aaron-rodgers-explosive-vaxx-interview-you-arent-allowed-to-say/", "https://thefederalist.com/2021/11/05/9-truths-from-aaron-rodgers-explosive-vaxx-interview-you-arent-allowed-to-say/", "https://thefederalist.com/2021/11/05/9-truths-from-aaron-rodgers-explosive-vaxx-interview-you-arent-allowed-to-say/", "https://thefederalist.com/2021/11/05/9-truths-from-aaron-rodgers-explosive-vaxx-interview-you-arent-allowed-to-say/", "https://thefederalist.com/2021/11/05/9-truths-from-aaron-rodgers-explosive-vaxx-interview-you-arent-allowed-to-say/", "https://thefederalist.com/2021/11/05/9-truths-from-aaron-rodgers-explosive-vaxx-interview-you-arent-allowed-to-say/", "https://www.hrsa.gov/cicp", "https://www.zerohedge.com/markets/people-dont-know-special-fund-exists-feds-pay-zero-claims-covid-19-vaccine-injuriesdeaths", "https://www.zerohedge.com/markets/people-dont-know-special-fund-exists-feds-pay-zero-claims-covid-19-vaccine-injuriesdeaths", "https://childrenshealthdefense.org/defender/vaers-cdc-covid-vaccine-injuries-deaths-fda-third-pfizer-shot/", "https://www.zerohedge.com/markets/people-dont-know-special-fund-exists-feds-pay-zero-claims-covid-19-vaccine-injuriesdeaths", "https://technofog.substack.com/", "https://technofog.substack.com/p/cdc-emails-our-definition-of-vaccine?justPublished=true", "https://technofog.substack.com/p/cdc-emails-our-definition-of-vaccine?justPublished=true", "https://technofog.substack.com/p/cdc-emails-our-definition-of-vaccine?justPublished=true", "https://twitter.com/RepThomasMassie/status/1435606845926871041", "https://en.wikipedia.org/wiki/Newspaper_of_record", "https://en.wikipedia.org/wiki/Quackery", "https://en.wikipedia.org/wiki/Ross_Douthat", "https://www.nytimes.com/2021/11/06/opinion/lyme-disease-medicine.html", "https://en.wikipedia.org/wiki/Lyme_disease", "https://www.nytimes.com/2021/11/06/opinion/lyme-disease-medicine.html", "https://www.nytimes.com/2021/11/06/opinion/lyme-disease-medicine.html", "https://en.wikipedia.org/wiki/Royal_Rife", "https://www.resonantlight.com/best-rife-machine/?gclid=EAIaIQobChMI0KnJvO-F9AIVFYrICh0r6Q5lEAAYASABEgKglvD_BwE", "https://www.immunitytherapycenter.com/blog/what-is-a-rife-machine/", "https://www.ftc.gov/system/files/warning-letters/covid-19-letter_to_bioenergywellness.pdf", "https://www.ftc.gov/system/files/warning-letters/covid-19-letter_to_bioenergywellness.pdf", "https://www.teriin.org/", "https://www.newindianexpress.com/nation/2020/jul/04/delhi-based-institute-claims-to-cure-covid-19-through-cosmic-sound-therapy-2165206.html", "http://www.tju.edu.cn/english/index.htm", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7577368/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7577368/", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3722pl.htm", "https://www.whatdoesitmean.com/index3722.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}