{"result_id": "341027", "URL": "http://www.whatdoesitmean.com/index921.htm", "timestamp": "2023-04-25 18:12:28 CEST+0200", "meta": {"description": "Sanhedrin David Booth Fatima Sharon Israel Iran Russia Temple.", "lang": "en", "keywords": "Sorcha Faal international news headlines, earth changes, world politics, international news, United Nations, US state dept, globalization", "favicon": "", "canonical": "http://www.whatdoesitmean.com/index921.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "WhatDoesItMean.Com", "cleaned_text": "Sorcha Faal’s Books Available Now In English!\n\nThe True Knowledge of The Three Minds: When The Three Become One By: Sorcha Faal “With knowledge obtained from the most ancient of texts, including the Gospel of Mary Magdalene, join Sorcha Faal on one of the most incredible and important journeys into the truest knowledge of human beings. (Continued)\n\nPicking up the Pieces: Practical Guide for Surviving Economic Crashes, Internal Unrest and Military Suppression By: Sorcha Faal “In the span of less than 3 months gasoline prices will rise 500%. The prices of both food and shelter rise over 300%. (Continued)\n\nThe Children of Winter: Apocalyptic Message of Hope By: Sorcha Faal \"Not told by Sorcha herself alone, but by the Children of Winter themselves, who at 6 years of age the weather had no effect upon them as they walked naked in the snows of winter. Who at 10 years of age could walk thorough boiling water with no burns or (Continued)\n\nWarns US Over Plans To Begin Massive Spraying Of American Population With Bird Flu Vaccine\n\nBy: Sorcha Faal, and as reported to her Russian Subscribers\n\nReports from the Kremlin today show that Foreign Minister Sergei Lavrov has issued a ‘strong protest’ to the United States over their plan to begin a massive spraying of their population to protect them from the bird flu virus H5N1.\n\nThis planned mass aerial spraying of the American population comes after the breakthrough research in this new technology by the United States Pentagon supported Akzo Nobel Dutch chemical giant, and as we can read as reported by Reuters News Service in their article titled \"Akzo Nobel to test mass bird flu vaccine\", and which says:\n\n\"Dutch chemical group Akzo Nobel said on Monday it has developed a bird flu vaccine prototype that can be applied to large avian populations by spraying instead of injections. The new vaccine, developed by Akzo's animal health unit Intervet, works against avian influenza and Newcastle Disease and is scheduled to undergo field trials next year, Akzo Nobel said in a statement.\n\nA vaccine that replaces the tedious and costly process of injecting birds individually could be available in the \"near future\", Akzo Nobel said.\"The prototype combines the efficacy of the present vaccines with a mass application tool and could prove invaluable in helping to quickly protect large numbers of birds, which currently have to be injected individually,\" Toon Wilderbeek, Akzo's executive in charge of pharmaceuticals, said in a statement.\n\nThe H5N1 avian influenza, which has spread out of Asia into Africa and across Europe, has killed or forced the culling of tens of millions of birds.\"\n\nThese reports state the United States authorities have become increasingly alarmed by their failure to mass produce a bird flu vaccine due to their involvement with the British vaccine maker Chiron, and as we can read as reported by the San Francisco Chronicle News Service in their article titled \"Feds fault Chiron for not cleaning up flu shot plant\", and which says:\n\n\"Chiron Corp.'s troubled flu shot factory in England earned poor marks from federal regulators last summer, just weeks before it expected to resume shipments to the United States -- and despite a 10-month effort to turn the plant around, according to a newly released report. The report by the U.S. Food and Drug Administration, obtained by The Chronicle under a Freedom of Information Act request, details the results of a nine-day inspection the FDA conducted in July.\n\nToday, the same Liverpool plant is in full production for this fall's flu shot season, and the company expects to produce up to 40 million doses for the U.S. market. It also has been tapped to fill a $62.5 million federal contract to make an experimental human vaccine against the H5N1 strain of bird flu. At the time of the inspection, the Emeryville company was under heavy pressure to resume making flu shots at its Liverpool factory after its entire production run of 48 million doses -- half the U.S. flu shot supply -- had been condemned the year before and destroyed.\n\nDespite the high stakes, FDA inspectors found that Chiron still was unable to test reliably for the presence of bacteria that had caused the previous year's shutdown and had failed to complete dozens of reports routinely required whenever problems crop up in the laborious vaccine-making process.\"\n\nThe greatest concern among Russian Scientists relating to this planned spraying of the American population is the ‘unproven genetic science’ behind the makeup of the new generation of altered DNA vaccines being developed by the United States and their possible effects upon all biological life-forms and eco-systems.\n\nIt has long been suspected that the has for years been conducting massive sprayings of their population, but to which their Government authorities have denied, and as we can read as reported by the Las Vegas Tribune News Service in their article titled \"Chemtrails Are Over Las Vegas\", and which says:\n\n\"Congressman Dennis Kucinich of Ohio authored the Space Preservation Act of 2001, which sought a \"permanent ban against weapons in space,\" specifically banning \"chemtrails\" as weapons. But in a subsequent version of the bill, the \"chemtrails\" language disappeared entirely. The missing words suggest an eyes-wide-open denial, which says as much about the cover-up as it does about the spraying that's plainly visible in the sky.\n\nIn a front-page story entitled \"Conspiracy theorists look up,\" the Akron Beacon Journal noted that Kucinich's bill \"had been rewrittenand the references to chemtrails and the other types of weapons were quietly eliminated.\" The Beacon Journal article, linking chemtrails to conspiracies, resulted from massive local pressure. Michel Massullo of Akron provided that newspaper with rolls of photos of plane trails and a sworn affidavit attesting to extensive aerial activity over that city.\n\nThe U.S. Air Force Website refutes the \"Chemtrail Hoax\" as having been around since 1996, \"accusing the Air Force of being involved in spraying the U.S. population\" with mysterious substances: \"Several authors cite an Air University research paper titled 'Weather as a Force Multiplier: Owning the Weather in 2025' that suggests the Air Force is conducting weather modification experiments. The purpose of that paper was part of a thesis to outline a strategy for the use of a future weather modification system to achieve military objectives and it does not reflect current military policy, practice, or capability.\"\n\nMost interesting about these American Government denials, however, are numerous Russian Intelligence reports that detail how the United States Military themselves are the ones responsible for disseminating information linking these ‘Chemtrails’ to weather modification, but which in truth are more likely to have an application for the control of populations via the introduction of fluoride based mental sedatives, according to these reports.\n\nThe concerns of the United States in regard to the bird flu are indeed well founded however as new reports from Indonesia are showing that this virus has possible begun its final mutation to human-to-human transmission, and as we can read as reported by Canada’s Globe and Mail News Service in their article titled \"Bird flu likely spread within Indonesian family\", and which says:\n\n\"The World Health Organization has concluded that human-to-human transmission likely occurred among seven relatives who developed bird flu in Indonesia. In a report obtained yesterday, WHO experts said the cluster's index case was probably infected by sick birds and spread the disease to six family members. The UN agency stressed the virus has not mutated and that no cases were detected beyond the family.\"\n\nA greater concern regarding this bird flu is the news coming out of China, and which shows they have not been forthcoming to the World in their knowledge of this dreaded virus, and as we can read as reported by the CBC News Service in their article titled \"China had bird flu case two years earlier than Beijing admits: researchers\", and which says:\n\n\"In an extraordinary turn of events, Chinese researchers have contradicted Beijing's official version of the country's H5N1 human infection timeline, revealing a Chinese man died of H5N1 avian flu fully two years before China reported its first human case to the World Health Organization in November 2005. The eight researchers reported in a letter in Thursday's New England Journal of Medicine - a letter they attempted to withdraw Wednesday - on the genetic blueprint of H5N1 virus isolated from the man, who died in November 2003.\n\nThat case predates any of the 228 confirmed cases that have been reported to WHO since the current outbreak of H5N1 virus began in late 2003. Officially, the first human cases in this outbreak occurred in Vietnam in December of 2003. Influenza experts outside China have long believed the country has hidden or missed human cases of H5N1. To date the country has reported 19 cases to the WHO; 12 of those people have died.\"\n\nTo whatever the final outcome of these events it remains the saddest fact that these American peoples do appear to be nothing more to their Government than test subjects for some of the most vial human experiments since the days of the Nazi Germans. And as the nightmare of these imprisoned peoples grows ever darker, their ability to seek protection for themselves and their families, and against all common sense, seems to have completely disappeared from their lives.\n\n© June 22, 2006 EU and US all rights reserved.\n\n[Ed. Note: The United States government actively seeks to find, and silence, any and all opinions about the except those coming from authorized government and/or affiliated sources, of which we are not one. No interviews are granted and very little personal information is given about our contributors to protect their safety.]", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.whatdoesitmean.com/index615.htm", "http://www.whatdoesitmean.com/threemindsbook.htm", "http://www.whatdoesitmean.com/index713.htm", "http://www.whatdoesitmean.com/partisanshandbook.html", "http://www.whatdoesitmean.com/index937.htm", "http://today.reuters.com/stocks/QuoteCompanyNewsArticle.aspx?view=CN&storyID=2006-06-12T064512Z_01_L12294817_RTRIDST_0_CHEMICALS-AKZO-VACCINE-UPDATE-1.XML&rpc=66", "http://today.reuters.com/stocks/QuoteCompanyNewsArticle.aspx?view=CN&storyID=2006-06-12T064512Z_01_L12294817_RTRIDST_0_CHEMICALS-AKZO-VACCINE-UPDATE-1.XML&rpc=66", "http://today.reuters.com/stocks/QuoteCompanyNewsArticle.aspx?view=CN&storyID=2006-06-12T064512Z_01_L12294817_RTRIDST_0_CHEMICALS-AKZO-VACCINE-UPDATE-1.XML&rpc=66", "http://today.reuters.com/stocks/QuoteCompanyNewsArticle.aspx?view=CN&storyID=2006-06-12T064512Z_01_L12294817_RTRIDST_0_CHEMICALS-AKZO-VACCINE-UPDATE-1.XML&rpc=66", "http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/06/21/CHIRON.TMP", "http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/06/21/CHIRON.TMP", "http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/06/21/CHIRON.TMP", "http://www.sfgate.com/cgi-bin/article.cgi?f=/c/a/2006/06/21/CHIRON.TMP", "http://www.lasvegastribune.com/20050819/headline1.html", "http://www.lasvegastribune.com/20050819/headline1.html", "http://www.lasvegastribune.com/20050819/headline1.html", "http://www.lasvegastribune.com/20050819/headline1.html", "http://www.theglobeandmail.com/servlet/story/LAC.20060622.REPO22-5/TPStory/TPInternational/Asia/", "http://www.theglobeandmail.com/servlet/story/LAC.20060622.REPO22-5/TPStory/TPInternational/Asia/", "http://www.cbc.ca/cp/health/060621/x062128.html", "http://www.cbc.ca/cp/health/060621/x062128.html", "http://www.cbc.ca/cp/health/060621/x062128.html", "http://www.whatdoesitmean.com/", "http://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}