{"result_id": "341039", "URL": "https://www.whatdoesitmean.com/index3508.htm", "timestamp": "2023-04-25 18:12:33 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3508.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Boxing Legend Marvelous Marvin Hagler KO'd To Grave As COVID Vaccine Disaster Deepens", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nAn informative new Security Council (SC) report circulating in the Kremlin today first noting Foreign Ministry spokeswoman Maria Zakharova revealing that the West has not yet stopped its information campaign against the Russian coronavirus vaccine Sputnik V, says most important was her stating: “It is evident that the campaign against our vaccine has been ongoing for many months…The backbone of that information hydra was broken by Westerners, by the way, after they had either rolled out vaccination with the Russian vaccine or started asking for its deliveries, or started calling for joint production on their territories…But it does not mean that this smear information campaign is over yet”.\n\nA statement of importance because the evidence that this “information hydra” of lies about Sputnik V, the first vaccine against COVID-19 registered in the world, has been broken continues to mount—as exampled by the North African nation of Tunisia starting its vaccination campaign with Sputnik V yesterday, the United Arab Emirates having completed their inoculation phase of the Sputnik V vaccine, and Italy last week becoming the first European Union nation to make the Sputnik V vaccine for its citizens—sees the Lancet Medical Journal last month having confirmed Sputnik V’s efficacy in peer-reviewed findings, showing its efficacy of 91.6%--and whose Gamaleya Research Institute developer today announced that the Sputnik V coronavirus vaccine has proven equally effective for all age groups.\n\nNot being told to the American people about Sputnik V, however, is that the Gamaleya Research Institute was able to be develop it so rapidly because they had already been working on its variants for decades—a development of Sputnik V that took only months to achieve—and was based on the Ebola virus platform Russian scientists have been working on for over 20-years—is also why this research institute was able to quickly develop a vaccine for the MERS virus—and when COVID-19 first appeared last year, saw its director Doctor-Scientist Aleksandar Ginzburg stating: “We were well-prepared in advance for this work…Over the past 20 and more years, our institute has been developing a platform that allows the replacement of defective genes with well-functioning ones…This technology was well-developed, but it was not adopted for practice due to economic and other circumstances”.\n\nThat Russian scientists have been working extensively on the vaccine against Ebola is not a secret, but their progress in that area went pretty much unnoticed—specifically because there is no financial profit incentives for pharmaceutical companies to invest hundreds-of-millions of dollars in developing a vaccine mainly for poor African countries—which meant that besides the Gamaleya Research Institute, only the American multinational pharmaceutical giant Johnson & Johnson continued researching the Ebola virus.\n\nAnd is critical to notice, because immediately after Russia registered the Sputnik V vaccine, Johnson & Johnson quickly followed the same research path to gain emergency use authorization for its COVID-19 vaccine, and in its announcement stated: “The Company’s COVID-19 vaccine leverages the AdVac® vaccine platform, a unique and proprietary technology that was also used to develop and manufacture Janssen’s European Commission-approved Ebola vaccine regimen and construct its investigational Zika, RSV, and HIV vaccines”.\n\nUnlike the Gamaleya Research Institute and Johnson & Johnson, both of whom leveraged their decades of Ebola virus research to quickly develop inactivated vaccines (or killed vaccines) against COVID-19 using dead coronavirus particles to build up immunity, the American bio-pharmaceutical company AstraZeneca and American bio-technology company Moderna took a new research path to develop their COVID-19 vaccines using Messenger RNA—otherwise known as “mRNA”—and sees these types of vaccines using live coronavirus particles—about which is known: “RNA instability is one of the biggest hurdles for researchers developing nucleic acid based vaccines…It is the primary reason for the technology’s stringent cold chain requirements and has been addressed by encapsulating the mRNA in lipid nanoparticles”—and in The Journal of Pharmaceutical Sciences late last year, saw Professor of Biopharmaceutics Daan J.A. Crommelin warning: “The complete, intact mRNA molecule is essential to its potency as a vaccine…Even a minor degradation reaction, anywhere along a mRNA strand, can severely slow or stop proper translation performance of that strand and thus result in the incomplete expression of the target antigen”.\n\nThis warning about mRNA vaccines was brought into grim focus this past week when leaked emails revealed that the European Medicines Agency raised concerns with Pfizer that the vaccine contained lower levels of intact mRNA molecules than expected—and were leaked emails followed by the shocking news that 9 patients in a Devon-England nursing home who received mRNA vaccines suddenly died of the coronavirus.\n\nEven more concerning, unlike the inactivated vaccines that don’t cause an inflammatory response of white cells leading to deadly blood clots, reports are now emerging that those receiving mRNA vaccines are dying of blood clots—and as revealed in the just published Bloomberg News article “AstraZeneca’s EU Vaccine Disaster Deepens on Clots”, wherein it states: “AstraZeneca Plc’s European vaccine nightmare is worsening, with a number of countries halting shots over safety fears as further delivery delays prompt governments around the world to hoard doses they’ve already got...At least 10 countries including Italy and Norway reacted after Austria, and later Denmark, raised concerns over the possible side effects from two batches”.\n\nIn what is being called “another tragic coincidence”, a few hours ago middle-weight boxing legend Marvelous Marvin Hagler died in an ICU after receiving a mRNA vaccine for COVID—and looming into the future for those who’ve received mRNA vaccines for COVID is an even greater potential catastrophe—a catastrophe whose names are B.1.1.7, B.1.351, and P.1—which are the 3 major variants of COVID sweeping across the globe—variants the Sputnik V vaccine protests against, also sees the single-dose Johnson & Johnson vaccine being effective against these variants—but are variants mRNA vaccines aren’t even designed to protect against.\n\nWith articles like “Russia Offers Europe Win-Win Vaccine Solution” pointing out the obvious truth: “Russia’s willingness to supply its vaccine to other nations reflects a sound medical strategy of promoting widespread and speedy immunization...The global pandemic requires a collective solution…No nation is safe until all are safe”, most urgently needed for the American people to do is to understand the facts behind articles like “Top US Billionaires Multiplied Their Fortune During Pandemic”, that reveals: “Nine of the richest people in the US have increased their prosperity by a combined total of more than $360 billion in the past year”—and when understanding, would see them being able to know the true reality being exposed in the article “Vaccine Nationalism: The Virulent Covid-19 Strain We Really Should Be Talking About”, wherein it states the real economic truth about this disease:\n\nOf particular worry is the risk of an ‘escape’ mutation that allows the virus to circumvent the immune response mechanisms triggered by the vaccines – turning them into, in effect, little more than fool’s gold.\n\nNaturally, pharmaceutical companies with vaccine approaches in the pipeline and billions at stake will claim to be able to tailor their vaccines to tackle these new variants.\n\nNot coincidentally, over the past week, efforts at the World Trade Organization to temporarily suspend intellectual property protections for vaccines – so as to allow unique approaches to be duplicated by other companies for scalability – were blocked, with opponents, including the US Chamber of Commerce, arguing that vaccine development and distribution would be hampered.\n\nOther calls to waive and modify IP protections have fallen on deaf ears too, but then that’s another ailment common to the short-sighted.\n\n[Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nMarch 14, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nAmericans Need To Remember That Tyranny Is An Illusion—And Qatar Is Helping Them\n\nAmerican People Are Winning A War They Don't Even Know They're Fighting", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://tass.com/world/1265717", "https://sputnikvaccine.com/", "https://tass.com/world/1265717", "https://sputnikvaccine.com/", "https://abcnews.go.com/Health/wireStory/tunisia-starts-vaccination-campaign-sputnik-shots-76434678", "https://www.bloomberg.com/news/articles/2021-03-11/uae-trials-show-russian-vaccine-has-91-6-efficacy", "https://abcnews.go.com/Health/wireStory/russia-make-sputnik-vaccine-italy-1st-eu-76336904", "https://www.thelancet.com/", "https://www.devex.com/news/in-brief-sputnik-v-vaccine-has-91-6-efficacy-the-lancet-finds-99047", "https://www.genengnews.com/covid-19-candidates/gamaleya-research-institute-of-epidemiology-and-microbiology-sputnik-v/", "https://www.business-standard.com/article/current-affairs/russia-s-sputnik-v-vaccine-equally-effective-for-all-age-groups-developer-121031400046_1.html", "https://news.cgtn.com/news/2021-03-14/Exclusive-How-Russia-s-Sputnik-V-vaccine-was-developed-within-months--YCietuIcYE/index.html", "https://news.cgtn.com/news/2021-03-14/Exclusive-How-Russia-s-Sputnik-V-vaccine-was-developed-within-months--YCietuIcYE/index.html", "https://news.cgtn.com/news/2021-03-14/Exclusive-How-Russia-s-Sputnik-V-vaccine-was-developed-within-months--YCietuIcYE/index.html", "https://news.cgtn.com/news/2021-03-14/Exclusive-How-Russia-s-Sputnik-V-vaccine-was-developed-within-months--YCietuIcYE/index.html", "https://news.cgtn.com/news/2021-03-14/Exclusive-How-Russia-s-Sputnik-V-vaccine-was-developed-within-months--YCietuIcYE/index.html", "https://en.wikipedia.org/wiki/Johnson_%26_Johnson", "https://www.jnj.com/johnson-johnson-covid-19-vaccine-authorized-by-u-s-fda-for-emergency-usefirst-single-shot-vaccine-in-fight-against-global-pandemic", "https://en.wikipedia.org/wiki/Inactivated_vaccine", "https://www.astrazeneca.com/", "https://www.genome.gov/genetics-glossary/messenger-rna", "https://www.bmj.com/content/372/bmj.n627", "https://www.bmj.com/content/372/bmj.n627", "https://www.medicalnewstoday.com/articles/early-concerns-raised-over-levels-of-intact-mrna-in-pfizer-vaccine", "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=167885", "https://www.bloomberg.com/news/articles/2021-03-14/astrazeneca-s-eu-vaccine-disaster-deepens-on-clots-nationalism", "https://www.bloomberg.com/news/articles/2021-03-14/astrazeneca-s-eu-vaccine-disaster-deepens-on-clots-nationalism", "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=167882", "https://www.thegatewaypundit.com/2021/03/boxing-great-marvin-hagler-dies-according-reports-icu-saturday-taking-vaccine/", "https://www.zerohedge.com/covid-19/explained-3-major-covid-19-variants", "https://www.zerohedge.com/covid-19/explained-3-major-covid-19-variants", "https://www.zerohedge.com/covid-19/explained-3-major-covid-19-variants", "https://www.zerohedge.com/covid-19/explained-3-major-covid-19-variants", "https://www.reuters.com/article/us-health-coronavirus-sputnik-mutations/russian-scientists-say-sputnik-v-performs-well-against-covid-mutations-idUSKBN2AR0E7", "https://abcnews.go.com/Politics/single-dose-johnson-johnson-vaccine-effective-variants-data/story?id=76084549", "https://abcnews.go.com/Politics/single-dose-johnson-johnson-vaccine-effective-variants-data/story?id=76084549", "https://www.zerohedge.com/geopolitical/russia-offers-europe-win-win-vaccine-solution", "https://www.zerohedge.com/geopolitical/russia-offers-europe-win-win-vaccine-solution", "https://sputniknews.com/us/202103141082336371-top-us-billionaires-multiplied-their-fortune-during-pandemic-reports-say/", "https://sputniknews.com/us/202103141082336371-top-us-billionaires-multiplied-their-fortune-during-pandemic-reports-say/", "https://www.rt.com/op-ed/517981-covid-vaccine-nationalism-pandemic/", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3491pl.htm", "https://www.whatdoesitmean.com/index3491.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}