{"result_id": "341001", "URL": "https://www.whatdoesitmean.com/index3644.htm", "timestamp": "2023-04-25 18:12:14 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3644.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Covid Vaccine Backlash Now Joined With Two Global Extinction Warnings", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nCovid Vaccine Backlash Now Joined With Two Global Extinction Warnings\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nAn informative new Security Council (SC) report circulating in the Kremlin today first sees this transcript showing Security Council Members reviewing a document prepared by the Ministry of Health (MINZDRAV), wherein it reveals that clinical trials of another Russian coronavirus vaccine, Betuvax-CoV-2 developed by the Institute of Human Stem Cells, may begin in September—and is a revelation preceded by top Russian infectious diseases specialist Doctor-Scientist Yekaterina Stepanova stating: “As preliminary research shows, various strains require various levels of antibodies…For example, protection against the South African strain requires a level of over 1,000 BAU/ml…The level for the Delta strain is presumed to be even higher, at 1,500 BAU/ml”, after which she informed everyone: “If you haven’t been vaccinated yet, I advise you to get the jab, regardless of whether you had fallen ill or not”.\n\nSecurity Council Members in this transcript note that a coronavirus is a group of related RNA viruses that cause diseases in mammals and birds, and in humans and birds cause respiratory tract infections that can range from mild to lethal—best exampled by the Common Cold, that has over 200 virus strains, with rhinoviruses, coronaviruses, adenoviruses and enteroviruses being the most common—the importance of knowing about is because Yale University scientists released a new study that found “exposure to the rhinovirus, the most frequent cause of the common cold, can protect against infection by the virus which causes COVID-19”—which is why Doctor-Scientist Stepanova asserts that serum diagnostics cannot be 100% precise, and should not be viewed as an ultimate reason to skip vaccination—then she dismissed rumors about a certain “dangerous” level of antibodies, when vaccination is not advised—and stated: “COVID patients are being treated with donor plasma, boosting the number of protective antibodies to speed up recovery…Therefore, there have been no evidence supporting this theory...The same applies to the theory of antibody-dependent enhancement of the infection, according to which a virus can find its way into a cell quicker when it merges with antibodies…Again, the success of plasma therapy proves this is not possible for the time being”.\n\nWith it now being beyond scientific dispute that Covid-19 was created in a laboratory, Security Council Members in this transcript note that this fact doesn’t matter anymore, because like all coronavirus, Covid-19 will continue to endlessly evolve—an evolution that will see Covid-19 adapting itself into never ending strains, exactly like the Common Cold and Flu Viruses—which is why famed Wall Street Journal editorial board member Holman W. Jenkins Jr. released his open letter last week entitled “The Delta Variant Is A Reality Test”, wherein he first states: “Americans haven’t wanted to understand what it means for a virus to be endemic”, then sees him truthfully revealing: “If you haven’t had Covid yet, you will…If you’ve had it once, you’ll have it again…If you’re vaccinated or were infected previously—which will one day be most people except the very young—your symptoms will likely be mild or nonexistent, but it’s not guaranteed...Nobody is surprised when they get the flu for the second, the third, the eighth time in their lives…This is what epidemiologists meant when, for the last 15 months, they said the new coronavirus was likely to evolve and become endemic”.\n\nJust like Russia, this report details, Sweden also knows that COVID-19 is endemic, which is why they refused to place their citizens under draconian masked-up lockdowns—and while refusing to lockdown their citizens, Swedish scientists continue examining Covid-19 vaccines that work for the known strains of this virus that have evolved, with them finding the best two being Russia’s Sputnik V and Johnson & Johnson’s, both of which are based on the dead virus vaccine model used for decades to create vaccines for influenza virus strains that mutate yearly—as opposed to the experimental mRNA vaccines for Covid-19 being forced on most Westerners by their socialist governments.\n\nThis transcript sees Security Council Members being astonished over the insane reaction by these socialist controlled Western nations to an endemic virus—a reaction never seen in history with common cold and/or flu outbreaks—today sees these socialist Western nations forcing their citizens with threats of social and job destruction to submit to experimental vaccinations—the lunacy of which is exposed when knowing the truth that whatever Covid-19 vaccines work today will be ineffective next year—but whose greatest failing of these socialist Western nations is them forgetting that their citizens aren’t as stupid as they thought they were—which is why, for the third week in a row, tens-of-thousands took to the streets around France to protest the government’s health pass law, which was passed by Parliament recently but still needs a final greenlight from a top constitutional council, expected next week, before it can be fully enforced—anti-lockdown protests that have now erupted in Germany, whose police forces beat protesters yesterday and arrested over 600 of them—while in Australia, it sees it socialist government having placed armed military troops in their cities to keep their citizens locked in their homes, and further saw this week leftist tech giant YouTube banning their nation’s top news outlet Sky News Australia for daring to tell the truth about Covid madness.\n\nIn the , this report continues, yesterday it saw Supreme Socialist Leader Joe Biden’s top Covid advisor Dr. Anthony Fauci grimly warning: “Things are going to get worse”—a warning joined by leftist tech giant Twitter suspending the account of a science writer because he posted the scientific results Pfizer published about a clinical test of their experimental Covid-19 vaccine—then saw leftist tech giant Apple removing a dating app for unvaccinated people—hysterical socialist lunacy coming at the same time it was revealed that less than 0.1% of vaccinated Americans tested positive for COVID-19 and resistance to vaccinations appears to have solidified, with a recent Washington Post-ABC News poll finding 29% of Americans say they are unlikely to get the shots, an increase from April, when 24% said the same, and in some corners, hesitancy to get inoculated has transformed into outright hostility.\n\nAdding to this socialist scamdemic lunacy, this report notes, is the leftist Washington Post reporting in their article “To Fight Vaccine Lies, Authorities Recruit An ‘Influencer Army’” that “the White House has teamed up with TikTok stars for pro-vaccine campaigns”, and then states: “Fewer than half of all Americans age 18 to 39 are fully vaccinated, compared with more than two-thirds of those over 50, according to the Centers for Disease Control and Prevention. And about 58 percent of those age 12 through 17 have yet to receive a shot at all”—after which they published their article “Vaccine Mandates Will backfire. People Will Resist Even More”, wherein it warns: “If this rhetoric and these efforts lead to a de facto national vaccine mandate, it will backfire…Americans from all walks of life resist being told what to put into their bodies, and many will resent any politician or institution that makes them get vaccinated, creating a crisis of legitimacy for any government, university or business that forces constituents, students or employees to get vaccinated…Indeed, the president of the Federal Law Enforcement Officers Association has already said, “There will be a lot of pushback” from members of his organization against the federal employee mandate”.\n\nSecurity Council Members in this transcript note that the vile game socialist leader Biden and his leftist propaganda media lapdogs are playing is one of blatant deception using Covid-19 case numbers, instead of telling the truth about how many are really sick from this disease—a vile game of socialist deception that explains why the New York Post just published their truthful article “Ignore The Hysteria: It's Time To Move Past COVID, America”, wherein it states:\n\n“Team Biden sure threw the nation into a state of confusion last week with its scary, flip-flopping COVID rhetoric, but Americans should rest assured: America’s pandemic is over, slain by Operation Warp Speed.\n\nYes, COVID will still take lives, but it’s simply not a major threat to people with immunity, whether natural or from a vaccine. Despite the new alarms from the Centers for Disease Control and Prevention about the Delta variant’s dangers, and the media hype amplifying them, the bottom line remains: Only a tiny fraction of those who are vaxxed have been infected and hospitalized, as The Post reported last week. An even smaller fraction have died.\n\nFact is, as a society, we have to move on — and not be paralyzed by the vax-resistant or those demanding zero risk.\n\nThe good news: Most of us are moving back to normalcy already.\n\nLet’s face it: The CDC and its public-health peers have been disaster shows all pandemic long (recall the test it insisted was the only acceptable one, until it turned out to not work?), but the failing has reached the level that the only rational thing to do is to not take its hopeless advice as gospel.\n\nBe sensible, but don’t let the scaremongering stop you living your life.\n\nThe coronavirus may be here to stay, but the menace is gone.\n\nFrom 1918 through 1920, the Spanish flu infected roughly a third of the world population, killing tens of millions. The distant descendants of that virus still kill tens of thousands of people globally each year — but life goes on.\n\nThat’s the inevitable future of COVID because evolution favors strains that are more contagious but far less deadly, since killing your host is a losing “strategy.”\n\nIn the decade after the Spanish flu, the nation saw an explosion of social, economic and cultural exuberance. Something like that is our own future, too, once our elites get past their hysteria.\n\nIt’s now time to move on — and let the good times roll.”\n\nAs to if “the good times roll” after this scamdemic hysteria ends, however, this might not what happens, because in the conclusion section of this transcript, it sees Security Council Members reviewing a document prepared for them by the Foreign Intelligence Service (SVR)—an SVR document containing information about American national security investigative journalist Brandon Smith, best known for his investigation of TransDigm for cornering the market on proprietary parts for US military aircraft—and contains information about former US Army Green Beret combat veteran John Moore, who is best known for releasing to the public, in 2010, the shocking news that the Gulf Stream had stopped flowing—for releasing this secret information Moore said was given to him by top US military officials saw it being said: “In 2010 he claimed that the Gulf Stream stopped and that the government isn't telling you this, and that we civilians are told that everything is working as intended…Of course this isn't true and the Gulf Stream is actually working exactly as we are being told and Mr. Moore is the one being full of himself”—but in 2015, it saw world renowned climate scientist James E. Kamis publishing his scientific paper “Gulf Stream Shut Down Caused By Geological Heat Flow”, wherein it confirms everything Moore first revealed in 2010.\n\nAs to why Security Council Members were reviewing this SVR information about national security investigative journalist Brandon Smith, this transcript shows it’s because of his just published article “Why Are Globalists And Governments So Desperate For 100% Vaccination Rates?”, wherein he asserts as being true:\n\n“The stage is being set for a mass infertility event, and covid will be blamed in place of the experimental vaccines.\n\nThis is why the establishment needs a 100% vaccination rate; unvaccinated people would stand as evidence of their crime.\n\nIf a large population of millions of people remain unvaccinated after the next couple of years, then they will represent a sizable and undeniable control group.\n\nA control group is a group of subjects that act as a pure sample untouched by a drug or vaccine experiment.\n\nIf the vaccinated group becomes ill or dies from specific conditions and the control group does not have those same conditions, then that is a pretty good sign that your vaccine or drug is poison.”\n\nAnd as to why Security Council Members were reviewing this SVR information about former Green Beret combat veteran John Moore, this transcript shows it’s because of the just published article “John Moore Reveals Military Knowledge Of Civilization-Ending Global Event”, wherein it beyond shockingly reveals:\n\n“If you’re wondering why corrupt, criminal governments of the world seem to be in such a hurry to mass “vaccinate” everybody with a deadly, experimental, non-approved gene therapy injection, one of the most shocking answers may be simpler than you think. According to analyst and radio host John Moore (The Man), who has many contacts with high level Navy officers and scientists, a global extinction level event is approaching and the globalists are desperately trying to cull the human population before people figure out what’s about to happen.\n\nIf 7+ billion people were told the truth about the coming cosmic event that may devastate human civilization, they would all stop working, causing a near-instant collapse of the entire global infrastructure of manufacturing, transportation, food production, government, military and so on.\n\nThe globalists are still buying up loads of supplies such as food, electronics, firearms, ammunition, communications gear, etc., and they need the masses to keep on working until the very end.\n\nOtherwise, they can’t acquire more supplies for themselves, even as these globalists are now hiding out on remote islands, moving into underground tunnel systems and cities, or planning to be off-planet when it all comes down.\n\nThe event that John Moore refers to is a “tenth planet” fly-by where a, dark large planetary mass (that can only be seen with infra-red telescopes) passes near Earth’s orbital plane around the sun.\n\nThe gravitational effects alone, warned former top Navy scientists, will cause cataclysmic Earth changes consisting of unprecedented earthquakes, volcanoes and even a “pole shift” that will reportedly reorient the physical polar axis of the planet (not just the magnetic poles), thereby shifting the equator and unleashing unimaginable ocean “slosh” that will inundate coastal areas on every continent.”\n\n[Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nAugust 2, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nNext Chapter Of American Civil War—United States Of Yugoslavia?\n\nThose Who Created Covid WILL Hang—China Says It Won't Be Them", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "http://en.kremlin.ru/structure/security-council/members", "http://government.ru/en/department/23/events/", "https://tass.com/society/1321577", "https://tass.com/society/1321577", "https://www.imemo.ru/en/about/persons/department/full?id=93", "https://tass.com/world/1321473", "https://tass.com/world/1321473", "https://en.wikipedia.org/wiki/Coronavirus", "https://en.wikipedia.org/wiki/Common_cold", "https://news.yale.edu/2021/06/15/common-cold-combats-covid-19", "https://tass.com/world/1321473", "https://tass.com/world/1321473", "https://tass.com/world/1321473", "https://nypost.com/2021/07/24/heres-all-the-proof-biden-needs-to-conclude-covid-19-was-leaked-from-a-lab/", "https://www.hoover.org/profiles/holman-w-jenkins-jr", "https://www.wsj.com/articles/delta-variant-coronavirus-covid-19-vaccine-hesitancy-11626816160", "https://www.wsj.com/articles/delta-variant-coronavirus-covid-19-vaccine-hesitancy-11626816160", "https://www.wsj.com/articles/delta-variant-coronavirus-covid-19-vaccine-hesitancy-11626816160", "https://www.rt.com/news/530759-sweden-delta-masks-zero-covid-deaths/", "https://www.rt.com/news/530759-sweden-delta-masks-zero-covid-deaths/", "https://www.nytimes.com/2021/07/31/world/europe/france-covid-pass-protest.html", "https://www.rt.com/news/530843-berlin-lockdown-protests-scuffles-police/", "https://www.thegatewaypundit.com/2021/07/australia-will-use-military-enforce-sydney-covid-lockdown-troops-will-knock-doors-make-sure-residents-home/", "https://www.rt.com/news/530825-sky-youtube-suspended-covid/", "https://www.wsj.com/articles/fauci-warns-on-covid-19-that-things-are-going-to-get-worse-11627838537?mod=djemalertNEWS", "https://www.zerohedge.com/political/twitter-suspends-science-writer-after-he-posts-results-pfizer-clinical-test", "https://www.zerohedge.com/political/apple-bans-tinder-anti-vaxxers-app-store", "https://www.axios.com/chart-vaccinated-americans-delta-covid-cases-b93710e3-cfc1-4248-9c33-474b00947a90.html?utm_source=twitter&utm_medium=social&utm_campaign=editorial&utm_content=health-covid", "https://www.washingtonpost.com/health/2021/07/31/vaccinated-angry-at-unvaccinated/", "https://www.washingtonpost.com/health/2021/07/31/vaccinated-angry-at-unvaccinated/", "https://www.nytimes.com/2021/08/01/technology/vaccine-lies-influencer-army.html", "https://www.nytimes.com/2021/08/01/technology/vaccine-lies-influencer-army.html", "https://www.msn.com/en-us/news/opinion/opinions-vaccine-mandates-will-backfire-people-will-resist-even-more/ar-AAMN584", "https://www.msn.com/en-us/news/opinion/opinions-vaccine-mandates-will-backfire-people-will-resist-even-more/ar-AAMN584", "https://nypost.com/2021/07/31/ignore-the-hysteria-its-time-to-move-past-covid-america/", "http://government.ru/en/department/112/", "https://brandonsmith.com/about/", "https://theintercept.com/2017/04/13/contractor-whose-business-model-is-price-gouging-the-pentagon-has-powerful-wall-st-backers/", "https://www.thelibertyman.com/bio.html", "https://globalrumblings.blogspot.com/2011/01/has-gulf-stream-stopped.html", "http://2012hoax.wikidot.com/john-moore", "http://www.plateclimatology.com/about", "http://www.plateclimatology.com/gulf-stream-shut-down-caused-by-geological-heat-flow", "https://alt-market.us/why-are-globalists-and-governments-so-desperate-for-100-vaccination-rates/", "https://www.naturalnews.com/2021-08-01-bombshell-interviews-john-moore-military-knowledge-of-civilization-ending-global-event.html", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3634pl.htm", "https://www.whatdoesitmean.com/index3634.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}