{"result_id": "341013", "URL": "http://www.whatdoesitmean.com/index836.htm", "timestamp": "2023-04-25 18:12:21 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.whatdoesitmean.com/index836.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "WhatDoesItMean.Com", "cleaned_text": "Sorcha Faal’s Books Available Now In English!\n\nPicking up the Pieces: Practical Guide for Surviving Economic Crashes, Internal Unrest and Military Suppression By: Sorcha Faal “In the span of less than 3 months gasoline prices will rise 500%. The prices of both food and shelter rise over 300%. (Continued)\n\nThe Children of Winter: Apocalyptic Message of Hope By: Sorcha Faal \"Not told by Sorcha herself alone, but by the Children of Winter themselves, who at 6 years of age the weather had no effect upon them as they walked naked in the snows of winter. Who at 10 years of age could walk thorough boiling water with no burns or (Continued)\n\nUnited States Military Leaders in Chaos as Terrorists Targeting US Center For Disease Control and American University Escape With Secret Documents And 1918 Spanish Flu Virus Samples\n\nBy: Sorcha Faal, and as reported to her Russian Subscribers\n\nIn what Russian Intelligence Analysts are describing as one of the most sophisticated intelligence operations ever conducted in the United States, an ‘unknown’, though suspected, terrorist organization, and operating under the ‘cover’ of an as yet unidentified foreign government, has succeeded in goals of acquiring the United States most protected secrets relating to the Bird Flu Pandemic.\n\nThese reports further state that these terrorists have not only succeeded in obtaining their intended target, and which were the computer hard drives containing massive amounts of data, but were also able to obtain complete genetic samples of one of the world’s most feared diseases, the 1918 Spanish Flu Virus.\n\nAccording to these reports, German Intelligence officers had first learned of this sophisticated intelligence plot less than two weeks ago and were unable to apprehend the subjects in , whereupon they issued International Arrest Warrants for the 14 suspected terrorists and notified both Russias FSB and the American CIA. The members of this terrorist group, according to these reports, are all former members of the former ’s Ministerium für Staatssicherheit (Stasi).\n\nEscaping from Europe this terrorist group was next suspected to be in the country of the Dominican Republic, and as we can read as reported by the Dominican Today News Service in their article titled \"Germany is looking for 14 fugitives in the DR\" and which says, \"Dominican security agencies are looking 14 Germans, wanted by that country’s authorities, for drug trafficking, fraud and tax evasion, among other crimes. The country’s investigative and airport security agencies were alerted of the German racketeers entering Dominican territory, and that the German government asked the authorities’ collaboration to locate about fourteen nationals from that country who are now fugitives after committing diverse felonies.\"\n\nThe next ‘surfacing’ of this terrorist group was in the United States this past weekend when they entered into the that country by boat from the Dominican Republic and then appropriated a jet aircraft, and as we can read as reported by News 11 Alive News Service in their article titled \"Mystery Behind Plane Unfolding\" and which says, \"Aviation experts say planes are easy to steal if you know how to fly them. But to fly a jet without a flight plan to Gwinnett County from Florida, you'd have to have a lot of experience. Sometime over the weekend, a ten passenger Cessna Citation landed at Briscoe Field [Atlanta, Georgia] without anyone noticing. The mystery of the stolen jet that landed at Briscoe Field is beginning to unfold according to Gwinnett County Police.\"\n\nOn Monday morning, October 10th, this terrorist group carried out simultaneous attacks on both the United States Centers for Disease Control and the genetic laboratories located at the Georgia Institute of Technology College of Sciences, and which are both located in the American city of Atlanta, Georgia.\n\nOf the attack at the Georgia Institute of Technology we can read as reported by the Associated Press News Service in their heavily censored article titled \"Two Georgia Tech dorms evacuated after suspicious devices found\" and which says, \"About 100 students were evacuated from Cloudman and Glenn residence halls after the janitor found the suspicious bottle at 8:45 a.m., said spokeswoman Amelia Gambino. At least two other bottles were found and detonated by Atlanta police, she said.\"\n\nAgain, it must be pointed out that under the current Military Regime in the United States all news of this kind are heavily censored and not allowed to be known by the American people themselves, and as exampled by the events that had occurred in Oklahoma, and as we can read as reported by Nebraska's State Paper News Service in their article titled \"In Bombing At OU Stadium There Are More Questions Than Answers\" and which says:\n\n\"Ten days have passed since a 21-year-old University of Oklahoma engineering student was killed when a bomb he was carrying exploded 100 yards from the stadium where Oklahoma and Kansas State were playing football before a crowd of 84,000 – and there are still more questions than answers to exactly What? and Why?\n\nThe explosion occurred about 7:30 p.m., during the second quarter of the KSU-OU game. During the fourth quarter OU President David Boren informed the media that a student had apparently committed suicide by blowing himself up near the stadium. He asked fans at the stadium to remain calm and said no one was in danger. How could he have been so sure? The FBI was just then starting interviews with some of Hinrichs’ neighbors and acquaintances. And the FBI’s Joint Terrorism Task Force, which is said to be in charge, would not have had time to arrive in Norman. It’s also a mystery why the mainstream media outside Oklahoma has pretty much ignored the incident.\n\nDays later the news media was obsessed with the story of a possible terror threat in New York City; and cable news outlets spent far too much time on a bomb threat that briefly closed the Washington Monument. But there was almost nothing about an actual bombing – just 100 yards outside a college stadium full of people – that could have been a terrorism incident gone awry.\n\nI first heard about the incident late Saturday, October 1, when it was a “breaking news” item on FOX News. The report said a bomb exploded near OU’s stadium during a football game. There was a brief video showing police cars with lights flashing and an area cordoned off by yellow police tape. I later checked the Omaha World-Herald’s online edition and found no mention of the incident. If over the next few days it was listed in the index for online OWH stories I missed it; it was not listed as a “headline” story. FOX never mentioned it again.\"\n\nTo the terrorist events in Atlanta, these reports further state, that not only were the terrorist able to obtain the secret data that had been their intended target, but were also able to obtain from the Georgia Institute Technical Collage a complete sample of the worlds most dangerous virus, the 1918 Spanish Flu, and which this collage was in the process of genetically coding for the United States Military, and who had just announced their success at resurrecting this horrific monster, and as we can read as reported by the Newsweek News Service in their article titled \"Resurrecting a Killer Flu\" and which says:\n\n\"Scientists have long puzzled over the exceptional lethality of the 1918 flu, which killed between 20 million and 50 million people worldwide. What features of the viral genome enabled it to become both highly transmissible and lethal at the same time? Some of those questions were answered this week, with the publication of twin papers in the journals Nature and Science. In Nature, Jeffery Taubenberger of the Pentagon's Armed Forces Institute of Pathology announced that he had completed sequencing the genome of the 1918 flu. At the same time, Terrence Tumpey, senior microbiologist at the Influenza Branch of the Centers for Disease Control and Prevention, reported in Science that he and his colleagues had used Taubenberger’s sequence to reconstruct the actual 1918 virus, a living copy of the germ that killed millions.\"\n\nVirtually unknown to the masses of American citizens is that this Bird Flu Pandemic, and to which some of the worlds Intelligence Agencies are suspecting was created by the US Military itself, are that the events that will soon overtake them have not been designed to protect them from this virus, but rather it will be the device utilized by their Military Leaders to complete their long laid plans for the creation of a total American Fascist Police State.\n\nEven to yesterday, the world watched in horror as the American President, and who is also the United States top Military Leader, announced that instead of the health or medical experts being put in charge of preparations for this Pandemic it would be led by the Military and Police Forces of America under the direction of their Homeland Security Department, and as we can read as reported by the MSNBC News Service in their article titled \"Homeland Security to be lead in flu crisis\" and which says:\n\n\"If the nightmare of an avian flu pandemic emerges from the dark chapters of doomsday scenarios, it will fall to the Department of the Homeland Security, not the medical establishment, to manage the crisis, according to federal documents and interviews with government officials.\"\n\nYesterday’s announcement by Americas top Military Leader followed his statements of last week, and where he asked the United States Congress for new laws to allow his use of Military Forces against the American people, and as we can read as reported by the CNN News Service in their article titled \"Bush military bird flu role slammed\" and which says:\n\n\"A call by President George W. Bush for Congress to give him the power to use the military in law enforcement roles in the event of a bird flu pandemic has been criticized as akin to introducing martial law. Bush said aggressive action would be needed to prevent a potentially disastrous U.S. outbreak of the disease that is sweeping through Asian poultry and which experts fear could mutate to pass between humans.\n\nSuch a deadly event would raise difficult questions, such as how a quarantine might be enforced, the president said. \"I'm concerned about what an avian flu outbreak could mean for the United States and the world,\" he told reporters during a Rose Garden news conference on Tuesday. \"One option is the use of a military that's able to plan and move,\" he said. \"So that's why I put it on the table. I think it's an important debate for Congress to have.\"\n\nThe Posse Comitatus Act of 1878 bans the military from participating in police-type activity on U.S. soil.\n\nBut Dr. Irwin Redlener, associate dean of Columbia University's Mailman School of Public Health and director of its National Center for Disaster Preparedness, told The Associated Press the president's suggestion was dangerous. Giving the military a law enforcement role would be an \"extraordinarily Draconian measure\" that would be unnecessary if the nation had built the capability for rapid vaccine production, ensured a large supply of anti-virals like Tamiflu and not allowed the degradation of the public health system.\n\n\"The translation of this is martial law in the United States,\" Redlener said.\"\n\nIn noting the dangers of any countries Military Forces assuming control of a nation, for whatever reason, history has long showed the horrific and terrifying results, and with no better example being the Germany Nazi Empire under Adolph Hitler, and to which almost exactly the American Military Leadership is copying. But not to knowing, or remembering, are these strange American people today….who even when their freedoms and liberties are stripped from them by the hour, they broker no dissent, they voice no outrage.\n\nAs hard as it is for any normal human being to believe and Western news sources show this to be true, the greater mass of the American population believe that they will be saved from death by a vaccine that doesn’t exist for a virus that no one possible knows what it will look like prior to its final stage mutation.\n\nTheir belief that this is so stands in contradiction to not just logic, but also the worlds top scientists, and as exampled by this article from the Channel News Asia News Service where one of the worlds top viral experts, Dr. Jeffrey Staples, Senior Medical Advisor at International SOS, had conducted an interview with the reporter Justin Teo, and had this exchange:\n\n“Justin Teo: Michael Osterholm, an infectious disease expert advising the US government, mentioned that if the H5N1 bird flu virus infects humans, it will move too quickly for drugs and vaccines to be of much use. How true is this?\n\nDr. Jeffrey Staples: I think he is absolutely correct in a lot of ways. First and foremost, on the vaccine front, there is no vaccine against the avian flu virus. If this virus mutates into a human pandemic form, we’ll not have a vaccine for that virus probably for six to nine months because we don’t know what the virus looks like yet and so we can’t make a vaccine for it.\"\n\nToday in America, some of their most vital secrets, and the world’s most deadly virus, relating to what will be for the entire world one of its most catastrophic events, are in the hands of a band of terrorists, for purposes only known to the country that had assigned these former Stasi Special Forces Operatives their mission.\n\nTo the American people themselves, they remain blinded to the horrific scope of what is about to befall them, and who upon hearing true things that are kept from them, and like the German people under Hitler, cry loudly to censor, to ban, to burn, to murder, to put into camps…..all who attempt to show them what the rest of the world knows.\n\nNo greater sign has been put before them than the actions of their own Military Leaders, who both in American and Israel, who both when faced with International condemnation for the United States torturing of Prisoners of War, and the Israeli Armies long practice of using innocent civilians as ‘human shields’, both responded as follows:\n\nAs reported by the Aljazeera News Service in their article titled \"Israel army to fight human shield ban\" and which says, \"The Israeli army has signaled its intention to keep using Palestinian civilians as human shields in operations aimed at assassinating, arresting or kidnapping Palestinian political and resistance activists.\n\nThe Israeli High Court issued a ruling earlier this week barring the army from using Palestinian civilians as human shields, a practice used heavily in the West Bank, particularly since the outbreak of the Palestinian intifada or uprising in 2000. On Tuesday, Israeli military sources said the army would press the High Court to reconsider the ruling on the ground that it would complicate \"army activities\" in the West Bank.\"\n\nAs reported by the Hartford Courant News Service in their article titled \"Demanding Right To Torture\" and which says, \"So deeply does President Bush feel our country, despite all its treaty commitments, has a right to torture that he has threatened to veto the bill if it passes. This would the first time in five years he has ever vetoed anything. Think about it: Five years of stupefying pork, ideological nonsense, dumb administrative ideas, fiscal idiocy, misbegotten energy programs --- and the first thing the man vetoes is a bill to pay our soldiers because it carries an amendment saying, once again, that this country does not torture prisoners.\n\nThis is the United States of America. It is our country, not George W. Bush's personal property. The United States of America still stands for the rights of man, for freedom, dignity and justice. We do not torture helpless prisoners. Our soldiers are not the SS, not the North Vietnamese who tortured McCain and others for years on end, not bestial Argentinean fascists, not the Khmer Rouge.\"\n\nTo the courage of the American writer to state that ‘Our Soldiers are not the SS’ ignores the reality that they in fact are. One only has to walk through an American city, or even one of its smallest towns, to see the future of their once great country, and where without exception the Militarization of their Nation is almost complete.\n\n© October 13, 2005, EU and US all rights reserved.\n\n[Ed. Note: The United States government actively seeks to find, and silence, any and all opinions about the except those coming from authorized government and/or affiliated sources, of which we are not one. No interviews are granted and very little personal information is given about our contributors to protect their safety.]", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.whatdoesitmean.com/index615.htm", "http://www.whatdoesitmean.com/index713.htm", "http://www.whatdoesitmean.com/index937.htm", "http://www.dominicantoday.com/app/article.aspx?id=5386", "http://www.dominicantoday.com/app/article.aspx?id=5386", "http://www.11alive.com/news/news_article.aspx?storyid=70388", "http://www.11alive.com/news/news_article.aspx?storyid=70388", "https://www.cdc.gov/", "http://www.cos.gatech.edu/info.htm", "http://www.accessnorthga.com/news/hall/newfullstory.asp?ID=97120", "http://www.accessnorthga.com/news/hall/newfullstory.asp?ID=97120", "http://nebraska.statepaper.com/vnews/display.v/ART/2005/10/10/434a8f7944e01", "http://nebraska.statepaper.com/vnews/display.v/ART/2005/10/10/434a8f7944e01", "http://nebraska.statepaper.com/vnews/display.v/ART/2005/10/10/434a8f7944e01", "http://nebraska.statepaper.com/vnews/display.v/ART/2005/10/10/434a8f7944e01", "http://nebraska.statepaper.com/vnews/display.v/ART/2005/10/10/434a8f7944e01", "https://www.msnbc.msn.com/id/9623695/site/newsweek/", "https://www.msnbc.msn.com/id/9623695/site/newsweek/", "https://www.msnbc.msn.com/id/9654456/", "https://www.msnbc.msn.com/id/9654456/", "http://edition.cnn.com/2005/POLITICS/10/05/bush.reax/", "http://edition.cnn.com/2005/POLITICS/10/05/bush.reax/", "http://edition.cnn.com/2005/POLITICS/10/05/bush.reax/", "http://edition.cnn.com/2005/POLITICS/10/05/bush.reax/", "http://edition.cnn.com/2005/POLITICS/10/05/bush.reax/", "http://edition.cnn.com/2005/POLITICS/10/05/bush.reax/", "http://www.channelnewsasia.com/stories/analysis/view/173095/1/.html", "http://www.channelnewsasia.com/stories/analysis/view/173095/1/.html", "http://www.channelnewsasia.com/stories/analysis/view/173095/1/.html", "http://english.aljazeera.net/NR/exeres/8431605A-2F44-4282-8037-E8B53A529EB9.htm", "http://english.aljazeera.net/NR/exeres/8431605A-2F44-4282-8037-E8B53A529EB9.htm", "http://english.aljazeera.net/NR/exeres/8431605A-2F44-4282-8037-E8B53A529EB9.htm", "http://www.courant.com/news/opinion/op_ed/hc-ivins1012.artoct12,0,5699594.story?coll=hc-headlines-oped", "http://www.courant.com/news/opinion/op_ed/hc-ivins1012.artoct12,0,5699594.story?coll=hc-headlines-oped", "http://www.courant.com/news/opinion/op_ed/hc-ivins1012.artoct12,0,5699594.story?coll=hc-headlines-oped", "http://www.whatdoesitmean.com/", "http://www.whatdoesitmean.com/", "http://www.whatdoesitmean.com/index737.htm"], "authors": [], "publish_date": null}