{"result_id": "341018", "URL": "https://www.whatdoesitmean.com/index3781pl.htm", "timestamp": "2023-04-25 18:12:24 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3781pl.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Supreme Court Starts 15 Day Countdown To Save America", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nNote: This is an urgent private letter intended for the sole and exclusive use of the patron/donors to the Sisters of Sorcha Faal.\n\nSister Ciara explained in her letter “Americans Have Been Warned—But They Forgot How To Think” sent to you yesterday that it was “an exercise meant to enable you to think about thinking”—and whose context is best understood when knowing that the reports written by the Dear Sisters are based on “predictive analytics”, from which they create “predictive models”.\n\nThe use of “predictive analytics” to create “predictive models” are employed by every company, government and institution you can name, and are what guide decision makers—but outside of in-depth economic articles read by financial decision makers, the mainstream media doesn’t employ them because, and it’s the truth, people are easier to manipulate and persuade if you don’t overburden them with facts, logic and truth.\n\nUnlike the mainstream media, however, the Dear Sisters care nothing about manipulating or persuading you about anything, as they believe you’re smart enough to think for yourself—which is why, on 15 December, they sent you the report America Warned Is “Past The Point Of No Return” As Supreme Court Hammer Blow Looms—and—on 16 December, sent you the report “Breathtaking Path Of Destruction” Blazed By US Supreme Court Backs Russia And China.\n\nOn 17 December, mainstream media articles appeared like “Court Allows Biden Employer Vaccine Mandate To Take Effect”, that revealed: “A federal appeals court panel on Friday allowed President Joe Biden’s COVID-19 vaccine mandate for larger private employers to move ahead, reversing a previous decision on a requirement that could affect some 84 million U.S workers...The 2-1 decision by a panel of the 6th U.S. Circuit Court of Appeals in Cincinnati overrules a decision by a federal judge in a separate court that had paused the mandate nationwide”.\n\nNow for those of you who read the two reports sent to you by the Dear Sisters that preceded this court decision, you realized it signaled a showdown to save America was looming—and shortly before Midnight last evening, the United States Supreme Court began a 15-day countdown to save America when it issued an extraordinary order saying it will hear this case on 7 January 2022.\n\nUnlike the mainstream media that will tell you this extraordinary Supreme Court order is about a case involving vaccine mandates, the Dear Sisters in their reports explained to you nothing could be further from the truth—and whose real truth about is documented in articles like “Confronting The Administrative State”, wherein, in 2015, it documented:\n\nIt is fitting that we refer to the administrative state as a “state,” for it has become a sovereign power unto itself, an imperium in imperio regulating virtually every dimension of our lives.\n\nIts nearly 450 agencies are manned by legions of bureaucrats, now numbering almost 2.7 million.\n\nIn 2013 alone, 3,659 final rules were issued, adding 26,417 pages to the Federal Register.\n\nAll told, the Code of Federal Regulations contained 175,496 pages of regulations spread out over 235 volumes as of 2013.\n\nThat represents a 7.4% increase in the number of pages in the CFR since President Obama assumed office — and that figure does not include 2014 or 2015.\n\nIn this case ordered by the Supreme Court to be heard on 7 January, its majority decision allowing vaccine mandates was written by President Barack Obama appointed United States Circuit Judge Jane B. Stranch, who spent her career as a private attorney litigator for Democrat Party interests—and whose dissenting opinion was written by President Donald Trump appointed United States Circuit Judge Joan L. Larsen, a former associate justice of the Michigan Supreme Court and clerked for Justice Antonin Scalia of the US Supreme Court during the 1994 term, and was a top legal expert in the President George W. Bush administration.\n\nAs one could expect, the majority decision written by Democrat Party activist-minion Judge Stranch is a leftist word salad of legal mumbling fully supporting the administrative state and whatever it wants to do against Americans—and stands opposed to legal giant Judge Larsen writing in her dissent:\n\nIn the modern administrative state, many ‘laws’ emanate not from Congress but from administrative agencies, inasmuch as Congress has seen fit to vest broad rulemaking power in the executive branch.\n\nTo preserve at least a modicum of democratic protections, Congress created the notice-and-comment requirements of the Administrative Procedure Act (APA), which provide public notice of a proposed rule and an opportunity for the public to express its concerns.\n\nWhether successful or not, the aim is to ensure that agency ‘rules’ are also carefully crafted (with democratic values served by public participation) and developed only after assessment of relevant considerations.\n\nThis case, though, involves yet a more truncated process.\n\nCongress understood that emergencies might arise, and so it provided the Secretary with authority to bypass the public and the deliberative process, and to issue emergency temporary standards that “take immediate effect upon publication” and remain effective for six months.\n\nBecause this is such a departure from the ordinary processes, federal courts have recognized this authority as the “most dramatic weapon in [OSHA’s] enforcement arsenal.”\n\nIt is an “extraordinary power” that “should be delicately exercised, and only in those emergency situations which require it.”\n\n“Emergency standards are to be used only in limited situations” and “only as an unusual response to exceptional circumstances.”\n\nPerhaps wary of misusing such immense authority, OSHA has rarely invoked it.\n\nThe agency has issued only ten previous emergency standards in the half-century that it has held that power. Six of those were challenged in court; five were struck down.\n\nTo illustrate OSHA’s task, consider the danger from fire in a workplace: a pizzeria.\n\nOne way to protect the workers would be to require all employees to wear oven mitts all the time—when taking phone orders, making deliveries, or pulling a pizza from the flames.\n\nThat would be effective—no one would be burned—but no one could think such an approach necessary.\n\nWhat OSHA’s rule says is that vaccines or tests for nearly the whole American workforce will solve the problem; it does not explain why that solution is necessary.\n\nOn 20 December, the Editorial Board of the Wall Street Journal issued a dire warning in their article “The Supreme Court’s Covid Vaccine Test” that said:: “The separation of powers is crucial to safeguarding individual liberty…Justices now have two key tests on whether they will rein in the administrative state…They will have to decide if they take their major question and non-delegation doctrines seriously, or are they merely seminars at the Federalist Society?”—and less than 48-hours later, the Supreme Court heeded this warning by ordering the extraordinary 7 January hearing.\n\nI bring your attention to this warning the Wall Street Journal issued to the Supreme Court, and their quick response to it, as an example to prove to you that your voice is being heard, and has smashed through the entire leftist mainstream propaganda media and big tech edifice created to silence you—and that I can further evidence with the Dear Sisters report “Biden Unleashes “Red October” Plot To Seize All Bank Accounts In America” sent to you on 25 October, wherein it revealed Biden was attempting to appoint Marxist leader Saule Omarova as the top banking regulator so she could seize all the bank accounts in America—a revelation that began a hidden battle to stop this outrage, that, on 7 December, ended in victory, as explained in articles like “Biden Bank Regulator Pick Saule Omarova Withdraws After Senate Fight Over Her Background”.\n\nAs you know, a war isn’t fought all at once, it’s a series of battles, some large, most small—and in this present war that you’re, most certainly, a part of, the side of freedom is winning more of these battles than we’re losing.\n\nHowever, and as these battles intensify, this war can still be lost unless more of you begin supporting those of us fighting on and behind its front lines.\n\nWhen armed by your kind and generous support, the Dear Sisters are able to wield their powerful weapons of truth and facts to battle back against the dark forces of lies and deceptions—so during this Christmas Season, can you please aid them with just a pittance of what Our Dear Lord has blessed you with?\n\nThank you for listening and aiding us in our hour of desperate need by going below and giving what you can, and as always, please feel free to write me at [email protected] with any comments/questions/suggestions, remembering to put ATTN: BRIAN in the subject line, or if requesting to be placed on the Sisters mailing list, put MAILING LIST in the subject line.\n\nAll the best folks,", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/index3781.htm", "https://www.whatdoesitmean.com/index3781.htm", "https://en.wikipedia.org/wiki/Predictive_analytics", "https://en.wikipedia.org/wiki/Predictive_analytics#Predictive_models", "https://www.whatdoesitmean.com/index3775.htm", "https://www.whatdoesitmean.com/index3776.htm", "https://apnews.com/article/coronavirus-pandemic-joe-biden-business-health-880d2052bb4127fb40bcaaca98514753", "https://apnews.com/article/coronavirus-pandemic-joe-biden-business-health-880d2052bb4127fb40bcaaca98514753", "https://www.supremecourt.gov/orders/courtorders/122221zr2_f20h.pdf", "https://www.nationalaffairs.com/publications/detail/confronting-the-administrative-state", "https://www.opn.ca6.uscourts.gov/opinions.pdf/21a0287p-06.pdf", "https://en.wikipedia.org/wiki/Jane_Branstetter_Stranch", "https://www.opn.ca6.uscourts.gov/opinions.pdf/21a0287p-06.pdf", "https://en.wikipedia.org/wiki/Joan_Larsen", "https://www.opn.ca6.uscourts.gov/opinions.pdf/21a0287p-06.pdf", "https://www.wsj.com/articles/the-supreme-courts-covid-vaccine-test-sixth-circuit-osha-mandate-11640034808?mod=hp_opin_pos_2#cxrecs_s", "https://www.wsj.com/articles/the-supreme-courts-covid-vaccine-test-sixth-circuit-osha-mandate-11640034808?mod=hp_opin_pos_2#cxrecs_s", "https://www.whatdoesitmean.com/index3725.htm", "https://www.cnbc.com/2021/12/07/biden-bank-regulator-pick-saule-omarova-withdraws-after-senate-fight-over-her-background.html", "/cdn-cgi/l/email-protection#44372b36272c2522252528042225373029252d286a2229", "https://fundrazr.com/f1fYo3?ref=sh_79C0K1_ab_1Kr7htbtQ5H1Kr7htbtQ5H", "https://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}