{"result_id": "341020", "URL": "https://www.whatdoesitmean.com/index3634.htm", "timestamp": "2023-04-25 18:12:25 CEST+0200", "meta": {"description": "Sanhedrin David Booth Fatima Sharon Israel Iran Russia Temple.", "lang": "en", "keywords": "Cho Seung Hui, Ismail Ax, Virginia Tech, Massacre", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3634.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Those Who Created Covid WILL Hang—China Says It Won't Be Them", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nThose Who Created Covid WILL Hang— Says It Won't Be Them\n\n“The Trial of the German war criminals was tacitly based on the recognition of the principle: criminal actions cannot be excused if committed on government orders; conscience supersedes the authority of the law of the state.”\n\nAlbert Einstein (1879-1955)— German-born theoretical physicist widely acknowledged to be one of the greatest physicists of all time.\n\nOn Tuesday, one of the most consequential moments in modern world history occurred when United States Senator Rand Paul questioned Dr. Antony Fauci during an under oath hearing in the US Senate—tense questioning that left Dr. Fauci visibly shaken to the point he accused Senator Paul of lying—that Senator Paul responded to by declaring that “there will be responsibility” for 4-million deaths from the Covid virus—and before continuing, please watch this full exchange, that’s posted below, so you’ll understand what was REALLY happening.\n\nWhat you’ve just witnessed is known in law as “predicate crime” questioning—a component of a larger crime Senator Paul was factually establishing with evidence Dr. Fauci was complicit in—criminal case questioning that was quickly followed by Senator Paul making a criminal referral to the Department of Justice accusing Dr. Fauci of lying to Congress regarding gain-of-function virus research—immediately after Senator Paul made this criminal referral the Democrats in the US House blocked a bill to declassify the origins of the Covid virus—then immediately after the Democrats blocked this bill, it saw the Department of Justice issuing an extraordinary memo limiting contact between them and the White House.\n\nIt would be accurate to say we’re witnessing in real time is the old cliché “Rearranging the deck chairs on the Titanic” as people rush to protect themselves from what they know is coming—which will be an exact replay of the Nuremberg Trials held in the aftermath of World War II that exposed the crimes against humanity committed by the leaders of Germany’s Nazi Regime, many of whose top leaders were convicted and hung by their necks until dead.\n\nWhy it’s important for you to know about the Nuremberg Trials is the same thing known by Senator Paul, as evidenced by his “predicate crime” questioning of Dr. Fauci—specifically because Senator Paul’s line of questioning exactly conformed to the legal outlines laid out in what is known as The Nuremberg Code-Permissible Medical Experiments, which established in binding international law:\n\nThe great weight of the evidence before us to effect that certain types of medical experiments on human beings, when kept within reasonably well-defined bounds, conform to the ethics of the medical profession generally.\n\nThe protagonists of the practice of human experimentation justify their views on the basis that such experiments yield results for the good of society that are unprocurable by other methods or means of study.\n\nAll agree, however, that certain basic principles must be observed in order to satisfy moral, ethical and legal concepts:\n\nThe voluntary consent of the human subject is absolutely essential.\n\nThis means that the person involved should have legal capacity to give consent; should be so situated as to be able to exercise free power of choice, without the intervention of any element of force, fraud, deceit, duress, overreaching, or other ulterior form of constraint or coercion; and should have sufficient knowledge and comprehension of the elements of the subject matter involved as to enable him to make an understanding and enlightened decision.\n\nThis latter element requires that before the acceptance of an affirmative decision by the experimental subject there should be made known to him the nature, duration, and purpose of the experiment; the method and means by which it is to be conducted; all inconveniences and hazards reasonably to be expected; and the effects upon his health or person which may possibly come from his participation in the experiment.\n\nThe duty and responsibility for ascertaining the quality of the consent rests upon each individual who initiates, directs, or engages in the experiment.\n\nIt is a personal duty and responsibility which may not be delegated to another with impunity.\n\nIn direct contravention of The Nuremberg Code, today in America it sees people being forced against their will to participate in history’s largest medical experiment involving Covid vaccines—a blatant violation of international law the United States is perpetrating using an Orwellian document they issued on 25 May 2021, wherein it replaces the words “experimental vaccines” with “emergency authorized vaccines”—in direct contravention of The Nuremberg Code further sees the American people not being told the truth that more people are dying from Covid vaccines than the virus itself, and whose Covid vaccine death toll is estimated at over 45,000.\n\nWhat I personally find most interesting in America today is that its black citizens are openly rebelling against these “experimental vaccines”—black citizens that make up 12% of the US population—but, as of 19 July, only 9% of these black peoples have allowed themselves to be given a Covid experimental vaccine shot—are black citizens the US government conducted secret medical experiments on for 40-years—and one can presume that after they hear that a John Hopkins study found zero Covid deaths among healthy children, these blacks will never allow their own children to become experimental lab rats.\n\nOn the other hand, however, what I find most personally distressing is the truth being hidden from the Americans that the Covid virus was created in a laboratory—an undisputed fact first revealed in February-2020 when the chilling scientific document “The Spike Glycoprotein Of The New Coronavirus 2019-nCoV Contains A Furin-Like Cleavage Site Absent In CoV Of The Same Clade” was published—a scientific document published a few weeks after Wuhan Lab virologist Shi Zhengli and her colleagues published a paper with the virus’s partial genome, wherein they omitted any mention of the special sequence that supercharges the virus or the rare double CGG section, yet the fingerprint is easily identified in the data that accompanied the paper—is a fingerprint that proves the Covid-19 pathogen has a genetic footprint that has never been observed in a natural coronavirus—specifically because for a virus to mutate it must have a genome sequence allowing this to occur—but in the Covid virus is missing—which means someone in a laboratory spliced the Covid virus together—and is exactly what Nobel Prize winning French virologist Dr. Luc Montagnier (aka the world’s smartest virus expert) said occurred in April-2020.\n\nThough you aren’t being allowed to know the truthful and historic significance of Senator Paul’s “predicate crime” questioning of Dr. Fauci as it relates to The Nuremberg Code, it most certainly wasn’t lost on the Communist Chinese government, that near immediately after this criminal case questioning occurred, suddenly declared to the entire world that it won’t mandate experimental Covid vaccines on its citizens, and officially stated: “Informed, consented and voluntary are the basic principles for the inoculation program of COVID-19 vaccines”—today sees China rejecting as “insulting” any new World Health Organization probe into the origins of Covid—and is a rejection coming at the same time China renewed its call for a Fort Detrick biolab probe as nearly 500-million Chinese petition WHO to search in the United States for Covid origins.\n\nAs China well knows, and history confirms, those who created the Covid virus and have forced experimental vaccines on unsuspecting people not aware of its deadly dangers will be put on trial, convicted and executed—though as to when this will occur sees our only guide being World War II—that saw an estimated up to 85-million people killed before those who committed the most despicable crimes against humanity were finally brought to justice.\n\nWith there being more things unknown than known as this present war grows in ferocity, I can assure you that Senator Paul wouldn’t have begun his “predicate crime” questioning of Dr. Fauci unless he knew an “endgame” has been put in place—a fact demonstrated by the House Democrats frantically hiding true information, and the Department of Justice distancing itself from the White House—which, at least to me, gives a strong signal that the good guys are winning.\n\nAs all of you know, my Dear Sisters have been with you through every twist and turn in this great conflict providing the truth and historical context needed to understand what is happening—a mission whose cost is crushing and hourly sees them making expenditures from near non-existent funds to keep true information flowing to you—and whose only lifeline as they fight both behind and on the front lines of this war remains your sorely needed generosity—and is why I leave you today with the words I’ve left you with before:\n\nIn the coming months, the dimensions of this looming war are going to shift in radical and unforeseen ways—which is why we believe it is your right to know the full truth about what is happening—a truth the demonic enemies of humanity and our God are doing everything in their power to suppress—which is why our Dear Lord ordered us to band together in such times as these to protect one another—a protection we urgently need at this very moment to keep the truth flowing to you—and in aiding us, our Dear Lord has promised you: “Give, and it will be given to you. A good measure, pressed down, shaken together and running over, will be poured into your lap. For with the measure you use, it will be measured to you.”\n\nOur needs today are dire indeed, but, if every one of you reading this gave just $20.00 today, our budget for the entire year would be met! So, before you click away, ask yourself this simple question….if your knowing the truth about what is happening now, and what will be happening in the future isn’t worth 5 US pennies a day what is?", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/pFoaBV_cTek\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/pFoaBV_cTek"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" align=\"center\" src=\"https://www.youtube.com/embed/9VnJ9l4xZ6Q\" frameborder=\"0\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/9VnJ9l4xZ6Q"}], "links": ["https://en.wikipedia.org/wiki/Albert_Einstein", "https://www.forbes.com/sites/joewalsh/2021/07/20/fauci-and-rand-paul-accuse-each-other-of-lying-in-tense-testimony-over-covid-origins/?sh=44ae6d2e4c73", "https://www.youtube.com/watch?v=pFoaBV_cTek", "https://en.wikipedia.org/wiki/Predicate_crime", "https://www.rt.com/usa/529874-fauci-criminal-referral-perjury/", "https://thefederalist.com/2021/07/21/house-democrats-block-bill-declassifying-the-origins-of-covid-19/", "https://www.politico.com/news/2021/07/21/justice-white-house-contact-biden-trump-500476", "https://www.washingtonpost.com/blogs/arts-post/post/literally-rearranging-the-deck-chairs-on-the-titanic/2012/04/12/gIQAqKhbCT_blog.html", "https://en.wikipedia.org/wiki/Nuremberg_trials", "https://media.tghn.org/medialibrary/2011/04/BMJ_No_7070_Volume_313_The_Nuremberg_Code.pdf", "https://www.fda.gov/media/142749/download", "https://www.fda.gov/media/142749/download", "https://www.fda.gov/media/142749/download", "https://www.thegatewaypundit.com/2021/07/second-week-row-covid-19-vaccination-deaths-covid-19-deaths-us-according-cdc-vaers-websites/", "https://www.infowars.com/posts/huge-whistleblower-says-at-least-45k-people-have-died-from-experimental-covid-jab-in-new-lawsuit/", "https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/", "https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/", "https://www.mcgill.ca/oss/article/history/40-years-human-experimentation-america-tuskegee-study", "https://thefederalist.com/2021/07/21/johns-hopkins-study-found-zero-covid-deaths-among-healthy-kids/", "https://www.researchgate.net/publication/339153857_The_spike_glycoprotein_of_the_new_coronavirus_2019-nCoV_contains_a_furin-like_cleavage_site_absent_in_CoV_of_the_same_clade", "https://www.wsj.com/articles/the-science-suggests-a-wuhan-lab-leak-11622995184", "https://www.wsj.com/articles/the-science-suggests-a-wuhan-lab-leak-11622995184", "https://www.wsj.com/articles/the-science-suggests-a-wuhan-lab-leak-11622995184", "https://www.wsj.com/articles/the-science-suggests-a-wuhan-lab-leak-11622995184", "https://www.youtube.com/watch?v=usyQgPU-VrI", "https://www.thegatewaypundit.com/2021/07/china-says-wont-mandate-covid-vaccinations-us-will-mandate-vaccines-military-force-pre-schoolers-wear-masks/", "https://www.thegatewaypundit.com/2021/07/china-says-wont-mandate-covid-vaccinations-us-will-mandate-vaccines-military-force-pre-schoolers-wear-masks/", "https://sputniknews.com/world/202107221083435731-there-is-no-evidence-of-covid-19-leak-from-lab-artificial-origins-of-virus-china-says/", "https://www.rt.com/news/529811-china-covid19-us-biolab-who/", "https://en.wikipedia.org/wiki/World_War_II_casualties", "https://dailyverses.net/giving", "https://fundrazr.com/f1fYo3?ref=sh_79C0K1_ab_1Kr7htbtQ5H1Kr7htbtQ5H", "https://www.whatdoesitmean.com/index072221.htm", "https://www.whatdoesitmean.com/indexnews.htm"], "authors": [], "publish_date": null}