{"result_id": "341040", "URL": "https://www.whatdoesitmean.com/index3752.htm", "timestamp": "2023-04-25 18:12:34 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3752.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Protest Rocked West Nears War Against “Leader Of Free World” To Hide “Mysterious Covid Truth”", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nProtest Rocked West Nears War Against “Leader Of Free World” To Hide “Mysterious Covid Truth”\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA forewarning new Security Council (SC) report circulating in the Kremlin today first noting leftist fake news American mainstream media outlet CBS News citing the customary unnamed US intelligence “sources” yesterday to warn that Russia is set to launch a winter invasion of Ukraine, with them stating: “An incursion is weather-dependent, but could happen in a matter of weeks, barring intervention from the West”, says quick to join this absurd war propaganda was new Ukrainian Defense Minster Alexey Reznikov, who warned that President Putin is “playing chess” with the West, and stated: “He is testing the unity of the European Union, he is testing the unity of NATO allies, he is testing our society, Ukrainians, he is testing Poland, the Baltic countries”—a sudden ratcheting up of Western war propaganda causing defense historians like Professor Glenn Diesen at the University of South-Eastern Norway to warn: “A Russia-NATO war over Ukraine is becoming increasingly unavoidable”—sees none of these Western war propagandists explaining why anyone would be so insane to launch a war during a brutal Russian Winter that has defeated every enemy throughout history—and in response to these Western lunatics, this morning Kremlin spokesman Dmitry Peskov most accurately observed: “Ukraine is most likely seeking to make another attempt at resolving its own problem through military means; create another disaster for themselves and for everyone in Europe…This is what Ukraine is striving for…And it is trying to achieve this, most likely, under the cover of those very NATO exercises near Russia's borders, NATO ships in the Black Sea, US and British soldiers in the region, of which there are more and more”.\n\nAs these “Winds Of War” continue blowing over Europe like they did last century fanning the flames for World War II, this report notes, unlike those past times when the United States was looked upon as the savior of the free world, its rapid plunge into demonic evil led by Supreme Socialist Leader Joe Biden today sees it being feared and reviled the world over—a fact noted yesterday by His Holiness Patriarch Kirill of Moscow and All Russia, who in commenting on the flood of Orthodox Christians that have fled to Russia for freedom from the United States declared: “I can imagine the types of reaction to my words from different corners, but I can prove that Russia today is the true leader of the free world...We’re free from the most powerful influences from abroad...We’re developing in accordance with our own path and, by God’s will, our path shall be successful...Russia can serve as an example for others”.\n\nAdding to his declaration that “Russia today is the true leader of the free world”, this report continues, His Holiness said: “We currently don’t have a hot-button issue that would make societal interests collide and produce deep, irreconcilable contradictions”, with him adding that Russia “benefited from a healthy diversity of opinion that doesn’t destroy the foundations of human and spiritual life”.\n\nUnlike in Russia where the “foundations of human and spiritual life” are enshrined in constitutional law and respected above all else, this report notes, peoples living under socialist siege in Western nations watched in horror as their tyrannical leaders used scamdemic fears of Covid to strip them of all their rights—the consequence of which saw tens-of-thousands of Australians marching for freedom yesterday—saw hundreds-of-thousands of Europeans rising up in every country for freedom—that includes the tens-of-thousands of freedom protesters taking over every city in Italy and the over 100,000 freedom protesters that took over in Zagreb-Croatia—and in Rotterdam-Netherlands this weekend, it shockingly saw police firing live rounds into massive crowds of rampaging freedom protesters.\n\nFueling the rage of these Western freedom protesters fighting back against their despotic elite socialist leaders, this report explains, was the European Medicines Agency (EMA) releasing data this past week showing that experimental Covid vaccines have injured 1,163,356 and killed a staggering 30,551 innocent European citizens—a shocking death toll caused by experimental Covid vaccines revelation that was joined by British health authorities grimly reporting that vaccinated English adults under 60 are dying at twice the rate of unvaccinated people the same age.\n\nIn the United States yesterday, this report continues, the CDC grimly reported that under socialist leader Biden twice as many people have died of Covid in 2021 than under President Trump in 2020—sees the CDC reporting “COVID-19 was the third leading underlying cause of death in 2020, replacing suicide as one of the top 10 leading causes of death” and revealing “Overall age-adjusted COVID-19 death rates were lowest among Asian and Hispanic persons and highest among Black and American Indian and Alaska Native persons”—sees the CDC further revealing “About 59% of the U.S. population is fully vaccinated, and some 17% have received booster shots”, and them further reporting that “81% of COVID-19 deaths hit people ages 65 and up last year, that group represents about 69% of this year’s deaths”.\n\nIn stark contrast to the European Medicines Agency, this report details, the CDC continues obfuscate the true number of those injured and killed by experimental Covid vaccines—but when looking at the US government’s Vaccine Adverse Event Reporting System (VAERS), as of 12 November, it documents that 1,742,488 innocent Americans have been injured by experimental Covid vaccines—sees it documenting “94,537 Total COVID Vaccine Reported Hospitalizations And 174,987 Total Reported Hospitalizations”—and most grimly documents “18,853 COVID Vaccine Reported Deaths”—all of which comes at the same time it bears noticing that the highest rates for Covid-related hospitalizations and deaths are occurring in highly-vaccinated socialist Democrat Party iron grip controlled Blue States.\n\nAs of 1 November, this report notes, the CDC would only confirm that 9,367 innocent Americans died because of experimental Covid vaccines—a number most critical to notice because it’s three-times higher than the 3,000 people total that have died from Covid since the pandemic began in Africa’s largest country Nigeria, that has a population of over 200-million—is a “Mysterious Covid Truth” being kept from the American people as to why the entire African continent has only 6% of its 1.2-billion population vaccinated, but has the lowest death Covid rate in the entire world—but whose mystery about that today has “scientists mystified”, becomes more than explainable if these Americans were told the truth about their Amish peoples, who like hundreds-of-millions of Africans, infected themselves with the Covid virus last year when the pandemic first began, then went about living their normal lives without masks, experimental vaccines, hospitalizations or deaths.\n\nThe conclusion section of this transcript sees Security Council Members wondering how the American people would react if they were allowed to know the truth that more of their loved ones have died from experimental Covid vaccines than have died of this disease in Africa’s largest country—though they note that these Americans still haven’t heeded the warning from a brave Chinese citizen pleading to them “Please don’t stop advocating, because if you don’t speak out, maybe it’s your furry babies that will die next” as Biden and his demonic socialist forces continue their plot to kill every pet puppy, kitten, dog and cat in American on their alter of Covid madness. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nNovember 21, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nThe Secret Government Ruling America—Is Trump Still In Power?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://www.rt.com/russia/540888-russian-troops-ukraine-winter/", "https://www.rt.com/russia/540888-russian-troops-ukraine-winter/", "https://www.rt.com/russia/540888-russian-troops-ukraine-winter/", "https://www.rt.com/russia/540868-putin-chess-master-troops/", "https://www.rt.com/russia/540868-putin-chess-master-troops/", "https://www.usn.no/om-usn/kontakt-oss/tilsette/glenn-diesen-1", "https://www.rt.com/russia/540853-red-lines-nato-war/", "https://en.wikipedia.org/wiki/Russian_Winter", "https://sputniknews.com/20211121/kremlin-does-not-rule-out-foreign-provocations-amid-claims-of-planned-russian-invasion-of-ukraine-1090899942.html", "https://en.wikipedia.org/wiki/The_Winds_of_War", "https://mospat.ru/en/patriarch/", "https://www.rt.com/russia/540847-kirill-church-orthodox-free/", "https://www.rt.com/russia/540847-kirill-church-orthodox-free/", "https://www.rt.com/russia/540847-kirill-church-orthodox-free/", "https://www.rt.com/russia/540847-kirill-church-orthodox-free/", "http://www.constitution.ru/en/10003000-03.htm", "https://www.rt.com/news/540865-australia-melbourne-freedom-protest/", "https://www.rt.com/news/540867-europe-thousands-protest-covid-passes/", "https://www.thegatewaypundit.com/2021/11/huge-protests-vaccine-mandates-italy-reach-18th-week-rest-europe-rises-joins-video/", "https://citizenfreepress.com/breaking/100000-citizens-rise-up-in-zagreb/", "https://citizenfreepress.com/breaking/rampage-in-rotterdam/", "https://www.ema.europa.eu/en", "https://www.thegatewaypundit.com/2021/11/european-medicines-agency-data-shows-1163356-adverse-drug-reactions-30551-fatalities-covid-19-vaccinations/", "https://alexberenson.substack.com/p/vaccinated-english-adults-under-60", "https://www.wsj.com/articles/u-s-covid-19-deaths-in-2021-surpass-2020-11637426356?mod=hp_lead_pos1", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7014e1.htm", "https://www.cdc.gov/mmwr/volumes/70/wr/mm7014e1.htm", "https://www.wsj.com/articles/u-s-covid-19-deaths-in-2021-surpass-2020-11637426356?mod=hp_lead_pos1", "https://www.wsj.com/articles/u-s-covid-19-deaths-in-2021-surpass-2020-11637426356?mod=hp_lead_pos1", "https://openvaers.com/index.php", "https://openvaers.com/index.php", "https://openvaers.com/index.php", "https://openvaers.com/index.php", "https://www.nytimes.com/interactive/2021/us/covid-cases.html", "https://www.miamiherald.com/news/coronavirus/article255540656.html", "https://news.yahoo.com/scientists-mystified-wary-africa-avoids-074905034.html", "https://news.yahoo.com/scientists-mystified-wary-africa-avoids-074905034.html", "https://news.yahoo.com/scientists-mystified-wary-africa-avoids-074905034.html", "https://news.yahoo.com/scientists-mystified-wary-africa-avoids-074905034.html", "https://news.yahoo.com/scientists-mystified-wary-africa-avoids-074905034.html", "https://www.whatdoesitmean.com/index3712.htm", "http://en.kremlin.ru/structure/security-council/members", "https://nypost.com/2021/11/15/china-slaughtering-pets-of-covid-patients-under-draconian-new-law/", "https://www.whatdoesitmean.com/index3747.htm", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3722pl.htm", "https://www.whatdoesitmean.com/index3722.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}