{"result_id": "341044", "URL": "http://www.whatdoesitmean.com/index2204.htm", "timestamp": "2023-04-25 18:12:35 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "http://www.whatdoesitmean.com/index2204.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Heads Of US Media “Explode” After Trump Targets Vaccines He Believes Causes Autism", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive, and Destroy Reputations\n\nHeads Of Media “Explode” After Trump Targets Vaccines He Believes Causes Autism\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nAn astonishing Ministry of Healthcare (MoH) report circulating in the Kremlin today states that within 2-hours of their receiving a request yesterday from Robert F. Kennedy Jr. [the son and nephew of the slain American leaders Senator Robert F. Kennedy Sr. and President John F. Kennedy] on behalf of the Trump Transition Team (Great Again) to review Federation medical files and statistics on the child neurodevelopmental disorder known as autism, the “heads/minds” of the elite US mainstream propaganda “fake news” media establishment exploded causing them to unleash against President-elect Donald Trump one of the most vile and false stories ever created against an American leader claiming that Russia had sordid intelligence files on him—and to which Presidential Press Secretary Dmitry Peskov responded to by blunting stating: “The Kremlin has no compromising information on Trump. This report does not correspond to reality and is nothing but an absolute fiction. This is a total bluff, an absolute fabrication, complete nonsense.” [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nAccording to this report, the request made to the MoH by Robert F. Kennedy Jr. for Federation autism information was based upon his appointment by President-elect Trump to become the Chairman of the Golden Vaccine Safety Task Force, but who is hated and reviled by the US propaganda media establishment after his publishing a manifesto titled MERCURY & VACCINES linking childhood vaccines with autism.\n\nPresident-elect Trump’s views on the linkage of childhood vaccines to autism have long been known, this report continues, such as when he stated to CNN during a May, 2016 interview:\n\n“Autism has become an epidemic… Because you take a baby in, and I’ve seen it, and I’ve seen it, and I had my children taken care of, over a long period of time, over a two or three year period of time, same exact amount, but you take this little beautiful baby, and you pump – I mean, it looks just like it’s meant for a horse, not for a child, and we’ve had so many instances, people that work for me, just the other day, two-years-old, two-and-a-half-years-old, a child, a beautiful child went to have the vaccine, and came back, and a week later got a tremendous fever, got very, very sick, now is autistic. …I’m in favor of vaccines [but] do them over a longer period of time, same amount, but just in little sections. I think you’re going to have – I think you’re going to see a big impact on autism.”\n\nFurther to note, this report says, are the many (and growing) rumors that President-elect Trump made his decision to run for president due to his youngest child, Barron, having been diagnosed with autism immediately after receiving a childhood vaccine shot, and that his wife, Melania, has vowed to file lawsuits against anyone making such a claim—but who, nevertheless, will not be moving to the White House in order to keep her child out of the “media bubble” that surrounds all US presidents and their families.\n\nTo how fanatically dishonest the US mainstream propaganda media is in protecting any American from being told about how dangerous these childhood vaccines are and how they cause autism, this report details, is constantly on display—including this past week when the might of these elite propagandists was turned against one of the most respected doctors in the US, Daniel Neides, MD, the Medical Director and Chief Operating Officer of the world renowned Cleveland Clinic Wellness Institute, for his daring to write an anti-vaccine article—that The Washington Post labeled “a viral screed” and that Dr. Neides was forced to apologize for, and may still be fired from his job.\n\nWhere Dr. Neides was shown the full might and power of the propaganda mainstream media in their protecting of the multi-billion-dollar vaccine industry no matter how many millions of American children get autism, however, this report continues, President-elect Trump’s appointment of the anti-vaccine advocate Robert F. Kennedy Jr. to head a new investigation into how autism is caused by childhood vaccines has caused these elites to “lose all sense of normalcy, bordering on the insane.”\n\nAnd to how actually insane these US mainstream media “fake news” propagandists have become, this report says, was displayed yesterday when nearly immediately after President-elect Trump appointed Robert F. Kennedy Jr. to head his new vaccine-autism taskforce, these elites began publishing articles and giving cable news interviews alleging that Trump was caught in Russia consorting with prostitutes who he allowed to pee on him—but was, in fact, a totally made up “fan-fiction” story lie created on Reddit.\n\nAs to why this “fan-fiction” story lie was created in the first place, this report explains, was due to group of pro-Trump Reddit users being angry with an anti-Trump reporter named Rick Wilson, who during an MSNBC interview referred to Trump supporters as “childless single men who masturbate to anime”.\n\nAfter creating this “fan-fiction” story lie about Trump and his peeing Russia prostitutes, this report explains, these pro-Trump Reddit users then sent it to Rick Wilson under the cover of “Anonymous”—and in what can only be described as “you can’t make this up” insanity, Wilson then sent this “fake news” story to the anti-Trump former CIA operative Evan McMullin, who then sent it to the George Soros funded US Senator John McCain, who then sent to the CIA, who yesterday leaked it to the leftist website BuzzFeed, and whose article has now been “echo chambered” throughout all the world.\n\nWant to know more? Click HERE.\n\nThis report concludes by agreeing with President-elect Trump on how vile and dishonest the US mainstream “fake news” propaganda media has now become—and who on his Twitter page today raged about this atrocity by saying:\n\n“Intelligence agencies should never have allowed this fake news to \"leak\" into the public. One last shot at me. Are we living in Nazi Germany?”\n\nJanuary 11, 2017 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked back to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human beings right to know the truth. Due to our missions conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nAmerica Goes Insane As It Rushes Towards Civil War\n\nThey Are Going To Come For You…Why Are You Helping Them?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.whatdoesitmean.com/", "http://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://government.ru/en/department/23/events/", "http://robertfkennedyjr.com/", "https://en.wikipedia.org/wiki/Robert_F._Kennedy", "https://en.wikipedia.org/wiki/John_F._Kennedy", "https://greatagain.gov/", "https://en.wikipedia.org/wiki/Autism", "http://nypost.com/2017/01/10/buzzfeeds-trump-report-takes-fake-news-to-a-new-level/", "http://en.kremlin.ru/catalog/persons/309/biography", "https://www.rt.com/news/373283-kremlin-trump-clinton-compromising/", "https://www.washingtonpost.com/politics/trump-to-meet-with-proponent-of-debunked-tie-between-vaccines-and-autism/2017/01/10/4a5d03c0-d752-11e6-9f9f-5cdb4b7f8dd7_story.html?utm_term=.ccd82731f2ef", "http://robertfkennedyjr.com/mercury-vaccines/", "http://www.vaccines.news/2016-05-25-cnn-tried-to-destroy-donald-trump-with-vaccine-autism-question-but-he-gave-this-amazing-response-2.html", "http://www.usmagazine.com/celebrity-news/news/melania-trump-threatens-lawsuit-over-barron-autism-video-w452617", "http://www.cnn.com/2016/11/20/politics/melania-trump-barron-white-house/", "http://www.healthnutnews.com/cleveland-clinic-md-damning-article-vaccines-schedule/", "http://www.cbn.com/700club/guests/bios/daniel_neides_protectyourhealth_1014.aspx?mobile=false", "http://www.healthnutnews.com/cleveland-clinic-md-damning-article-vaccines-schedule/", "https://www.washingtonpost.com/news/morning-mix/wp/2017/01/10/cleveland-clinic-doc-pens-viral-screed-against-vaccines-peers-call-it-post-truth-medicine/?utm_term=.20f6174fd08e", "https://www.washingtonpost.com/news/morning-mix/wp/2017/01/10/cleveland-clinic-doc-pens-viral-screed-against-vaccines-peers-call-it-post-truth-medicine/?utm_term=.20f6174fd08e", "http://www.globalresearch.ca/big-pharma-and-big-profits-the-multibillion-dollar-vaccine-market/5503945", "https://www.reddit.com/r/The_Donald/comments/5n8yd9/when_you_never_verify_anything_because_youre_fake/", "https://en.wikipedia.org/wiki/Rick_Wilson_(political_consultant)", "http://www.thedailybeast.com/articles/2017/01/10/4chan-claims-they-invented-the-trump-golden-showers-story.html", "https://en.wikipedia.org/wiki/Evan_McMullin", "http://www.wnd.com/2008/02/56177/", "https://www.buzzfeed.com/kenbensinger/these-reports-allege-trump-has-deep-ties-to-russia?utm_term=.hmzjV7RzdE#.kgdwABqLpo", "http://www.rumormillnews.com/cgi-bin/forum.cgi?read=66328", "http://www.nbcnews.com/news/world/moscow-rejects-report-donald-trump-ties-total-hoax-n705586", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "http://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "http://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "http://www.whatdoesitmean.com/index2187.htm", "http://www.whatdoesitmean.com/index1424.htm", "http://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}