{"result_id": "341019", "URL": "https://www.whatdoesitmean.com/index3708.htm", "timestamp": "2023-04-25 18:12:24 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3708.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Biden Deploys CIA “Zero Unit” Kill Squads After Horror Pics Of Vaxxed Babies Shock America", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA gobsmacking new Security Council (SC) report circulating in the Kremlin today, wherein this transcript sees Security Council Members discussing the NATO expulsion of eight Russian diplomats, allegedly over claims of “undisclosed espionage” at the military bloc’s Brussels headquarters, notes this provocation occurred within hours of NATO Secretary-General Jens Stoltenberg telling the Americans: “We have to talk to Russia because we don't want a new Cold War…We don't want a new arms race and Russia is our neighbour so we need to engage with them”—and in response to, this morning Kremlin spokesman Dmitry Peskov declared: “There is a glaring discrepancy between NATO officials’ statements about their wish to normalize relations with our country and real actions…These actions, of course, leave no room for illusions regarding the normalization of relations and the resumption of the dialogue with NATO…These prospects are rather completely upset”.\n\nThis transcript sees Security Council Members reviewing a Ministry of Defense (MoD) document about its recent activities at NATO headquarters in Brussels, the most beyond shocking part of which reveals that the CIA has secreted into the United States from Afghanistan up to 7,000 commandos from its “Zero Unit” kill squads—and about whom it’s reported: “In the course of their operations, often alongside CIA agents or US special forces troops, Zero Unit forces gained a reputation for extreme brutality against non-combatants, with Human Rights Watch and other rights groups accusing them of a range of abuses and outright war crimes including the execution of civilian adults and children during nighttime raids”.\n\nWith these CIA-trained “Zero Unit” kill squad war criminals now deployed at US military bases throughout America, this transcript sees Security Council Members grimly noting this is occurring at the same time Supreme Socialist Leader Joe Biden declared that American parents are now “domestic terrorists”—a “domestic terrorist” branding fully supported by the leftist mainstream propaganda media, like MSNBC now warning that American parents are “mentally ill white nationalists”—this week saw it being revealed that the US government secretly ordered leftist tech giant Google to identify anyone searching for information that might be dangerous to the Biden Regime—and is a campaign of terror directed by US Attorney General Merrick Garland, whose family is making millions-of-dollars in the socialist indoctrination of American school children.\n\nSecurity Council Members in this transcript note that the American people are fiercely resisting the socialist onslaught against them, as best exampled by them creating a “Firearms Bubble Economy” that makes 2021 the second-highest gun sales year ever, and with three months remaining in this year, today sees it being reported: “So far this year, there have been over 30 million checks through the National Instant Criminal Background Check System…In 2020, there was a total of 39,615,395 checks”.\n\nEnraging these tens-of-millions of gun owning under socialist siege Americans, this report details, are them having to accept as gospel every pronouncement about Covid and experimental vaccines made by radical socialist death merchant Dr. Anthony Fauci, who funded demonic medical experiments killing defenseless little puppies—American rage further exploding today against the leftist “fact checkers” attempting to cover up the genocidal de-population vaccine statements made by leftist tech giant Bill Gates—and now coming to the aid of these Americans is renowned British actor-activist Russell Brand, whose searing video about these lying leftist “fact checkers” has now gone viral.\n\nUpon receiving confirmation that a healthy 15-year-old boy in California died after receiving an experimental Covid vaccine, this report concludes, Sweden and Denmark immediately halted their use for those under 30—an immediate ban against experimental Covid vaccines for those under 30 quickly joined by Finland—a ban coming at the same time the whistle blowing organization Project Veritas released a shocking video showing an experimental Covid vaccine maker admitting that “aborted fetal tissue is in the vaccine”, with them stating: “We want to avoid having the info on the fetal cells floating out there”—shocking information about aborted babies being used to make these experimental Covid vaccines coming at the same time many believe Facebook was taken down to prevent the spread of the horror pics of what happens to babies receiving them—is information so incendiary UCLA fired and escorted from its hospital yesterday famed anesthesiologist Dr. Christopher B. Rake to keep him silent, and in leaving saw him defiantly declaring to all Americans: “This is what happens when you stand up for freedom and when you show up to work, willing to work, despite being unvaccinated, and this is the price you have to pay sometimes…But what they don’t realize is that I’m willing to lose everything — job, paycheck, freedom, even my life for this cause”. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nOctober 7, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nOf Course They Are Coming You. What Did You Expect?\n\nAmericans Given Bill For Cost Of Freedom—World Wonders If They'll Pay It", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "http://en.kremlin.ru/structure/security-council/members", "https://www.rt.com/russia/536763-nato-expel-russian-diplomats/", "https://www.rt.com/russia/536763-nato-expel-russian-diplomats/", "https://sputniknews.com/20211005/nato-chief-urges-interaction-with-russia-to-avoid-another-cold-war-1089687531.html", "https://tass.com/politics/1346761", "https://eng.mil.ru/", "https://sputniknews.com/20211007/cia-reportedly-airlifted-commandos-suspected-of-execution-style-killings-of-civilians-out-of-kabul-1089738036.html", "https://sputniknews.com/20211007/cia-reportedly-airlifted-commandos-suspected-of-execution-style-killings-of-civilians-out-of-kabul-1089738036.html", "https://www.reuters.com/world/asia-pacific/exclusive-giant-can-worms-some-afghans-leave-us-military-bases-before-2021-10-01/", "https://pjmedia.com/news-and-politics/gwendolynsims/2021/10/05/epic-427000-parents-respond-to-national-school-board-association-labeling-them-domestic-terrorists-n1521936", "https://www.newsbusters.org/blogs/nb/kristine-marsh/2021/10/06/msnbc-warns-parents-pushing-back-are-mentally-ill-white", "https://www.zerohedge.com/political/keyword-warrants-feds-secretly-ordered-google-track-anyone-searching-certain-names", "https://www.foxnews.com/politics/merrick-garland-son-in-law-panorama-zuckerberg", "https://www.washingtonexaminer.com/washington-secrets/firearms-bubble-economy-makes-2021-second-highest-gun-sales-year-ever", "https://www.washingtonexaminer.com/washington-secrets/firearms-bubble-economy-makes-2021-second-highest-gun-sales-year-ever", "https://dailycaller.com/2021/10/05/antony-fauci-niaid-white-coat-waste-anima-experiment-abuse/", "https://www.rt.com/usa/536781-fact-checkers-gates-depopulation-vaccines/", "https://www.russellbrand.com/", "https://www.brighteon.com/c9459663-6baf-4f01-ab29-765d2fe7d078", "https://citizenfreepress.com/breaking/15-year-old-california-boy-killed-by-covid-vaccine/", "https://www.thegatewaypundit.com/2021/10/breaking-big-sweden-denmark-halt-moderna-vaccinations-30-due-potential-side-effects/", "https://www.zerohedge.com/covid-19/finland-joins-sweden-denmark-limiting-use-modernas-jab-young-men", "https://citizenfreepress.com/breaking/james-okeefe-strikes-pfizer/", "https://www.thegatewaypundit.com/2021/10/breaking-project-veritas-pfizer-whistleblower-reveals-internal-emails-discussing-covid-vax-want-avoid-info-fetal-cells-floating/", "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=184093", "https://www.latimes.com/california/story/2021-10-06/ucla-anesthesiologist-vocal-against-covid-19-vaccine-mandates-is-escorted-out-of-workplace", "https://www.brighteon.com/d32c3406-035d-4ab1-954b-2933aac3853c", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3695pl.htm", "https://www.whatdoesitmean.com/index3695.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}