{"result_id": "341009", "URL": "https://www.whatdoesitmean.com/index3868pl.htm", "timestamp": "2023-04-25 18:12:19 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3868pl.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Whoever Who Can Make You Believe Absurdities Can Make You Commit Atrocities", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nNote: This is an urgent private letter intended for the sole and exclusive use of the patron/donors to the Sisters of Sorcha Faal.\n\nWhoever Who Can Make You Believe Absurdities Can Make You Commit Atrocities\n\nWhile the Western media continues its non-stop war propaganda over the Russian invasion of Ukraine, I found it more than interesting that the top story ricocheting around the rest of the world yesterday, most particularly in Africa and the Middle East, involved United States Supreme Court nominee Judge Ketanji Brown Jackson, whose gobsmacking exchange with US Senator Marsha Blackburn that stunned every normal and sane person around the globe was:\n\nSenator Blackburn: Can you provide a definition for the word, “woman”?\n\nJudge Jackson: Not in this context. I’m not a biologist.\n\nLeaving aside the absurdity of how Judge Jackson could actually be the first black “woman” to be nominated to the Supreme Court, as she clearly doesn’t even know if she is a “woman”, I have no doubt that she’s fully supported by every one of those who obediently followed the socialist edicts to inject themselves with dangerous and unproven Covid vaccines, about whom a survey conducted by polling firm EKOS shows that Canadians who received “three or more doses” of a Covid-19 vaccine tended to express significantly more support for aggressive anti-Russian measures with regard to the ongoing military conflict in Ukraine—and I also have no doubt that Judge Jackson is fully supported by elite New York City socialite Lauren Pazienza, who yesterday was arrested and charged with manslaughter for pushing an elderly 87-year-old woman to her death, after this shocking crime she hid out at her wealthy parents’ home and deleted all of her social media pages, saw classmates describing her as bully from her earliest school days, and, or course, her Democrat Party privileged parents quickly posted her $1-million bail.\n\nNow if you’ve ever wondered exactly why the Western socialist forces have declared an all-out war on history and logical thought, everything I’ve just related to you is a prime example of why—specifically because there was a time when educated people were able to connect-the-dots between such things like Judge Jackson not knowing what a “woman” is, the blind war lust of the Covid vaccinated obedient masses, and elite socialists brutally murdering the elderly—the first one coming to mind being the 18th Century French philosopher-historian Voltaire, who famously [this is the most exact French to English translation] warned:\n\nTruly, whoever can make you believe absurdities can make you commit atrocities.\n\nIf the God-given understanding of your mind does not resist a demand to believe what is impossible, then you will not resist a demand to do wrong to that God-given sense of justice in your heart.\n\nAmong the most vile and demonic believers in socialist absurdities committing human atrocities was former US Secretary of State Madeleine Albright, who died yesterday at the age of 84, after which Nazi German supporter socialist-globalist architect George Soros proclaimed: “Madeleine Albright was an astute stateswoman, scholar, and a true champion for freedom and democracy”—most honestly it saw former Macedonian diplomat Risto Nikovski stating: “The foreign policy that Albright pursued together with Bill Clinton led to the encircling of Russia from all sides by new NATO members...That encirclement is de facto the reason for all the problems that started in Ukraine and will continue in Europe in the future as well as in the world”—but whose true and lasting legacy known to every man, woman and school child in the entire Eastern world, was evidenced in her 1996 interview on 60 Minutes, wherein it was revealed:\n\nLesley Stahl on sanctions against : We have heard that a half million children have died. I mean, that’s more children than died in Hiroshima. And, you know, is the price worth it?\n\nSecretary of State Madeleine Albright: I think this is a very hard choice, but the price–we think the price is worth it.\n\nAlso believing in socialist absurdities and thinking nothing about committing human atrocities is former US Secretary of State Hillary Clinton, who after the President George W. Bush administration, in 2003, convinced Libyan leader Muammar Qaddafi to dismantle his nuclear weapons programme, saw her, in 2011, ordering the complete NATO bombing destruction of Libya and the murdering of Qaddafi—shortly after which Clinton gave an interview where she gleefully exclaimed while laughing: “We came, we saw, he died!”—a demonic display joined by becoming the largest refugee crisis in modern times—today sees the United Nations reporting: “An estimated 1.3 million people are in need of humanitarian assistance in Libya. Hundreds of thousands of people across the country are suffering. They are living in unsafe conditions with little or no access to health care, essential medicines, food, safe drinking water, shelter or education”—and after watching what happened to Libya, it saw North Korea breaking off talks with US and expanding its nuclear weapons programme.\n\nStriking back against these socialist absurdities that allowed the death of 500,000 children in Iraq and plunged Libya into total chaos and abject misery, this week it saw Syrian President Bashar al-Assad accusing these Western elites of hypocrisy and moral decadence in their dealings with the peoples of the world—then it saw Chinese Foreign Ministry spokesman Wang Wenbin rebuking the United States as “the biggest human rights violator in the world”.\n\nAll of this is critical for you to know, specifically because as people in the Western world are daily assaulted with non-stop socialist Russia-Ukraine war propaganda, the people in the Eastern world are intently focused on the United States controlling about 750 bases in at least 80 countries worldwide and its spending more on its military than the next 10 countries combined—and whose reason for this intense focus is documented by the Brown University findings contained in their “Costs Of War Project”, that reveals: “Over 929,000 people have died in the post-9/11 wars due to direct war violence, and several times as many due to the reverberating effects of war...Over 387,000 civilians have been killed as a result of the fighting...38 million is the number of war refugees and displaced persons...The US federal price tag for the post-9/11 wars is over $8 trillion...The US government is conducting counterterror activities in 85 countries...The wars have been accompanied by violations of human rights and civil liberties, in the U.S. and abroad”.\n\nWhatever your views may be about the barely month old Russia-Ukraine conflict, it pales into insignificance when measured against the massive wholesale destruction the United States has caused around the world these past two decades—and whose reason this is allowed to happen was previously, in 2014, documented by the Washington Post in their article “Americans Read Headlines. And Not Much Else”, wherein it revealed: “Roughly six in 10 people acknowledge that they have done nothing more than read news headlines...And, in truth, that number is almost certainly higher than that, since plenty of people won't want to admit to just being headline-gazers but, in fact, are”.\n\nAdding to this dangerous practice of Americans reading only headlines for their news, and as I alerted you about in my August-2021 Letter, the article “Biden Is Betting Americans Will Forget About Afghanistan”, further revealed: “People in and around the White House are relying on Americans’ notoriously short-term memory…The White House’s dream scenario is that in the end, the voters don’t blame Joe Biden for anything that happens in Afghanistan”.\n\nAs a direct consequence of this dangerous practice of just reading news headlines and their notorious short-term memories, these Americans today are accepting as fact such things like the just published New York Post article “NATO: 7,000 to 15,000 Russian Troops Dead On Ukraine”, whose headline appears to claim that these are deaths reported by NATO, sees this claim now being widely reported throughout the Western media—but when reading down into the depths of this article sees it stating: “A senior NATO military official said the alliance’s estimate was based on information from Ukrainian authorities” and revealing: “Ukraine has released little information about its own military losses, and the West has not given an estimate, but President Volodymr Zelensky said nearly two weeks ago that about 1,300 Ukrainian servicemen had been killed”.\n\nFor anyone who wants to believe the Ukrainian “authorities” who claim they’ve killed up to 15,000 highly-trained and experienced Russian combat soldiers belonging to the world’s second-largest army, while only suffering about 1,300 losses of their own, I’d first respectfully refer them to world renowned American tactical war strategist retired US Army Colonel Douglas Macgregor, Ph.D., who this week honestly declared: “The war is really over for the Ukrainian…They have been grounded to bits”—then I’d respectfully remind them that these are the exact same Ukrainian “authorities” that released video game footage and falsely claimed it showed them shooting down Russia jets—falsely claimed Russia killed defiant Ukraine soldiers on Snake Island, but all of whom are alive—falsely claimed that a large number of Russian servicemen refused to participate in the special operation on the territory of Ukraine, but whose documents they used as evidence were all fakes and not even used by the Russian military—this week they put out a video where Ukrainian demolition experts managed to defuse a high-explosive FAB-250 aerial bomb literally with their bare hands, unscrewing the fuse and watering it, but is laughably fake because this type of bomb is paper thin and even if it didn’t explode, would have shattered into thousands of pieces on impact—this week they put out a video of Ukrainian soldiers capturing a Russian BRDM amphibious armored scout car, another laughable fake because Russia hasn’t used these outdated BRDM’s for over a decade, and the one in the video has “pixel” camouflage used by Ukraine—and this week saw them outrageously claiming that Russia is ready to use chemical weapons in Ukraine, that if factual reality is an impossibility because Russia doesn’t have any chemical weapons, as verified by United Nations chemical treaty weapons inspectors in 2017.\n\nThough truthful sites like WarOnFakes keep hourly track and expose with facts, provable evidence and documentation all of the lies being spread about the Russia-Ukraine conflict, I’m sure none of you would be surprised to learn that the leftist fake news war propagandist are winning out among the “notoriously short-term” Americans that rely only on “headlines” for their news.\n\nBut that doesn’t mean those very few us left that are still telling the truth should just give up, rather it makes what we do even more critical in times like these—most importantly because nothing less than World War III is at stake.\n\nFor over 20-years, the Dear Sisters have informed and educated you about everything underlying this global conflict—and yesterday, Sister Ciara’s letter “Sooner Or Later The Endless Spectacle Is Over. Then We Will Take Revenge; Mercilessly.”, explained and documented how truly existential this conflict is to the entire world, and that she began with the John Michael Crichton quote: “If you don't know history, then you don't know anything…You are a leaf that doesn't know it is part of a tree”.\n\nToday, right now in fact, this “tree of truth” that you’re a “leaf” of desperately needs your kind and generous support by you going below and giving what you can—and by doing, you protect us all from living under those who believe absurdities to the point it allows them to commit atrocities.\n\nThank you for listening and aiding us in our hour of desperate need by going below and giving what you can, and as always, please feel free to write me at [email protected] with any comments/questions/suggestions, remembering to put ATTN: BRIAN in the subject line, or if requesting to be placed on the Sisters mailing list, put MAILING LIST in the subject line.\n\nAll the best folks,", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.wsj.com/articles/judge-jackson-and-the-biology-of-gender-11648069148?mod=hp_opin_pos_5", "https://www.rt.com/news/552492-vaccinated-support-russian-sanctions/", "https://heavy.com/news/lauren-pazienza/", "https://www.foxnews.com/us/nyc-lauren-pazienza-charged-broadway-coach-death", "https://en.wikipedia.org/wiki/Voltaire", "https://www.cato.org/publications/commentary/origins-warning-from-voltaire#:~:text=Truly%2C%20whoever%20can%20make%20you,of%20justice%20in%20your%20heart.", "https://www.wsj.com/articles/madeleine-albright-first-woman-to-serve-as-secretary-of-state-dies-11648061238", "https://www.drugfree.org.au/images/pdf-files/library/soros/2019/60%20Minutes%20and%20Glen%20Beck%20on%20soros.pdf", "https://www.rt.com/news/552591-george-soros-mourns-madeleine-albright/", "https://sputniknews.com/20220324/albrights-nato-expansion-policy-paved-road-to-ukraine-crisis---ex-macedonian-diplomat-1094135207.html", "https://fair.org/extra/we-think-the-price-is-worth-it/", "https://www.wilsoncenter.org/blog-post/giving-the-bomb-revisiting-libyas-decision-to-dismantle-its-nuclear-program", "https://www.cbsnews.com/news/clinton-on-qaddafi-we-came-we-saw-he-died/", "https://en.wikipedia.org/wiki/Refugees_of_Libya", "https://www.unhcr.org/en-us/libya.html", "https://theconversation.com/what-north-korea-learned-from-libyas-decision-to-give-up-nuclear-weapons-95674", "http://www.informationliberation.com/?id=62971", "https://www.rt.com/news/552465-china-us-human-rights/", "https://www.aljazeera.com/news/2021/9/10/infographic-us-military-presence-around-the-world-interactive", "https://watson.brown.edu/costsofwar/", "https://watson.brown.edu/costsofwar/", "https://www.washingtonpost.com/news/the-fix/wp/2014/03/19/americans-read-headlines-and-not-much-else/", "https://www.washingtonpost.com/news/the-fix/wp/2014/03/19/americans-read-headlines-and-not-much-else/", "https://www.whatdoesitmean.com/index3668pl.htm", "https://www.theatlantic.com/politics/archive/2021/08/biden-afghanistan-midterms/619838/", "https://www.theatlantic.com/politics/archive/2021/08/biden-afghanistan-midterms/619838/", "https://nypost.com/2022/03/23/nato-7000-to-15000-russian-troops-dead-in-ukraine/", "https://nypost.com/2022/03/23/nato-7000-to-15000-russian-troops-dead-in-ukraine/", "https://nypost.com/2022/03/23/nato-7000-to-15000-russian-troops-dead-in-ukraine/", "http://douglasmacgregor.com/missionstatement.htm", "https://www.mediaite.com/tv/douglas-macgregor-declares-russian-victory-the-war-is-really-over-for-the-ukrainians-they-have-been-grounded-to-bits/", "https://www.spieltimes.com/news/ukraine-russia-military-footage-actually-from-video-game/", "https://www.cnn.com/2022/02/28/europe/snake-island-ukraine-russia-survivors-alive-intl/index.html", "https://waronfakes.com/mo-rf/fake-russian-military-personnel-refuse-to-participate-in-the-special-operation-in-ukraine/", "https://waronfakes.com/vsu/fake-ukrainian-demolition-experts-defused-a-russian-bomb-with-their-bare-hands/", "https://waronfakes.com/vsu/fake-ukrainian-fighters-captured-a-russian-brdm/", "https://waronfakes.com/common/fake-russia-is-ready-to-use-chemical-weapons-in-ukraine/", "https://waronfakes.com/common/fake-russia-is-ready-to-use-chemical-weapons-in-ukraine/", "https://waronfakes.com/", "https://www.whatdoesitmean.com/index3868.htm", "/cdn-cgi/l/email-protection#7c0f130e1f141d1a1d1d103c1a1d0f08111d1510521a11", "https://fundrazr.com/f1fYo3?ref=sh_79C0K1_ab_1Kr7htbtQ5H1Kr7htbtQ5H", "https://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}