{"result_id": "341028", "URL": "https://www.whatdoesitmean.com/index3711.htm", "timestamp": "2023-04-25 18:12:28 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3711.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Covid Mass Murderer Biden Slammed With “Let’s Go Brandon!” Chants Sweeping America", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA thought-provoking new Security Council (SC) report circulating in the Kremlin today sees Security Council Members in this transcript expressing grave concern over the United States Federal Reserve just releasing a beyond shocking report revealing that the top one percent of richest Americans now hold more wealth than the entire American middle class—a shocking revelation coming seven years after American economic experts declared in 2014 that the United States was an oligarchy, not a democracy—and with this new revelation means the United States has officially become a banana republic.\n\nWith a “banana republic” being a nation operated as a private commercial enterprise for the exclusive profit of its elite ruling class, this report notes, they are tyrannically ruled over by a “puppet leader” who’s dependent upon an outside power and subject to its orders—an exact description of Supreme Socialist Leader Joe Biden, which is why shortly after he seized power, the National Republican Senatorial Committee (NRSC) sent out an alert to all of its members entitled “Joe Biden: The Puppet President”, wherein it asked and warned: “Who is making these important decisions that affect the future of our country?...The answer: Biden’s radical handlers in the White House and their far-Left Socialist friends like Bernie Sanders and AOC”.\n\nAmong the “far-left socialists” pulling the strings to control “puppet leader” Biden, this report details, is Democrat Party House Speaker Nancy Pelosi, about whom its just been stunningly revealed amassed a staggering fortune of up to $315-million during the Covid pandemic—and is fortune of blood money Pelosi began amassing during last year’s presidential election after Biden, on 17 September 2020, declared to the American people about President Donald Trump: “If the president had done his job from the beginning, all the people who have died from coronavirus would still be alive”.\n\nDuring the entirety of 2020 when President Trump was in power, this report continues, the American people didn’t have Covid vaccines available, and it saw 325,000 of them dying from this disease—but with Covid vaccines available since he seized power in January-2021, during the past nine months Biden has seen over 375,000 Americans dying of Covid on his watch—according to his own socialist logic thus makes Biden a Covid mass murderer—though to notice for both President Trump and Biden, during the entirety of 2020, and ten months into 2021, the CDC has yet to document a single flu death occurring in America.\n\nThis transcript sees Security Council Members agreeing that the total elimination of flu deaths in America over these past nearly two years remains the greatest kept secret in human history—an historic secret coming at the same time a new global study estimates that over 50-million people suffered from major depressive disorders in 2020 due to Covid-19 pandemic—comes at the same time the entire leftist American mainstream propaganda media suppressed the shocking news that all flights in Florida were cancelled after air traffic controllers walked off the job because they refuse to take experimental Covid vaccines—and comes at the same time Dr. Pierre Kory of Frontline Doctors stunningly revealed: “Between 100-200 United States Congress Members (plus many of their staffers and family members) with COVID were treated by a colleague over the past 15 months with ivermectin & the I-MASK+ protocol…None have gone to hospital”.\n\nWith Israeli researchers announcing last week that Covid recovery gave Israelis longer-lasting Delta varient defense than vaccines, this report continues, it came too late for Singapore, that vaccinated over 85% of its population, and now sees Covid cases skyrocketing because no one in their country has natural immunity to stop the spread of this disease—is an 85% vaccination rate the United States is nowhere close to, but is understandable because, as of 1 October, the US government reports that 778,685 Americans have been seriously injured by experimental Covid vaccines and 16,310 of them have died—and whose the total number of deaths associated with experimental Covid vaccines is greater than the number of deaths associated with all other vaccines combined since the year 1990.\n\nWith American pharmaceutical giant Pfizer admitting this past week that it uses the body parts of murdered aborted helpless babies in its experimental Covid vaccines, this report concludes, countless tens-of-millions of Americans know this shocking revelation allows them religious exemptions protecting them being forced to take them—are religious exemptions from being forced to take experimental Covid vaccines now supported by the unanimous ruling handed down Friday by the United States Court of Appeals for the Sixth Circuit, that sided with unvaccinated college students against their socialist university overlords, and is a final ruling binding on the States of Michigan, Kentucky, Ohio and Tennessee only the US Supreme Court can overturn—sees this ruling coming at the same time yet another American nurse posted a heartbreaking video of her being fired for refusing to take an experimental Covid vaccine—and today sees all of these fired nurses being supported by what’s being called by Fox News a “national social media sensation” of the “Let's Go Brandon!” chants, social media postings, signs and billboards sweeping America—that began when a leftist lunatic NBC reporter tried to cover up on live television the “Fuck Joe Biden” chants heard in stadiums across America by saying they were chanting “Let’s Go Brandon”. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nOctober 10, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nOf Course They Are Coming You. What Did You Expect?\n\nAmericans Given Bill For Cost Of Freedom—World Wonders If They'll Pay It", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "http://en.kremlin.ru/structure/security-council/members", "https://www.breitbart.com/politics/2021/10/09/feds-americas-elite-now-hold-more-wealth-than-entire-middle-class/", "https://www.bbc.com/news/blogs-echochambers-27074746", "https://www.zerohedge.com/markets/us-officially-banana-republic-top-1-now-own-more-wealth-entire-middle-class", "https://en.wikipedia.org/wiki/Banana_republic", "https://en.wikipedia.org/wiki/Puppet_state", "https://www.nrsc.org/", "https://www.nrsc.org/press-releases/joe-biden-the-puppet-president-2021-05-25/", "https://www.nrsc.org/press-releases/joe-biden-the-puppet-president-2021-05-25/", "https://www.foxnews.com/media/watters-world-investigates-nancy-pelosis-315-million-in-assets", "https://americasbestpics.com/picture/if-the-president-had-done-his-job-from-the-beginning-NrPmF1Zz8", "https://www.usatoday.com/story/news/health/2021/10/05/covid-vaccination-mask-mandates-health-care-workers/5994168001/", "https://www.usatoday.com/story/news/health/2021/10/05/covid-vaccination-mask-mandates-health-care-workers/5994168001/", "https://www.cdc.gov/flu/weekly/index.htm", "https://www.rt.com/news/537071-covid-depressive-anxiety-disorders-study/", "https://citizenfreepress.com/breaking/florida-flights-cancelled-air-traffic-controllers-conduct-mass-sickout-to-protest-vaccine-mandate/", "https://citizenfreepress.com/breaking/100-200-members-of-congress-treated-with-ivermectin/", "https://www.timesofisrael.com/study-covid-recovery-gave-israelis-longer-lasting-delta-defense-than-vaccines/", "https://citizenfreepress.com/breaking/holy-spike-protein-vaccinated-singapore-is-getting-hammered-by-covid-check-out-the-chart/", "https://vaersanalysis.info/2021/10/08/vaers-summary-for-covid-19-vaccines-through-10-1-2021/", "https://vaersanalysis.info/2021/10/08/vaers-summary-for-covid-19-vaccines-through-10-1-2021/", "https://www.rt.com/op-ed/537011-pfizer-development-aborted-fetal-tissue/", "https://news.gab.com/2021/07/29/important-download-covid-vaccine-religious-exemption-documents-here/", "https://www.greatlakesjc.org/wp-content/uploads/Order-Denying-Motion-for-Stay-COA-WMU-1.pdf", "https://citizenfreepress.com/breaking/victory-for-freedom-6th-circuit-court-of-appeals-sides-with-unvaccinated-michigan-students/", "https://en.wikipedia.org/wiki/United_States_Court_of_Appeals_for_the_Sixth_Circuit", "https://citizenfreepress.com/breaking/nurse-makes-her-point-in-perfect-way/", "https://www.foxnews.com/politics/the-phrase-lets-go-brandon-has-become-an-internet-sensation-fueled-by-trump-supporters-heres-why", "https://www.foxnews.com/politics/the-phrase-lets-go-brandon-has-become-an-internet-sensation-fueled-by-trump-supporters-heres-why", "https://www.brighteon.com/4ad66c42-1dd0-47db-925c-bc76b69902c3", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3695pl.htm", "https://www.whatdoesitmean.com/index3695.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}