{"result_id": "341041", "URL": "https://www.whatdoesitmean.com/index3791.htm", "timestamp": "2023-04-25 18:12:34 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3791.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Truth Outlawed In America After Covid Strikes Down Fully Vaxxed Defense Secretary", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nTruth Outlawed In After Covid Strikes Down Fully Vaxxed Defense Secretary\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA thought-provoking new Security Council (SC) report circulating in the Kremlin today first noting President Putin held a telephone conversation with Turkish President Recep Tayyip Erdogan, wherein they reaffirmed their determination to boost partnership between the two countries, says quick to follow was the White House press service releasing a statement about the telephone conversation held between Supreme Socialist Leader Joe Biden and Ukrainian President Vladimir Zelensky, that said: “The leaders expressed support for diplomatic efforts, starting next week with the bilateral Strategic Stability Dialogue, at NATO through the NATO-Russia Council, and at the Organization for Security and Cooperation in Europe…President Biden underscored the commitment of the United States and its allies and partners to the principle of ‘nothing about you without you’”.\n\nIn response to this White House statement, this report notes, Deputy Foreign Minister Andrey Rudenko stated: “On our part, we are ready to cooperate in any format based on the principle that there is no alternative to the Minsk Agreement, which was supported by Washington, and the understanding that it is impossible to resolve the conflict without providing special status to Donbass”—a statement joined by articles appearing in America like “Is Ukrainian Democracy Worth War With Russia To Save?”, wherein it revealingly asks: “Recently, Ukrainian authorities announced former Ukrainian President Petro Poroshenko is under formal investigation for high treason, the same charge his predecessor was convicted of just two years ago…Does this sound like a kind of democracy worth shedding American blood to save?”.\n\nSecurity Council Members in this transcript discussing these issues of war note the United States Department of Defense releasing an urgent bulletin yesterday stating: “Statement by Secretary of Defense Lloyd J. Austin III...I tested positive this morning for COVID-19...I requested the test today after exhibiting symptoms while at home on leave...My symptoms are mild, and I am following my physician’s directions...As my doctor made clear to me, my fully vaccinated status — and the booster I received in early October — have rendered the infection much more mild than it would otherwise have been...The vaccines work and will remain a military medical requirement for our workforce…I continue to encourage everyone eligible for a booster shot to get one... This remains a readiness issue”.\n\nBased on his Covid vaccine status, as Defense Secretary Austin himself revealed, this report notes, according to Mayo Clinic guidelines he’s “fully vaxxed”, and as they define: “You’re considered fully vaccinated two weeks after you get your second dose of a messenger RNA (mRNA) vaccine, such as Pfizer-BioNTech or Moderna, or two weeks after a single dose of the Janssen/Johnson & Johnson vaccine”—in spite of Defense Secretary Austin being “fully vaxxed” he’s now been taken out of service by Covid, thus making his “readiness issue” claim about experimental Covid vaccines comical—but, most certainly, isn’t comical for the thousands of soldiers Defense Secretary Austin has drummed out of the US military who know these experimental Covid vaccines are worthless, at best, and for many are highly deadly.\n\nAs to what kind of Covid advice socialist indoctrinated idiots like Defense Secretary Austin are following, this report continues, it comes from those like popular leftist media propagandist MSNBC host Rachel Maddow, who proclaimed: “Instead of the virus being able to hop from person to person to person, potentially mutating and becoming more virulent and drug-resistant along the way, now we know that the vaccines work well enough that the virus stops with every vaccinated person...A vaccinated person gets exposed to the virus, the virus does not infect them...The virus cannot then use that person to go anywhere else. It cannot use a vaccinated person as a host to go get more people...That means the vaccines will get us to the end of this, if we just go fast enough to get the whole population”.\n\nInstead of Defense Secretary Austin, or anyone else believing lying leftist media proclamations like “the virus stops with every vaccinated person”, this report notes, they would be better served paying attention to the critical scientific report issued by the Canadian Covid Care Alliance titled THE PFIZER INOCULATIONS FOR COVID-19—MORE HARM THAN GOOD, wherein the over 500 scientists, doctors and disease experts belonging to this organization beyond horrifyingly document that experimental mRNA Covid vaccines were NEVER TESTED, the results proving their efficacy are FRAUDULENT, it was ILLEGAL to have given them emergency use authorization, and in NO WAY WHATSOVER do they stop the spread of Covid.\n\nTo hide the factual reality that experimental Covid vaccines are worthless and dangerous, and that those responsible for them are guilty of committing crimes against humanity, this report concludes, today it sees the entire leftist propaganda media and big tech establishment in America shockingly outlawing the truth—as best exampled during the past week alone by mRNA vaccine inventor Dr. Robert Malone being permanently banned from Twitter and his powerful videos of truth purged from YouTube—now it sees YouTube purging from existence the bombshell interview Dr. Robert Malone gave to the world’s top podcaster Joe Rogan—then yesterday it saw Twitter permanently banning Republican Party lawmaker US Congresswoman Marjorie Taylor Greene because she posted Vaccine Adverse Event Reporting System (VAERS) data from the Centers for Disease Control and Prevention—after which Congresswoman Greene declared to the under socialist siege American people: “When Maxine Waters can go to the streets and threaten violence on Twitter, Kamala and Ilhan can bail out rioters on Twitter, and Chief spokesman for terrorist IRGC can tweet mourning Soleimani but I get suspended for tweeting VAERS statistics, Twitter is an enemy to America and can’t handle the truth...That’s fine, I’ll show America we don’t need them and it’s time to defeat our enemies”. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nJanuary 3, 2022 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nAmericans Have Been Warned—But They Forgot How To Think", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://tass.com/politics/1383515", "https://tass.com/world/1383563", "https://tass.com/politics/1383485", "https://www.zerohedge.com/geopolitical/ukrainian-democracy-worth-war-russia-save", "https://www.zerohedge.com/geopolitical/ukrainian-democracy-worth-war-russia-save", "http://en.kremlin.ru/structure/security-council/members", "https://www.defense.gov/News/Releases/Release/Article/2886520/statement-by-secretary-of-defense-lloyd-j-austin-iii-on-covid-status/", "https://www.thegatewaypundit.com/2022/01/drumming-unvaxxed-servicemembers-fully-vaccinated-boosted-defense-secretary-lloyd-austin-tests-positive-covid-experiencing-mild-symptoms/", "https://www.mayoclinic.org/coronavirus-covid-19/fully-vaccinated", "https://www.thegatewaypundit.com/2022/01/drumming-unvaxxed-servicemembers-fully-vaccinated-boosted-defense-secretary-lloyd-austin-tests-positive-covid-experiencing-mild-symptoms/", "https://www.theblaze.com/furnace/flashback-remember-when-rachel-maddow-said-the-virus-does-not-infect-vaccinated-people", "https://www.theblaze.com/furnace/flashback-remember-when-rachel-maddow-said-the-virus-does-not-infect-vaccinated-people", "https://www.canadiancovidcarealliance.org/", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "https://www.canadiancovidcarealliance.org/wp-content/uploads/2021/12/The-COVID-19-Inoculations-More-Harm-Than-Good-REV-Dec-16-2021.pdf", "https://www.thegatewaypundit.com/2022/01/powerful-pfizer-video-got-mrna-vaccine-inventor-kicked-off-twitter/", "https://www.thegatewaypundit.com/2022/01/direct-hit-youtube-begins-removing-uploads-dr-robert-malones-bombshell-interview-joe-rogan-platform/", "https://rumble.com/vrrdsc-dr.-robert-malone-explains-how-dire-the-situation-is-in-the-usa-full-interv.html", "https://www.thegatewaypundit.com/2022/01/marjorie-taylor-greene-responds-twitter-ban-gettr-telegram/", "https://www.thegatewaypundit.com/2022/01/marjorie-taylor-greene-responds-twitter-ban-gettr-telegram/", "https://www.thegatewaypundit.com/2022/01/marjorie-taylor-greene-responds-twitter-ban-gettr-telegram/", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3781pl.htm", "https://www.whatdoesitmean.com/index3781.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}