{"result_id": "341047", "URL": "https://www.whatdoesitmean.com/index3719.htm", "timestamp": "2023-04-25 18:12:37 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3719.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Russia Cuts NATO Ties As “Everything Shortage” Creating “Dark Winter” Throws World Into Pandemonium", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA foreboding new Security Council (SC) report circulating in the Kremlin today first noting Russia suspended this morning all diplomatic ties with NATO and ordered the US-led military bloc’s Moscow mission to close, says in explanation for this war move Foreign Minister Sergey Lavrov declared: “In response to NATO’s actions, we are suspending the activity of the NATO military liaison mission in Moscow and will recall the accreditation of its staff from 1 November this year...If NATO has some urgent matters, it may contact our ambassador in Belgium on these issues”—a declaration joined with the warning just issued by Kremlin spokesman Dmitry Peskov, who stated: “Ukraine’s accession to NATO would be the worst-case scenario...This is a scenario that goes beyond the red lines of Russia’s national interests...This is a scenario that could force Russia to take active measures to ensure its own security”—a warning quickly followed by the Ministry of Defense (MoD) issuing a war bulletin about its actions on the Crimea border with Ukraine that says: “Su-30SM fighters and Su-24M and Su-34 bombers conducted sorties to the target area at low and ultra-low altitudes operating outside the zone of visibility for radars and surface-to-air missile systems of the notional enemy’s warships…The Su-30SM fighters conducted launches of Kh-31A anti-ship missiles from a maximum distance while the bombers delivered strikes with high-explosive fragmentation bombs from an altitude of up to 600 meters”.\n\nSecurity Council Members in this transcript note these war moves are coming at the same time Malaysian geosecurity expert Dr. Mathew Maavak published his economic white paper “Pandemonium Looms For The World As The ‘Everything Shortage’ Meets A ‘Dark Winter’ Thanks To Collapsing Global Supply Chains”, wherein he warns: “The coming years will be marked by extreme socio-economic turbulence…The world is reportedly facing an “everything shortage” where essential goods are getting harder, farther, and more time-consuming to find…These shortages affect the entire gamut of the social pyramid structure…The typical production to delivery cycle is repeatedly hammered by a macabre musical chair of woes in tune with Murphy’s Law: ‘Anything that can go wrong will go wrong’”.\n\nFurther to be noted, Security Council Members in this transcript point out is Dr. Maavak revealing: “Everything is now conveniently blamed on Covid-19, with causations and fearmongering reaching epically absurd proportions...If the problem is not a lockdown, then it is a dearth of raw materials...If ports are ready to unload raw materials and finished products, then truckers are unavailable to pick them up...If truckers are available, ports are unable to process freights...Coronavirus restrictions worldwide have also led to a shortage of essential labour, ranging from garbage collectors to pilots...Under the pyramidical hierarchy of the New Normal, only the capstone representing the top 0.1% is truly detached and thriving”—a revelation important to notice because of the historic massive backlog of cargo containers piling up in California ports—is an historic supply chain crisis the American people aren’t being told is caused by the socialist Democrats in California having passed their AB5 anti-trucking law that is preventing trucking companies in their State from investing in new trucks—and on 30 September, it saw the socialist idiots at the Port of Los Angeles slamming on truckers radical new emissions rules that keeps older trucks from entering their port to take away cargo.\n\nAs the pandemonium of this self inflicted crisis sweeps across the United States, this report continues, the leftist New York Times today published their article “Last Chance To Save American Democracy” supporting the socialist Democrats’ plan this week to federalize all elections, wherein it warns: “This is a once in a generation moment, one pivotal to the very survival of the country as we know it”—is a socialist plan that would strip the States of their power over elections and will keep the Democrats in power forever, that the New York Times joined with their article “To Make Capitalism Work, Give Workers Ownership” advocating socialist worker collectives be given control over all American companies—last week saw socialist Democrats ousting from power two members of the United States Federal Reserve central bank, then them advocating their replacements be Communist Marxists that favor socialist worker collectives—and today sees Supreme Socialist Leader Joe Biden attempting to put into power over all of the banks in America a radical Marxist communist named Saule Omarova, who was born and raised in the former Soviet Union and is now refusing to turn over to the US Senate her Moscow State University thesis, titled “Karl Marx’s Economic Analysis and the Theory of Revolution in The Capital”.\n\nThis transcript sees Security Council Members expressing their disgust over how the entire leftist propaganda media establishment is deliberately concealing from the American people the communist Marxist takeover of their government—a disgust they further evidence against socialist leader Biden, who after slamming un-needed masks on his citizens was spotted yesterday going into a restaurant without one, along with his wife—elite socialist hypocrisy now joined by former Secretary of State General Colin Powell, who famously got an experimental Covid vaccine to show his fellow Black citizens how safe they are, but a few hours ago died of Covid complications—a tragic death now joined by Catholic Church Archbishop Carlos Maria Viganò declaring “The vaccine victims are sacrificed at the altar of Moloch”, with him further gravely stating:\n\nIt now seems clear to me that we are facing a siege on both the social and religious front.\n\nThe so-called emergency pandemic has been utilized as a false pretext to impose the vaccination and Green pass in many nations of the world in a simultaneous and coordinated way.\n\nThey support them in this wicked plan and go so far as to condemn those who do not accept being subjected to innoculation with an experimental gene serum, with unknown side effects, that does not impart any immunity from the virus, to say nothing of the moral implications related to the presence of genetic material derived from aborted fetuses, which for a Catholic is a more than sufficient reason to refuse the vaccine.\n\nWe are war, a war that is not openly declared, that is not fought with conventional weapons, but a war all the same.\n\nThe alliance is not between state and church. But it is between the deep state and deep church.\n\nMost certainly knowing the truth of Archbishop Viganò gravely noting “We are at war”, this report concludes, are the fearless American political dissidents like Bari Weiss, who in her just published open letter “We Got Here Because Of Cowardice, We Get Out With Courage” states: “Every day I hear from people who are living in fear in the freest society humankind has ever known…Dissidents in a democracy, practicing doublespeak…That is what is happening right now… What happens five, 10, 20 years from now if we don’t speak up and defend the ideas that have made all of our lives possible?”—like John Scott Lewinski, who in his just published open letter “There’s Still Fire In The Public’s Belly, And We’re Seeing More And More Of It As Covid Fatigue Grows” states: “Truth be told, there’s nothing as sweet as the discomfort and frustration of an unworthy overlord”—and like Al Stankard, who in his just published open letter “Why Can’t We Americans Do What The Afghans Did, And Take Back Control Of Our Country?” says to his fellow under socialist seize citizens:\n\nSince the Taliban’s unexpected success in reclaiming their country, the one thing I’ve been losing sleep over is, well, why can’t we have what they have?\n\nAre we Americans really so gaslit and demoralized by the self-anointed “adults in the room” that we dare not challenge their presence?\n\nThings are already bad and getting worse for too many of us.\n\nThe ongoing improperly motivated Covid lockdowns and vaccine mandates are backing many of us into corners out of which we have no choice but to fight.\n\nThe cliché that man’s predilections for self-interested opportunism and vanity render stillborn all efforts of collective group action in the pursuit of justice – it is a lie.\n\nThe evil embodied by our current social order is no less evil, nor more viable, simply for the fact that it enfranchises and domesticates opportunism, rather than taking half-measures to stymie it.\n\nThe end game of the American world order is unendurable for most of us, and we are slowly but surely building the cultural vocabulary with which to say as much.\n\nA better world is possible.\n\n[Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nOctober 18, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nOf Course They Are Coming You. What Did You Expect?\n\nAmericans Given Bill For Cost Of Freedom—World Wonders If They'll Pay It", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://www.rt.com/russia/537765-russia-to-suspend-diplomatic-ties-nato/", "https://tass.com/politics/1350875", "https://www.rt.com/russia/537750-ukraine-join-nato-kremlin/", "https://eng.mil.ru/", "https://tass.com/defense/1350777", "http://en.kremlin.ru/structure/security-council/members", "https://www.internationalaffairshouse.org/author/mathewmaavak/", "https://www.rt.com/op-ed/537664-supply-chains-shortage-crisis/", "https://www.rt.com/op-ed/537664-supply-chains-shortage-crisis/", "https://www.rt.com/op-ed/537664-supply-chains-shortage-crisis/", "https://www.washingtonpost.com/business/2021/09/17/port-los-angeles-satellite/", "https://www.shrm.org/resourcesandtools/legal-and-compliance/state-and-local-updates/pages/ruling-threatens-independent-trucker-business-model-in-calif.aspx", "https://www.portoflosangeles.org/environment/air-quality/clean-truck-program", "https://www.nytimes.com/2021/10/17/opinion/voting-rights-congress.html", "https://www.nytimes.com/2021/10/17/opinion/voting-rights-congress.html", "https://www.nytimes.com/2021/10/18/opinion/economy-wages-dow-jones.html", "https://nypost.com/2021/10/17/marxists-try-to-take-fed-reserve-as-biden-weighs-powell-reappointment/", "https://nypost.com/2021/10/17/marxists-try-to-take-fed-reserve-as-biden-weighs-powell-reappointment/", "https://dailycaller.com/2021/10/14/saule-omarova-office-of-the-comptroller-of-the-currency-marxism/", "https://dailycaller.com/2021/10/14/saule-omarova-office-of-the-comptroller-of-the-currency-marxism/", "https://dailycaller.com/2021/10/14/saule-omarova-office-of-the-comptroller-of-the-currency-marxism/", "https://sputniknews.com/20211018/biden-first-lady-spotted-maskless-at-italian-restaurant-in-dc-1089995975.html", "https://www.zerohedge.com/markets/former-secstate-colin-powell-dies-covid-complications", "https://en.wikipedia.org/wiki/Carlo_Maria_Vigan%C3%B2", "https://www.thegatewaypundit.com/2021/10/archbishop-vigano-vaccine-victims-sacrificed-altar-moloch-video/", "https://www.thegatewaypundit.com/2021/10/archbishop-vigano-vaccine-victims-sacrificed-altar-moloch-video/", "https://en.wikipedia.org/wiki/Bari_Weiss", "https://www.zerohedge.com/political/weiss-we-got-here-because-cowardice-we-get-out-courage", "https://www.zerohedge.com/political/weiss-we-got-here-because-cowardice-we-get-out-courage", "https://www.johnscottlewinski.com/bio.html", "https://www.rt.com/op-ed/537434-covid-quiet-revolution-public-resistance/", "https://www.rt.com/op-ed/537434-covid-quiet-revolution-public-resistance/", "https://www.c-span.org/person/?115311/AlStankard", "https://www.rt.com/op-ed/537723-americans-control-afghanistan-covid/", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3695pl.htm", "https://www.whatdoesitmean.com/index3695.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}