{"result_id": "341033", "URL": "https://www.whatdoesitmean.com/index3729.htm", "timestamp": "2023-04-25 18:12:31 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3729.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "US Air Force Prepares Over 12,000 Court Martials For Covid Jab Refuseniks", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nUS Air Force Prepares Over 12,000 Court Martials For Covid Jab Refuseniks\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA beyond stunning new Security Council (SC) report circulating in the Kremlin today first noting Foreign Ministry spokeswoman Maria Zakharova warning the United States that attempts to settle the Donbass conflict in Ukraine by force “will result in incalculable tragedy”, says in defiance of this warning Supreme Socialist Leader Joe Biden ordered the US Air Force to stop the retirement of its 40-year-old B-1 strategic bombers and deploy them in the Black Sea to target Russian warships.\n\nIn discussions about this latest demented provocation by Biden, this transcript sees Security Council Members reviewing the latest war bulletins issued by the Ministry of Defense (MoD), the most notable of which documents saw top US Air Force General John E. Hyten, the outgoing Vice Chairman of the Joint Chiefs of Staff, warning this week that China’s military progression is “stunning” and that the US must take immediate action to remain the world’s preeminent superpower, with his stating: “Calling China a pacing threat is a useful term because the pace at which China is moving is stunning...The pace they’re moving and the trajectory they’re on will surpass Russia and the United States if we don’t do something to change it...It will happen”.\n\nWith Biden provoking Russia while the US Air Force warns about China, the MoD war bulletins in this report note that America’s most critical immediate conflict is with itself—an internal conflict that, on 26 October, saw US Air Force Lieutenant-General Mary O’Brien posting the message: “I have “breakthrough” COVID despite being fully vaccinated, with many symptoms…102 fever, cough, congestion, fatigue, muscle aches...I'm also healthy, normal weight, exercise, eat right, never touched tobacco & wear my mask indoors...Breakthrough cases do not mean that COVID-19 vaccines are ineffective, according to the Centers for Disease Control and Prevention”—a message coming ahead of the 2 November deadline imposed by Biden for all US military forces to accept being jabbed with experimental Covid vaccines—today sees over 12,000 US Air Force personnel having rejected orders to get fully vaccinated and will fail to meet this deadline—further sees that recruits in the US Air Force training pipeline were recently forced out for refusing to get vaccinated—this past week saw one tearful US Air Force solider refusing to be jabbed posting a video and stating: “We have no idea what to plan for”—though in factual reality, these over 12,000 soldiers are in willful violation of a lawful order and subject to discipline under Article 92 of the Uniform Code of Military Justice, the maximum punishment for is dishonorable discharge, forfeiture of all pay and allowances, and prison confinement for two years.\n\nSecurity Council Members in this transcript note that in the waning years of the Soviet Union, soldiers and citizens refusing to follow orders or obey their despotic socialist overlords were branded “refuseniks”—a term now rightly applied to soldiers in the US Army, which is America’s largest military service, that has granted just one permanent medical exemption and no religious exemptions for experimental Covid vaccines—a term now rightly applied to sailors in the US Navy, that plans to issue blanket rejections for ALL religious exemptions to the Covid vaccine mandate despite directly violating several Naval procedures—and in what is being called “Biden’s Covid Nightmare”, today it sees fully one-third of US Military forces refusing to be jabbed with experimental Covid vaccines.\n\nJoining these tens-of-thousands of US military “refuseniks”, this report continues, are the tens, if not hundreds-of-thousands of US government employees also refusing to be jabbed with experimental Covid vaccines, as just reported: “Some agencies, such as the Bureau of Prisons, where only about half of employees were vaccinated as of early October, and the Transportation Security Administration, where the rate is just 60%, are still lagging behind national averages…A union official recently estimated that between 10% and 20% of BOP’s workforce would leave their jobs as a result of the mandate, while the TSA chief said the agency is “building contingency plans” for a mass exodus of employees…The Pentagon is butting heads with the Archbishop for the Military Services Timothy Broglio, who recently said no one should be forced to receive a COVID-19 vaccine…Defense has affirmed that less than half of the department’s 760,000 civilian employees have been vaccinated…Most federal workers have until November 22 to be fully vaccinated”—and yesterday it saw National Border Patrol Council President Brandon Judd warning he stands to lose over 6,000 US Border agents that are refusing to be jabbed.\n\nWhile viewing this looming catastrophe, this report notes, yesterday it caused United States District Judge Colleen Kollar-Kotelly of the United States District Court for the District of Columbia to issue a temporary restraining order that prevents both civilian and active-duty military plaintiffs from being terminated after they sued the Biden regime over religious exemptions to Covid experimental vaccines—after which New York State Richmond County Supreme Court Judge Lizette Colon denied a request from a New York City police union to temporarily halt Mayor Bill de Blasio’s order requiring all municipal employees, including law enforcement officials, to receive at least one dose of an experimental Covid vaccine by later this week or face unpaid leave—a denial coming at the same time thousands of police and fire “refuseniks” protested throughout New York City with the rallying cry “Coercion is not consent”—and to this very day, it sees the leftist American mainstream media maintaining their “Striketober” farce to keep hidden the thousands of “refusenik” protests occurring all throughout the United States.\n\nIn a shocking display proving beyond all doubt that socialist insanity now controls America instead of rational science, this report details, yesterday the American Geophysical Union’s fellows program “rejected awards for five of their nation’s top ice scientists because they were white men”—awards open to anyone, regardless of colour, whose rigorous scientific peer reviewed examination process allows only the top scientists to be accepted, but now sees the colour of ones skin being the main deciding factor—though in viewing this socialist racist atrocity, it does explain why the idiots ruling America are failing to understand the significance of the massive Covid outbreak now occurring in Ireland where 91% of its population is vaccinated, while at the same time in Florida, whose vaccination rate is 59.5% of its population, today sees it having reached the lowest Covid case rate in America—a striking difference between Ireland and Florida explained in articles kept hidden from the American people like “Consensus REACHED: An Astounding 91 Clinical Research Studies ALL CONFIRMED That NATURAL IMMUNITY Provides Same, If Not Better Protection Against the Virus Than Covid-19 Vaccines – Infection Rate Remained at “Almost ZERO” Among Previously Infected Individuals”—and in another major study just concluded by world renowned scientist Professor S.V. Subramanian Ph.D. at Harvard Universities T.H. Chan School of Public Health, these demonic Biden socialists are hiding his findings, that reveal:\n\n“At the country-level, there appears to be no discernable relationship between percentage of population fully vaccinated and new COVID-19 cases in the last 7 days.\n\nIn fact, the trend line suggests a marginally positive association such that countries with higher percentage of population fully vaccinated have higher COVID-19 cases per 1 million people.\n\nNotably, with over 60% of their population fully vaccinated had the highest COVID-19 cases per 1 million people in the last 7 days.\n\nThe lack of a meaningful association between percentage population fully vaccinated and new COVID-19 cases is further exemplified, for instance, by comparison of and .\n\nBoth countries have over 75% of their population fully vaccinated and have more COVID-19 cases per 1 million people than countries such as and that have around 10% of their population fully vaccinated.”\n\nIn a country like the ruled over by demonic socialist tyranny instead of moral and rational science, this report concludes, it was no surprise this week to see surgeon Dr. Jeffrey Horak being fired after telling a local school board to let parents make decisions about masking their children—nor was it surprising this week to see the socialist Democrat Party controlled Wisconsin Supreme Court condemning a Covid patient to death by refusing to allow him to be treated with the Nobel Prize winning lifesaving drug Ivermectin, and is the same lifesaving Ivermectin drug used to treat 200 members of the US Congress—nor was it surprising this week to see famed cartoonist Michael Leunig being fired for his cartoon comparing Covid “refuseniks” to the Chinese citizens massacred in Tiananmen Square—and most importantly to notice, it isn’t surprising at all that the top socialist Covid authority in America is Dr. Anthony Fauci, who’s most infamously known for deliberately killing helpless puppies. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nOctober 29, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nThe Secret Government Ruling America—Is Trump Still In Power?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://tass.com/world/1355381", "https://sputniknews.com/20211028/us-reportedly-plans-to-use-ageing-b-1-strategic-bombers-against-russian-ships-in-black-sea-1090285199.html", "http://en.kremlin.ru/structure/security-council/members", "https://eng.mil.ru/", "https://www.dailywire.com/news/top-u-s-general-warns-about-chinas-military-progress-u-s-problems-we-have-to-do-something", "https://www.dailywire.com/news/top-u-s-general-warns-about-chinas-military-progress-u-s-problems-we-have-to-do-something", "https://taskandpurpose.com/news/air-force-covid-vaccine-lt-gen-obrien/", "https://www.washingtonpost.com/national-security/2021/10/28/vaccine-mandate-air-force/", "https://www.washingtonpost.com/national-security/2021/10/28/vaccine-mandate-air-force/", "https://taskandpurpose.com/news/military-discharge-refusing-covid-vaccine-video/", "https://www.mcmilitarylaw.com/articles-of-ucmj/article-92-failure-to-obey-an-order/", "https://www.mcmilitarylaw.com/articles-of-ucmj/article-92-failure-to-obey-an-order/", "https://www.merriam-webster.com/dictionary/refusenik", "https://www.washingtonpost.com/national-security/2021/10/28/vaccine-mandate-air-force/", "https://www.thegatewaypundit.com/2021/10/bombshell-templated-denial-memo-reveals-u-s-navys-plans-issue-blanket-rejection-religious-exemptions-covid-vaccine-mandate-despite-directly-violating-several-naval-procedures/", "https://www.thegatewaypundit.com/2021/10/bidens-covid-nightmare-one-third-us-military-still-not-fully-vaccinated/", "https://www.thegatewaypundit.com/2021/10/bidens-covid-nightmare-one-third-us-military-still-not-fully-vaccinated/", "https://www.govexec.com/workforce/2021/10/meet-federal-employees-who-will-refuse-covid-19-vaccine/186180/", "https://www.breitbart.com/politics/2021/10/28/border-patrol-union-on-bidens-vaccine-mandate-we-cannot-afford-to-lose-employees-during-largest-border-crisis-in-nations-history/", "https://www.foxnews.com/politics/biden-admin-vaccine-employees-judge-injunction", "https://www.washingtonpost.com/nation/2021/10/28/new-york-city-vaccine-mandate-judge/", "https://www.rt.com/usa/538780-nyc-firefighters-police-protest/", "https://www.zerohedge.com/geopolitical/establishment-hiding-mass-resistance-vaccine-mandates-striketober-farce", "https://www.dailywire.com/news/all-white-men-nominated-for-science-award-so-committee-refused-to-pick-any-of-them", "https://www.dailywire.com/news/all-white-men-nominated-for-science-award-so-committee-refused-to-pick-any-of-them", "https://www.thegatewaypundit.com/2021/10/ireland-massive-new-covid-outbreak-despite-91-vaccination-rate/", "https://www.mayoclinic.org/coronavirus-covid-19/vaccine-tracker", "https://www.breitbart.com/politics/2021/10/27/florida-reaches-lowest-coronavirus-case-rate-nation/", "https://www.thegatewaypundit.com/2021/10/consensus-reached-astounding-91-clinical-research-studies-confirmed-natural-immunity-provides-not-better-protection-virus-covid-19-vaccines-infection-rate-rema/", "https://pjmedia.com/columns/stacey-lennox/2021/10/28/a-shocking-study-on-vaccine-rates-and-covid-19-you-may-have-missed-n1527669", "https://nypost.com/2021/10/27/minnesota-surgeon-loses-job-after-telling-school-board-to-let-parents-make-decisions-about-masking-kids/", "https://www.wispolitics.com/2021/state-supreme-court-declines-to-take-case-seeking-to-force-hospital-to-administer-ivermectin/", "https://www.thegatewaypundit.com/2021/10/joe-rogan-way-200-congress-people-treated-ivermectin-covid/", "https://www.thegatewaypundit.com/2021/10/aussie-cartoonist-fired-comparing-australias-covid-19-mandates-tiananmen-square-massacre/", "https://www.rt.com/usa/538654-fauci-experiments-beagle-freedom-project/", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3722pl.htm", "https://www.whatdoesitmean.com/index3722.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}