{"result_id": "341024", "URL": "https://www.whatdoesitmean.com/index3510.htm", "timestamp": "2023-04-25 18:12:26 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3510.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "“Taste For Violence” Democrats And Leftist Media Ignore Deadly COVID Vaccine Catastrophe", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA thought-provoking new Security Council (SC) report circulating in the Kremlin today noting the Higher School of Economics (HSE) declaring yesterday that the pandemic-caused Russian economic recession has officially ended, says following this declaration the United States Treasury announced that Russia now owns $6.145-billion worth of US government securities, up from $6.011-billion in December last year, that was joined by the Central Bank of Russia announcing that its own national debt had dropped by $21.3-billion to a total of $470.1-billion.\n\nA national debt for Russia more than offset by its over $586-billion in international reserves and having the world’s greatest natural resource wealth of over $75-trillion—that stands opposed to the United States having over $28-trillion in national debt and its owing over $159-trillion in unfunded government liabilities—stark differences between the fiscally sound Russian Federation and debt ridden economic basket case United States pointed out by President Putin noting that increasing debt to boost economies is obsolete and serves to widen gap between rich and poor, with his stating: “Increasing the debt burden cannot be used as a way of fostering economic growth any more…If 20 or 30 years ago the problem could be solved by means of stimulating macro-economic policy, today these mechanisms have reached their limits”—and now sees the internationally renowned macro strategist Lawrence G. McDonald agreeing with this analysis in his just published warning article “The Big Market Quake Is Coming”, wherein he states: “The Fed is planet earth’s central bank…Every time they tried to play Tough Guy, they’ve blown up the global economy”.\n\nSees this warning coming within days of the Security Council exposing the COVID vaccine fraud being perpetrated upon the world by the United States—which specifically sees the Americans pushing to the forefront the experimental live virus mRNA COVID vaccines containing untested nanoparticles, while at the same time they ignore the decades-long proven inactivated virus ones like Russia’s Sputnik V and Johnson & Johnson’s COVID vaccines—and whose insidious reason for doing so is because unlike the Sputnik V and Johnson & Johnson’s vaccines that protect against all COVID variants, the mRNA vaccines, like AstraZeneca and Moderna, offer no such protection—which means everyone receiving mRNA vaccines will forever be having to receive booster shots as each new COVID variant emerges—that in turn will allow these socialist-globalist monsters to keep this scamdemic ongoing long into the future so they can remake the world according to their diabolical “The Great Reset” master plan.\n\nAfter boxing legend Marvelous Marvin Hagler was reported to have died after receiving an mRNA COVID vaccine this weekend, however, it was followed by Australia’s Health Minister Greg Hunt being admitted to hospital in serious condition just one day after receiving a dose of Oxford-AstraZeneca’s mRNA Covid vaccine—thus making it no surprise that a few hours ago Germany, Italy, France and Spain joined the ranks of European and Asian countries that have temporarily halted use of AstraZeneca’s mRNA COVID vaccine over blood-clot concerns—further sees the European Medicines Agency (EMA) rushing to hold an emergency summit on these mRNA COVID vaccines and the World Health Organization (WHO) urgently discussing the halt of mRNA COVID vaccines—all of which explains why in the just published article “EU Greenlights Talks For Possible Sputnik Procurement After Dubbing Russia's Rollout ‘Propaganda’” it says: “Reuters in a new report has admitted the “unthinkable” now looks very possible: despite Europe's fierce public criticism of Russia's coronavirus vaccine, it found that “Behind the scenes, the bloc is turning to Moscow’s Sputnik V shot as it tries to get its stuttering efforts to vaccinate its 450 million people back on track, EU diplomatic and official sources told Reuters”.\n\nWhile this deadly COVID mRNA vaccine catastrophe continues unfolding, though, the socialist Democrats and their leftist mainstream propaganda media lapdogs won’t allow the Americans to know what’s going on—and to keep these people distracted from true things sees them waging an all-out smear campaign against top Republican Party leader US Senator Ron Johnson, because during an interview this weekend he said about the 6 January protest at the US Capitol: “Now, had the tables been turned—Joe, this could get me in trouble—had the tables been turned, and President Trump won the election, and those were tens of thousands of Black Lives Matter and antifa protesters, I might have been a little concerned”.\n\nBy Senator Johnson openly telling the truth that no one at the US Capitol was really in fear of mainly elderly Trump supporters, his destruction of the lying narrative about this protest ignited a leftist media firestorm—best exampled by the leftist Washington Post saying that Senator Johnson’s “racism is breathtaking”, and leftist television talk show host Joy Behar screaming: “You know, he’s right out there…He’s right out there with his racism…There is no dog whistle for him…He’s scared of this fictitious idea of Antifa, a thing that doesn’t even exist”—and in response to this unhinged rage-filled lying leftist media insanity, now sees Senator Johnson having released to the Wall Street Journal his open letter entitled “I Won’t Be Silenced By The Left”, wherein he states: “They twisted what I said about Jan. 6 because they want Americans to forget last summer’s violence and destruction”—then reveals: “Those who seek political advantage by dividing the nation hurl the worst possible accusations to silence anyone who challenges their left-wing agenda”—and factually says:\n\nLeftists who want to memory hole last summer’s political violence immediately started lecturing me that the 2020 protests were mostly peaceful.\n\nApparently they’ve forgotten that, according to the Armed Conflict Location & Event Data Project, 570 leftist protests became riots last year.\n\nTwenty-five people lost their lives and 700 law enforcement officers were injured. Braying about “peaceful protests” offers no comfort to those victims or the other innocent Americans whose homes, businesses and property were destroyed.\n\nThe same people fail to see the damage they do by pushing a narrative designed to portray the 74 million Americans who voted for Mr. Trump as potential domestic terrorists or armed insurrectionists.\n\nWe should all be disgusted at the cynical way antifa and other leftists hide behind the banner of equality—a goal we all share—even as they carry signs calling for an end to America or talk of burning cities down. It was also sadly predictable that liberals would hurl the accusation of racism.\n\nThis isn’t about race. It’s about riots. The rioters who burned weren’t of any one ethnicity; they were united by their radical leftism.\n\nTheir politics, together with their taste for violence—so different from the Trump supporters I know personally or the Trump rallies we all saw carried out peacefully—should concern us.\n\nThere’s a reason why the boarded-up windows in the downtowns of major cities came down soon after Joe Biden won the election: Nobody was worried what Trump supporters would do if their guy lost; they were worried about what Biden supporters would do if their guy didn’t win.\n\nUnfortunately, much of the media have lost any sense of fairness and objectivity.\n\nThey shed all pretense of being unbiased the moment President Trump won the 2016 election. As a result, approximately half of simply doesn’t trust the mainstream media or rely on what it reports.\n\nAn unbiased free press is essential in a democracy, but the censorship of conservative perspectives in today’s cancel culture is antithetical to freedom.\n\nMost reporters today put advocacy above journalism. Instead of conducting interviews with conservatives, they conduct arguments.\n\nThey push their political viewpoints and are willing to lie, twist, distort, omit, censor and cancel anything or anyone with an opposing view. They are oblivious to the harm they are doing.\n\nAll who value liberty and free speech must push back.\n\n[Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nAccording to this report, as an example of the full socialist brainwashing horror the American people are being subjected to, it’s being best revealed today by the exposing of the 9 January leftist Washington Post “bombshell” article about what President Trump reportedly said on a phone call to the Georgia elections investigator, whose headline was “Find The Fraud”, and said Trump pressured a Georgia elections investigator in a separate call legal experts are saying could amount to obstruction—a revelation so damning, it formed the basis of the impeachment charge leveled against President Trump by the socialist Democrats.\n\nUnknown to the greater masses of the American people about this leftist media claim, however, this report details, is that it was entirely fabricated out of thin air and never happened—a fact exposed as being true this past week when the recording of this call was released proving President Trump said no such thing—which is why a few days ago, on 11 March, the leftist Washington Post quietly retracted their made up lies, but about which is being said: “A correction two months after the fact, when the story has already played a significant role in shaping perceptions of political events, seems wholly inadequate”—and in response to saw President Trump releasing a statement, in part, saying: “While I appreciate the Washington Post's correction, which immediately makes the Georgia Witch Hunt a non- story, the original story was a Hoax, right from the very beginning…You will notice that establishment media errors, omissions, mistakes, and outright lies always slant one way—against me and against Republicans…Meanwhile, stories that hurt Democrats or undermine their narratives are buried, ignored, or delayed until they can do the least harm”.\n\nFully supporting these socialist Democrat and leftist media brainwashing lies, this report notes, are America’s leftist tech giants—one of the most prominent of whom is social media messaging giant Twitter, who this past week locked out top Republican Party icon former US House Speaker Newt Gingrich because he criticized Biden’s immigration policies—after which censorship-happy Twitter suddenly became concerned about “public conversation” as Russia cracks down on illegal content—then saw Twitter rushing to a US Federal Court and filing a motion to dismiss a lawsuit from a minor who claims that they refused to remove child porn that featured him and another 13-year-old—which is the exact reason Russia is taking legal actions against Twitter, because they refuse to abide by the law and remove tweets with information on ways of committing suicide, incitement to commit suicide, as well as child pornography and information about methods of making and using drugs—and is why earlier today, Russian officials warned they are poised to announce a ban on the Twitter within weeks if they fail to comply with demands to take down these unlawful posts featuring child pornography, calls for suicide and drug use.\n\nWith the Ministry of Digital Development-Communications and Mass Media (Minkomsvyaz) having ordered that starting from 1 July, manufacturers of cell phone, tablets and computers will have to pre-install a domestic search engine in the browser by default, this report continues, this protection of the Russian people from American tech giants and leftist media brainwashing propaganda is needed because of “The Sovietization of the American Press”, whose transformation from phony “objectivity” to open one-party orthodoxy is rapidly expanding—a Sovietization news expansion being noted in articles like “Free Speech: And... It's Gone”, that warns: “It’s no surprise to me that the war against speech is accelerating…There’s desperation in the air everywhere”—and to the forces driving the Sovietization of the American press, sees them being revealed by Pulitzer Prize winning investigative journalist Glenn Greenwald, who in his just published article “The Leading Activists For Online Censorship Are Corporate Journalists” states: “It should not require much work to recognize that vesting this magnitude of power in the hands of unaccountable billionaires, who operate outside the democratic process yet are highly influenced by public media-led pressure campaigns, is unsustainable”.\n\nStill not being understood by the American people about their nation, this report further notes, is that it is no longer a democracy; rather it’s an oligarchy—which in English means the wealthy few move policy, while the average American has little power—and to keep this power sees these wealthy corporate oligarchs needing to keep the American people divided against each other, otherwise they’ll wise up to what’s going on and turn on their masters—which is why there is no affront against human morals or common sense too great to throw into the faces of these Americans—best exampled this week by socialist California school districts using COVID money to pay teacher bonuses while keeping schools closed, and the Grammy Awards putting on an actual pornographic performance on live television.\n\nThe Grammy Awards is of particular notice, this report concludes, first of all because one of its presenters, comedian Bill Burr, openly attacked and mocked leftists—an attack followed by leftists erupting in fury at Burr calling him a racist—a leftist attack quickly met by Barr’s wife Nia posting a picture of them together, who just happens to be a beautiful black woman—which caused leftist mobs to then attack her saying such vile things like “You shouldn't assume someone isn't racist just because they own a minority sex servant…They may very well have one because they're racist”—and secondly important notice about was followed by articles like “Woke Grammy Awards Sees Ratings Plummet 50 Percent in Early Numbers Report” and “Get Woke, Go Broke: 2021 Grammy Ratings Tank, Could be Event’s Lowest in History”—articles critical to notice because of the massive losses corporate television and entertainment giants are suffering because of leftist woke culture—profit losses in the billions-of-dollars coming at the same articles are now appearing like “CNN and MSNBC Built up That Trump Hate, Now They're Drowning Without Him”—and when all combined, shows how desperately these corporate oligarchs need President Trump to reemerge into the limelight—an emergence of President Trump these corporate oligarchs will pave the way for by viciously turning on Biden and his socialist Democrats—and is why astute political observers are predicting the soon coming demise of these socialist-leftist forces, like top President Ronald Reagan advisor Donald Devine, who states: “I think it’s going to be absolutely clear to everybody in two — and certainly in the four years — that this whole progressive solution to the problem doesn’t work...They tried this for almost a century now...I think what we’re witnessing now is the end of an era...We’re seeing the end of the progressive reforms started slowly under Woodrow Wilson, picking up on the Franklin Roosevelt, and peaking under Lyndon Johnson”.\n\nMarch 16, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nAmericans Need To Remember That Tyranny Is An Illusion—And Qatar Is Helping Them\n\nAmerican People Are Winning A War They Don't Even Know They're Fighting", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://www.hse.ru/en/", "https://tass.com/economy/1266105", "https://home.treasury.gov/", "https://www.rt.com/russia/518221-pandemic-downturn-political-tensions/", "https://www.cbr.ru/eng/", "https://www.rt.com/russia/518221-pandemic-downturn-political-tensions/", "https://www.cbr.ru/eng/hd_base/mrrf/mrrf_m/", "https://www.rt.com/business/447815-russia-natural-resources-sanctions/", "https://www.usdebtclock.org/", "https://www.rt.com/business/513783-putin-economy-boosting-inequality/", "https://www.rt.com/business/513783-putin-economy-boosting-inequality/", "https://en.wikipedia.org/wiki/Lawrence_G._McDonald", "https://www.zerohedge.com/markets/larry-mcdonald-warns-big-market-quake-coming", "https://www.zerohedge.com/markets/larry-mcdonald-warns-big-market-quake-coming", "https://www.whatdoesitmean.com/index3508.htm", "https://www.whatdoesitmean.com/index3508.htm", "https://www.whatdoesitmean.com/index3508.htm", "https://www.whatdoesitmean.com/index3508.htm", "https://www.whatdoesitmean.com/index3508.htm", "https://www.weforum.org/great-reset/", "https://moguldom.com/342281/thomas-hitman-hearns-marvin-hagler-died-from-effects-of-covid-vaccine/", "https://stateofthenation.co/?p=55957", "https://www.wsj.com/articles/germany-becomes-latest-european-country-to-suspend-use-of-astrazenecas-covid-19-vaccine-11615820414?mod=hp_lead_pos6", "https://www.ema.europa.eu/en", "https://citizenfreepress.com/breaking/european-drug-regulator-calls-emergency-vaccine-summit/", "https://www.who.int/", "https://112.international/society/who-to-discuss-halt-of-astrazeneca-vaccine-use-59765.html", "https://www.zerohedge.com/covid-19/eu-greenlights-talks-possible-sputnik-procurement-after-dubbing-russias-rollout-propaganda", "https://www.zerohedge.com/covid-19/eu-greenlights-talks-possible-sputnik-procurement-after-dubbing-russias-rollout-propaganda", "https://www.wsj.com/articles/i-wont-be-silenced-by-the-left-11615848103?mod=hp_opin_pos_3", "https://www.washingtonpost.com/opinions/the-ron-johnsons-of-the-republican-party-seem-proud-to-be-racist/2021/03/15/1ad4c514-85b0-11eb-bfdf-4d36dab83a6d_story.html", "https://www.breitbart.com/clips/2021/03/15/joy-behar-antifa-is-fictitious-idea-its-not-a-real-thing/", "https://www.wsj.com/articles/i-wont-be-silenced-by-the-left-11615848103?mod=hp_opin_pos_3", "https://www.wsj.com/articles/i-wont-be-silenced-by-the-left-11615848103?mod=hp_opin_pos_3", "https://www.wsj.com/articles/i-wont-be-silenced-by-the-left-11615848103?mod=hp_opin_pos_3", "https://www.wsj.com/articles/i-wont-be-silenced-by-the-left-11615848103?mod=hp_opin_pos_3", "https://thefederalist.com/2021/03/16/washington-post-accuses-trump-of-a-crime-based-on-fabricated-quotes/", "https://thefederalist.com/2021/03/16/washington-post-accuses-trump-of-a-crime-based-on-fabricated-quotes/", "https://thefederalist.com/2021/03/16/washington-post-accuses-trump-of-a-crime-based-on-fabricated-quotes/", "https://www.zerohedge.com/political/find-fraud-youll-be-hero-was-lie-wapo-issues-major-retraction-after-audio-vindicates", "https://thefederalist.com/2021/03/16/washington-post-accuses-trump-of-a-crime-based-on-fabricated-quotes/", "https://thefederalist.com/2021/03/16/washington-post-accuses-trump-of-a-crime-based-on-fabricated-quotes/", "https://www.zerohedge.com/political/find-fraud-youll-be-hero-was-lie-wapo-issues-major-retraction-after-audio-vindicates", "https://saraacarter.com/newt-gingrich-locked-out-of-twitter-for-criticizing-biden-immigration-policy/", "https://www.rt.com/op-ed/517771-twitter-censorship-russia-illegal-content/", "https://www.theblaze.com/news/twitter-dismiss-child-porn-lawsuit-section-230", "https://tass.com/world/1264665", "https://www.rt.com/russia/518242-block-twitter-month-regulator/", "http://government.ru/en/department/387/events/", "https://tass.com/economy/1266169", "https://taibbi.substack.com/p/the-sovietization-of-the-american", "https://taibbi.substack.com/p/the-sovietization-of-the-american", "https://www.zerohedge.com/political/free-speech-and-its-gone", "https://www.zerohedge.com/political/free-speech-and-its-gone", "https://www.zerohedge.com/political/greenwald-leading-activists-online-censorship-are-corporate-journalists", "https://www.zerohedge.com/political/greenwald-leading-activists-online-censorship-are-corporate-journalists", "https://www.bbc.com/news/blogs-echochambers-27074746", "https://www.bbc.com/news/blogs-echochambers-27074746", "https://redstate.com/jenniferoo/2021/03/15/for-the-children-california-school-districts-want-to-use-covid-money-for-teacher-bonuses-n344068", "https://sputniknews.com/society/202103161082355874-cardi-b-chastised-for-weakening-american-society-with-pornographic-performance-at-grammys/", "https://redstate.com/tladuke/2021/03/15/bill-burr-ticks-off-all-the-thin-skinned-snowflakes-at-the-grammy-awards-n343627", "https://redstate.com/scotthounsell/2021/03/15/bill-burrs-wife-responds-exactly-how-youd-expect-someone-married-to-bill-burr-to-respond-n344028", "https://redstate.com/scotthounsell/2021/03/15/bill-burrs-wife-responds-exactly-how-youd-expect-someone-married-to-bill-burr-to-respond-n344028", "https://www.breitbart.com/entertainment/2021/03/15/grammy-awards-sees-ratings-plummet-50-percent-in-early-numbers-report/", "https://www.thegatewaypundit.com/2021/03/get-woke-go-broke-2021-grammy-ratings-tank-events-lowest-history/", "https://redstate.com/nick-arama/2021/03/14/cnn-and-msnbc-built-up-that-trump-hate-now-theyre-drowning-without-him-brian-stelter-pitches-new-hate-object-n343333", "https://www.westernjournal.com/top-reagan-admin-official-predicts-bidens-term-will-mark-end-progressive-era/?utm_source=site&utm_medium=aggregator10&utm_campaign=can", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3491pl.htm", "https://www.whatdoesitmean.com/index3491.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}