{"result_id": "341002", "URL": "https://www.whatdoesitmean.com/index3920.htm", "timestamp": "2023-04-25 18:12:15 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3920.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Buffalo Mass Shooter Supporting Ukraine Nazis Blames “Covid Vaccine Juice” For Massacre", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA compelling new Security Council (SC) report circulating in the Kremlin today first noting the white race Nordic nations Finland and Sweden have moved to join the Western colonial NATO military bloc after more than a half century of neutrality, says in quick response it saw Deputy Foreign Minister Sergei Ryabkov stating: “The fact that the security of Sweden, like Finland, will not be strengthened as a result of this decision, is completely obvious to us...The general level of military tension will increase, and predictability in this area will become less...It is a pity that common sense is being sacrificed for some phantom ideas about what should be done in the current situation”.\n\nImmediately prior to Finland announcing its move to join with the Western colonial powers, this report notes, Finnish President Sauli Niinisto called to inform President Putin, after which he expressed surprise over Putin’s calm reaction—an expression of surprise clearly showing President Niinisto isn’t fully aware of Russia’s Nuclear War Doctrine, wherein it plainly states that in a war Russia will immediately target all NATO nations with overwhelming nuclear weapon strikes, which now includes Finland and Sweden—is a doctrine based on the factual reality that Russia can’t match NATO in a conventional war—and with the United States declaring it’s ready to provide military support to these NATO hopefuls, it sees Russia more than willing to allow these Western colonial powers to spend their national wealth on weapons that will be obliterated in the opening seconds of World War III.\n\nBecause of the Western colonial sanctions against Russia due to its launching of the “Special De-Nazification Operation” to liberate Ukraine, this report continues, this weekend it caused Norwegian independent energy research and business intelligence company Rystad Energy to issue the grim warning: “A perfect winter storm may be forming in Europe as gas prices are forecast to triple...The cost of the fuel on the continent could hit $3,500 per 1,000 cubic meters in winter”—a warning quickly followed by Bloomberg News revealing: “The European Commission has reportedly agreed a plan that would allow companies to keep buying Russian gas without violating sanctions imposed on Moscow over its military attack on Ukraine…The proposal does not prevent the companies from opening euro or dollar accounts in Gazprombank, as Moscow has requested”.\n\nIn the United States this weekend, this report details, a mass shooting massacre took place at a Buffalo-New York supermarket targeting Blacks and killing 10—in response to this massacre it saw Supreme Socialist Leader Joe Biden stating: “We’re still gathering the facts, but already the Justice Department has stated publicly that it is investigating the matter as a hate crime...This was a racially motivated act of white supremacy and violent extremism...We must all work together to address the hate that remains a stain on the soul of America”—is a statement that follows an honest-to-god pro-Nazi rally in the middle of New York City where Biden Regime supporters shouted “Azov! Azov! Azov!” in support of Ukrainian Nazi Azov Battalion fighters—is the same Azov Battalion whose political branch National Corps leader Andriy Biletsky proclaimed after the US Congress cut off funds to these Nazi fighters: “So why the “Negro-love” on a legislative level?...They want to break everyone who has risen to defend themselves, their family, their right to be masters of their own land!...They want to destroy the Nation’s biological resistance to everything alien and do to us what happened to Old Europe, where the immigrant hordes are a nightmare for the French, Germans and Belgians, where cities are “blackening” fast and crime and the drug trade are invading even the remotest corners”—and after these American funds were restored when the Azov Battalion was incorporated into the Ukraine military, it saw their political leader Biletsky vowing that the Azov Nazi force’s goal is to “lead the White races of the world in a final crusade”.\n\nFully supporting the Ukrainian Nazi goal to “lead the White races of the world in a final crusade”, this report notes, is Buffalo mass shooter Payton Gendron, who immediately prior to his massacre of innocent Blacks posted a 180-page manifesto that was emblazoned with the Azov Battalion Black Sun Nazi symbol—and in support of these Western colonial European master race Ukrainian Nazi fighters it saw 18-year-old mass shooter Gendron stating in his manifesto: “The United States, just like the rest of the colonies of Europe, is simply an off-shoot of the European people…A finger on the hand of the body of Europe…The origins of my language are European, my culture is European, my political beliefs are European, my philosophical beliefs are European, my identity is European and most importantly, my blood is European”.\n\nAs to why mass shooter Gendron identified with socialist Europe over his own country, this report continues, is due to the socialist indoctrination he received in the schools he attended in the socialist Democrat Party iron grip controlled State of New York, and in his manifesto states: “When I was 12 I was deep into communist ideology”—due to Russia launching its special operation to de-Nazify Ukraine it saw mass shooter Gendron writing in his manifesto: “I support neo-nazism…you can call me an ethno-nationalist eco-fascist national socialist if you want, I wouldn’t disagree with you”—because Fox News is nearly alone in telling the truth about Ukraine it saw mass shooter Gendron including in his manifesto an anti-Semitic meme attacking Fox News and its owner Rupert Murdoch—is a manifesto that sees mass shooter Gendron asking then answering his own questions, like him asking: “Are you a fed/shill/mossad agent/false flag/patsy/imposter/antifa/“three letter agent glow sobright” etc?”, and sees him answering: “Who knows maybe it’s the two shots of covid vaccine juice going through my bloodstream that’s really making me do this”.\n\nMost assuredly supporting the socialist Nazi master race ideology espoused by mass shooter Gendron and Azov Battalion fighters, this report concludes, is Western colonial war leader NATO Secretary General Jens Stoltenberg, who yesterday declared: “Ukraine can win this war”—a declaration quickly countered by First Deputy Permanent Representative Dmitry Polyansky to the United Nations, who more factually declared: “We have no other way out, our cause is right, and we will of course win”—and are opposing declarations now joined by the latest urgent war bulletins issued by the Ministry of Defense (MoD), whose most notable ones reveal:\n\n“Over the past 24 hours, Russian missile troops and artillery hit 325 areas of concentration of manpower and military equipment, 14 command posts and 24 artillery batteries in firing positions”.\n\n“During the past day, high-precision air-launched missiles of the Russian Aerospace Forces hit two command posts, including the command post of the 72nd mechanized brigade in the Tsapovka area of ​​the Kharkov region, 16 areas of concentration of manpower and military equipment, eight long-term firing points and five depots of missile and artillery weapons...Over 360 nationalists were killed as a result of the strikes and 78 units of military equipment were put out of action”.\n\n“Russian air defense systems shot down two Ukrainian Su-25 attack aircraft, one Su-24 bomber, and ten drones overnight, including two Tu-143 Reis jets, and intercepted 18 rockets of the Smerch multiple launch rocket system”.\n\n“Over the past three or four days, up to 100 fighters of the Armed Forces of Ukraine have been destroyed in the Vasilyevka area in the Avdiivka direction in the Donbass”.\n\n“The Kherson Region is 100% protected by Russian troops...Many people have realized by now that it is Russian army by means of its air defense systems that protects the residents of the Kherson Region and its capital city...Many people are beginning to understand, that all those rallies, all those images shown by Ukraine’s media are an illusion, and a ploy to fuel fear”.\n\n[Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nMay 16, 2022 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nNASA Knows That World Is Now Well And Truly Dead", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://www.cnbc.com/2022/05/16/russia-ukraine-live-updates.html", "https://ria.ru/20220516/nato-1788736183.html", "https://www.foxnews.com/world/finland-president-putin-calm-nato-membership", "https://sgp.fas.org/crs/nuke/R45861.pdf", "https://www.rt.com/news/555526-us-nato-sweden-finland-assistance/", "https://metro.co.uk/2022/04/30/russian-tv-stimulates-nuking-europe-in-200-seconds-with-no-survivors-16565000/", "https://sputniknews.com/20220225/what-did-putin-mean-by-denazification-of-ukraine-and-why-is-it-so-important-1093375330.html", "https://www.rt.com/business/555440-europe-gas-price-triple/", "https://www.rt.com/russia/555525-gas-eu-commission-draft/", "https://www.zerohedge.com/political/ten-dead-after-gunman-military-uniform-livestreams-mass-shooting-buffalo-supermarket", "https://www.breitbart.com/politics/2022/05/15/joe-biden-condemns-buffalo-shooting-racially-motivated-act-white-supremacy-violent-extremism/", "https://rumble.com/v126kl4-ukraine-war-attendees-chant-azov.html", "https://mronline.org/2022/03/23/u-s-congress-admits-nazi-role-in-ukraine/", "https://www.cnn.com/2022/03/29/europe/ukraine-azov-movement-far-right-intl-cmd/index.html", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.zerohedge.com/news/2022-05-15/buffalo-mass-shooting-complicates-ukraine-war-narrative", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.scribd.com/document/574156945/Payton-Gendron-Manifesto", "https://www.rt.com/russia/555523-ukraine-can-win-war/", "https://tass.com/politics/1451345?utm_source=&utm_medium=referral&utm_campaign=&utm_referrer=", "http://government.ru/en/department/94/events/", "https://ria.ru/20220516/upravlenie-1788748895.html", "https://ria.ru/20220516/upravlenie-1788748895.html", "https://ria.ru/20220516/upravlenie-1788748895.html", "https://lenta.ru/news/2022/05/16/matros/?utm_source=smi2_lentanews&utm_medium=exchange&es=smi2", "https://tass.com/politics/1451241", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3902pl.htm", "https://www.whatdoesitmean.com/index3902.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}