{"result_id": "341006", "URL": "https://www.whatdoesitmean.com/index3782.htm", "timestamp": "2023-04-25 18:12:17 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3782.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Putin Embraces Vax Refuseniks After WHO Reveals “Some Countries Are Using Boosters To Kill Children”", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nPutin Embraces Vax Refuseniks After WHO Reveals “Some Countries Are Using Boosters To Kill Children”\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nAn insightful new Security Council (SC) report circulating in the Kremlin today sees this transcript showing Security Council Members fully supporting the embrace given to Covid vaccine refuseniks by President Putin, who revealed that the level of herd immunity against coronavirus may achieve 80% in Russia by the second quarter of 2022, and then ordered that “no prosecution measures” should be imposed for the refusal to receive the vaccine, because “action force is always equal to reaction force”—which means if someone is forced to do something against their free will, they will rebel.\n\nAlso fully supporting President Putin’s embrace of Covid vaccine refuseniks, this report notes, is Director-General Dr. Tedros Adhanom Ghebreyesus of the World Health Organization, who this week warned that the insane Covid policies enacted by Supreme Socialist Leader Joe Biden could prolong the pandemic, and stated: “Blanket booster programs are likely to prolong the pandemic rather than ending it...No country can boost its way out of the pandemic”—then to the horror of the entire world, Director-General Tedros shockingly revealed: “As we see, some countries are using boosters to kill children, this is not right”—a shock revelation of outright genocide quickly joined by Covid experimental mRNA vaccine inventor American virologist Dr. Robert Malone, who in his just issued dire warning states:\n\nParents, before you inject your child, a decision that is irreversible, I wanted to let you know the scientific facts about this genetic vaccine which is based on the mRNA vaccine technology I created.\n\nFirst, is that a viral gene will be injected into your children’s cells. This gene forces your child’s body to make toxic spike proteins. This protein can cause permanent damage in children’s critical organs, including their brain and nervous system, their heart and blood vessels including blood clots, their reproductive system, and this vaccine can trigger fundamental changes to their immune system.\n\nThe most alarming part about this is that these damages, once they occur are irreparable. You can’t fix lesions within their brains. You can’t repair heart tissue scarring. You can’t repair a genetically reset immune system. And this vaccine could cause reproductive damage that could infect future generations of your family.\n\nThe second thing that you need to know about this is the fact that this novel technology has not been adequately tested. We typically need at least five years of testing and research before we can really understand the risks of new medicines or vaccines.\n\nHarms and risks from new medicines often become revealed many years later.\n\nSo ask if yourself if you want your own child to be part of the most radical medical experiment in human history.\n\nOne final point. The reason they are giving you to vaccinate your child is a lie. Your children represent no danger to their parents or grandparents. It’s actually the opposite. Their immunity after getting COVID is critical to save your family if not the world from this disease.\n\nIn summary, there is no benefit for your children or your family to be vaccinating your children against the small risk of this virus given the known health risk of the vaccine that is apparent you and your children may have to live with for the rest of their lives.\n\nThe risk benefit for this vaccine isn’t even close for children.\n\nAs a parent and grandparent, my recommendation to you is to protect your children and do not give them this unproven vaccine.\n\nUnlike the dangerous and deadly experimental Covid vaccines based on unproven and untested mRNA technology, this report continues, Russia’s first in the world Sputnik V vaccine for Covid, and like the Johnson & Johnson jab, is based on the decades-long proven dead virus technology to boost immunity—which made it no surprise this week when a major scientific study concluded: “Russia's Sputnik-V vaccine and its one-shot version Sputnik Light booster demonstrates high virus-neutralising activity (VNA) against the highly-contagious Omicron variant of COVID-19, providing a strong defence against severe disease and hospitalisation”.\n\nDue to the insane and deadly Covid policies enacted by the socialist Biden Regime, this report details, today in America it’s being reported that thousands of people stranded at airports in a Christmas holiday travel nightmare because dozens of flights have been canceled across the United States on Christmas Eve due to Covid staff shortages with thousands of passengers stuck at the airports and others forced to cancel holidays altogether—as this Christmas holiday travel nightmare accelerates it saw leftist fake news propagandist CNN trying to ignite fear hysteria by saying the first Omicron death in Texas was reported, but saw the hospital saying: “This is not true”—then it saw leftist fake news propagandist MSNBC demanding that unvaccinated patients be denied hospital care—would be denied hospital care for unvaccinated Americans that might actually save their lives after it was revealed this week that 70% of London’s Covid hospitalizations were diagnosed after the patient had already been admitted for other ailments—though most surprisingly this week, it saw the world’s top podcaster Joe Rogan actually supporting the science proving that face diaper masks don’t work against Covid when he factually observed:\n\nMasks are like the Democrats’ MAGA hat. You wear it to make people feel comfortable.\n\nI know it’s illogical, and I’m fine wearing it if it relaxes people, and makes them feel better.\n\nBut if people want to argue that they do something, it just doesn’t make any sense man.\n\nThe conclusion section of this transcript sees Security Council Members noting the British Health Security Agency revealing this week: “While Covid-19 booster shots provide more protection against severe disease from the new Omicron variant, even this starts to wane after 10 weeks”—is a revelation that supports President Putin’s assertion that only herd immunity is able to stop the pandemic, and unjustly persecuting vaccine refuseniks will only prolong it—and is factual reality now agreed with by Australian Prime Minister Scott Morrison, who after trying to stamp out the pandemic with two years of crushing lockdowns and massive vaccine refusenik persecutions, just called an emergency National Cabinet meeting whose one key message will be telling state premiers that a return to lockdowns, tight social restrictions and fines for violating them is not the answer, and stated: “We have got to get past the heavy hand of government and we've got to treat Australians as adults”. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nDecember 24, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nAmericans Have Been Warned—But They Forgot How To Think", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "http://en.kremlin.ru/structure/security-council/members", "https://tass.com/world/1380241", "https://tass.com/world/1380241", "https://tass.com/world/1380241", "https://www.who.int/director-general/biography", "https://www.zerohedge.com/political/no-country-can-boost-its-way-out-who-warns-booster-programs-could-prolong-pandemic", "https://www.zerohedge.com/political/no-country-can-boost-its-way-out-who-warns-booster-programs-could-prolong-pandemic", "https://www.brighteon.com/78aa41f6-b7c4-4b61-a68f-13e8b27db9a5", "https://www.rwmalonemd.com/", "https://www.thegatewaypundit.com/2021/12/mrna-vaccine-inventor-issues-warning-parents-not-give-children-unproven-vaccines-may-permanently-damage-organs-reproductive-system-immunity/", "https://www.ndtv.com/world-news/russian-vaccine-sputnik-v-says-it-is-more-effective-against-covid-19-omicron-variant-report-2665430", "https://www.rt.com/usa/544293-thousands-flights-covid-canceled/", "https://www.thegatewaypundit.com/2021/12/busted-cnn-reports-first-omicron-death-texas-hospital-says-not-true-video/", "https://www.thegatewaypundit.com/2021/12/busted-cnn-reports-first-omicron-death-texas-hospital-says-not-true-video/", "https://www.thegatewaypundit.com/2021/12/msnbc-medical-analyst-dr-vin-gupta-says-unvaxxed-denied-care-hospitals-video/", "https://www.zerohedge.com/covid-19/70-londons-covid-hospitalisations-diagnosed-after-being-admitted-other-ailments", "https://yogaesoteric.net/en/masking-and-microns-a-virus-can-easily-squeeze-through-the-pores-of-a-surgical-mask/", "https://www.rt.com/news/544249-britain-boosters-omicron-nhs/", "https://www.cnn.com/2021/12/21/australia/australia-new-south-wales-covid-omicron-intl-hnk/index.html", "https://www.cnn.com/2021/12/21/australia/australia-new-south-wales-covid-omicron-intl-hnk/index.html", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3781pl.htm", "https://www.whatdoesitmean.com/index3781.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}