{"result_id": "341032", "URL": "https://www.whatdoesitmean.com/index3688.htm", "timestamp": "2023-04-25 18:12:30 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3688.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Rapper Nicki Minaj Ignites Epic Internet Holy War Against Biden Covid Slavery", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nOther reports in this series include:\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA discerning new Security Council (SC) report circulating in the Kremlin today first noting that socialist Democrat Party officials in New York City have told the United Nations that in order to meet in person, and without masks, all the world leaders planning to attend next weeks summit will need to be vaccinated, says this shocking affront against health freedom and privacy was quickly blasted by the Russian Permanent Representative to the United Nations Vassily Nebenzia, who in a letter to UN General Assembly President Abdulla Shahid, UN Secretary General Antonio Guterres and UN ambassadors of all countries, noted that he was “very much surprised and disappointed” by Shahid’s letter to members in which he supported the New York authorities’ requirement to provide a vaccination certificate to enter the UN debate hall, and stated on behalf of the Russian Federation: “We strongly object that only people with a proof of vaccination should be admitted to the General Assembly hall”.\n\nSecurity Council Members note that this vaccination demand was made within an hour of Foreign Minister Sergey Lavrov announcing he planned on attending this UN meeting next week—a meeting where Foreign Minister Lavrov intends on demanding that America cease its illegal military occupation of Syria, otherwise Russian forces will eject them—and President Putin isn’t able to attend while he’s bunkered in a nuclear war command center.\n\nThis transcript sees Security Council Members agreeing that this vaccination ploy is intended to keep from the UN debate hall world leaders who’ve received Sputnik V, the first in the world registered vaccine for Covid—a Sputnik V vaccine having 97.2% efficacy against Covid—and after this vaccination order was issued, it then saw the World Health Organization suspending its approval process for Russia’s Sputnik V coronavirus vaccine, pending a fresh inspection of at least one Russian factory manufacturing the shot.\n\nAs to why the socialist-globalist forces in the West fear and despise Sputnik V, this report explains, is because it’s based on decades-old proven vaccine development for similar viruses, which is why it has no side effects and is effective against all Covid variants—and stands opposed to the experimental mRNA vaccines for Covid produced by Pfizer and Moderna whose side effects include heart swelling, fertility issues and even death—yesterday saw Pfizer and Moderna both admitting that their experimental vaccines lose efficacy over time—after which the US Food and Drug Administration bizarrely said that these experimental vaccines currently provide protection against death and severe disease and may not require additional boosters.\n\nNot being told to the American people about these experimental mRNA vaccines, this report details, is that they’re only permitted to be used under an FDA emergency authorization that claims there exists no other known treatments for Covid—a blatant lie known to top White House medical advisor Dr. Anthony Fauci, whose emails prove he knows the effectiveness of Hydroxychloroquine in treating Covid—and is a blatant lie known to the Indian government health officials overseeing the 33 districts in Uttar Pradesh-India, who announced last week the complete eradication of Covid using the drug Ivermectin.\n\nIf Supreme Socialist Leader Joe Biden allowed his health officials to tell the truth about these effective and proven treatments for Covid, this report continues, it would open the floodgates for lawsuits against these mRNA experimental vaccines—which is why Biden issued an illegal order to force them on every American citizen last week—with the end game hoped for consequence being to force the US Congress to pass new laws to protect these vaccine manufacturers before they all are bankrupted.\n\nSecurity Council Members in this transcript note that the Mayo Clinic estimates that 94% of the US population must be immune to interrupt the chain of transmission of Covid to achieve herd immunity—with the United States having a population of 333-million citizens sees 94% of them needing to be exposed to Covid to reach herd immunity being 313-million—as of 8 September, saw the CDC reporting that 75% of the adult population in the United States have received at least one dose of a COVID-19 vaccine, of whom there are 258-million, which equals 193-million of them having been vaccinated—and according to a new model produced by Columbia University Mailman School of Public Health researchers, it estimates that over 100-million Americans had Covid in 2020 alone without even knowing.\n\nThe most striking thing to notice about these numbers of Americans exposed to Covid and/or having been vaccinated against it, this report notes, is it leaves unexplained why Covid cases in the US appear to keep rising—and whose only logical explanation is because those who have received experimental mRNA vaccines are being re-infected with the Covid virus, which are known as “breakthrough infections”.\n\nMost astonishing to note in this transcript, however, are Security Council Members noticing that of all the American people, its Black citizens appear to be the only ones knowing that something is very wrong with how the socialist Biden regime is handling Covid and these experimental mRNA vaccines—a fact proven by the CDC, who in their 8 September report stunningly reveal that of the 59% of those vaccinated whose race is known, ONLY 10% of Black Americans have allowed themselves to jabbed with these experimental Covid vaccines—and in spite of Biden’s illegal forced vaccine mandate, experimental vaccine numbers keep falling.\n\nThis transcript sees Security Council Members agreeing that it’s not a surprise to see Black Americans openly rebelling against having experimental vaccines forced on them—most particularly because these African Americans know the long demonic history of them being subjected to secret medical experiments performed on them by their own government—not just any government, but saw these secret medical experiments ordered by socialist Democrat Party leaders when they were in power—the same Democrat Party that since its founding in 1829, fought against every major civil rights initiative, has a long history of racial discrimination, defended slavery, started the Civil War, opposed Reconstruction, founded the Ku Klux Klan, imposed segregation, perpetrated lynchings, and fought against the civil rights acts of the 1950’s and 1960’s.\n\nThe ideological leader of the present day Democrat Party, this report details, is the late American socialist activist Margret Sanger, the founder of the Planned Parenthood Federation of America, Inc. (PPFA)—a genocidal baby killing organization whose top “Margret Sanger Award” was given yearly to the Democrat Party leader most closely adhering to this demonic ideology, like in 2009 when it was presented to Hillary Clinton—saw Margret Sanger telling these Democrat Party leaders: “We do not want word to go out that we want to exterminate the Negro population, and the minister is the man who can straighten out that idea if it ever occurs to any of their more rebellious members”—which is why Democrat Party leaders lavish money on corrupt Black ministers while they flood poor African American neighborhoods with Planned Parenthood genocidal abortion mills—the catastrophic consequence of which led to the beyond shocking US Congressional report issued in 2015, that heartbreakingly revealed: “Dis-proportionally, the leading consumer of the abortionists’ services is the African-American female…According to the 2011 Abortion Surveillance Report issued by the Center for Disease Control, black women make up 14 percent of the childbearing population, yet obtained 36.2 percent of reported abortions…Black women have the highest abortion ratio in the country, with 474 abortions per 1,000 live births…Percentages at these levels illustrate that more than 19 million black babies have been aborted since 1973…According to the Departments of Public Health of every state that reports abortion by ethnicity; black women disproportionately lead in the numbers”.\n\nGoing unnoticed by Biden and his socialist Democrat Party comrades as they vilely use Covid to create for themselves a “masked servant class” of workers, this report continues, is that the younger generation of African Americans are no longer swayed into having a slavery mentality by corrupt ministers—as instead they look for guideance and support from Black entertainment icons like famed rapper Nicki Minaj, who on her social media accounts of Twitter, Facebook and Instagram alone has over 227-million devoted followers—and over the past few days, has ignited what’s being described as an “Internet Holy War”, and is otherwise known as “Ballgate”.\n\nWith this “Internet Holy War” now crashing into the White House, this report details, it began when Nicki Minaj posted what to her seemed like an innocuous message to her 22-million Twitter followers saying: “My cousin in Trinidad won’t get the vaccine cuz his friend got it & became impotent…His testicles became swollen…His friend was weeks away from getting married, now the girl called off the wedding…So just pray on it & make sure you’re comfortable with ur decision, not bullied”—apparently unbeknownst to Ms. Minaj, however, her message struck at the socialist Democrat Party core lying narrative that experimental mRNA vaccines are safe.\n\nFirst to strike back at Ms. Minaj, this report notes, was socialist Democrat Party idiot mouthpiece MSNBC host Joy Reid, who said live on air: “You have a platform, sister, that is 22 million followers, OK?...I have 2 million followers…You have 22 million followers on Twitter...For you to use your platform to encourage our community to not protect themselves and save their lives, my God sister, you can do better than that!”—quickly after which Ms. Minaj posted a Twitter message that idiot Reid sent last year that said: “I mean, will anyone...anyone at all...ever fully trust the @CDC again?...And who on God's earth would trust a vaccine approved by the @US FDA???...How do we get a vaccine distributed after this broken, Trumpist nonsense has infected everything?...Even if Biden wins?”—then saw Ms. Minaj posting this message saying about Reid: “A lying homophobic cunt...I guess I can join in the reindeer games too right?..Ppl can go on tv & lie on me, I can report on them, too…Doesn’t have to be truths…It can be half truths…Uncle Tomiana asked who on earth would trust the US FDA guys”.\n\nTaking quick notice of this “Internet Holy War”, this report continues, was America’s most watched news host Tucker Carlson of Fox News, who used the opening of his programme to vigorously defend Ms. Minaj against Biden’s socialist forces attacking her—a Tucker Carlson segment Ms. Minaj posted to her Twitter account—after which Ms. Minaj reported that she was “put in Twitter jail” for daring to post the video of Tucker Carlson defending her—then it saw Biden “butt boy” Stephen Colbert using his late night CBS programme to tear into Tucker Carlson for defending Ms. Minaj—an attack on Tucker Carlson that Ms. Minaj responded to with the message: “Right…I can’t speak to, agree with, even look at someone from a particular political party…Ppl aren’t human any more…If you’re black & a Democrat tells u to shove marbles up ur ass, you simply have to…If another party tells u to look out for that bus, stand there & get hit”—the it saw Ms. Minaj posting a message to Biden “butt boy” Colbert saying: “The black woman lied on me & made ppl attack me…But I can’t quote this man who did the opposite…Okay. FUCK HIM…. YASSSSSSSWOOHOOOOOOOOOO happy now?...Brain dead”.\n\nWith this “Internet Holy War” ignited by Ms. Minaj consuming everything in its path, this report concludes, the terror stricken socialist Biden regime forced the government of Trinidad to proclaim that experimental Covid vaccines don’t cause “swollen testicles”—that was followed top White House advisor Dr. Anthony Fauci giving his expert opinion on Ms. Minaj’s cousins friends “swollen balls”—then it saw the White House appearing to invite Ms. Minaj so they could discus vaccine safety with her—an apparent invitation Ms. Minaj responded to with the message: “The White House has invited me & I think it’s a step in the right direction…Yes, I’m going…I’ll be dressed in all pink like Legally Blonde so they know I mean business…I’ll ask questions on behalf of the ppl who have been made fun of for simply being human. #BallGate day 3”—then after this message was posted saw a panicked White House denying it had invited Ms. Minaj to visit—and in quick response, it saw an enraged Ms. Minaj awakening to how these socialist monsters work and posting a nearly 15-minute video to her 157-million Instagram followers, wherein she skewered CNN fake news host Don Lemon, and, in part, said:\n\nLet me ask y'all something.\n\nIn the 10, 12, 13 years, however many years you guys have known of me. Do y'all think that I would go on the Internet and lie about being invited to the fucking White House?\n\nDo you guys see what is happening right now?\n\nSo now this man tries to come on Twitter to make a fucking fool out of me.\n\nSweetheart are you out of your fucking mind?\n\nI'm not one of those people that y'all are gonna be able to do this with sweetheart, okay?\n\nIt's disgusting that a person can't speak about just questions or thoughts they're having about something they're gonna have to put in their body - that this attack is this hateful and purposeful.\n\nY'all saying all this shit on the internet wouldn't make a fucking peep in real life to these artists that you tweet and comment every fucking day.\n\n[Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nSeptember 16, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nBiden Bet On Americans “Notoriously Short-Term Memory” In US Marine Slaughter\n\nBiden Is Dead Man Walking—Davos Game Now In Play", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/index3689.htm", "http://en.kremlin.ru/structure/security-council", "https://justthenews.com/world/un-require-world-leaders-be-vaccinated-order-speak-assembly", "https://tass.com/politics/1338369", "https://tass.com/politics/1338369", "http://en.kremlin.ru/structure/security-council/members", "https://tass.com/politics/1337547", "https://www.whatdoesitmean.com/index3687.htm", "https://www.whatdoesitmean.com/index3686.htm", "https://sputnikvaccine.com/", "https://www.reuters.com/business/healthcare-pharmaceuticals/russias-sputnik-v-vaccine-shows-972-covid-19-efficacy-belarus-rdif-2021-09-15/", "https://www.themoscowtimes.com/2021/09/15/who-suspended-sputnik-v-approval-process-over-manufacturing-breaches-a75058", "https://www.precisionvaccinations.com/vaccines/sputnik-v-vaccine", "https://www.rt.com/usa/534967-fda-vaccine-booster-shots/", "https://www.zerohedge.com/covid-19/fda-says-authorized-covid-19-vaccines-still-effective-boosters-may-not-be-needed", "https://www.thegatewaypundit.com/2021/09/never-forget-dr-tony-fauci-killed-millions-pushed-bogus-study-downplayed-hydroxychloriquine-use-emails-prove-knew-effectiveness/", "https://www.thegatewaypundit.com/2021/09/huge-uttar-pradesh-india-announces-state-covid-19-free-proving-effectiveness-deworming-drug-ivermectin/", "https://www.mayoclinic.org/diseases-conditions/coronavirus/in-depth/herd-immunity-and-coronavirus/art-20486808", "https://www.worldometers.info/world-population/us-population/", "https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/", "https://www.census.gov/library/stories/2021/08/united-states-adult-population-grew-faster-than-nations-total-population-from-2010-to-2020.html#:~:text=In%202020%2C%20the%20U.S.%20Census,from%20234.6%20million%20in%202010.", "https://newatlas.com/health-wellbeing/modeling-estimates-100-million-americans-had-covid19-2020/", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019/media-resources/science-in-5/episode-49-can-i-get-infected-after-vaccination?gclid=EAIaIQobChMIyvqv982D8wIV3otaBR2yIQtJEAAYASAAEgIuj_D_BwE", "https://www.kff.org/coronavirus-covid-19/issue-brief/latest-data-on-covid-19-vaccinations-race-ethnicity/", "http://www.informationliberation.com/?id=62546", "https://www.ucsf.edu/news/2007/12/102785/scholar-speaks-about-history-medical-experimentation-african-americans", "https://assets.ctfassets.net/qnesrjodfi80/6bQdKPLDjyo2s0I8c60gA2/aec7a4feb53cdd469d9c59bc3dd5cc64/swain-the_inconvenient_truth_about_the_democratic_party-transcript.pdf", "https://en.wikipedia.org/wiki/Margaret_Sanger", "https://en.wikipedia.org/wiki/Planned_Parenthood", "https://www.baptistpress.com/resource-library/news/hillary-clinton-receives-award-named-for-famed-eugenicist/", "https://www.goodreads.com/author/quotes/264856.Margaret_Sanger", "https://www.protectingblacklife.org/pp_targets/index.html", "https://www.congress.gov/115/meeting/house/106562/witnesses/HHRG-115-JU10-Wstate-ParkerS-20171101-SD001.pdf", "https://greenwald.substack.com/p/the-masking-of-the-servant-class", "https://en.wikipedia.org/wiki/Nicki_Minaj", "https://www.dexerto.com/entertainment/hasan-responds-to-furious-hate-messages-from-nicki-minaj-fans-after-viral-tweets-1653836/?nowprocket=1", "https://www.google.com/#spf=1631803730434", "https://www.rt.com/usa/534756-nicki-minaj-vaccine-trinidad/", "https://www.dailymail.co.uk/news/article-9994883/Conservative-columnist-Joy-Reid-phony-backs-left-tells-with.html", "https://www.dailymail.co.uk/news/article-9994883/Conservative-columnist-Joy-Reid-phony-backs-left-tells-with.html", "https://www.dailymail.co.uk/news/article-9994883/Conservative-columnist-Joy-Reid-phony-backs-left-tells-with.html", "https://www.foxbusiness.com/technology/nicki-minaj-says-shes-in-twitter-jail-will-never-use-platform-again", "https://www.foxbusiness.com/technology/nicki-minaj-says-shes-in-twitter-jail-will-never-use-platform-again", "https://www.thedailybeast.com/stephen-colbert-tears-into-tucker-carlson-for-defending-nicki-minaj", "https://dailycaller.com/2021/09/15/nicki-minaj-responds-tucker-carlsons-segment/", "https://twitter.com/NICKIMINAJ/status/1438257735338905600", "https://www.rt.com/news/534957-nicki-minaj-twitter-trinidad-testicles/", "https://exclaim.ca/music/article/dr_fauci_provides_his_expert_opinion_on_nicki_minajs_cousins_friends_balls", "https://www.nytimes.com/2021/09/15/us/nicki-minaj-vaccine.html", "https://twitter.com/NICKIMINAJ/status/1438249396571807744", "http://www.nydailynews.com/snyde/ny-nicki-minaj-white-house-invite-20210916-akkh3cidsjecjhlzbb32se6fae-story.html", "https://www.mirror.co.uk/3am/celebrity-news/nicki-minaj-launches-expletive-rant-24996094", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3668pl.htm", "https://www.whatdoesitmean.com/index3668.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}