{"result_id": "341034", "URL": "https://www.whatdoesitmean.com/index1288.htm", "timestamp": "2023-04-25 18:12:31 CEST+0200", "meta": {"description": "Obama, CIA", "lang": "en", "keywords": "Obama, Israel, Mossad, CIA, 9/11, War", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index1288.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Western Use Of “Genocidal” Swine Flu Vaccine Sparks Russian Fears", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\n“Dirty, Filthy, Christians”: Treatise On The Most Dangerous Death Cult In Human History\n\nAn unprecedented work detailing the agenda behind the greatest deception ever foisted upon humanity. (Continued)\n\nBegins For Throne of This World: The Return of the Einherjar Warriors\n\nBy: Sorcha Faal “The truest accounting of our World’s present state of Global Chaos, the ‘whys’ and ‘how’s’ are presented in this epic history of what has been kept hidden from humanity. (Continued)\n\nPicking up the Pieces: Practical Guide for Surviving Economic Crashes, Internal Unrest and Military Suppression By: Sorcha Faal “In the span of less than 3 months gasoline prices will rise 500%. The prices of both food and shelter rise over 300%. (Continued)\n\nThe True Knowledge of The Three Minds: When The Three Become One By: Sorcha Faal “With knowledge obtained from the most ancient of texts, including the Gospel of Mary Magdalene, join Sorcha Faal on one of the most incredible and important journeys into the truest knowledge of human beings. (Continued)\n\nPartisans Handbook: By: Sorcha Faal “Essential Survival Guide For Resisting Foreign Military Occupation, Escape And Evasion Techniques, Surviving Interrogation, Facing Execution, Wilderness Survival (Continued)\n\nThe Children of Winter: Apocalyptic Message of Hope By: Sorcha Faal \"Not told by Sorcha herself alone, but by the Children of Winter themselves, who at 6 years of age the weather had no effect upon them as they walked naked in the snows of winter. Who at 10 years of age could walk thorough boiling water with no burns or (Continued)\n\nCode Red: The Coming Destruction Of The United States Limited release of the perhaps one of the most prophetic books of our time relating to the underlying causes, and history, of the downfall of (Continued)\n\nSpecial Offer: The Power Of Things: The Aryan Symbols Of Hope\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nThe World's most influential philosopher has long been acknowledged as being the Greek mathematician Plato, who being most influenced by the great Greek mathematician, mystic and scientist Pythagoras of Samos (Geometry is knowledge of the eternally existent.), and the “Father of Geometry” Euclid (The laws of nature are but the mathematical thoughts of God.), once gave an order that “Nobody untrained in geometry may enter my house.”\n\nCzar Alexander II, Emperor of All The Russias [photo 2nd left], would not only have been welcomed into Plato’s house by the great Greek philosopher himself, the warning he would give about events to occur from the mid 1800’s, on through to the 21st Century would have shaken Plato to his core, and none more important now than that of the West’s beginning their long-planned assault upon humanity through a seemingly innocuous inoculation against a virus they call the Swine Flu.\n\nUpon his accession to power in 1855 after the death of his father, Emperor Nicholas I, Alexander II became alarmed over the West’s plan to subjugate the entire World through the insidious destruction and enslavement of humanity for the sole benefit of a ruling elite class of people that was gaining ascendancy in the Royal Houses of Europe after the 1848 publication the German philosopher Karl Marx’s “Manifesto of the Communist Party” and which stated that the “The history of all hitherto existing society is the history of class struggles.”\n\nRaising Alexander II’s fears even more were the European Royal Houses “power moves” to force into Western thought and science, and hence its peoples, the catastrophic theories of the English naturalist Charles Darwin who was propounding the concept of “natural selection” and culminated in the publishing of his theories in his 1859 book “On the Origin of Species”.\n\nNow what had led to the fears of Alexander II was the West’s attempting to overturn what is the real state of our existence, which is rooted in geometry and is (loosely) called the “Social Cycle Theory”, and that the great Russian scientist Nikolay Yakovlevich Danilevsky (opposed to Darwin and Marx by advocating that our World’s history is circular not linier) warned the Czar that a “clash of civilizations” between Russia and the West inevitable.\n\nAnd Alexander II’s facing the wrath of the European Royal Houses in this “clash of civilizations” was being realized the very moment upon his taking power as both Britain and France, normally bitter enemies, had united against his father, along with their Muslim Turk allies, in 1854, and attacked the main Russian Naval Base in Sebastopol blocking Russia’s fleet from entering either the Mediterranean or Atlantic.\n\nIn what is called in Russia as the “precursor” to United States Civil War, and to history as the Crimean War, that resulted in the West defeating Russia and leading to the Treaty of Paris of 1856 (which Alexander II annulled after Russia’s victory over his successful war of 1877-8 against the Ottoman Empire) the Czar did “hold back” a significant portion of the Russian Fleet that he used to great effect by stationing them in New York Harbor in 1863 after the European Royal Houses attempt to destroy the United States by pitting its Union Forces against the Confederacy.\n\nEven more importantly, in Alexander II’s knowing that Russia’s and the United States successfully blocking of the European Royal Houses by their wins in the Russian-Ottoman and American Civil wars, the Czar knew the fight was not over and would stretch into the 20th and 21st Centuries with even more horrific conflicts to come. So, in order to strengthen both Russia and the United States, he ordered the Russian territories of Alaska and the Aleutian Islands to be sold to the Americans in 1867, and following the example of Abraham Lincoln ordered the abolition of serfdom in all of the Russia’s believing by these actions both Nations would better prepared for the “clash of civilizations” that was surely to come.\n\nTo the defense of humanity against these monsters, Alexander II also ordered the “greatest men” in Russia to assemble at Kazan State University in Tatarstan where under the guidance of Darwin and Marx’s fieriest foe, Nikolay Danilevsky, they were tasked with uncovering the scientific mechanisms the European Royal Houses could be expected to use against the World in achieving their goal of total Global domination.\n\nIncluded in the ranks of these Great Men of the Motherland was the Russian pianist, conductor and composer Mily Alexeyevich Balakirev who through his research warned of the rise in Western culture of “music for the masses” whose effect on the minds of impressionable young children would “split them” from the control of their parents and society; the Russian mathematician called the “Copernicus of Geometry”, Nikolai Ivanovich Lobachevsky, who through his research warned that the West would embark upon a course devaluing the knowledge of geometry and mathematics thus keeping from their people the true knowledge of our World; and the Russian writer widely regarded as among the greatest novelists of all time, Leo Tolstoy, who warned of the West’s planned destruction of their languages for the purpose of creating an uneducated mindless mass of humanity fit only for slavery.\n\nBut to the most important of these Great Men was the Russian chemist Vladimir Markovnikov who discovered the means by which these Western Powers would exterminate countless hundreds of millions of human beings through the “evil use” of what is known as Markovnikov's Rule that states that “with the addition of a protic acid such as H-X to an alkene, the acid hydrogen (H) becomes attached to the carbon atom with the greatest number of hydrogens, and the halide (X) group becomes attached to the carbon with the fewest hydrogens. In other words the negative part of the addendum attaches itself to the carbon atom with the fewest hydrogen atoms.”\n\nSo dangerous to humanity was Markovnikov’s findings that he refused to publish his research in any language other than Russian. Unknown to him, or to Alexander II, however, was that one of Kazan State Universities students was also a German spy named Vladimir Ilyich Lenin who under the “guidance” of the European Royal Houses secreted out of Russia Markovnikov’s research and which eventually was given to the Ukrainian-American organic chemist Morris Selig Kharasch who by applying Markovnikov’s Rule created in 1928 at the University of Chicago the deadly vaccine additive we know today as Thimerosal.\n\n[Note: Upon the discovery of Lenin’s treachery he was expelled from Kazan State University but he was destined to have a much larger influence upon Russian history when in 1917 the Germans secreted him back to Russia with $10 Million to bring down the government and use the newly created Soviet Union as their first “mass experiment” in how to control large populations.]\n\n[Note: In November, 1880, Alexander II and United States President James Garfield concluded a “secret pact” wherein Russian and American Military and Naval Forces would “invade and occupy” all of Western Europe before the European Royal Houses could regain their power and begin to, once again, plunge our World into total war and genocide. Russian and American coup forces loyal to the European Royal Houses discovered the existence of this “secret pact” and assassinated Alexander II on March 13, 1881 and President Garfield on July 2, 1881.]\n\nThiomersal is an organomercury compound (approximately 49% mercury by weight) that is used as an antiseptic and antifungal agent in vaccines and was first used in 1931. It is blamed for millions of deaths since that time the World over, and, even worse, this deadly mercury poisoned vaccine additive is said to be the cause of the devastating child mental illness called Autism, and though denied by Western governments and pharmaceutical companies, first appeared in the West in the 1930’s after the push to give children vaccines with the Thiomersal additive in the Western Nations.\n\nInteresting to note too is that in the United States, where Thimerosal laden vaccines have long been mandated for children, two groups who have long-claimed religious “exemptions” to the vaccinating of their children, The Nation of Islam in Chicago and the Amish religious sect, have a curious (coincidental) linkage….thousands of their children have NEVER been vaccinated and neither group has ever recorded a single case of Autism.\n\nEven more interesting to note is that in the their government is not just dispensing one Swine Flu vaccine, they are dispensing two of them. The first, called Live, Attenuated (H1N1 LAIV) (nasal spray vaccine), does not contain thimerosal or other preservatives and is recommended for healthy military and potential military age persons with no illness or pregnancy between the ages of 2-49.\n\nThe second one, called Live Inactivated (delivered by injection), has thimerosal and other preservatives and is recommended for everyone else. And from new warnings being issued in the US, one of those “other preservatives” is the deadly organic compound called Squalene, and which is blamed for the catastrophic disease called Persian Gulf War Syndrome that according to American government reports has affected roughly 1 in 4 of the 697,000 US Veterans who served in the first Persian Gulf War.\n\nThe greatest minds of the Russian Motherland assembled in the mid-1880’s and charted the course the Western Powers would take in their quest for total Global domination over our Earth and its resources. As of this date their predictions have all been borne out by the facts of history. The events to occur as this epic “clash of civilizations” reaches its climax have, also, been foretold, including a time when these Western Powers would turn against their own people using mass genocide in order to “weed out” all remaining opposition leaving them with nothing more than ignorant slaves to control.\n\nIt is not in our knowing if this Swine Flu and its poison laden vaccines are a part of this “weeding out” being planned for the Westerners. What is in our knowing though is that there is enough history behind this “event” to bear closer, much closer, examination than is currently being seen by the masses of ordinary peoples.\n\nThe “Geometry of Life” always shows, and tells, all. One wonders though if there is anyone able to see it. We can only hope they do before all is lost and some of these peoples, like Alexander II, would be welcomed in Plato’s home too.\n\nNote: This report should NOT be considered as an alternative to sound medical advice from your Doctors or Government Public Health Officials regarding the H1N1 Swine Flu or its associated vaccines.\n\n© October 20, 2009 EU and US all rights reserved\n\nAre You Ready? You’d Better Be!\n\nWhile You Were Sleeping…\n\n[Ed. Note: Western governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagrees with in believing that it is every human beings right to know the truth. Due to our missions conflicts with that of those governments, the responses of their ‘agents’ against us has been a longstanding misinformation/misdirection campaign designed to discredit and which is addressed in the report “Who Is Sorcha Faal?”.]", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://www.whatdoesitmean.com/indexdfc88.htm", "https://www.whatdoesitmean.com/battlebook.htm", "https://www.whatdoesitmean.com/index713.htm", "https://www.whatdoesitmean.com/threemindsbook.htm", "https://www.whatdoesitmean.com/partisanshandbook.html", "https://www.whatdoesitmean.com/index937.htm", "https://www.whatdoesitmean.com/index8888.htm", "https://www.whatdoesitmean.com/indexpower.htm", "https://www.whatdoesitmean.com/indexfamine.htm", "https://www.whatdoesitmean.com/indexdeathstar.htm", "https://www.whatdoesitmean.com/hyperwar.html", "https://en.wikipedia.org/wiki/Plato", "https://en.wikipedia.org/wiki/Pythagoras", "http://www.gogeometry.com/math_geometry_quotes/pythagoras_geometry_knowledge.html", "https://en.wikipedia.org/wiki/Euclid", "http://www.brainyquote.com/quotes/authors/e/euclid.html", "http://thinkexist.com/quotes/with/keyword/geometry/", "http://www2.sptimes.com/Treasures/TC.2.3.17.html", "http://www2.sptimes.com/Treasures/TC.2.3.16.html", "https://en.wikipedia.org/wiki/Karl_Marx", "https://en.wikipedia.org/wiki/The_Communist_Manifesto", "https://en.wikipedia.org/wiki/Charles_Darwin", "https://en.wikipedia.org/wiki/On_the_Origin_of_Species", "https://en.wikipedia.org/wiki/Social_cycle_theory", "https://en.wikipedia.org/wiki/Nikolai_Danilewski", "http://euphrates.wpunj.edu/courses/hist330-60/Supplementary%20Material/HTML/Danilevskii.html", "http://www.reformation.org/president-lincoln.html", "https://en.wikipedia.org/wiki/Crimean_War", "https://en.wikipedia.org/wiki/Treaty_of_Paris_(1856)", "http://www.onwar.com/aced/data/romeo/russoturk1876.htm", "https://en.wikibooks.org/wiki/Modern_History/American_Civil_War/Wartime_Diplomacy/US-Russian_Relations", "https://simple.wikipedia.org/wiki/Kazan_State_University", "https://en.wikipedia.org/wiki/Nikolay_Danilevsky", "https://en.wikipedia.org/wiki/Mily_Balakirev", "https://en.wikipedia.org/wiki/Nikolai_Lobachevsky", "https://en.wikipedia.org/wiki/Leo_Tolstoy", "https://en.wikipedia.org/wiki/Vladimir_Markovnikov", "https://en.wikipedia.org/wiki/Markovnikov%27s_rule", "http://www.rferl.org/content/article/1051273.html", "https://en.wikipedia.org/wiki/Vladimir_Lenin", "https://en.wikipedia.org/wiki/Morris_Kharasch", "https://en.wikipedia.org/wiki/Thiomersal", "http://www.economicexpert.com/a/Kazan:State:University.htm", "http://www.thecopydude.com/lenin-a-sealed-train-and-10m-dollars/", "https://en.wikipedia.org/wiki/Alexander_II_of_Russia#Assassination", "https://en.wikipedia.org/wiki/James_A._Garfield#Assassination", "https://en.wikipedia.org/wiki/Autism", "https://en.wikipedia.org/wiki/Thiomersal_controversy", "http://answers.yahoo.com/question/index?qid=20080528024727AA2EINM", "http://www.venusproject.com/ethics_in_action/Children_Autism.html", "https://www.cdc.gov/vaccines/pubs/vis/downloads/vis-laiv-h1n1.pdf", "https://www.cdc.gov/vaccines/pubs/vis/downloads/vis-inact-h1n1.pdf", "https://www.youtube.com/watch?v=Jck_1G01xHw", "https://en.wikipedia.org/wiki/Squalene", "https://en.wikipedia.org/wiki/Squalene#Health_controversy", "https://en.wikipedia.org/wiki/Gulf_War_syndrome", "https://www.whatdoesitmean.com/indext3785.htm", "https://www.whatdoesitmean.com/indexmain.htm", "https://www.whatdoesitmean.com/index738.htm", "https://www.whatdoesitmean.com/whoissorcha.htm", "https://www.whatdoesitmean.com/index632.htm", "https://www.whatdoesitmean.com/", "https://www.whatdoesitmean.com/", "https://www.whatdoesitmean.com/", "https://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}