{"result_id": "341043", "URL": "https://www.whatdoesitmean.com/index3722.htm", "timestamp": "2023-04-25 18:12:35 CEST+0200", "meta": {"description": "Sanhedrin David Booth Fatima Sharon Israel Iran Russia Temple.", "lang": "en", "keywords": "Cho Seung Hui, Ismail Ax, Virginia Tech, Massacre", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3722.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "The Secret Government Ruling America—Is Trump Still In Power?", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nThe Secret Government Ruling —Is Trump Still In Power?\n\n“Behind the ostensible government sits enthroned an invisible government owing no allegiance and acknowledging no responsibility to the people. To destroy this invisible government, to befoul the unholy alliance between corrupt business and corrupt politics is the first task of the statesmanship of the day.”\n\nTheodore Roosevelt Jr. (1858-1919)—26th President of the United States and Nobel Prize Peace Prize winner, whose above citied words you can hear him say in the rare sound recording of his speech “The Progressive Covenant With The People”.\n\nShortly before midnight last night, Director Francis Collins of the National Institutes of Health (NIH) sent out a panicked letter titled “Statement On Misinformation About SARS-CoV-2 Origins”—a panicked letter Director Collins rushed out in reply to Richard H. Ebright, Ph.D., the Board of Governors Professor of Chemistry and Chemical Biology at Rutgers University and Laboratory Director at the Waksman Institute of Microbiology, who an hour before posted the message: “The NIH received the relevant documents in 2018 and reviewed the documents in 2020 and again in 2021...The NIH--specifically, Collins, Fauci, and Tabak--lied to Congress, lied to the press, and lied to the public. Knowingly. Willfully. Brazenly”.\n\nSocialist forces in America can censor and ban just about anyone to keep truth hidden, but Dr. Ebright, most certainly, isn’t one of them, because he’s more powerful than anyone trying to silence him—the “relevant documents” cited by Dr Ebright were leaked to the American non-profit news organization Intercept, that on 1 October published their bombshell article “NIH Bat Coronavirus Grant Report Was Submitted More Than Two Years Late”—an article wherein these leaked documents conclusively proved that NIH Director Collins and Dr. Anthony Fauci were secretly funding gain of research experiments in Wuhan China to turn bat viruses into pandemic pathogens—a damning article followed four days later, on 5 October, by NIH Director Collins announcing his retirement.\n\nAs many of you know, at the bottom of every Sorcha Faal Report are a series of notes, one of which says: “The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq”—and to enable you to understand the significance of the facts I’ve just related, here is what you should know about this particular notice.\n\nFirst of all, Wayne Green was one of the leading pioneers of the computer revolution, whose magazines and publications formed the backbone of communications used by this new communications industry that’s changed the world—whose moral philosophy was forged in the fires of World War II during his time in service aboard the American submarine USS Drum—and whose bestselling book “Secret Guide To Health” eviscerated the foods forced on consumers by government and corporate propaganda he warned caused obesity, diabetes, cancer and heart disease.\n\nAfter setting up the WhatDoesItMean.com website, Mr. Green would frequently advise my Dear Sisters to pay attention to what he called the “hidden streams” of information coursing through America he said would lead to discovering what the real truth is—the most important of which he warned was the November-2005 document “National Strategy For Pandemic Influenza” issued by President George W. Bush—and by June-2006, saw this pandemic plan being reviewed by the United States Nuclear Regulatory Commission.\n\nIn following the “hidden stream” of information about the growing pandemic fears of the American government, on 26 September 2019, it caused me to write my warning letter to you “Lucifer Unleashed Against President Trump As Last Stand For America Begins”, wherein I documented the historical context describing the socialist plot “control healthcare and you control the people”.\n\nAs you know, in late September-2019, when I sent this warning letter to you, no one yet knew that the Covid pandemic was about to be unleashed, at least that’s what you’re told—but 15-days prior to sending you my warning letter, on 19 September 2019, I noticed that President Donald Trump had quietly signed a national emergency decree titled “Executive Order on Modernizing Influenza Vaccines in the United States to Promote National Security and Public Health” establishing a task force headed by the Department of Defense—a national emergency decree followed a month later, on 24 October 2019, by Chairman of the Joints Chief of Staff General Mark Milley releasing the results of a study he commissioned in the document “Implications of Climate Change for the U.S. Army”, wherein it warned the US Army could collapse in 20-years, and said: “Americans could face a horrifically grim future from climate change involving blackouts, disease, thirst, starvation and war”.\n\nWhen you combine President Trump’s national emergency decree and General Milley’s commissioned study, they formed the documented legal basis proving that the United States was facing “extraordinary situations” in 2019—which is why it’s critical to notice that, on 13 March 2020, it saw President Trump declaring: “I have the right to do a lot of things that people don’t even know about”.\n\nWhat President Trump was specifically referring to with his declaration are the closest held secrets in America known as Presidential Emergency Action Documents, or PEADs—and whose only public reference came from a 2015 declassified 23 July 2004 letter to the United States Nuclear Regulatory Commission, that revealed: “The PEADs are pre-coordinated legal documents designed to implement Presidential decisions during a national emergency…The PEADs consist of proclamations, executive orders, Presidential messages, and draft legislation ready for submission to Congress…Originally designed for use in the event of any major attack against the United States that disrupted the normal functions of the government, PEADs are used to implement extraordinary Presidential authority in response to extraordinary situations”.\n\nNo matter what side of the political spectrum you adhere to, it is now beyond all dispute that Biden is not in charge of anything or making decisions of any kind—which begs the question, who’s really running America?\n\nUsing the problem-solving principle Occam’s Razor, which says the simplest explanation is usually the best one, or the legal principle Prima Facie, that’s based on the first impression; accepted as correct until proved otherwise, a strong case can be made that President Trump is still in power, as evidenced by the socialist Democrats being given enough rope that they’re hanging each other by the day, and both Biden and Harris having all but disappeared, except when they’re trotted out before cameras so people can see they’re still both alive.\n\nWhatever the case may be, it remains a fact that the strongest evidence points to President Trump having used the PEADs available to him to deal with the “extraordinary circumstances” slamming America—which is why it’s more critical than ever that you start supporting those few us left still following these “hidden streams” of facts and information to whatever truth they reveal.\n\nAnd while deciding if you’re going to remain on the sidelines of this war mistakenly believing it won’t crash into your homes and lives, or support those of us fighting behind and on the front lines of this conflict for your freedom to keep that from happening, I’d like to bring your attention to the just released poll showing Biden’s approval rating has sunk to 37%--a sinking approval rate, most certainly, not caused by the lying leftist mainstream propaganda media—as this victory solely belongs to those of us risking our lives to keep real truth and facts flowing to you, and those supporting us.\n\nI’ll leave you today with the words I’ve left you with before, and are as true right now as they always will be: In the coming months, the dimensions of this looming war are going to shift in radical and unforeseen ways—which is why we believe it is your right to know the full truth about what is happening—a truth the demonic enemies of humanity and our God are doing everything in their power to suppress—which is why our Dear Lord ordered us to band together in such times as these to protect one another—a protection we urgently need at this very moment to keep the truth flowing to you—and in aiding us, our Dear Lord has promised you: “Give, and it will be given to you. A good measure, pressed down, shaken together and running over, will be poured into your lap. For with the measure you use, it will be measured to you.”\n\nOur needs today are dire indeed, but, if every one of you reading this gave just $20.00 today, our budget for the entire year would be met! So, before you click away, ask yourself this simple question….if your knowing the truth about what is happening now, and what will be happening in the future isn’t worth 5 US pennies a day what is?", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" align=\"center\" src=\"https://www.youtube.com/embed/9VnJ9l4xZ6Q\" frameborder=\"0\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/9VnJ9l4xZ6Q"}], "links": ["https://en.wikipedia.org/wiki/Theodore_Roosevelt", "https://www.loc.gov/collections/theodore-roosevelt-films/articles-and-essays/sound-recordings-of-theodore-roosevelts-voice/", "https://www.nih.gov/about-nih/who-we-are/nih-director/statements/statement-misinformation-about-sars-cov-2-origins", "https://www.waksman.rutgers.edu/ebright/people/dr-richard-h-ebright", "https://justthenews.com/politics-policy/coronavirus/nih-confirms-it-funded-gain-function-virus-research-wuhan-calls-it", "https://theintercept.com/2021/10/01/nih-bat-coronavirus-grant-ecohealth-alliance/", "https://justthenews.com/government/federal-agencies/francis-collins-step-down-director-nih", "https://en.wikipedia.org/wiki/Wayne_Green", "https://archive.org/details/SubmarineLifeInWWIIWayneGreen/page/n3/mode/2up", "https://en.wikipedia.org/wiki/USS_Drum_(SS-228)", "https://www.amazon.com/Greens-Secret-Health-Simple-Obvious/dp/B002BPZCN2", "https://www.cdc.gov/flu/pandemic-resources/pdf/pandemic-influenza-strategy-2005.pdf", "https://www.nrc.gov/docs/ML0633/ML063330283.pdf", "https://www.whatdoesitmean.com/index2995.htm", "https://www.whatdoesitmean.com/index2995.htm", "https://trumpwhitehouse.archives.gov/presidential-actions/executive-order-modernizing-influenza-vaccines-united-states-promote-national-security-public-health/", "https://climateandsecurity.files.wordpress.com/2019/07/implications-of-climate-change-for-us-army_army-war-college_2019.pdf", "https://www.vice.com/en/article/mbmkz8/us-military-could-collapse-within-20-years-due-to-climate-change-report-commissioned-by-pentagon-says", "https://www.vice.com/en/article/mbmkz8/us-military-could-collapse-within-20-years-due-to-climate-change-report-commissioned-by-pentagon-says", "https://www.nytimes.com/2020/04/10/opinion/trump-coronavirus-emergency-powers.html", "https://www.nytimes.com/2020/04/10/opinion/trump-coronavirus-emergency-powers.html", "https://www.governmentattic.org/18docs/NRCupdtPEADS_2004.pdf", "https://www.breitbart.com/politics/2021/10/19/poll-bidens-approval-rating-sinks-to-37-percent/", "https://dailyverses.net/giving", "https://fundrazr.com/f1fYo3?ref=sh_79C0K1_ab_1Kr7htbtQ5H1Kr7htbtQ5H", "https://www.whatdoesitmean.com/", "https://www.whatdoesitmean.com/indexnews.htm"], "authors": [], "publish_date": null}