{"result_id": "341031", "URL": "http://www.whatdoesitmean.com/index1810.htm", "timestamp": "2023-04-25 18:12:30 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "http://www.whatdoesitmean.com/index1810.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Obama Refusal To Release Data On US Military Ebola Vaccine Shocks Russia", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nPicking up the Pieces: Practical Guide for Surviving Economic Crashes, Internal Unrest and Military Suppression By: Sorcha Faal “In the span of less than 3 months gasoline prices will rise 500%. The prices of both food and shelter rise over 300%. (Continued)\n\nPartisans Handbook: By: Sorcha Faal “Essential Survival Guide For Resisting Foreign Military Occupation, Escape And Evasion Techniques, Surviving Interrogation, Facing Execution, Wilderness Survival (Continued)\n\nThe Great Refusal: An Historical Guide To Christian Suicide: By: Sorcha Faal is a MUST book for anyone who has contemplated suicide, tried suicide or has had someone they know commit suicide. For as the Sorcha Faal quotes in this psychologically, spiritual, monumental and controversial work: “The whole secret of existence is to have no fear. Never fear what will become of you. Only the moment you reject all are you freed.” (Continued)\n\nObama Refusal To Release Data On US Military Ebola Vaccine Shocks\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA new report prepared by the Federal Service for Supervision of Consumer Rights Protection and Human Well-Being (Rospotrebnadzor) that is circulating in the Kremlin today states that Russian disease experts were shocked this past week after the Obama regime refused to turn over to them test results on a successful ebola virus vaccine developed by the US military in 2004.\n\nRospotrebnadzor disease experts, this report notes, have been at the forefront in the battle against the ebola virus, where their work in the West African nation of has provided funding for the purchase and supply of medical modules, medicines and disposables for 60,000 people in countries most affected by this outbreak.\n\nAccording to this report, the Defense Ministry’s Microbiology Research Institute in Sergiyev Posad and at the Vektor Center for Virology and Biotechnologies in Novosibirsk (both of whom are working on three ebola virus vaccines, one of which is expected to be deployed to West Africa in the next two months) contacted their American counterparts at the US Army Medical Research Institute of Infectious Diseases (USAMRIID) this past week in a bid to gain access to the 2004 test results of a proven ebola virus vaccine.\n\nThe specific ebola vaccine information being requested by these disease experts, this report continues, was developed by the USAMRIID and their private sector partner Crucell, which is the global biopharmaceutical company specializing in vaccines and antibodies and is a subsidiary of Johnson & Johnson headquartered in .\n\nTo how successful the USAMRIID-Crucell ebola vaccine actually is this report documents from Crucell’s reports exactly:\n\n“In 2002, we entered into a Collaborative Research and Development Agreement (CRADA) with the VRC of the NIH to develop jointly, test and manufacture an adenovirus-based Ebola vaccine. Under the terms of the agreement, we have an option for exclusive worldwide commercialization rights to the Ebola vaccine resulting from this collaboration. In August 2002, the CRADA was extended to cover vaccines against Marburg and Lassa infections.\n\nIn experiments conducted in 2004 by the VRC together with the U.S. Army Medical Research Institute of Infectious Diseases (USAMRIID), our vaccine candidate confirmed single-dose protection of monkeys against Ebola. Our results are distinct from the earlier trials in that our vaccine is based on PER.C6® cells, making it suitable for large-scale manufacturing.\n\nIn 2005, we extended the CRADA with the VRC of the NIH to develop and produce vaccines against Ebola, Marburg and Lassa infections. Crucell was also granted an exclusive license to patents owned by the NIH to develop and commercialize vaccines against Ebola. Furthermore, Crucell signed a contract of up to €21.4 million with the NIH to produce Ebola vaccines.\n\nCrucell’s Ebola vaccine entered Phase I studies in Q3 2006. For this randomized, double-blind, placebo-controlled study, two groups of 16 healthy volunteers were enrolled and vaccinated. The study showed safety and immunogegicity at the doses evaluated.\n\nBased on these results, a second Phase I study is anticipated. This will use alternative multivalent adenovirus vectors that are able to bypass pre-existing immunity against the more commonly used adenovirus serotype 5 (Ad5).”\n\nIn October 2008, Crucell announced that it had secured a NIAID/NIH award to advance the development of Ebola and Marburg vaccines, with the ultimate aim of developing a multivalent filovirus vaccine. The award provides funding of up to $30 million, with additional options worth a further $40 million. Under this award, the use of alternative multivalent adenovirus vectors that are able to bypass pre-existing immunity against Ad5 will be evaluated.\n\nThe Obama regimes response to Russia’s request for data relating to this successful ebola vaccine, this report continues, was to simply state that they were unable to comply due to this vaccine being protected under US patent, national security and privacy laws.\n\nRospotrebnadzor disease experts in this report further describe the Obama regimes refusal to release the information on this ebola vaccine as “shocking” due to the World Health Organization (WHO) now warning that as many as 10,000 new cases a week of Ebola could develop in the three hardest-hit West African countries by early December.\n\nEven worse, this report says, as the Foreign Intelligence Service (SVR) has warned since August of the estimated 3,000 Islamic “Ebola Martyrs” preparing to decimate the United States, and new evidence showing some of them reached South America last month, the Obama regimes refusal to release their data on this proven vaccine is “beyond perplexing”.\n\nJoining their SVR counterparts in warning of these “Ebola Martyrs” ready to strike , this report continues, Professor-Captain Al Shimkus of the US Naval War College and Professor Anthony Glees, director at ’s Center for Security and Intelligence Studies, have likewise warned their governments to prepare for them too.\n\nAll of these warnings, this report states, continue to fall on deaf ears as US Department of Homeland Security Secretary Jeh Johnson stated this week that even though the Islamic State (IS) is seeking to attack the US homeland, there is “no specific credible intelligence” they are planning on using the ebola virus…a statement that stunned Russian intelligence experts, especially when viewed in the light of the news of the IS laptop seized from one of their operatives that was filled with bio-terror weapons plans.\n\nMost chilling about this IS laptop, as reported by the Foreign Policy News Service, were the documents contained on it suggesting that its owner was teaching himself about the use of biological weaponry in preparation for “a potential attack that would shock the world.”\n\nOther US media articles trying to discount the existence of these “Ebola Martyrs”, this report continues, further state that “the Ebola outbreak is in West Africa, far from ISIS territory”, a statement which stands in sharp contrast to the fact that the West African terror group Boko Haram has now joined forces with the Islamic State (ISIS/IS) to form what they call a “Super Caliphate”.\n\nAnd most perplexing of all, this report concludes, is why the Obama regime, in having a proven ebola vaccine since 2008, has not yet allowed its citizens to know this fact, let alone use it to protect them…or at the very least its healthcare workers who are beginning to die.\n\nOctober 15, 2014 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked back to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Ed. Note: Western governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagrees with in believing that it is every human beings right to know the truth. Due to our missions conflicts with that of those governments, the responses of their ‘agents’ against us has been a longstanding misinformation/misdirection campaign designed to discredit and which is addressed in the report “Who Is Sorcha Faal?”.]\n\nWorld In Shock After America Lies Its Way Into War Again\n\nThey Are Going To Come For You…Why Are You Helping Them?", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.whatdoesitmean.com/", "http://www.whatdoesitmean.com/index7131.htm", "http://www.whatdoesitmean.com/partisanshandbook.html", "http://www.whatdoesitmean.com/index1725.htm", "http://www.rospotrebnadzor.ru/en/", "http://allafrica.com/stories/201410101225.html", "http://en.itar-tass.com/russia/754070", "http://english.cntv.cn/2014/10/12/VIDE1413114722849589.shtml", "https://rt.com/news/195536-ebola-russia-vaccine-send/", "http://www.usamriid.army.mil/", "http://www.crucell.com/ABOUT_US.HTM", "http://www.crucell.com/R_AND_D_CLINICAL_DEVELOPMENT_EB.HTM", "http://www.crucell.com/R_AND_D_CLINICAL_DEVELOPMENT_EB.HTM", "http://www.crucell.com/R_AND_D_CLINICAL_DEVELOPMENT_EB.HTM", "http://www.crucell.com/R_AND_D_CLINICAL_DEVELOPMENT_EB.HTM", "http://www.crucell.com/R_AND_D_CLINICAL_DEVELOPMENT_EB.HTM", "http://www.crucell.com/R_AND_D_CLINICAL_DEVELOPMENT_EB.HTM", "http://www.who.int/en/", "http://www.voanews.com/content/who-new-ebola-cases-could-hit-10000-a-week/2484205.html", "http://svr.gov.ru/", "http://www.whatdoesitmean.com/index1795.htm", "http://www.whatdoesitmean.com/index1806.htm", "http://english.alarabiya.net/en/News/world/2014/10/10/Experts-warn-of-Ebola-suicide-bombers-.html", "http://news.antiwar.com/2014/10/14/dhs-no-credible-evidence-isis-is-planning-ebola-attack/", "http://www.foreignpolicy.com/articles/2014/08/28/found_the_islamic_state_terror_laptop_of_doom_bubonic_plague_weapons_of_mass_destruction_exclusive", "http://www.foreignpolicy.com/articles/2014/08/28/found_the_islamic_state_terror_laptop_of_doom_bubonic_plague_weapons_of_mass_destruction_exclusive", "http://news.antiwar.com/2014/10/14/dhs-no-credible-evidence-isis-is-planning-ebola-attack/", "http://www.motherjones.com/politics/2014/08/boko-haram-teaming-isis-super-caliphate", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "http://www.whatdoesitmean.com/index7381.htm", "http://www.whatdoesitmean.com/index7381.htm", "http://www.whatdoesitmean.com/index1807.htm", "http://www.whatdoesitmean.com/index1609.htm", "http://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}