{"result_id": "341030", "URL": "http://www.whatdoesitmean.com/index2216.htm", "timestamp": "2023-04-25 18:12:29 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "http://www.whatdoesitmean.com/index2216.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "President Trump Orders FBI To Conduct Massive Raid On CDC Headquarters", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive, and Destroy Reputations\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA stunning Foreign Intelligence Service (SVR) report circulating in the Kremlin today states that just hours after President Donald Trump and Federal Bureau of Investigation (FBI) Director James Comey “warmly embraced” in the White House yesterday, FBI agents conducted a massive early morning raid on the headquarters of the Centers for Disease Control and Prevention (CDC) based in Atlanta, Georgia, accompanied by Doctor-Scientist William Thompson—who is one of the most feared government whistleblowers in the United States for his exposing the vaccine-to-autism link cover-up. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nAccording to this report (and as we’ve previously reported on), almost a fortnight ago, President Trump appointed anti-vaccine activist Robert F. Kennedy Jr. to become the Chairman of the Golden Vaccine Safety Task Force, and whose scathing manifesto titled MERCURY & VACCINES shocked the liberal elites in America who have for decades deliberately poisoned millions of children, while at the same time, in 1986, President Clinton [24-1-2017 correction: President Reagan] signed a law called the National Childhood Vaccine Injury Act of 1986 that eliminated any liability to pharmaceutical manufacturers for their complicity in this crime against humanity.\n\nNearly immediately after President Trump appointed Robert F. Kennedy Jr. to head this vaccine-autism task force, this report continues, he then requested that Sally Yates become the Acting Attorney General of the Department of Justice (DOJ) on 20 January when he took power—which she accepted, and then nearly immediately afterwards returned to her home city of Atlanta where she empanelled a secret Grand Jury.\n\nTo Acting Attorney General Yates connection to President Trump, this report details, is through her “association/employment” with the international legal giant King & Spalding, who in turn created a partnership called Health Care and Life Sciences, in June,2014,with Trump’s mammoth, and feared, global private law firm Jones Day—and coming just 3 months after Trump Tweeted a series of cryptic warnings about vaccines that said:\n\n“If I were President I would push for proper vaccinations but not allow one time massive shots that a child cannot take-AUTISM.”\n\n“Healthy young child goes to doctor, gets pumped with massive shot of many vaccines, doesn't feel good and changes - AUTISM. Many such cases!”\n\nAnd three months after the King & Spalding-Jones Day Health Care and Life Sciences partnership was created, this report notes, Trump further Tweeted:\n\n“I am being proven right about massive vaccinations-the doctors lied. Save our children & their future.”\n\nAs to Trump proclaiming that he was “proven right” about vaccines being linked to autism in September, 2014, this report explains, was due to the King & Spalding-Jones Day Health Care and Life Sciences partnership uncovering and protecting the CDC whistleblower Dr. William Thompson the month prior.\n\nWith Dr. Thompson admitting to Trump’s lawyers that he worked on “fudged numbers” to lower the number of black children who were adversely affected by a certain type of vaccine, his telling how the CDC had committed research fraud with regard to manipulating the pivotal study that showed a correlation between the measles, mumps and rubella (MMR) vaccine and the onset of autism, and his revealing with secret documents smuggled out of the CDC how they were destroying all evidence proving the vaccine-autism link, this report continues, it was reported in early 2015 that the Obama regime had granted him protection, but that was never proven.\n\nRaising the suspicions that Dr. Thompson was not being protected by the Obama regime, this report explains, was that right before the 2016 US presidential election that brought President Trump to power, CDC Director Dr. Tom Frieden blocked Dr. Thompson from testifying on scientific fraud and destruction of evidence by senior CDC officials in critical vaccine safety studies regarding the causative relationship between childhood vaccines and autism.\n\nImmediately upon taking power on 20 January, however, this report notes, President Trump fired Dr. Tom Frieden and installed Rear Admiral Dr. Anne Schuchat as the acting head of the CDC—who along with Dr. Thompson were the only two witnesses presented on Saturday (21 January) before the secret Grand Jury called into session by Acting Attorney General Yates.\n\nWith the massive raid conducted by the FBI on the CDC headquarters just hours ago (3:00 am US East Coast time), this report continues, it is apparent that from her secret Grand Jury proceedings, Acting Attorney General Yates was able to secure a warrant for this to happen—though this SVR reports section on this subject is more highly classified than this general report allows mentioning.\n\nThis report concludes by including information from the Ministry of Healthcare (MoH) about this matter that we had previously summarized by stating:\n\nPresident-elect Trump’s views on the linkage of childhood vaccines to autism have long been known, such as when he stated to CNN during a May, 2016 interview:\n\n“Autism has become an epidemic… Because you take a baby in, and I’ve seen it, and I’ve seen it, and I had my children taken care of, over a long period of time, over a two or three year period of time, same exact amount, but you take this little beautiful baby, and you pump – I mean, it looks just like it’s meant for a horse, not for a child, and we’ve had so many instances, people that work for me, just the other day, two-years-old, two-and-a-half-years-old, a child, a beautiful child went to have the vaccine, and came back, and a week later got a tremendous fever, got very, very sick, now is autistic. …I’m in favor of vaccines [but] do them over a longer period of time, same amount, but just in little sections. I think you’re going to have – I think you’re going to see a big impact on autism.”\n\nAnd the many (and growing) rumors that President-elect Trump made his decision to run for president due to his youngest child, Barron, having been diagnosed with autism immediately after receiving a childhood vaccine shot in late 2013, and that his wife, Melania, has vowed to file lawsuits against anyone making such a claim—but who, nevertheless, will not be moving to the White House in order to keep her child out of the “media bubble” that surrounds all US presidents and their families.\n\nOther reports in this series include:\n\nPope Francis Compares Trump To Hitler As FBI Arrest Of Freemason Spy Shakes Italy To Its Core\n\nPope Francis Orders All Freemasons Expelled After Knights Of Malta Surround President Trump\n\nAmerica On The Brink As President Trump Prepares To Issue CIA Ultimatum\n\nObama Bans Russian News After Putin Warns: “Either Trump Or Bush Will Have To Die”\n\nCIA-Linked Reporter Summoned To Meet Trump Assassinated, And His Top Aide Poisoned Too\n\nTrump Sends Emergency Message To Putin: “I May Not Live Through The Week”\n\nObama Issues Ominous Warning To Trump: “We Are Not Going Gently Into The Night”\n\n6 Children Dead After Trump Sends Brutal Message To CIA: “Your Families Are Next!”\n\nPutin Orders Combat Alert After SVR Warns Of CIA Plot To Assassinate President-elect Trump\n\nHeads Of US Media “Explode” After Trump Targets Vaccines He Believes Causes Autism\n\nTrump Explodes In “Cold Anger” After CIA-NSA Gun Battle In Lower Manhattan\n\nJanuary 23, 2017 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked back to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human beings right to know the truth. Due to our missions conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nAmerica Goes Insane As It Rushes Towards Civil War\n\nThey Are Going To Come For You…Why Are You Helping Them?", "opengraph": {}, "tags": ["Doctor-Scientist William Thompson"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" align=\"center\" src=\"https://www.youtube.com/embed/sGOtDVilkUc\" frameborder=\"0\" allowfullscreen=\"\">&#13;</iframe>&#13;&#13;", "src": "https://www.youtube.com/embed/sGOtDVilkUc"}], "links": ["http://www.whatdoesitmean.com/", "http://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://svr.gov.ru/", "https://www.fbi.gov/", "https://twitter.com/ABC/status/823276961044852736/video/1", "https://www.cdc.gov/", "http://truthinmedia.com/tag/william-thompson/", "https://vaccineimpact.com/2016/another-cdc-whistleblower-adds-fuel-to-vaxxed-films-fight-against-censorship/", "http://www.whatdoesitmean.com/index2204.htm", "http://robertfkennedyjr.com/", "https://www.washingtonpost.com/politics/trump-to-meet-with-proponent-of-debunked-tie-between-vaccines-and-autism/2017/01/10/4a5d03c0-d752-11e6-9f9f-5cdb4b7f8dd7_story.html?utm_term=.7a729bdd3f91", "http://robertfkennedyjr.com/mercury-vaccines/", "https://vears.wordpress.com/vicp/the-fraud-of-national-vaccine-injury-compensation-program/", "https://en.wikipedia.org/wiki/Sally_Yates", "https://www.justice.gov/", "http://www.kslaw.com/", "http://www.jonesday.com/jones-day-adds-six-partners-to-health-care-and-life-sciences-practices-in-washington-and-columbus-06-04-2014/", "http://abovethelaw.com/2016/03/jones-day-helping-donald-trump-to-make-america-great-again/", "http://truthinmedia.com/protesters-rally-vaccines-cdc/", "http://truthinmedia.com/protesters-rally-vaccines-cdc/", "https://vaccineimpact.com/2016/another-cdc-whistleblower-adds-fuel-to-vaxxed-films-fight-against-censorship/", "http://vaxxedthemovie.com/download-the-cdc-autism-mmr-files-released-by-dr-william-thompson/", "http://dailycaller.com/2015/02/03/obama-admin-grants-immunity-to-cdc-scientist-that-fudged-vaccine-report-whistleblower-plans-to-testify-before-congress/", "https://en.wikipedia.org/wiki/Tom_Frieden", "http://www.ecowatch.com/cdc-vaccines-autism-2051536402.html", "https://en.wikipedia.org/wiki/Anne_Schuchat", "http://government.ru/en/department/23/events/", "http://www.whatdoesitmean.com/index2204.htm", "http://www.vaccines.news/2016-05-25-cnn-tried-to-destroy-donald-trump-with-vaccine-autism-question-but-he-gave-this-amazing-response-2.html", "http://www.usmagazine.com/celebrity-news/news/melania-trump-threatens-lawsuit-over-barron-autism-video-w452617", "http://www.cnn.com/2016/11/20/politics/melania-trump-barron-white-house/", "http://www.whatdoesitmean.com/index2215.htm", "http://www.whatdoesitmean.com/index2214.htm", "http://www.whatdoesitmean.com/index2213.htm", "http://www.whatdoesitmean.com/index2212.htm", "http://www.whatdoesitmean.com/index2211.htm", "http://www.whatdoesitmean.com/index2210.htm", "http://www.whatdoesitmean.com/index2209.htm", "http://www.whatdoesitmean.com/index2208.htm", "http://www.whatdoesitmean.com/index2207.htm", "http://www.whatdoesitmean.com/index2205.htm", "http://www.whatdoesitmean.com/index2206.htm", "http://www.whatdoesitmean.com/index2204.htm", "http://www.whatdoesitmean.com/index2203.htm", "http://www.whatdoesitmean.com/index2202.htm", "http://www.whatdoesitmean.com/index2201.htm", "http://www.whatdoesitmean.com/index2199.htm", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "http://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "http://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "http://www.whatdoesitmean.com/index2187.htm", "http://www.whatdoesitmean.com/index1424.htm", "http://www.whatdoesitmean.com/"], "authors": [], "publish_date": null}