{"result_id": "341046", "URL": "https://www.whatdoesitmean.com/index3646.htm", "timestamp": "2023-04-25 18:12:36 CEST+0200", "meta": {"description": "Sorcha Faal, Whatdoesitmean.com", "lang": "en", "keywords": "Sorcha Faal, Whatdoesitmean.com", "favicon": "", "canonical": "https://www.whatdoesitmean.com/index3646.htm", "encoding": "windows-1252"}, "image": null, "domain": "www.whatdoesitmean.com", "title": "Next Covid Variant To Be Named “Communism” In Honor Of Sex Fiend American Leaders", "cleaned_text": "\"The News You Need Today…For The World You’ll Live In Tomorrow.\"\n\nWhat You Aren’t Being Told About The World You Live In\n\nHow The “Conspiracy Theory” Label Was Conceived To Derail The Truth Movement\n\nHow Covert American Agents Infiltrate the Internet to Manipulate, Deceive and Destroy Reputations\n\nNext Covid Variant To Be Named “Communism” In Honor Of Sex Fiend American Leaders\n\nBy: Sorcha Faal, and as reported to her Western Subscribers\n\nA thoughtful new Security Council (SC) report circulating in the Kremlin today first nothing that Russia was not only the first country to register a coronavirus vaccine, but was also the first to declare its willingness to supply it on a transparent and non-discriminatory basis, says Foreign Minister Sergey Lavrov has just reaffirmed this commitment, with his stating this morning: “Domestic vaccines and medicines are the result of our scientists’ tireless efforts…Research infrastructure, approaches to epidemiology and healthcare organization have been created in our country for decades…We owe the end results to the work of many generations, and now our willingness to share these achievements is Russia’s contribution to ensuring the health and well-being of the whole of mankind...In view of that, I would like to note that we have agreed on localizing the production of Sputnik V abroad, including in Belarus, Brazil, India, Kazakhstan, China and South Korea”.\n\nMost unfortunately, however, this report next notes that Foreign Minister Lavrov was forced to slam the West’s unfounded attacks against Russian vaccines by further stating: “We have noted unfounded attacks by a number of Western countries against Russian vaccines…At the same time, I would like to emphasize that the Russian Direct Investment Fund and experts of the Gamaleya National Research Center for Epidemiology and Microbiology promptly provide detailed answers to all specific questions”.\n\nSecurity Council Members in this transcript note that Russia’s first in the world Sputnik V vaccine for Covid-19 is a “viral-vectored vaccine” that take a harmless cold virus and alters it so that it so can infect one cell, but can’t reproduce and go on to infect other cells—and is exactly like the Johnson & Johnson vaccine for Covid-19 that “uses a weakened common cold virus” as a vehicle to deliver a single coronavirus gene into human cells, and it cannot give one a cold or COVID-19.\n\nUnlike the Sputnik V and Johnson & Johnson vaccines for Covid-19, this report continues, the experimental mRNA vaccines being forced on Westerners by their socialist governments use a synthesizer machine to add each nucleic acid onto the next in the right sequence so that you end up with the full-length RNA sequence that encodes the spike protein of Covid-19—are Covid-19 spike proteins these experimental mRNA vaccines flood into the human body—but whose worrying concerns about were first voiced last year when Covid-19 spike proteins were discovered in the brains of mice—and are concerns raised to the level of alarm after Japanese scientific researchers issued a grave warning about Covid-19 spike proteins in mRNA vaccines stating: “The Covid-19 vaccine, an mRNA vaccine, is based on a technology never before used on a human population…The mRNA carries the manufacturing instructions for the spike protein; once inside the cell, the spike protein is manufactured by the cell’s ribosomes…The spike protein contains a syncytin-homologous protein which is similar to the synctyin-1 in women, which is needed to form the placenta and in men, in order to create the embryo”.\n\nThis transcript sees Security Council Members being alarmed over this shocking new Japanese study, specifically because this alarming information comes two days after they examined the assertions made by American national security investigative journalist Brandon Smith in his troubling article “Why Are Globalists And Governments So Desperate For 100% Vaccination Rates?”, wherein he states: “The stage is being set for a mass infertility event, and covid will be blamed in place of the experimental vaccines...This is why the establishment needs a 100% vaccination rate; unvaccinated people would stand as evidence of their crime”.\n\nAs to the type of demonic sadistic monsters that would even dare perpetrate such a vile crime against humanity, this transcript sees Security Council Members agreeing it fits the psychopathic profile of the deviant sex fiends ruling over America—deviant sex fiends like Supreme Socialist Leader Joe Biden, who yesterday tried to grope a 7-year-old boy child and whom the leftist media desperately protects by refusing to show how truly demented he is—deviant sex fiends like Socialist First Lady Jill Biden, who could soon be forced to testify in the murder trial of sexual deviant serial killer Robert Durst, and whose ex-husband admits to having an affair with Durst’s murdered wife before she vanished—deviant sex fiends like socialist Democrat Party leader Hillary Clinton, who aside from being married to serial rapist former President Bill Clinton, last week saw one of her biggest donors Ed Buck convicted for sex murder crimes against young black men he shot up with drugs before sexually abusing—sex fiends like socialist-globalist multi-billionaire George Soros, whose right-hand man Howard Rubin was accused this week of commiting bondage-sadistic crimes in his secret sex dungeon—sex fiends like rabid anti-Trump hater Judge Andrew Napolitano, whom Fox News fired this week after they discovered he was sexually abusing young men—sex fiends like the entire leftist Disney Company, several of whose employees where arrested this week in an undercover child sex predator sting—and sex fiends like socialist Democrat Party leader Governor Andrew Cuomo, who yesterday was slammed with a 165-page report released by the Attorney General of New York beyond shockingly documenting his sexual crimes against multiple young women whom he abused and terrified.\n\nWith crowds now gasping in horror all across America as fed up parents read out loud at school board meetings the pornographic books their children are being forced to read by socialist indoctrinated teachers, this report continues, it was no surprise to see articles appearing like “The Left Has A Pedophilia Problem, And It’s Out In The Open”, wherein it reveals: “The left is continuing its tradition of destroying society's sexual morality, now campaigning on multiple fronts for the normalization of pedophilia”—and because of this socialist Democrat Party demonic sex fiend madness sweeping across America, it’s also not surprising to see articles now appearing like “Democrats Panic as Latinos and Asian Voters Leave The Party”, “Biden Tries To Stem The Alarming Flow Of Minority Voters Away From Democrats Ahead Of Midterm Elections” and “3 New Polls Show They're Going To Need To Pump Out Much Bigger Doses Of \"Hopium\"”.\n\nInstead of “pumping out much bigger does of Hopium”, though, this report notes, Biden and his demonic sexually deviant socialist forces have opted for sheer lunacy—best exampled by Biden’s top health director Dr. Francis Collins insanely declaring yesterday that parents must start wearing masks at home around their children, which quickly prompted sane Americans to write such things like “These are the ravings of a mad man…A study from July obtained by the Wall Street Journal suggested that a child’s odds of surviving a COVID-19 infection is about 99.995%”—then saw leftist tech giant Twitter announcing yesterday that socialist news outlets AP and Reuters will be “helping us decide what’s true”—but for anyone wanting real truth, all they have to do is look at Germany’s largest newspaper Bild, whose editor-in-chief Julian Reichelt yesterday apologized for fear-driven Covid coverage, and stated:\n\nTo the millions of children in this country for whom our society is responsible, I want to express here what neither our government nor our Chancellor dares to tell you.\n\nWe ask you to forgive us.\n\nWe persuaded our children that they were going to murder their grandma if they dared to be what they are, children. Or if they met their friends.\n\nNone of this has been scientifically proven\n\nWhen a state steals the rights of a child, it must prove that by doing so it protects him against concrete and imminent danger.\n\nThis proof has never been provided.\n\nIt has been replaced by propaganda presenting the child as a vector of the pandemic.\n\nThis report concludes with this transcript showing Security Council Members expressing disgust that the “Citizen Cattle” these Americans have been turned into by their sex fiend socialist leaders are now beyond shockingly signing petitions advocating for their jailing of anyone not submitting to experimental Covid-19 vaccines—are “Citizen Cattle” who’ve failed to listen to what may very well be the socialist Democrat Party’s funeral oration just delivered by leftist HBO host Bill Maher—today does sees these “Citizen Cattle” having a new communist theme song to inspire them as they send their fellow citizens into the gulag—and when noticing that the leftist Washington Post is today scaremongering about a new “Delta-Plus” variant of Covid-19, it caused Chairwoman Matviyenko Valentina to openly wonder in this transcript how soon Biden and his sexually deviant socialist forces will give Covid-19 its truest name, the “Communist Variant”. [Note: Some words and/or phrases appearing in quotes in this report are English language approximations of Russian words/phrases having no exact counterpart.]\n\nAugust 4, 2021 © EU and US all rights reserved. Permission to use this report in its entirety is granted under the condition it is linked to its original source at WhatDoesItMean.Com. Freebase content licensed under CC-BY and GFDL.\n\n[Note: Many governments and their intelligence services actively campaign against the information found in these reports so as not to alarm their citizens about the many catastrophic Earth changes and events to come, a stance that the Sisters of Sorcha Faal strongly disagree with in believing that it is every human being’s right to know the truth. Due to our mission’s conflicts with that of those governments, the responses of their ‘agents’ has been a longstanding misinformation/misdirection campaign designed to discredit us, and others like us, that is exampled in numerous places, including HERE.]\n\n[Note: The WhatDoesItMean.com website was created for and donated to the Sisters of Sorcha Faal in 2003 by a small group of American computer experts led by the late global technology guru Wayne Green (1922-2013) to counter the propaganda being used by the West to promote their illegal 2003 invasion of Iraq.]\n\n[Note: The word Kremlin (fortress inside a city) as used in this report refers to Russian citadels, including in , having cathedrals wherein female Schema monks (Orthodox nuns) reside, many of whom are devoted to the mission of the Sisters of Sorcha Faal.]\n\nNext Chapter Of American Civil War—United States Of Yugoslavia?\n\nThose Who Created Covid WILL Hang—China Says It Won't Be Them", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.whatdoesitmean.com/", "https://stateofthenation2012.com/?p=14945", "https://firstlook.org/theintercept/2014/02/24/jtrig-manipulation/", "http://en.kremlin.ru/structure/security-council", "https://tass.com/world/1322571", "https://tass.com/politics/1322533", "https://theconversation.com/how-are-covid-19-vaccines-made-an-expert-explains-155430", "https://thewell.unc.edu/2021/03/25/6-things-to-know-about-the-johnson-johnson-covid-19-vaccine/", "https://theconversation.com/how-are-covid-19-vaccines-made-an-expert-explains-155430", "https://www.genengnews.com/news/sars-cov-2s-spike-protein-can-enter-the-brain-in-mice/", "https://hardball.parkoffletter.org/recently-revealed-japanese-study-shows-covid-vaccines-may-affect-fertility/", "https://www.whatdoesitmean.com/index3644.htm", "https://brandonsmith.com/about/", "https://alt-market.us/why-are-globalists-and-governments-so-desperate-for-100-vaccination-rates/", "https://alt-market.us/why-are-globalists-and-governments-so-desperate-for-100-vaccination-rates/", "https://www.thegatewaypundit.com/2021/08/creeper-joe-biden-zeroes-little-boy-slyly-reaches-hold-hand-speaking-mother-hands-dirty-mask-video/", "https://newsbusters.org/blogs/nb/bill-dagostino/2021/08/03/video-tv-media-desperately-conceal-bidens-gaffes-viewers", "https://www.gossipcop.com/jill-biden-could-testify-in-robert-durst-murder-trial/2566229/", "https://en.wikipedia.org/wiki/Robert_Durst", "https://nypost.com/2021/07/09/jill-bidens-ex-husband-says-he-had-affair-with-robert-dursts-wife/", "https://www.thecut.com/2019/11/ronan-farrow-bill-clinton-rape-allegation-juanita-broaddrick.html", "https://www.washingtonpost.com/nation/2021/07/27/ed-buck-convicted/", "https://nypost.com/2021/07/31/how-george-soros-money-manager-was-accused-of-bdsm-assaults/", "https://www.thegatewaypundit.com/2021/08/fox-news-fires-judge-napolitano-news-harassing-male-employees-emerges-morning/", "https://www.rumormillnews.com/cgi-bin/forum.cgi?read=178655", "https://www.nbcnewyork.com/news/read-the-cuomo-report-from-the-ny-attorney-generals-office/3196417/", "https://www.westernjournal.com/graphic-content-warning-crowd-gasps-fed-parents-read-schools-pornographic-books-loud-board-meeting/", "https://thefederalist.com/2021/07/30/the-left-has-a-pedophilia-problem-and-its-out-in-the-open/", "https://thefederalist.com/2021/07/30/the-left-has-a-pedophilia-problem-and-its-out-in-the-open/", "https://pjmedia.com/uncategorized/matt-margolis/2021/08/03/democrats-panic-as-latinos-and-asian-voters-leave-the-party-n1466731", "https://www.washingtonexaminer.com/politics/biden-minorities-infrastructure", "https://www.zerohedge.com/personal-finance/3-new-polls-show-theyre-going-need-pump-out-much-bigger-doses-hopium", "https://www.zerohedge.com/covid-19/i-know-it-seems-weird-nih-director-suggests-parents-wear-masks-home-around-children", "https://www.zerohedge.com/covid-19/i-know-it-seems-weird-nih-director-suggests-parents-wear-masks-home-around-children", "https://dailycaller.com/2021/08/02/associated-press-reuters-deal-twitter/", "https://www.zerohedge.com/covid-19/editor-chief-germanys-top-newspaper-apologizes-fear-driven-covid-coverage", "https://grrrgraphics.com/citizen-cattle-2021/", "https://www.brighteon.com/a7d2e9f4-7399-49a9-98a4-58c7e2ad20f2", "https://www.rt.com/op-ed/530938-bill-maher-woke-olympics/", "https://www.brighteon.com/374c26c2-072e-4e76-94c1-69c7e9f7095a", "https://www.washingtonpost.com/health/2021/08/03/delta-plus-coronavirus-variant-explained/", "http://www.en.kremlin.ru/structure/security-council/members", "http://creativecommons.org/licenses/by-sa/2.0/", "https://en.wikipedia.org/wiki/GNU_Free_Documentation_License", "https://www.whatdoesitmean.com/index7381.htm", "https://theintercept.com/2014/02/24/jtrig-manipulation/", "https://www.whatdoesitmean.com/indexsf33778855.htm", "https://en.wikipedia.org/wiki/Wayne_Green", "https://www.whatdoesitmean.com/index3634pl.htm", "https://www.whatdoesitmean.com/index3634.htm", "https://www.whatdoesitmean.com/index.htm"], "authors": [], "publish_date": null}