{"result_id": "342004", "URL": "https://whitehouse.news/2021-07-15-nolte-most-voters-reject-bidens-vaccination-push.html", "timestamp": "2023-04-25 18:12:40 CEST+0200", "meta": {"description": "His Fraudulency Joe Biden’s scheme to have a government emissary knock on the doors of the unvaccinated faces rejection from 53 percent of voters, according to Rasmussen Reports, one of the few pollsters to exit the 2016 and 2020 elections with its credibility in good standing. (Article by John Nolte republished from Breitbart.com) In 2020, Biden apparently won […]", "lang": "en", "keywords": "badmedicine,covid-19,COVID-19 vaccine,government,health freedom,Joe Biden,medical fascism,Medical Tyranny,pandemic,propaganda,vaccine,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://whitehouse.news/2021-07-15-nolte-most-voters-reject-bidens-vaccination-push.html", "encoding": "UTF-8"}, "image": null, "domain": "whitehouse.news", "title": "Nolte: Most voters reject Biden’s door-to-door vaccination push", "cleaned_text": "His Fraudulency Joe Biden’s scheme to have a government emissary knock on the doors of the unvaccinated faces rejection from 53 percent of voters, according to Rasmussen Reports, one of the few pollsters to exit the 2016 and 2020 elections with its credibility in good standing.\n\nIn 2020, Biden apparently won more than 50 percent of the vote, and only 37 percent approve of his BIG IDEA to boost vaccination rates? That’s some serious rejection right there.\n\nEver since it introduced this door-to-door idea, the White House has been on defense trying to justify and sell it. But their only defense has been, We’re not sending federal agents to your doors, Trumptards. Instead, these will be local leaders from your own communities.\n\nWell, I have two questions…\n• How will locals in rural communities handle this kind of work without access to a copy machine to duplicate the forms and stuff?\n• Why the fuck is the federal government revealing my vaccination status to my neighbors?\n\nThe survey of 1,000 likely voters was conducted between July 11-12, and the results are well outside the three-point margin of error.\n\nBy party, only 57 percent of Biden’s own Democrats approve of his door-to-door plan, while 31 percent disapprove. Non-affiliated voters disapprove by a 56 to 33 percent margin, and to the surprise of no one, Republicans disapprove by a 74 to 20 percent margin.\n\nBiden is trying to make his idea sound benign. It’s just neighbor helping neighbor! Knock-knock. Hey, maybe you don’t know how easy it is to get vaccinated and that it’s free!? Yeah, right. Who doesn’t know that by now? Somewhere on a forgotten Pacific island sits a 102-year-old Japanese soldier who doesn’t know the war’s over but knows he can drop in at his local CVS for a free shot.\n\nThis is not only naked intimidation on Biden’s part, and an invasion of privacy, it is also a sure-fire way to alert everyone watching to who the evil and selfish unvaccinated families are in the neighborhood, who the ignorant Trumptards are, who deserves to be given the side-eye, and who to exclude and disdain.\n\nDoes anyone doubt these lists of the unvaccinated will leak to a media that is already encouraging and endorsing violence against Trump supporters?\n\nHow long before Antifa takes a road trip to your front door?\n\nHow long before your kids are beaten up at school, and your whole family is herded into a solar-powered cattle car headed for Wokeschwitz?\n\nThe most maddening thing about this is how unnecessary it is. Who cares if people choose not to get vaccinated? They’re no serious threat to those of us who are vaccinated, and with survival rates (per the CDC) at 99.5 percent and up for those under 70, they’re no real threat to themselves.\n\nThis is only about one thing: a fascist government and fascist media that cannot stomach defiance. It’s not a 100 percent vaccination rate they seek. It’s not herd immunity they seek. No, what they seek is fealty and compliance. Well, fuck them.\n\nRead more at: Breitbart.com and JoeBiden.news.", "opengraph": {"title": "Nolte: Most voters reject Biden’s door-to-door vaccination push", "type": "article", "url": "2021-07-15-nolte-most-voters-reject-bidens-vaccination-push.html", "site_name": "White House News", "description": "His Fraudulency Joe Biden’s scheme to have a government emissary knock on the doors of the unvaccinated faces rejection from 53 percent of voters, according to Rasmussen Reports, one of the few pollsters to exit the 2016 and 2020 elections with its credibility in good standing.", "image": "wp-content/uploads/sites/80/2021/07/Joe-Biden-01.jpg", "locale": "en_US", "updated_time": "2021-07-15T23:31:18+00:00", "image:width": "1000", "image:height": "563", "image:type": "image/jpeg", "article:published_time": "2021-07-15T20:28:48+00:00", "article:modified_time": "2021-07-15T23:31:18+00:00", "article:author": "author/newseditors", "article:publisher": "/", "article:section": "Vaccines", "article:tag": "white house"}, "tags": ["pandemic", "Joe Biden", "government", "covid-19", "medical fascism", "White House", "COVID-19 vaccine", "vaccine", "Medical Tyranny", "health freedom", "propaganda"], "tweets": [], "movies": [], "links": ["https://www.rasmussenreports.com/public_content/politics/general_politics/july_2021/most_voters_reject_biden_s_door_to_door_covid_19_vaccine_push", "https://www.breitbart.com/politics/2021/07/14/nolte-most-voters-reject-bidens-door-to-door-vaccination-push/", "https://www.verywellhealth.com/covid-19-transmission-vaccination-5115630", "https://www.nbc26.com/news/coronavirus/cdc-estimates-covid-19-fatality-rate-including-asymptomatic-cases", "https://www.breitbart.com/politics/2021/07/14/nolte-most-voters-reject-bidens-door-to-door-vaccination-push/", "http://joebiden.news"], "authors": [], "publish_date": "2021-07-15T20:28:48+00:00"}