{"result_id": "342025", "URL": "https://www.whitehouse.news/2022-03-28-white-house-seeks-booster-funding-republicans-decline.html", "timestamp": "2023-04-25 18:12:54 CEST+0200", "meta": {"description": "The White House has requested for more funding to purchase Wuhan coronavirus (COVID-19) vaccine booster doses, but Republican lawmakers have blocked the proposal and instead demanded an accounting of previously released funds. White House officials emphasized the need for new funding – including $22.5 billion in emergency funding – in a March 15 statement. “The federal government […]", "lang": "en", "keywords": "accounting,badhealth,badmedicine,big government,boosters,COVID funds,covid-19,Federal Budget,funding,pandemic,Republicans,repurposing,vaccine,White House,Wuhan coronavirus", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2022-03-28-white-house-seeks-booster-funding-republicans-decline.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "White House seeks more funding for COVID vaccine boosters – but Republicans say NO", "cleaned_text": "White House seeks more funding for COVID vaccine boosters – but Republicans say NO\n\nThe White House has requested for more funding to purchase Wuhan coronavirus (COVID-19) vaccine booster doses, but Republican lawmakers have blocked the proposal and instead demanded an accounting of previously released funds.\n\nWhite House officials emphasized the need for new funding – including $22.5 billion in emergency funding – in a March 15 statement. “The federal government does not have adequate resources to purchase enough booster vaccine doses for all Americans, if additional doses are needed. The shortages will be even more acute if we need a variant-specific booster vaccine, since we will not have any existing supply,” they warned.\n\nThey also mentioned that insufficient funding can throw a wrench into research efforts for new COVID-19 vaccines. “The [Biden] administration does not have the funding for necessary investments in research and to support development of promising new vaccine candidates. The federal government must invest in next-generation vaccines … in order to fight COVID-19 in the future.”\n\nWhite House COVID-19 Response Coordinator Jeff Zients confirmed the lack of funds to Andy Slavitt, his former senior advisor. “Right now, we don’t have enough money for fourth [COVID-19] vaccine doses, if they’re called for. We don’t have the funding if we were to need a variant-specific vaccine in the future,” Zients admitted during an episode of Slavitt’s “In The Bubble” podcast.\n\nAccording to the coordinator, 93 percent of earlier COVID-19 funding approved by Congress had already been spent.\n\n“There’s very little [funds] left. The remaining funds are for areas like medical care for veterans or [Federal Emergency Management Agency] disaster relief. So we don’t have good resources to draw on from the prior allocated funds, and we need to make sure that this gets funded. So it’s up to Congress to either pass it on an emergency basis without offsets, or find viable offsets.”\n\nHowever, the Biden administration’s plea for extra funding appears to be a Herculean task as Congress has resisted it as of writing. Lawmakers are still debating how much should be allocated for new COVID-19 funding and how to pay for it. Some GOP lawmakers are asking for a better accounting of earlier funds allocated to the executive branch. (Related: Moderate Democrat Joe Manchin says he will join Republicans to kill funding for Joe Biden’s vaccine mandate.)\n\nAt least four GOP senators vocally expressed opposition to the calls for new funding.\n\nAlabama Sen. Richard Shelby said: “The basic thing we ought to figure out is: Is there a need? Secondly, if there’s a need, where’s all the money we appropriated?” The senior senator for the Yellowhammer State also serves as the top GOP lawmaker on the upper chamber’s appropriations committee.\n\nUtah Sen. Mitt Romney, a critic of additional COVID-19 funding, proposed that unspent money from earlier COVID-19 packages be redirected for this purpose. “The [Biden] administration needs to take the money that’s been appropriated and use that to prepare for what might be coming down the road, if there are new [SARS-CoV-2] variants that affect a lot of Americans,” Romney said.\n\nWyoming Sen. John Barrasso agreed with Romney on repurposing unspent funds. “We were very clear you need to repurpose money that has not been spent, that is out there, and it seems like the administration is not willing to do that,” said the senior senator for the Equality State.\n\nTexas Sen. Ted Cruz had strong words for the administration, denouncing it for seeking new money amid “the highest inflation rate in 40 years.” He commented: “There are billions and billions of dollars the administration still hasn’t spent from their last boondoggle – and yet they’re asking for more billions and at the same time scratching [its head] in wonderment that inflation is out of control.” Cruz added that repurposing unspent money “could well make sense, but the Democrats don’t want to do that.”\n\nVisit Pandemic.news for more stories like this.\n\nWatch former Kentucky Rep. Ron Paul lauding his GOP colleague, incumbent Kentucky Rep. Thomas Massie, for denouncing the $1 billion budget for vaccine propaganda.\n\nThis video is from the What is happening channel on Brighteon.com.\n\n$1 trillion budget deal confirms America’s horrifying swamptopian future, hopelessly beyond the zenith of reform or reason.\n\nUS government spends extra $3 billion on vaccine hesitancy propaganda ads – as vaccine deaths surpass 5,000.\n\nHouse Republicans calling for ban on using taxpayer funds for implementing military vaccine mandate.\n\nBiden requests $2.6 billion for “gender equality programs” that many fear will fund abortions.", "opengraph": {"title": "White House seeks more funding for COVID vaccine boosters – but Republicans say NO", "type": "article", "url": "https://www.whitehouse.news/2022-03-28-white-house-seeks-booster-funding-republicans-decline.html", "site_name": "White House News", "description": "The White House has requested for more funding to purchase Wuhan coronavirus (COVID-19) vaccine booster doses, but Republican lawmakers have blocked the proposal and instead demanded an accounting of previously released funds. White House officials emphasized the need for new funding – including $22.5 billion in emergency funding – in a March 15 statement. “The federal government […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2022/05/America-Covid-19-Vaccine-Vial-Syringe.jpg"}, "tags": ["pandemic", "big government", "covid-19", "COVID funds", "White House", "vaccine", "repurposing", "Federal Budget", "Republicans", "funding", "Wuhan coronavirus", "accounting", "boosters"], "tweets": [], "movies": [], "links": ["https://childrenshealthdefense.org/defender/biden-boosters-for-all-lawmakers-push-back/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/15/fact-sheet-consequences-of-lack-of-funding-for-efforts-to-combat-covid-19-if-congress-does-not-act/", "https://naturalnews.com/2021-12-12-moderate-democrat-to-join-republicans-kill-funding-bidens-vaccine-mandate.html", "https://www.msn.com/en-us/news/politics/republicans-reluctant-on-2415-billion-in-virus-aid-as-white-house-warns-about-pandemic-readiness/ar-AAV6jE9", "https://inflation.news", "https://pandemic.news/", "https://www.brighteon.com/b9997348-050f-461e-98e9-e2f44ff88c99", "https://www.brighteon.com/channels/annaka", "https://biggovernment.news/2017-05-02-1-trillion-budget-america-swamptopian-future-beyond-reform-reason.html", "https://propaganda.news/2021-06-14-us-government-spends-on-vaccine-hesitancy-propaganda-ads.html", "https://nationalsecurity.news/2022-02-04-republicans-ban-taxpayer-military-vaccine-mandate.html", "https://abortions.news/2022-03-10-biden-gender-equality-programs-fund-abortions.html", "https://childrenshealthdefense.org/defender/biden-boosters-for-all-lawmakers-push-back/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/15/fact-sheet-consequences-of-lack-of-funding-for-efforts-to-combat-covid-19-if-congress-does-not-act/", "https://www.msn.com/en-us/news/politics/republicans-reluctant-on-2415-billion-in-virus-aid-as-white-house-warns-about-pandemic-readiness/ar-AAV6jE9", "https://www.brighteon.com/b9997348-050f-461e-98e9-e2f44ff88c99", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2022-03-28-white-house-seeks-booster-funding-republicans-decline.html&linkname=White%20House%20seeks%20more%20funding%20for%20COVID%20vaccine%20boosters%20%E2%80%93%20but%20Republicans%20say%20NO", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}