{"result_id": "342010", "URL": "https://whitehouse.news/2023-04-03-russia-arrests-wsj-report-over-espionage-charges.html", "timestamp": "2023-04-25 18:12:44 CEST+0200", "meta": {"description": "Russian authorities arrested a reporter from the Wall Street Journal (WSJ) over charges of alleged espionage. The Russian Federal Security Service (FSB) confirmed the arrest of 31-year-old WSJ reporter Evan Gershkovich, adding that he is detained in the city of Yekaterinburg, 1,035 miles east of Moscow. A court in the Russian capital quickly ruled that […]", "lang": "en", "keywords": "arrest,big government,chaos,conspiracy,deception,espionage,Evan Gershkovich,Federal Security Service,FSB,Journalism,mainstream media,Paul Whelan,politics,Russia,spying,Viktor Bout,Wall Street journal,White House,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://whitehouse.news/2023-04-03-russia-arrests-wsj-report-over-espionage-charges.html", "encoding": "UTF-8"}, "image": null, "domain": "whitehouse.news", "title": "Russia arrests WSJ reporter over alleged espionage charges", "cleaned_text": "Russian authorities arrested a reporter from the Wall Street Journal (WSJ) over charges of alleged espionage.\n\nThe Russian Federal Security Service (FSB) confirmed the arrest of 31-year-old WSJ reporter Evan Gershkovich, adding that he is detained in the city of Yekaterinburg, 1,035 miles east of Moscow. A court in the Russian capital quickly ruled that the reporter should be kept in custody pending investigation. His arrest was the first time since the Cold War that an American journalist had been imprisoned over espionage allegations.\n\nThe FSB accused Gershkovich of attempting to obtain classified information, arguing that he “was acting on instructions from the American side to collect information about the activities of one of the enterprises of the Russian military-industrial complex that constitutes a state secret.” It added that Gershkovich – who had previously worked for Agence France-Presse and the New York Times – had been accredited by the Russian Ministry of Foreign Affairs (MFA) to work as a journalist.\n\nA fluent speaker of Russian, Gershkovich is a correspondent in the WSJ‘s Moscow bureau covering Russia, Ukraine and other countries in the former Soviet Union. If convicted, however, he can face up to 20 years behind bars.\n\nKremlin Press Secretary Dmitry Peskov told reporters about Gershkovich’s arrest: “It is not about a suspicion, it is about the fact that he was caught red-handed.” MFA spokeswoman Maria Zhakarova, meanwhile, accused the WSJ reporter of using his credentials as a cover for “activities that have nothing to do with journalism.”\n\nMeanwhile, the WSJ denied the allegations against its Russia correspondent. “[We seek] the immediate release of our trusted and dedicated reporter,” said the newspaper. “We stand in solidarity with Evan and his family.”\n\nPrior to Gershkovich, U.S. News & World Report correspondent Nicholas Daniloff was arrested by the Committee on State Security (KGB) in 1996 over the same charges. The Soviet-era KGB was the predecessor of the FSB that arrested the WSJ reporter. Daniloff was later released without charge 20 days after his arrest, in exchange for a member of the Soviet Union’s United Nations mission who was arrested by U.S. authorities for espionage.\n\nOver at the White House, the Biden administration said it has spoken with both the WSJ and Gershkovich’s family. However, it clarified that it had no “specific indication” that journalists in Russia were being targeted.\n\nWhite House Press Secretary Karine Jean-Pierre condemned the arrest “in the strongest terms” and urged Americans to heed government warnings against traveling to Russia. She added that the U.S. Department of State was in direct touch with Moscow and seeking access to the jailed reporter.\n\nProminent Russian defense attorney Ivan Pavlov said of the incident: “That unwritten rule not to touch accredited foreign journalists has stopped working.” He also pointed out that the case against Gershkovich was built to give Moscow “trump cards” for a future prisoner exchange. Pavlov ultimately remarked that the case will likely be resolved “not by the means of the law, but by political [and] diplomatic means.”\n\nJeanne Cavelier, head of Eastern Europe and Central Asia desk at press freedom group Reporters Without Borders (RSF), said Gershkovich’s arrest “looks like a retaliation measure of Russia against the United States.” She continued: “We are very alarmed because it is probably a way to intimidate all Western journalists that are trying to investigate aspects of the war on the ground in Russia.”\n\nCorporate security executive and former Marine Paul Whelan has been in a similar predicament since 2018. He was arrested by Russian authorities that year over the same espionage charges, and has been imprisoned since. An opportunity to free him came in December 2021, but the Biden administration chose to exchange arms dealer Viktor Bout for basketball player Brittney Griner – who was arrested for drug possession. (Related: CLAIM: Biden released international arms dealer Viktor Bout to RECRUIT him to offload US weapons for slush fund cash controlled by Dems.)\n\n“Our family is sorry to hear that another American family will have to experience the same trauma that we have had to endure for the past 1,553 days,” David Whelan, Paul’s brother, said in an emailed statement. “It sounds as though the frame-up of Gershkovich was the same as it was in Paul’s case.”\n\nVisit RussiaReport.news for more about Americans being arrested in Russia.\n\nWatch Harrison Smith discuss why arms dealer Viktor Bout was exchanged for Brittney Griner instead of Paul Whelan on “The American Journal.”\n\nThis video is from the InfoWars channel on Brighteon.com.\n\nChinese agents arrested for stalking and attempting to coerce Chinese dissidents into returning to China.\n\nEx-Twitter employee sentenced to 3.5 years in prison for serving as SPY for Saudi Arabia.", "opengraph": {"title": "Russia arrests WSJ reporter over alleged espionage charges", "type": "article", "url": "https://www.whitehouse.news/2023-04-03-russia-arrests-wsj-report-over-espionage-charges.html", "site_name": "White House News", "description": "Russian authorities arrested a reporter from the Wall Street Journal (WSJ) over charges of alleged espionage. The Russian Federal Security Service (FSB) confirmed the arrest of 31-year-old WSJ reporter Evan Gershkovich, adding that he is detained in the city of Yekaterinburg, 1,035 miles east of Moscow. A court in the Russian capital quickly ruled that […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2023/04/Prisoner-Jail-Criminal.jpg"}, "tags": ["conspiracy", "big government", "Journalism", "deception", "Federal Security Service", "Paul Whelan", "chaos", "arrest", "spying", "White House", "FSB", "Wall Street journal", "mainstream media", "Russia", "Evan Gershkovich", "politics", "World War III", "Viktor Bout", "espionage"], "tweets": [], "movies": [], "links": ["https://apnews.com/article/wall-street-journal-reported-russia-arrested-cd511a94a3fe0ce604df6648ef5adec5", "http://spygatenews.com", "http://biggovernment.news", "https://www.naturalnews.com/2022-12-09-biden-viktor-bout-weapons-trafficking-slush-fund-democrats.html", "http://russiareport.news/", "https://www.brighteon.com/47ed0a84-5311-40cb-b4b1-ef9a72f135ff", "https://www.brighteon.com/channels/infowarsnetwork", "https://collapse.news/2022-12-15-viktor-bout-liberalism-transgenderism-civilizational-suicide.html", "https://communistchina.news/2020-11-03-china-agents-arrested-harassing-dissidents.html", "https://treason.news/2022-12-18-ex-twitter-employee-spying-for-saudi-arabia.html", "https://apnews.com/article/wall-street-journal-reported-russia-arrested-cd511a94a3fe0ce604df6648ef5adec5", "https://www.brighteon.com/47ed0a84-5311-40cb-b4b1-ef9a72f135ff", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2023-04-03-russia-arrests-wsj-report-over-espionage-charges.html&linkname=Russia%20arrests%20WSJ%20reporter%20over%20alleged%20espionage%20charges", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}