{"result_id": "342009", "URL": "https://whitehouse.news/2021-12-09-only-37-percent-want-second-biden-term.html", "timestamp": "2023-04-25 18:12:43 CEST+0200", "meta": {"description": "A survey has found that only 37 percent of Democratic-leaning Americans want President Joe Biden to run again in 2024. The poll’s results came amid the former vice president’s dwindling popularity as he nears his first anniversary in office. The poll by news website Issues & Insights (I&I) and Tipp Insights asked respondents who they want […]", "lang": "en", "keywords": "2024 elections,big government,Democratic candidate,Democratic Party,Joe Biden,Kamala Harris,politics,presidential candidate,presidential survey,second term,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://whitehouse.news/2021-12-09-only-37-percent-want-second-biden-term.html", "encoding": "UTF-8"}, "image": null, "domain": "whitehouse.news", "title": "Survey: Only 37% of Democrats want a second Biden term", "cleaned_text": "Survey: Only 37% of Democrats want a second Biden term\n\nA survey has found that only 37 percent of Democratic-leaning Americans want President Joe Biden to run again in 2024. The poll’s results came amid the former vice president’s dwindling popularity as he nears his first anniversary in office.\n\nThe poll by news website Issues & Insights (I&I) and Tipp Insights asked respondents who they want to see as the Democratic presidential candidate for 2024. More than a thousand respondents participated in the survey conducted from Dec. 1 to Dec. 4.\n\nAccording to the survey results, 37 percent of Democratic-leaning respondents wanted Biden to run as the 2024 presidential candidate. Vice President Kamala Harris followed at 16 percent. Overall results reflect badly for Biden, with only 22 percent wanting him to run for a second term.\n\nOther Democratic Party politicians received less than five percent support, the survey revealed. Four percent of respondents wanted New York Rep. Alexandria Ocasio-Cortez and former Georgia gubernatorial candidate Stacey Abrams to run as president.\n\nThree percent of respondents wanted Transportation Secretary Pete Buttigieg, Massachusetts Sen. Elizabeth Warren or New Jersey Sen. Cory Booker on the presidential ticket. Only two percent of participants supported California Gov. Gavin Newsom running on the ticket, while only one percent wanted Michigan Gov. Gretchen Whitmer as a presidential candidate.\n\nI&I editor Terry Jones wrote that “even Democrats [themselves] seem less than enthused about Biden holding the top spot.” He also mentioned that Harris garnering only 16 percent of support was “alarming,” given that she was next in line to the presidency should Biden not complete his first term.\n\n“Only eight percent of independents and other non-major party voters also want Biden back as Democratic standard-bearer, and 10 percent want Harris. For Biden, that suggests near non-existent support among independents – the swing voters who make up a third or more of all those who go to the polls each election,” Jones added. (Related: New moms who picked Biden over Trump are horrified to discover they got exactly what they voted for.)\n\n“With no one else getting even more than low single-digit support, the 2024 presidential election is shaping up to be a wild one for the Democrats.”\n\nDemocrats plagued by infighting despite grip on power\n\nAccording to Jones, Biden’s health issues and declining popularity have led some pundits to speculate that he will not have a second term. Several major issues – the abrupt Afghanistan pullout, supply chain crunches, border policy and the vaccine mandate – contributed to the slide in Biden’s popularity.\n\nIn a Nov. 15, 2021 op-ed, Spectator contributing editor Stephen L. Miller pointed out that Biden’s term in the White House is a “sacrificial presidency” despite those setbacks. “The worst-kept secret in Washington, D.C. is that Joe Biden is a one-term president, whether he knows it or not,” he wrote. (Related: Biden – the Manchurian candidate decline & fall of America.)\n\n“Biden doesn’t acknowledge this. He’s signaled multiple times that he intends to run for a second term in 2024. He has been trying to capture the White House for over 30 years, [and] he’s not just going to give that up willingly – as he managed to go from party punchline to party patriarch in the span of one election.”\n\nJones mentioned that Harris and Buttigieg were already in conflict as to who is next in line after Biden. Miller called it a case of “the kids fighting over grandpa’s inheritance” while still alive.\n\nMiller warned that the uncertainties surrounding Biden’s future only made him more dangerous. “He could inflict real reform – and real harm, the kind of harm we are seeing right now. The infliction of this pain appears to be very intentional,” Miller wrote.\n\nJoeBiden.news has more articles about Biden’s plans for the upcoming 2024 elections.", "opengraph": {"title": "Survey: Only 37% of Democrats want a second Biden term", "type": "article", "url": "2021-12-09-only-37-percent-want-second-biden-term.html", "site_name": "White House News", "description": "A survey has found that only 37 percent of Democratic-leaning Americans want President Joe Biden to run again in 2024. The poll's results came amid the former vice president's dwindling popularity as he nears his first anniversary in office.", "image": "wp-content/uploads/sites/80/2021/12/joe-biden-e1597200437490-696x392-1.jpg", "locale": "en_US", "updated_time": "2021-12-09T11:06:33+00:00", "image:width": "696", "image:height": "392", "image:type": "image/jpeg", "article:published_time": "2021-12-09T07:41:55+00:00", "article:modified_time": "2021-12-09T11:06:33+00:00", "article:author": "author/ramontomeydw", "article:publisher": "/", "article:section": "Politics", "article:tag": "white house"}, "tags": ["second term", "Joe Biden", "big government", "White House", "presidential candidate", "politics", "Democratic candidate", "presidential survey", "2024 elections", "Democratic Party", "Kamala Harris"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/politics/2021/12/07/poll-only-37-of-democrats-want-to-see-biden-on-2024-ticket/", "https://tippinsights.com/i-i-tipp-poll-stunner-just-22-of-americans-want-joe-biden-to-run-for-president-again/", "https://www.naturalnews.com/2021-11-05-moms-who-picked-biden-over-trump-are-horrified.html", "https://spectatorworld.com/topic/joe-biden-bucket-list-presidency-progressive-policies/", "https://www.naturalnews.com/2021-12-06-manchurian-candidate-decline-fall-of-america.html", "https://joebiden.news/", "https://www.breitbart.com/politics/2021/12/07/poll-only-37-of-democrats-want-to-see-biden-on-2024-ticket/", "https://tippinsights.com/i-i-tipp-poll-stunner-just-22-of-americans-want-joe-biden-to-run-for-president-again/", "https://spectatorworld.com/topic/joe-biden-bucket-list-presidency-progressive-policies/"], "authors": [], "publish_date": "2021-12-09T07:41:55+00:00"}