{"result_id": "342027", "URL": "https://www.whitehouse.news/2019-01-20-roger-stone-deep-state-plans-to-remove-potus-trump-vp-pence-to-install-pelosi-and-hillary-in-coup.html", "timestamp": "2023-04-25 18:12:55 CEST+0200", "meta": {"description": "Longtime political strategist Roger Stone believes that elements of the Democrat-aligned Deep State are plotting a coup that will see POTUS Donald Trump and Vice President Mike Pence removed from office, which would then hand the presidency to No. 3 in line — Speaker of the House Nancy Pelosi (D-Calif.). Once Pelosi takes over, she […]", "lang": "en", "keywords": "Attorney General,Collusion,coup,deep state,government,Hillary Clinton,hoax,impeachment,lawless,Nancy Pelosi,political coup,presidency,President Trump,Republicans,Robert Mueller,Roger Stone,Russian collusion,special counsel,treason,Vice President Pence,William Barr", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2019-01-20-roger-stone-deep-state-plans-to-remove-potus-trump-vp-pence-to-install-pelosi-and-hillary-in-coup.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "Roger Stone: Deep State plans to remove POTUS Trump, VP Pence, to install Pelosi and Hillary in COUP", "cleaned_text": "Roger Stone: Deep State plans to remove POTUS Trump, VP Pence, to install Pelosi and Hillary in COUP\n\nLongtime political strategist Roger Stone believes that elements of the Democrat-aligned Deep State are plotting a coup that will see POTUS Donald Trump and Vice President Mike Pence removed from office, which would then hand the presidency to No. 3 in line — Speaker of the House Nancy Pelosi (D-Calif.).\n\nOnce Pelosi takes over, she would then oversee the appointment of twice-failed candidate Hillary Clinton as president, ensuring that she took her ‘rightful place’ as head of the country.\n\n“The Deep State seeks to fabricate some misdeed by the Trump campaign that is sold as Russian collusion,” he said, as reported by Infowars’ editor-at-large Paul Joseph Watson.\n\n“That way they can remove both Donald Trump and Vice President Mike Pence, paving the way for Nancy Pelosi to become president,” he added.\n\nAnd here’s how it will go from there: Pelosi would appoint Hillary to the vice presidency, then step down “as president allowing Hillary to take the White House which alluded her grasp in 2016.”\n\nIf that sounds farfetched, there have been some developments in recent days and weeks that substantiate Stone’s concerns, if not his suspicions. (Related: POTUS Trump: ‘People would revolt’ if Democrats impeach him.)\n\nFirst of all, earlier this month CNN reported that special counsel Robert Mueller received a six-month extension from a federal judge in Washington, D.C., for the grand jury convened on his behalf. The network, which has, of course, been unreliable when it comes to reporting about POTUS Trump in the past, noted that the grand jury’s 18-month term was set to expire.\n\nThe report, which was eventually corroborated by other media, noted further:\n\nThe extension is the surest sign yet that the Russia investigation isn’t finished. It means, broadly, that Mueller may continue pursuing alleged criminal activity related to the Russian government’s interference in the 2016 presidential election, and that more indictments may be coming.\n\nThere is a lot going on to support Roger Stone’s claim\n\nAlso, Democratic senators on the Judiciary Committee who are vetting the president’s attorney general nominee, William Barr, have shown a particular interest in making sure that Mueller’s probe continues — something Barr pledged would happen.\n\n“I believe it is vitally important that the Special Counsel be allowed to complete his investigation,” he said.\n\n“I believe it is in the best interest of everyone – the president, Congress, and, most importantly, the American people – that this matter be resolved by allowing the special counsel to complete his work,” Barr noted further, adding that he believes Mueller “is well along in his investigation.”\n\nFor that matter, Barr himself is seen as a Washington insider — he was first President George H. W. Bush’s attorney general and though he identifies with the Republican Party, is generally well-respected by the D.C. establishment (which means the Deep State). What’s more, Barr says he told POTUS Trump “how well I knew Bob Mueller and that the Barrs and Mueller were good friends and would be good friends when this was all over,” adding that “Bob is a straight shooter and should be dealt with as such.”\n\nIn addition, the calls for the president’s impeachment — despite the fact that no criminal collusion with Russia has been found and proven, and no other charges exist against him — are becoming blatant and open. The National Sentinel reported Friday:\n\nSure, he tweets a lot. He takes government planes away from Speaker Nancy Pelosi. He’s brusque, feisty, combative, and sometimes petulant (who in Washington isn’t?).\n\nBut the constitutional standard for impeachment is “high crimes and misdemeanors,” and so far that standard hasn’t been met.\n\nClearly there is an ongoing unhealthy obsession among factions in Washington, D.C., to “get” President Trump and expel him from office. That realization alone lends credibility to Roger Stone’s claim.\n\nRead more about the rebellious scheming of the Deep State at DeepState.news.", "opengraph": {"title": "Roger Stone: Deep State plans to remove POTUS Trump, VP Pence, to install Pelosi and Hillary in COUP", "type": "article", "url": "2019-01-20-roger-stone-deep-state-plans-to-remove-potus-trump-vp-pence-to-install-pelosi-and-hillary-in-coup.html", "site_name": "White House News", "description": "Longtime political strategist Roger Stone believes that elements of the Democrat-aligned Deep State are plotting a coup that will see POTUS Donald Trump and Vice President Mike Pence removed from office, which would then hand the presidency to No.", "image": "wp-content/uploads/sites/80/2019/01/roger-stone-target.jpg", "locale": "en_US", "updated_time": "2019-01-20T11:19:39+00:00", "image:width": "1197", "image:height": "1026", "image:type": "image/jpeg", "article:published_time": "2019-01-20T11:19:39+00:00", "article:modified_time": "2019-01-20T11:19:39+00:00", "article:author": "author/jdheyes", "article:publisher": "/", "article:section": "Politics", "article:tag": "william barr"}, "tags": ["coup", "government", "deep state", "hoax", "presidency", "Attorney General", "Nancy Pelosi", "Republicans", "President Trump", "Robert Mueller", "treason", "Roger Stone", "William Barr", "special counsel", "Russian collusion", "impeachment", "political coup", "Collusion", "Vice President Pence", "Hillary Clinton", "lawless"], "tweets": [], "movies": [], "links": ["https://www.infowars.com/roger-stone-warns-of-deep-state-coup-to-install-pelosi-then-hillary-as-president/", "https://www.newstarget.com/2018-12-12-potus-trump-people-would-revolt-if-democrats-impeach-him.html", "https://www.cnn.com/2019/01/04/politics/mueller-grand-jury/index.html", "http://www.robertmueller.news", "https://thenationalsentinel.com/2019/01/18/impeach-trump-after-all-of-these-obama-high-crimes-and-misdemeanors/", "http://www.deepstate.news", "https://thenationalsentinel.com/2019/01/18/impeach-trump-after-all-of-these-obama-high-crimes-and-misdemeanors/", "https://www.cnn.com/2019/01/04/politics/mueller-grand-jury/index.html", "https://www.infowars.com/roger-stone-warns-of-deep-state-coup-to-install-pelosi-then-hillary-as-president/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2019-01-20-roger-stone-deep-state-plans-to-remove-potus-trump-vp-pence-to-install-pelosi-and-hillary-in-coup.html&linkname=Roger%20Stone%3A%20Deep%20State%20plans%20to%20remove%20POTUS%20Trump%2C%20VP%20Pence%2C%20to%20install%20Pelosi%20and%20Hillary%20in%20COUP", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2019-01-20T11:19:39+00:00"}