{"result_id": "342040", "URL": "https://whitehouse.news/2022-11-08-democrat-hypocrisy-obama-warns-about-demonizing-political-opponents.html", "timestamp": "2023-04-25 18:13:03 CEST+0200", "meta": {"description": "Nationally, the Democratic Party pinned its political hopes to salvage the midterm elections on two things: Maintaining abortion ‘rights,’ and painting all Republicans as ‘too dangerous’ to be in charge — both of which are “threats to democracy.” But at the same time, the party’s real standard-bearer, Barack Obama, the man behind Joe Biden’s White […]", "lang": "en", "keywords": "2000 Mules,2022 election,barack obama,bias,cancel Democrats,Donald Trump,hate,hypocrisy,intolerance,Joe Biden,MAGA Republicans,midterms,political violence,suppressed,violence,vote fraud", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://whitehouse.news/2022-11-08-democrat-hypocrisy-obama-warns-about-demonizing-political-opponents.html", "encoding": "UTF-8"}, "image": null, "domain": "whitehouse.news", "title": "Democrat double standard: As Obama warns about ‘demonizing’ political opponents, Biden blatantly demonizes Republicans ahead of midterms", "cleaned_text": "Democrat double standard: As Obama warns about ‘demonizing’ political opponents, Biden blatantly demonizes Republicans ahead of midterms\n\nNationally, the Democratic Party pinned its political hopes to salvage the midterm elections on two things: Maintaining abortion ‘rights,’ and painting all Republicans as ‘too dangerous’ to be in charge — both of which are “threats to democracy.”\n\nBut at the same time, the party’s real standard-bearer, Barack Obama, the man behind Joe Biden’s White House, is trying to paint Democrats as being “more reasonable” in a perfect hypocritical double standard.\n\n“One thing is clear, and that is this increasing habit of demonizing political opponents, of just yelling and thinking not just that I disagree with someone, but that they’re evil and wrong,” Obama told a campaign rally in Arizona late last week. “That creates a dangerous climate. And when we have politicians and elected officials in leadership positions who continue to promote over-the-top rhetoric or make light of it … more people are going to get hurt.”\n\nNot long after, Biden reprised an earlier ‘MAGA Republicans are evil’ speech at Union Station that he gave in Philadelphia in September.\n\n“Just a few days ago, a little before 2:30 a.m. in the morning, a man smashed the back windows and broke into the home of the Speaker of the House of Representatives, the third-highest ranking official in America,” he said at one point. “The assailant tried to take Paul hostage. He woke him up, and he wanted to tie him up. The assailant ended up using a hammer to smash Paul’s skull. All of this happened after the assault, and it just — it’s hard to even say; it’s hard to even say — after the assailant entered the home asking, ‘Where’s Nancy? Where’s Nancy?'”\n\nIt has since been revealed that the alleged assailant is a left-wing nutjob who is a homeless drug abuser. Nevertheless, Biden — doing what Obama and his operatives inside the White House told him to do — likened the attack on Pelosi’s husband to the Jan. 6 riot at the Capitol Building.\n\nThose were the very same words used by the mob when they stormed the United States Capitol on January the 6th when they broke windows, kicked in the doors, brutally attacked law enforcement, roamed the corridors hunting for officials, and erected gallows to hang the former Vice President, Mike Pence,” he said. “It was an enraged mob that had been whipped up into a frenzy by a President repeating over and over again the Big Lie that the election of 2020 had been stolen. It’s a lie that fueled the dangerous rise in political violence and voter intimidation over the past two years.\n\n“You know, American democracy is under attack because the defeated former President of the United States refuses to accept the results of the 2020 election. He refuses to accept the will of the people. He refuses to accept the fact that he lost,” Biden continued. “He has abused his power and put the loyalty to himself before loyalty to the Constitution. And he’s made a Big Lie an article of faith in the MAGA Republican Party — the minority of that party.”\n\nIt is not a ‘big lie’ — as the documentary “2,000 Mules” by Dinesh D’Souza proves.\n\nIn September, Biden claimed, “Donald Trump and the MAGA Republicans represent an extremism that threatens the very foundations of our republic,” and that a Republican Party that supported Donald Trump was “a threat to this country.”\n\nMeanwhile, per Breitbart News, there is a litany of examples where left-wing lunatics have tried to or committed violence against Republicans that Biden conveniently forgot to mention:\n• Threats of rioting prior to the 2020 presidential election, forcing businesses in Democrat-run cities to board up their windows\n• The attempted stabbing of New York Republican gubernatorial nominee Rep. Lee Zeldin at a campaign rally\n• The alleged murder of a teenager in September after a North Dakota man said he suspected the boy was a Republican\n• The vicious beating of a volunteer for Sen. Marco Rubio (R-FL) by men who said Republicans were not allowed in the area\n• The alleged biting of a supporter of Republican gubernatorial candidate Tudor Dixon by a fan of Gov. Gretchen Whitmer (D)\n• Death threats last week against Republican gubernatorial nominee State Sen. Darren Bailey in Illinois\n• A physical attack on New Hampshire Republican nominee for Senate Don Bolduc (allegedly by a local libertarian)\n• The attempted assassination of Justice Brett Kavanaugh following the leaked draft of the Supreme Court’s Dobbs decision overturning Roe v. Wade\n• The fire-bombing and targeting of pregnancy centers and Catholic churches by pro-abortion activists in the wake of the Dobbs decision", "opengraph": {"title": "Democrat double standard: As Obama warns about ‘demonizing’ political opponents, Biden blatantly demonizes Republicans ahead of midterms", "type": "article", "url": "https://www.whitehouse.news/2022-11-08-democrat-hypocrisy-obama-warns-about-demonizing-political-opponents.html", "site_name": "White House News", "description": "Nationally, the Democratic Party pinned its political hopes to salvage the midterm elections on two things: Maintaining abortion ‘rights,’ and painting all Republicans as ‘too dangerous’ to be in charge — both of which are “threats to democracy.” But at the same time, the party’s real standard-bearer, Barack Obama, the man behind Joe Biden’s White […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2022/11/Hunter-Biden-Joe-Biden-Barack-Obama.jpg"}, "tags": ["Joe Biden", "2000 Mules", "vote fraud", "cancel Democrats", "Donald Trump", "hypocrisy", "intolerance", "midterms", "hate", "MAGA Republicans", "political violence", "violence", "barack obama", "bias", "suppressed", "2022 election"], "tweets": [], "movies": [], "links": ["https://www.msn.com/en-us/news/politics/obama-tells-arizona-crowd-to-focus-on-saving-democracy/ar-AA13GEBT?li=BBnbcA1", "https://naturalnews.com/2022-05-09-2000-mules-full-of-must-see-surprises.html", "https://www.breitbart.com/politics/2022/11/03/obama-warns-demonizing-poliical-opponents-violence-as-biden-attacks-republicans-threat-democracy/", "http://www.violence.news", "https://www.breitbart.com/politics/2022/11/03/obama-warns-demonizing-poliical-opponents-violence-as-biden-attacks-republicans-threat-democracy/", "https://naturalnews.com/2022-05-09-2000-mules-full-of-must-see-surprises.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2022-11-08-democrat-hypocrisy-obama-warns-about-demonizing-political-opponents.html&linkname=Democrat%20double%20standard%3A%20As%20Obama%20warns%20about%20%E2%80%98demonizing%E2%80%99%20political%20opponents%2C%20Biden%20blatantly%20demonizes%20Republicans%20ahead%20of%20midterms", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}