{"result_id": "342030", "URL": "https://www.whitehouse.news/2022-09-21-biden-transhumanist-eo-program-biology-like-computers.html", "timestamp": "2023-04-25 18:12:57 CEST+0200", "meta": {"description": "An executive order (EO) by President Joe Biden called for natural biology to be programmed “like computers” – a clear push for transhumanism under the guise of public health. On Sept. 12, Biden signed EO 14081 that sought to bolster the U.S. biotechnology industry. It proposed the use of biotechnology to “aid” human health, citing the […]", "lang": "en", "keywords": "badhealth,badmedicine,badscience,big government,biological database,biotechnology,Dangerous Medicine,deep state,EO 14081,future science,globalists,hackable humans,Joe Biden,research,science deception,science fraud,transhumanism,vaccines,Yuval Noah Harari", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2022-09-21-biden-transhumanist-eo-program-biology-like-computers.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "Biden’s transhumanist EO calls for natural biology to be programmed like computers", "cleaned_text": "Biden’s transhumanist EO calls for natural biology to be programmed like computers\n\nAn executive order (EO) by President Joe Biden called for natural biology to be programmed “like computers” – a clear push for transhumanism under the guise of public health.\n\nOn Sept. 12, Biden signed EO 14081 that sought to bolster the U.S. biotechnology industry. It proposed the use of biotechnology to “aid” human health, citing the role of such biotechnologies during the Wuhan coronavirus (COVID-19) pandemic.\n\n“The COVID-19 pandemic has demonstrated the vital role of biotechnology and biomanufacturing in developing and producing life-saving diagnostics, therapeutics and vaccines that protect Americans and the world,” the EO stated. “The power of these technologies is most vivid at the moment in the context of human health.”\n\nGiven this, EO 14081 called on the secretary of health and human services to “submit a report assessing how to use biotechnology … to achieve medical breakthroughs, reduce the overall burden of disease, and improve health outcomes.” According to the edict, the report “shall identify high-priority basic research and technology development needs … [alongside] recommendations for actions to enhance biosafety and biosecurity to reduce risk throughout the biotechnology R&D and biomanufacturing lifecycles.”\n\nThe EO also mandated the establishment of a “Data for the Bioeconomy Initiative,” which requires “biological data sets” – including gene-related information deemed critical for social advances. In line with this, it called for a “plan to fill any data gaps” and to “make new and existing public data findable and “accessible.”\n\nEO 14081 tried to allay the fears of critics by implementing a “data-protection plan” to mitigate security and privacy risks. However, the initiative raises the question of whether and how individuals’ genomic information might be publicly disclosed, and whether it would be done so only with informed consent.\n\n“Biden’s call for the ‘programming’ of biology the way we program software, if applied to humans, would facilitate [the] transhumanist vision of the creation of ‘superhumans’ through various kinds of technology, including biotechnology,” wrote Emily Mangiaracina for LifeSiteNews.\n\nBiden’s transhumanist EO 14081 oddly echoed the concept of hackable humans promoted by Israeli intellectual Yuval Noah Harari.\n\n“Today, we have the technology to hack human beings on a massive scale,” said Harari, a lead advisor for the World Economic Forum (WEF). “Everything is being digitalized [and] monitored.”\n\nAccording to Harari, the pandemic serves as a chance to bring hackable humans closer to reality thanks to the COVID-19 vaccines, which he branded as tools to facilitate “surveillance under the skin.”\n\n“The vaccine will help us, of course. It will make things more manageable, [such as] surveillance. People could look back in a hundred years and identify the [COVID-19] pandemic as the moment when a regime of surveillance took over – especially surveillance under the skin,” he said. (Related: Yuval Noah Harari: Humans are now HACKABLE ANIMALS thanks to vaccines.)\n\n“This ability to hack human beings, to go under the skin, collect biometric data, analyze it and understand people better than they understand themselves … is the most important event of the 21st century.”\n\nDuring a separate lecture, the WEF advisor explained how this ability to hack humans can be achieved.\n\n“Biological knowledge, multiplied by computing power, multiplied by data – equals the ability to hack humans. If you know enough biology and you have enough computing power and data – you can hack my body, my brain and my life,” he said.\n\n“In the past, many tyrants and governments wanted to do it. But nobody understood biology well enough, and nobody had enough computing power and data to hack millions of people. Neither the Gestapo nor the KGB could do it. But soon, at least some corporations and governments will be able to systematically hack all the people.”\n\nWatch Yuval Noah Harari discuss the transhumanist concept of hackable humans below.\n\nThis video is from the Thrivetime Show channel on Brighteon.com.\n\nGlobalists push transhumanism agenda with computer chips inserted into humans via COVID injections.\n\nLet’s Talk America: Democrats, globalists tearing down the US to “Build Back Better” – Brighteon.TV.\n\nThrive Time Show: Covid vaccines part of bigger plan to ELIMINATE free will – Brighteon.TV.\n\nWEF lead advisor Harari: Humans are now hackable animals; free will is over – Brighteon.TV.", "opengraph": {"title": "Biden’s transhumanist EO calls for natural biology to be programmed like computers", "type": "article", "url": "https://www.whitehouse.news/2022-09-21-biden-transhumanist-eo-program-biology-like-computers.html", "site_name": "White House News", "description": "An executive order (EO) by President Joe Biden called for natural biology to be programmed “like computers” – a clear push for transhumanism under the guise of public health. On Sept. 12, Biden signed EO 14081 that sought to bolster the U.S. biotechnology industry. It proposed the use of biotechnology to “aid” human health, citing the […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2022/09/Joe-Biden-Smiling-Close-Up.jpg"}, "tags": ["Joe Biden", "big government", "biotechnology", "future science", "science deception", "deep state", "research", "globalists", "hackable humans", "Yuval Noah Harari", "vaccines", "transhumanism", "biological database", "EO 14081", "science fraud"], "tweets": [], "movies": [], "links": ["https://www.lifesitenews.com/news/biden-transhumanist-executive-order-we-need-to-program-biology-like-we-program-computers/", "https://www.federalregister.gov/documents/2022/09/15/2022-20167/advancing-biotechnology-and-biomanufacturing-innovation-for-a-sustainable-safe-and-secure-american", "https://privacywatch.news/", "https://naturalnews.com/2022-02-09-covid-vaccines-make-hackable-humans-a-reality.html", "https://transhumanism.news", "https://www.brighteon.com/2025dc4b-14c8-4687-a52e-d772cefba862", "https://www.brighteon.com/channels/thrivetimeshow", "https://transhumanism.news/2022-03-09-globalists-pushing-for-transhumanism-through-computer-chips.html", "https://conspiracy.news/2022-04-12-dems-globalists-destroy-us-build-back-better.html", "https://vaccines.news/2022-02-02-covid-vaccines-bigger-plan-eliminate-free-will.html", "https://globalism.news/2022-06-19-harari-humans-now-hackable-animals-free-will-is-over.html", "https://greatreset.news/2022-02-25-clay-clark-discusses-government-corruption-globalist-collusion.html", "https://www.lifesitenews.com/news/biden-transhumanist-executive-order-we-need-to-program-biology-like-we-program-computers/", "https://www.federalregister.gov/documents/2022/09/15/2022-20167/advancing-biotechnology-and-biomanufacturing-innovation-for-a-sustainable-safe-and-secure-american", "https://www.brighteon.com/2025dc4b-14c8-4687-a52e-d772cefba862", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2022-09-21-biden-transhumanist-eo-program-biology-like-computers.html&linkname=Biden%E2%80%99s%20transhumanist%20EO%20calls%20for%20natural%20biology%20to%20be%20programmed%20like%20computers", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}