{"result_id": "342019", "URL": "https://www.whitehouse.news/2020-10-13-us-officials-chinese-hackers-stealing-trade-secrets-coronavirus-vaccines.html", "timestamp": "2023-04-25 18:12:50 CEST+0200", "meta": {"description": "During a recent appearance in London, Secretary of State Mike Pompeo called out communist China for allowing Chinese hackers to steal hundreds of millions of dollars’ worth of trade secrets and intellectual property about Wuhan coronavirus (COVID-19) vaccines. In addition to dropping the ball with its poor handling of the plandemic, China has apparently been […]", "lang": "en", "keywords": "Big Pharma,China,coronavirus,covid-19,intellectual property,medical technology,Pompeo,theft,trade secrets,vaccine wars,vaccines", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2020-10-13-us-officials-chinese-hackers-stealing-trade-secrets-coronavirus-vaccines.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "U.S. officials say Chinese hackers are stealing trade secrets about coronavirus vaccines", "cleaned_text": "U.S. officials say Chinese hackers are stealing trade secrets about coronavirus vaccines\n\nDuring a recent appearance in London, Secretary of State Mike Pompeo called out communist China for allowing Chinese hackers to steal hundreds of millions of dollars’ worth of trade secrets and intellectual property about Wuhan coronavirus (COVID-19) vaccines.\n\nIn addition to dropping the ball with its poor handling of the plandemic, China has apparently been facilitating the theft of Western research looking into solutions for the crisis. Joined by Foreign Secretary Dominic Raab, Pompeo had nothing but criticism to levy against the communist regime.\n\n“On behalf of the American people I want to extend my condolences to the British people for your losses from this preventable pandemic,” Pompeo stated, addressing his British audience.\n\n“This CCP (Chinese Communist Party) exploitation of this disaster to further its own interests has been disgraceful and rather than helping the world, General Secretary Xi has shown the world the party’s true face.”\n\nIn a unified front, the United States, the United Kingdom, and the other members of the “five eyes” intelligence group are all going after the CCP for scourging the world with this pandemic, as well as for interfering with with efforts by freedom fighters in Hong Kong to stop communist Chinese encroachment of their territory.\n\n“We began with the challenge presented by the Chinese Communist Party in the COVID-19 virus which originated in Wuhan, China,” Pompeo went on to state, adding that he is now calling on all democratic countries everywhere to unite against the “threat” of communist Chinese aggression.\n\nIs the U.S. gearing up for war against communist China?\n\nMirroring the language used against Russia just a few short months ago, Pompeo continued to stress that China needs to start behaving in a manner “consistent with international order,” or else. These and other statements were made after Pompeo engaged in “candid” talks with British Prime Minister Boris Johnson.\n\nAt the same time when Pompeo was making these remarks, federal prosecutors announced that they are now in hot pursuit of two Chinese hackers who supposedly stole trade secrets from companies that are working on Wuhan coronavirus (COVID-19) vaccines.\n\n“In this case, the pair of Chinese nationals, who it appears will not be brought to justice given they reside in China, are charged with stealing hundreds of millions of dollars’ worth of trade secrets and intellectual property,” Zero Hedge reports, again comparing the situation to the rhetoric used against Russia prior to the plandemic.\n\nThe FBI announced on Twitter that the agency and its “partners” are charging Li Xiaoyu and Dong Jiazhi for allegedly participating in a global computer intrusion campaign that involved hacking hundreds of different companies located in 11 different countries.\n\nThe indictment contains 11 counts that accuse Li and Dong of conspiring to trespass and steal information and trade secrets, most recently against large multinational corporations that are busy working on new vaccines for the Wuhan coronavirus (COVID-19).\n\n“The hackers stole terabytes of data which comprised a sophisticated and prolific threat to U.S. networks,” a DOJ (Department of Justice) press release reads. “More recently, the defendants probed for vulnerabilities in computer networks of companies developing COVID-19 vaccines, testing technology, and treatments.”\n\nSome of the most recent statements made by Chinese President Xi warned other countries like the U.K. not to “dance to the tune of the Americans.” But this warning appears to be too late as the war drums are already beating.\n\n“This man is a professional liar,” wrote one commenter about Pompeo and his latest rhetoric.\n\n“Never trust dual citizens and their fat stooges,” wrote another, to which a response was added that the U.S. “is ruled by dual citizens and traitors.”\n\nMore related news about the aggression of communist China is available at Tyranny.news.", "opengraph": {"title": "U.S. officials say Chinese hackers are stealing trade secrets about coronavirus vaccines", "type": "article", "url": "2020-10-13-us-officials-chinese-hackers-stealing-trade-secrets-coronavirus-vaccines.html", "site_name": "White House News", "description": "During a recent appearance in London, Secretary of State Mike Pompeo called out communist China for allowing Chinese hackers to steal hundreds of millions of dollars' worth of trade secrets and intellectual property about Wuhan coronavirus (COVID-19) vaccines.", "image": "wp-content/uploads/sites/80/2020/10/Coronavirus-Vaccine-Covid-19.jpg", "locale": "en_US", "updated_time": "2020-10-13T23:04:51+00:00", "image:width": "1000", "image:height": "563", "image:type": "image/jpeg", "article:published_time": "2020-10-13T23:04:51+00:00", "article:modified_time": "2020-10-13T23:04:51+00:00", "article:author": "author/ethanh", "article:publisher": "/", "article:section": "War", "article:tag": "vaccines"}, "tags": ["covid-19", "vaccine wars", "Big Pharma", "theft", "China", "vaccines", "coronavirus", "Pompeo", "intellectual property", "trade secrets", "medical technology"], "tweets": [], "movies": [], "links": ["https://www.zerohedge.com/geopolitical/communist-china-xis-exploitation-pandemic-disgraceful-pompeo-unloads-downing-street", "https://www.naturalnews.com/2020-07-08-criticizing-communist-china-even-outside-china-punishable-offense.html", "http://tyranny.news", "https://www.zerohedge.com/geopolitical/communist-china-xis-exploitation-pandemic-disgraceful-pompeo-unloads-downing-street", "https://www.naturalnews.com/2020-07-08-criticizing-communist-china-even-outside-china-punishable-offense.html"], "authors": [], "publish_date": "2020-10-13T23:04:51+00:00"}