{"result_id": "342028", "URL": "https://www.whitehouse.news/2023-02-01-too-late-for-nato-to-win-the-war-against-russia.html", "timestamp": "2023-04-25 18:12:56 CEST+0200", "meta": {"description": "While the prostituted propaganda media absurdly claims that Russia is retreating and NATO forces are winning the war in Ukraine, the truth is far more sobering: NATO has already lost the war with Russia. Here’s how we know: A land war with a major military power is a long, drawn out slug fest that requires […]", "lang": "en", "keywords": "battle tanks,defense industry,deindustrialization,Joe Biden,munitions,NATO,Pentagon,Putin,Russia,supply chain,Ukraine,War,weapons,world war", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2023-02-01-too-late-for-nato-to-win-the-war-against-russia.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "It’s TOO LATE for NATO to win the war against Russia… here’s why", "cleaned_text": "It’s TOO LATE for NATO to win the war against Russia… here’s why\n\nWhile the prostituted propaganda media absurdly claims that Russia is retreating and NATO forces are winning the war in Ukraine, the truth is far more sobering: NATO has already lost the war with Russia. Here’s how we know:\n\nA land war with a major military power is a long, drawn out slug fest that requires the sustained expenditure of enormous quantities of munitions: Artillery shells, rockets, missiles, small arms cartridges and so on.\n\nTo supply these munitions, a fighting force needs to be backed by a strong munitions manufacturing infrastructure or have huge stockpiles that can sustain the war while supplies are depleted. The United States has neither. No sufficiently large stockpiles and no existing munitions manufacturing infrastructure that can keep pace with Russia, which at times has expended up to 20,000 artillery rounds per day. (Note: The existing munitions infrastructure in the United States can’t even churn out that many rounds in a full month of production…)\n\nConsider this recent article from Breitbart.com: Endless Arms Flow to Ukraine Raises Worry over U.S. Military Readiness Against China, which warns that U.S. precision-guided munitions would run out in just one week:\n\nA recently-published think-tank analysis warned that as it currently stands, the U.S. would run out of long-range, precision-guided munitions in a war with China over Taiwan in less than a week — a problem that author Seth Jones called one of “empty bins.”\n\n“The United States has been slow to replenish its arsenal, and the DoD has only placed on contract a fraction of the weapons it has sent to Ukraine,” Jones, a senior vice president at the Center for Strategic and International Studies (CSIS) wrote.\n\nThe USA lacks raw materials and a labor pool to operate munitions factories at scale\n\nEven more importantly, to manufacture such munitions — even if you have the infrastructure factories that can churn them out — you must have: 1) Raw materials (metals, circuit boards, cotton linters, etc.) and 2) A labor pool that is sufficiently educated and motivated to work in factories.\n\nIf you’ve never heard of cotton linters, they’re a critical component needed for the manufacture of artillery rounds. The primary source is China, and China’s exports on cotton linters are currently nine months behind schedule, causing havoc with Germany’s munitions manufacturing. As Nikkei Asia reports:\n\nGerman ammunition makers at a recent defense symposium near Munich flagged that the lead time for orders of cotton linters from China — a key component for propelling charges for both small guns and artillery — has tripled to up to nine months, German-language daily Die Welt reported.\n\nWhile cotton linters are a commodity material produced and traded across the globe, the report cited unnamed industry sources saying that all European ammunition manufacturers rely on China for them.\n\nThe massive bottlenecks in raw material supply “concern especially ammunition and special steels,” Wolfgang Hellmich, the defense affairs speaker for the ruling Social Democratic Party (SPD) in parliament, told Nikkei Asia…\n\nThe United States lacks domestic raw materials production as well as a reliable, educated domestic labor pool. Young American men and women who might have traditionally worked in weapons factories are no longer interested in working at all. The work ethic of America has been utterly destroyed, and most American youth expect to collect Universal Basic Income money / stimulus money and function solely as consumers in society, not producers.\n\nThe Pentagon recently announced it would increase artillery production by 500%, hoping to achieve output of 90,000 artillery rounds per month. This was widely reported in the media, but what didn’t grab headlines is the fact that the factories to produce these rounds don’t exist and have to be built from the ground up. The process of building the factories will reportedly take two years, and that’s assuming everything goes as planned (which it never does). Sometime after these factories are built and tested, additional munitions could be produced. Most likely this will begin to appear in late 2025 or 2026. The problem with this plan, of course, is that Russia will likely defeat Ukraine this year (in 2023), because Russia has the capacity to churn out these high levels of munitions right now.\n\nThe USA and NATO, in other words, could conceivably crank up munitions production to fight a war in 2025 or 2026, but not in 2023 or even 2024. This means Russia has a huge window of opportunity to defeat Ukraine and send NATO packing, long before NATO can scrounge up the munitions to pose any real threat to Russia’s military forces.\n\nJavelin missiles will take years to increase production… and they are decades old in their design\n\nJavelin anti-tank missiles, which have been depleted in U.S. stockpiles due to most of them being shipped to Ukraine, are also slated for increased production by Lockheed Martin. But the chief executive of Lockheed Martin doesn’t seem to have any solid idea of how long it will take to produce just 4,000 per year — a small fraction of what would be needed to wage a land war with a major military power like Russia. As reported by DefenseNews.com:\n\nLockheed Martin aims to nearly double production for Javelin anti-tank missiles from 2,100 to 4,000 per year, but it needs the supply chain to “crank up,” according to its chief executive.\n\nAs the U.S. sends Javelins from its own military stockpiles to Ukraine’s fight against Russia, Lockheed is boosting Javelin production ? but getting to its goal could take as long as a couple of years, Jim Taiclet said Sunday on CBS’s “Face the Nation.”\n\n“We’re endeavoring to take that up to 4,000 per year, and that will take a number of months, maybe even a couple of years to get there because we have to get our supply chain to also crank up,” Taiclet said. “We think we can almost double the capacity in a reasonable amount of time.”\n\nSo is it months, or is it a year? And even once this goal of 4,000 per year is achieved, it doesn’t solve the problem that Javelin anti-tank systems are based on a decades-old design that renders them less than impressive against modern Russian tanks.\n\nAnother problem is that the current inventory of Javelin missiles has largely expired, turning them into duds. Often, they do not fire their main thrusters and just flop onto the ground. That’s because they contain internal batteries, and the batteries have lost their juice.\n\nEach Javelin anti-tank round is made with 250 microprocessors, says Defense News. Many of those are sourced from outside the USA, meaning they probably come from Taiwan or other Asian nations. Taiwan is about to face an attack from China which will almost certainly include a naval embargo against the island nation, blocking exports of microchips. This means the U.S. Javelin production supply chain grinds to a halt.\n\nAstonishingly, no one in the Pentagon bothered to secure domestic sources for critical munitions parts.\n\nAnd it’s too late to create a whole new supply chain any time in the near future, since such sweeping changes require many years to accomplish.\n\nRussia, on the other hand, has been forced to build out its domestic supply chain since at least 2014 when severe economic sanctions were leveled against the nation. The 2022 sanctions that cut off Russia from the SWIFT financial transaction system further forced Russia to rely almost exclusively on domestic supplies for iron ore, steel, aluminum, copper, microchips, gunpowder and more. As a result, Russia is at least a decade ahead of the USA in terms of domestic sourcing for munitions components.\n\nIt would take the United States a decade, in other words, just to reconfigure its military supply chains to the point where it could begin to reliably manufacture large quantities of munitions domestically. But before that would ever become a reality, green protesters would try to shut down the mines necessary to acquire raw materials domestically: Cobalt, copper, aluminum, nickel, magnesium and so on.\n\nIn effect, the United States of America is no longer capable of domestic munitions production in the scale necessary to wage a sustained war with any serious military power: China, Russia or otherwise. The USA and NATO have already lost this war with Russia even before it ramps up to a full escalation. There simply isn’t the supply chain and manufacturing infrastructure to wage such a war in the real world, which is why the US State Department relies on fake news propaganda and media campaigns to try to convince the American people that they are winning a war they’re actually losing badly.\n\nAs we saw early in the Biden regime’s occupation of the White House, the U.S. military can’t even fight the Taliban without turning tail and running, leaving behind billions of dollars in equipment that instantly fell into the hands of state-sponsored terrorist groups.\n\nIf America can’t fight the Taliban, how exactly do we expect to fight Russia?\n\nNone of what I’ve written here even gets into the details of Russia’s technically superior hypersonic missiles, multiple re-entry ICBMs, world class anti-air defense systems, superior artillery, drones, electronic warfare and more. Even if the USA and NATO matched Russia tank to tank, artillery to artillery, Russia would still win because their hardware is simply more effective and reliable.\n\nSuch is the result of the U.S. Pentagon going “woke” and focusing on transgender soldiers, pump-up bras for men and high heel cross dressing parties instead of focusing on building a military that can project power and defeat geopolitical enemies. Under the woke idiot leadership of Pentagon’s top brass, today’s U.S. military is a shadow of what it was even during Desert Storm. And back then, the Iraqis didn’t have nuclear weapons, hypersonic missiles, kamikaze drones and high-end anti-air defense systems.\n\nI repeat: The USA and NATO have already lost this war with Russia. It’s already in the cards. Now it’s just a matter of Russia performing the grinding work of warfare to achieve their military aims. The only way Russia loses this conflict is if Russia chooses to back down and retreat.\n\nThat outcome seems incredibly unlikely to occur.\n\nHear my full analysis on all this and more in today’s Situation Update podcast:\n\n– Damar Hamlin prostitutes himself out to the vaccine pushing American Heart Association\n\n – The AHA is a Big Pharma front group that pushes statin drugs and vaccines\n\n – #Hollywood libtards threaten to STOP making woke movies until everyone gets vaccinated\n\n – DEAR HOLLYWOOD: WE ACCEPT YOUR TERMS!\n\n – Why Hollywood’s movies suck: Filled with WOKE themes and scripted by idiots\n\n – EAT MORE BUGS: Swedish grocery retailer pushes mealworms recipes\n\n – US mobilizing to send THOUSANDS of tanks to Ukraine\n\n – Escalation with Russia will lead to nuclear annihilation of the west\n\n – Medvedev warns NATO countries they will be “turned to dust” if escalation continues\n\n – NATO countries are YEARS behind the curve in industrial output necessary to fight a war\n\n – US and UK forces will be out of ammunition in mere weeks\n\n – Austria and Hungary declare NO weapons for #Ukraine\n\n – US being left defenseless against China, no domestic defense remaining\n\n – Americans making $100K are still living paycheck to paycheck\n\n – Hedge fund manager warns of “mega tinderbox timebomb” crash coming\n\n – Many of the most dangerous cities in the world are located in the USA\n\n – US Treasury says no US funds were misused in Ukraine… seriously\n\n – Colossal gold purchases by central banks, thousands of tons in 2022\n\n – Giant space rock contains trillions of dollars worth of minerals (but so what?)\n\nDiscover more interviews and podcasts each day at:\n\nBrighteon.social: Brighteon.social/@HealthRanger (my breaking news gets posted here first)\n\nJoin the free NaturalNews.com email newsletter to stay alerted about breaking news each day.\n\nDownload my current audio books — including Ghost World, Survival Nutrition, The Global Reset Survival Guide and The Contagious Mind — at:\n\nDownload my new audio book, “Resilient Prepping” at ResilientPrepping.com – it teaches you how to survive the total collapse of civilization and the loss of both the power grid and combustion engines.", "opengraph": {"title": "It’s TOO LATE for NATO to win the war against Russia… here’s why", "type": "article", "url": "https://www.whitehouse.news/2023-02-01-too-late-for-nato-to-win-the-war-against-russia.html", "site_name": "White House News", "description": "While the prostituted propaganda media absurdly claims that Russia is retreating and NATO forces are winning the war in Ukraine, the truth is far more sobering: NATO has already lost the war with Russia. Here’s how we know: A land war with a major military power is a long, drawn out slug fest that requires […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2023/02/Situation-Update-HRR-2023-1-2-v.jpg"}, "tags": ["battle tanks", "Joe Biden", "deindustrialization", "supply chain", "Russia", "weapons", "munitions", "world war", "NATO", "Pentagon", "Ukraine", "War", "Putin", "defense industry"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/ZAUYgi86vWE\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>", "src": "https://www.youtube.com/embed/ZAUYgi86vWE"}], "links": ["https://www.breitbart.com/politics/2023/01/31/endless-arms-flow-to-ukraine-raises-worry-over-u-s-military-readiness-against-china/", "https://asia.nikkei.com/Politics/Ukraine-war/Germany-struggles-to-get-China-parts-to-replenish-ammo-stockpile", "https://ussanews.com/2023/01/29/pentagon-plans-on-increasing-artillery-ammunition-production-by-500-for-ukraine/", "https://www.defensenews.com/industry/2022/05/09/lockheed-aiming-to-double-javelin-production-seeks-supply-chain-crank-up/", "http://Brighteon.com/343f42a4-1c9a-4665-adcd-88652702cb61", "https://Rumble.com/v27ysou-situation-update-feb-1-2023-its-too-late-for-nato-to-win-the-war-against-ru.html", "http://Bitchute.com/video/B6N2ybaJyfcb/", "http://Banned.video/watch?id=63da782cf246b125edf47b02", "http://Healthrangerreport.com/situation-update-feb-1-2023-its-too-late-for-nato-to-win-the-war-against-russia", "https://www.brighteon.com/channels/hrreport", "http://Brighteon.social/@HealthRanger", "http://HealthRanger.substack.com", "http://Banned.video/channel/mike-adams", "https://truthsocial.com/@healthranger", "http://GETTR.com/user/healthranger", "http://Parler.com/user/HealthRanger", "https://Rumble.com/c/HealthRangerReport", "http://Bitchute.com/channel/9EB8glubb0Ns/", "http://app.clouthub.com/#/users/u/naturalnews/posts", "https://www.naturalnews.com/readerregistration.html", "https://audiobooks.naturalnews.com/", "http://ResilientPrepping.com", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2023-02-01-too-late-for-nato-to-win-the-war-against-russia.html&linkname=It%E2%80%99s%20TOO%20LATE%20for%20NATO%20to%20win%20the%20war%20against%20Russia%E2%80%A6%20here%E2%80%99s%20why", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}