{"result_id": "342032", "URL": "https://www.whitehouse.news/2021-08-17-bidens-presidency-collapsed-with-afghanistan.html", "timestamp": "2023-04-25 18:12:58 CEST+0200", "meta": {"description": "What we are witnessing today is the end of Joe Biden’s presidency… Afghanistan was merely the last straw… (Article by John Nolte republished from Breitbart.com) Joe Biden Lost Entire Country in a Single Day After 20 years, thousands of American lives, and trillions of dollars, Afghanistan collapsed in a single day. Think about the extent of […]", "lang": "en", "keywords": "Afghanistan,border,Collapse,COVID,economy,embarrassment,government,government debt,Inflation,Joe Biden,Middle East,national security,politics,stupid,terrorism", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2021-08-17-bidens-presidency-collapsed-with-afghanistan.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "Nolte: Biden’s presidency collapsed with Afghanistan", "cleaned_text": "What we are witnessing today is the end of Joe Biden’s presidency… Afghanistan was merely the last straw…\n\nAfter 20 years, thousands of American lives, and trillions of dollars, Afghanistan collapsed in a single day. Think about the extent of that failure. All those years, all that treasure, all those precious lives, and in one day, it’s all over.\n\nOh, Slow Joe and the fake media will try to blame former President Donald Trump, and it is more than fair to believe the Taliban would’ve eventually routed the Afghan government with Trump in office, but not like this, nothing like this.\n\nFirst off, Joe violated our agreement with the Taliban. My colleague Frances Martel perfectly laid out what the media will never tell you:\n\nUnder predecessor Donald Trump, Washington brokered a deal with the Taliban that would have seen the American military presence in the country, which turned 20 years old this year, end on May 1, 2021. In exchange, the Taliban promised not to attack American troops and to cut ties with international jihadist organizations like al-Qaeda, whose attacks on America on September 11, 2001, prompted the Afghan War. Instead, Biden broke the deal, extending the military presence initially into September before cutting it back to August. Taliban officials took Biden’s disavowal of the agreement as a license to begin a campaign of conquest nationwide that has resulted in, according to Taliban officials, the group now controlling about 85 percent of the country. Taliban officials also falsely claimed they never agreed to cut ties with al-Qaeda. [emphasis added]\n\nSo by breaking the deal Trump brokered, Biden gave the Taliban terrorists the green light to violate their end of the agreement. And so, here we are, fleeing with our tail between our legs and dealing with a national embarrassment unseen since Saigon 1975.\n\nDoes anyone honestly believe the Taliban — who saw Trump wipe out ISIS in about 45 minutes — would have launched this offensive with Trump still in office? Does anyone believe Trump would have left all that U.S. military equipment behind for the Taliban to scoop up?\n\nNothing stopped Biden from evacuating our people from Afghanistan starting on the day he took office. Nothing stopped Biden from destroying all the military equipment that has just fallen into the hands of barbarians. Nothing stopped Biden from honoring Trump’s deal. Nothing stopped Biden from increasing our troop presence to protect Americans and friendly Afghans until everyone was evacuated.\n\nListen, after 20 years, it was time to leave. It’s a terrible thing to witness, but we have no choice when there are no “Afghan people.” This is a tribal country filled with warlords and corruption. America didn’t lose to the Taliban. America lost to a majority population that chose the 7th century over the 21st.\n\nNevertheless, this disastrous, incompetent, bloody, and humiliating withdrawal did not have to happen. That’s all on Slow Joe.\n\nThousands of lives, trillions of dollars, twenty years… And Biden lost it all in one day.\n\nWhile Joe Biden allowed the Taliban to swarm into Kabul, he’s allowing hundreds of thousands of illegal aliens to swarm over our southern border, and a countless number of them are infected with the coronavirus. And then, instead of being deported, all those infected illegals are transported by our own government into our own cities and towns.\n\nTrump pretty much had the border problem solved. All Biden had to do was nothing. He chose instead to open our borders.\n\nAmerica was energy independent under Trump, and a gallon of gas cost us about a buck less than it does now. Yet, Biden strolled in, killed a vital pipeline, killed energy exploration on federal land, and poked his finger in the eye of the Saudis. Biden’s done everything he can to increase the cost of this basic necessity.\n\nThanks to Biden’s lunatic government spending, all the wage growth we saw under Trump is being eaten alive by record inflation as everyone pays more for housing, food, and energy — the three basics of life. All Biden has to do to solve this is to stop spending, but with the help of some Republican quislings, trillions more in unnecessary spending is on the way. Unfortunately, this is going to get worse… much worse.\n\nUnder Trump, the Middle East was not only stable; peace with Israel was breaking out all over. Well, look at the Middle East now, and not just Afghanistan. Let’s not forget the ongoing attacks against Israel.\n• The Return of the Coronavirus Hysteria\n\nAlthough the much-hyped “breakthrough” infections of those vaccinated amounts to practically zero — 7,608 hospitalizations and 1,587 deaths out of 166 million vaccinated — Biden has still bungled the communication so badly, the vaccinated, who are at almost no risk, are being panicked and shoved back into those filthy masks. This will cause economic activity to slow further and put a dark cloud over everyone’s heads when the truth is that the Trump vaccine is working as well as anyone could have hoped for.\n\nThere is no reason life cannot return to normal for the vaccinated, but Joe Biden has allowed the fear-porn peddlers in the medical deep state and fake media to hijack the truth.\n\nBiden’s presidency is officially over. He has no legitimacy on the world stage. He has no moral authority. Voters will never again trust his judgment.\n\nEverything a president requires to lead Biden has squandered.\n\nRead more at: Breitbart.com and JoeBiden.news.", "opengraph": {"title": "Nolte: Biden’s presidency collapsed with Afghanistan", "type": "article", "url": "2021-08-17-bidens-presidency-collapsed-with-afghanistan.html", "site_name": "White House News", "description": "What we are witnessing today is the end of Joe Biden’s presidency… Afghanistan was merely the last straw… (Article by John Nolte republished from Breitbart.", "image": "wp-content/uploads/sites/80/2021/08/Joe-Biden-Presidential-Address-Congress.jpg", "locale": "en_US", "updated_time": "2021-11-10T01:16:28+00:00", "image:width": "1000", "image:height": "563", "image:type": "image/jpeg", "article:published_time": "2021-08-17T18:03:13+00:00", "article:modified_time": "2021-11-10T01:16:28+00:00", "article:author": "author/newseditors", "article:publisher": "/", "article:section": "Politics", "article:tag": "terrorism"}, "tags": ["government", "Joe Biden", "stupid", "embarrassment", "national security", "terrorism", "Collapse", "border", "COVID", "Middle East", "politics", "Afghanistan", "economy", "Inflation", "government debt"], "tweets": [], "movies": [], "links": ["https://www.breitbart.com/politics/2021/08/16/nolte-bidens-presidency-collapsed-afghanistan/", "https://www.breitbart.com/asia/2021/08/13/taliban-pr-victory-tour-we-will-not-be-violent-will-treat-women-as-sharia-demands/", "https://www.reuters.com/world/asia-pacific/militia-commanders-rush-aid-afghan-forces-against-taliban-2021-07-09/", "https://www.breitbart.com/asia/2021/07/12/taliban-we-never-promised-cut-ties-al-qaeda/", "https://www.breitbart.com/politics/2021/03/02/report-border-crossers-released-into-u-s-by-biden-officials-test-positive-for-coronavirus/", "https://www.breitbart.com/politics/2021/03/02/report-border-crossers-released-into-u-s-by-biden-officials-test-positive-for-coronavirus/", "https://www.breitbart.com/politics/2021/08/11/nolte-white-house-blames-opec-for-energy-prices-joe-biden-made-higher/", "https://www.breitbart.com/economy/2021/05/28/inflation-soars-to-29-year-high/", "https://www.breitbart.com/middle-east/2021/08/06/lebanons-hezbollah-fires-terror-rockets-into-israel/", "https://www.cdc.gov/vaccines/covid-19/health-departments/breakthrough-cases.html", "https://www.breitbart.com/politics/2021/08/16/nolte-bidens-presidency-collapsed-afghanistan/", "http://joebiden.news"], "authors": [], "publish_date": "2021-08-17T18:03:13+00:00"}