{"result_id": "342012", "URL": "https://whitehouse.news/2023-03-30-moderna-government-400million-participation-operation-warp-speed.html", "timestamp": "2023-04-25 18:12:45 CEST+0200", "meta": {"description": "Prior to its inclusion in the Trump administration’s Operation Warp Speed scheme for the rapid deployment of Wuhan coronavirus (Covid-19) “vaccines,” Moderna agreed to pay the U.S. National Institutes of Health (NIH) $400 million to license the spike protein technology the company used in its mRNA (messenger RNA) covid injections. A newly disclosed contract shows […]", "lang": "en", "keywords": "big government,Big Pharma,conspiracy,corruption,COVID,deception,drugs,Moderna,money supply,NIH,Operation Warp Speed,pandemic,pay to play,royalties,suppressed,vaccine", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://whitehouse.news/2023-03-30-moderna-government-400million-participation-operation-warp-speed.html", "encoding": "UTF-8"}, "image": null, "domain": "whitehouse.news", "title": "Moderna paid U.S. government $400 million for pay-to-play participation in Operation Warp Speed", "cleaned_text": "Moderna paid U.S. government $400 million for pay-to-play participation in Operation Warp Speed\n\nPrior to its inclusion in the Trump administration’s Operation Warp Speed scheme for the rapid deployment of Wuhan coronavirus (Covid-19) “vaccines,” Moderna agreed to pay the U.S. National Institutes of Health (NIH) $400 million to license the spike protein technology the company used in its mRNA (messenger RNA) covid injections.\n\nA newly disclosed contract shows that Moderna engaged in a pay-for-play type of arrangement with the federal government, which apparently owns the patent for the covid spike proteins that were the center of attention from early 2020 when the “pandemic” began until now.\n\nFor years, Moderna executives denied any type of relationship with the bureaucrats in Washington, D.C., but changed its story in late 2021. The company also disclosed the existence of the contract in question during an earnings call it held on February 23.\n\nAccording to the company, the $400 million it paid to the NIH was merely a “catch-up payment” made specifically to the National Institute of Allergy and Infectious Diseases (NIAID), a division of the NIH that, at the time, was headed up by none other than disgraced medical charlatan Tony Fauci.\n\nThe contract states that Moderna would pay the NIH a “noncreditable, nonrefundable royalty in the amount of Four Hundred Million dollars” for the rights to use its spike protein technology in the company’s vaccines. This is far more money than the “low single digit royalties” that were initially confirmed by Moderna, but later redacted.\n\nWhy is the government trying to hide its royalties arrangement with Moderna?\n\nThe 34-page contract was obtained via a Freedom of Information Act (FOIA) request, though, again, numerous portions of it that specifically pertain to royalty payments are redacted.\n\n“The licensee agrees to pay to the NIAID earned royalties on net sales … as follows,” reads one such section about royalties, the rest of which is completely redacted from public view.\n\nThe reason why these sections are redacted, according to the NIH, is because the agency has the right to withhold “trade secrets and commercial or financial information obtained from a person and privileged or confidential.”\n\n“They redacted the royalties, even though there have been press releases about the royalties,” explained James Love, director of the nonprofit group Knowledge Ecology International. “It’s common but [expletive] to redact royalties on a negotiated license on a government patent.”\n\nWhat we do know from the unredacted portions of the contract is that Moderna had, in fact, agreed to start paying the NIH royalties before the agreement took effect in late 2022, along with “minimum annual royalty,” “earned royalties,” and “benchmark royalties.”\n\nThe contract was signed on Dec. 14, 2022, by Michael Mowatt, director of the Technology Transfer and Intellectual Property Office at NIAID, and Shannon Klinger, chief legal officer at Moderna.\n\nThe payments specified therein were to include a royalty within 60 days of government officials providing a “reasonable detailed written statement and request” for an amount “equivalent to a pro rata share of the unreimbursed patent expenses previously paid by the NIAID.”\n\nSo far, Moderna has raked in nearly $37 billion from the sale of its Chinese Virus injections. In 2023, the company expects to bring in an additional $5 billion, all thanks to the lucrative contract agreements the company forged with government bureaucracies.\n\n“The NIH shares ownership of the spike protein technology with researchers at Scripps Research Institute and Dartmouth University‘s Geisel School of Medicine,” reports explain. “Both are named as partners in the contract.”\n\nWant to keep up with the latest news about the Wuhan coronavirus (Covid-19) “vaccine” scam, as well as the government’s involvement with it? You can do so at ChemicalViolence.com.", "opengraph": {"title": "Moderna paid U.S. government $400 million for pay-to-play participation in Operation Warp Speed", "type": "article", "url": "https://www.whitehouse.news/2023-03-30-moderna-government-400million-participation-operation-warp-speed.html", "site_name": "White House News", "description": "Prior to its inclusion in the Trump administration’s Operation Warp Speed scheme for the rapid deployment of Wuhan coronavirus (Covid-19) “vaccines,” Moderna agreed to pay the U.S. National Institutes of Health (NIH) $400 million to license the spike protein technology the company used in its mRNA (messenger RNA) covid injections. A newly disclosed contract shows […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2023/03/Bribe-Corrupt-Bribery-Envelope-Deal-Bad-Crime.jpg"}, "tags": ["pandemic", "conspiracy", "big government", "Big Pharma", "pay to play", "Moderna", "royalties", "COVID", "NIH", "deception", "vaccine", "Operation Warp Speed", "drugs", "corruption", "suppressed", "money supply"], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/contract-confirms-us-government-received-400-million-from-major-covid-19-vaccine-manufacturer_5144915.html", "https://naturalnews.com/2020-11-19-science-pfizer-moderna-covid19-vaccines-have-none.html", "http://www.dartmouth.edu", "http://chemicalviolence.com", "https://www.theepochtimes.com/contract-confirms-us-government-received-400-million-from-major-covid-19-vaccine-manufacturer_5144915.html", "https://naturalnews.com/2020-11-19-science-pfizer-moderna-covid19-vaccines-have-none.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2023-03-30-moderna-government-400million-participation-operation-warp-speed.html&linkname=Moderna%20paid%20U.S.%20government%20%24400%20million%20for%20pay-to-play%20participation%20in%20Operation%20Warp%20Speed", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}