{"result_id": "342011", "URL": "https://www.whitehouse.news/2022-06-02-russia-can-destroy-america-with-four-missiles.html", "timestamp": "2023-04-25 18:12:45 CEST+0200", "meta": {"description": "Four intercontinental ballistic missiles are all Russia needs to destroy the entire United States. A politician hosting a Russian state TV show on Monday, May 30, issued a warning that Russian President Vladimir Putin could “destroy the entire East coast of the U.S.” with just two missiles. (Related: FLASHBACK: Russia has “Satan 2” nuclear missiles that can […]", "lang": "en", "keywords": "Alexei Zhuravlev,big government,chaos,military tech,national security,NATO,nuclear war,nuclear weapons,propaganda,radiation,Russia,Sarmat,Satan 2,UK,Ukraine,US,Vladimir Putin,weapons technology,World War III", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2022-06-02-russia-can-destroy-america-with-four-missiles.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "Russian MP: Russia can destroy America with four Satan 2 missiles", "cleaned_text": "Russian MP: Russia can destroy America with four Satan 2 missiles\n\nFour intercontinental ballistic missiles are all Russia needs to destroy the entire United States.\n\nA politician hosting a Russian state TV show on Monday, May 30, issued a warning that Russian President Vladimir Putin could “destroy the entire East coast of the U.S.” with just two missiles. (Related: FLASHBACK: Russia has “Satan 2” nuclear missiles that can wipe out an entire area the size of Texas.)\n\nAlexei Zhuravlev, a member of Russia’s parliament, bragged about the country’s military power in the footage from the Kremlin’s prime propaganda show. The legislator alleged that two of Russia’s Sarmat missiles could wipe out the whole East coast of America before adding it would also take just “two missiles for the West coast” to be destroyed, as well.\n\n“Four missiles and there’ll be nothing left. They think the mushroom cloud will be taller than a high rise. That mushroom cloud will be visible from Mexico,” Zhuravlev said.\n\nThe 208-ton RS-28 Sarmat missile, also called Satan 2, is capable of hitting targets at almost 16,000 mph and it stands at the enormous height of a 14-storey tower block.\n\nThe doomsday long range nuclear missile can also carry 15 warheads and has the capability to eradicate an area the size of the United Kingdom in one blast.\n\nPutin-allies have claimed that the Russian military has as many as 50 Sarmat missiles in its stockpile. Every single one of the Sarmat missile’s 15 nuclear warheads are over 100 times more powerful than the atomic bomb dropped on Hiroshima in World War II.\n\nPutin previously said that his Satan 2 missiles “can break through all modern anti-missile defenses.”\n\nWhile these types of threats have become quite normal on Russian propaganda shows since the Ukraine invasion, the risk of mutually assured destruction diminishes much of the danger.\n\nIn addition to threatening the U.S. with Russia’s nuclear power, the show also examined the crisis in Ukraine with the host reiterating the denazification theme of Russia’s invasion.\n\nDepicting them as “incurable,” Zhuravlev said that two million Ukrainians should “be denazified which means to be destroyed.” Ukraine has a population of over 40 million.\n\nHe mentioned a study that found 40 percent of Ukrainians do not support tearing down Soviet era statues in the country, which is being conducted in several regions. Zhuravlev said the 36 percent with “no opinion” on the issue were too afraid to talk, making the case that “over three quarters of Ukrainians are against tearing down monuments.”\n\n“If we re-install their brains correctly, 12-15 percent will also believe it shouldn’t be done. So the maximum of five percent are incurable,” the Russian legislator said.\n\nSarmat missile can reduce the US into nuclear ashes\n\nIn a separate interview, the 59-year-old Zhuravlev said that the Sarmat would reduce the U.S. into “nuclear ashes” if they “think that Russia should not exist.”\n\nHis comments repeated those of Dmitry Rogozin, an ardent friend of Putin, who alleged the missiles could destroy large parts of America before turning his sight on the U.K. and warning the Sarmat could hit British targets in minutes.\n\nRogozin, the head of Russia’s space agency Roscosmos, recently told schoolchildren that Russia’s hypersonic missile could destroy “half the coast of a continent.”\n\nWearing his space agency uniform, Rogozin showed the schoolchildren a list of Russia’s strategic rockets at a “federal education marathon” called New Horizons. This culminated with Rogozin showing the schoolchildren the Sarmat intercontinental ballistic missile.\n\nPutin has stated that Russia’s new “big beast” hypersonic weapon would be “unstoppable … for a long time to come” and it is set to be deployed this year.\n\nAnd not long ago TV anchor Dmitry Kiselyov declared before his Russian TV audience that the U.K. should be deluged twice with Putin’s most sophisticated nuclear arsenals.\n\nKiselyov suggested the use of Satan 2 to obliterate England from the map and that Russia should “plunge Britain into the depths of the sea” with its “underwater robotic drone Poseidon” causing a 1,640-foot tsunami. Former Russian President Dmitry Medvedev also warned of a possible nuclear war. It comes as Russia asked its people not to travel to Britain and swore to block Britons attempting to enter its nation.\n\nMoscow has accused Britain of acting as a Western organizer and cheerleader of the harsh NATO response to Russia’s invasion of Ukraine.\n\nFollow NuclearWeapons.news for more news about Russia’s nuclear capabilities.\n\nWatch the video below to know why Russia’s Sarmat (Satan 2) is the most powerful missile in the world.\n\nThis video is from the Russia Truth channel on Brighteon.com.\n\nNew Russia nuke deployment strategy could unleash massive tidal wave that destroys the entire East Coast of the USA.\n\nRussia threatens to deploy intermediate-range nuclear missiles in Europe as tension with US escalates.\n\nRussian TV airs discussion about possibility of launching nuclear missiles against Berlin, Paris and London.\n\nRussia holds war games with simulated nuclear strikes against the EU.", "opengraph": {"title": "Russian MP: Russia can destroy America with four Satan 2 missiles", "type": "article", "url": "https://www.whitehouse.news/2022-06-02-russia-can-destroy-america-with-four-missiles.html", "site_name": "White House News", "description": "Four intercontinental ballistic missiles are all Russia needs to destroy the entire United States. A politician hosting a Russian state TV show on Monday, May 30, issued a warning that Russian President Vladimir Putin could “destroy the entire East coast of the U.S.” with just two missiles. (Related: FLASHBACK: Russia has “Satan 2” nuclear missiles that can […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2022/06/russia-ICBM-nuclear-missile.jpg"}, "tags": ["big government", "national security", "Satan 2", "chaos", "radiation", "US", "Sarmat", "weapons technology", "UK", "propaganda", "Vladimir Putin", "military tech", "nuclear weapons", "Russia", "Alexei Zhuravlev", "World War III", "NATO", "nuclear war", "Ukraine"], "tweets": [], "movies": [], "links": ["http://www.the-sun.com/news/5460070/russia-threatens-to-hit-us-with-satan-missiles-ukraine/", "https://naturalnews.com/2017-04-13-flashback-russia-has-satan-2-nuclear-missiles-that-can-wipe-out-an-entire-state-the-size-of-texas.html", "http://militarytech.news", "http://www.mirror.co.uk/news/world-news/russia-could-wipe-out-just-27115418", "http://weaponstechnology.news", "http://nuclearweapons.news", "http://www.brighteon.com/40a47485-ad9e-4816-a8e9-2b97f73f1fe3", "http://www.brighteon.com/channels/russiatruth", "https://naturalnews.com/2017-03-08-new-russia-nuke-deployment-strategy-could-unleash-massive-tidal-wave-that-destroys-the-entire-east-coast-of-the-usa.html", "https://naturalnews.com/2021-12-16-russia-threatens-to-deploy-nuclear-missiles-europe.html", "https://nuclearweapons.news/2022-05-03-russian-tv-possible-nuking-berlin-paris-london.html", "https://weaponstechnology.news/2022-05-06-russia-war-games-simulated-nuclear-strike-europe.html", "http://www.the-sun.com/news/5460070/russia-threatens-to-hit-us-with-satan-missiles-ukraine/", "http://www.mirror.co.uk/news/world-news/russia-could-wipe-out-just-27115418", "https://www.brighteon.com/40a47485-ad9e-4816-a8e9-2b97f73f1fe3", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2022-06-02-russia-can-destroy-america-with-four-missiles.html&linkname=Russian%20MP%3A%20Russia%20can%20destroy%20America%20with%20four%20Satan%202%20missiles", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}