{"result_id": "342002", "URL": "https://www.whitehouse.news/2017-05-17-has-trump-already-been-indicted-civil-war-could-follow-if-deep-state-takes-out-duly-elected-president.html", "timestamp": "2023-04-25 18:12:38 CEST+0200", "meta": {"description": "An “exclusive” report published online Monday claims that there has been a secret indictment against President Donald J. Trump, citing “separate sources” linked “to the intelligence and Justice communities.” As noted by Louise Mensch and Claude Taylor, the indictment is to serve as the quasi-legal basis for an impeachment case to be brought against the president […]", "lang": "en", "keywords": "civil war,impeachment,indictment,President Donald J. Trump", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2017-05-17-has-trump-already-been-indicted-civil-war-could-follow-if-deep-state-takes-out-duly-elected-president.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "Has Trump already been indicted? Civil war could follow if Deep State takes out duly elected president", "cleaned_text": "Has Trump already been indicted? Civil war could follow if Deep State takes out duly elected president\n\nAn “exclusive” report published online Monday claims that there has been a secret indictment against President Donald J. Trump, citing “separate sources” linked “to the intelligence and Justice communities.”\n\nAs noted by Louise Mensch and Claude Taylor, the indictment is to serve as the quasi-legal basis for an impeachment case to be brought against the president – something Democrats have been threatening for weeks despite the fact that Trump has been in office just over 100 days. The idea is to unseal the indictment after Trump has been impeached.\n\nFirst, the pair mentions the “Supremacy Clause” in their story as the reason why Trump, as president, cannot simply be indicted. But the Supremacy Clause has nothing to do with it; that phrase relates to Article VI, Sect. 2 of the Constitution, which says that the nation’s founding document, federal laws made pursuant to it and all treaties constitute the supreme law of the land, taking precedence over state laws when there is a conflict. (RELATED: Corrupt DNC Actually Admits It Rigged The Democratic Presidential Nomination For Hillary Clinton)\n\nThe only constitutionally prescribed remedy for removing a president from office is impeachment, which has nothing to do with the Supremacy Clause. That said in Nixon v. Fitzgerald, the U.S. Supreme Court ruled 5-4 that while a president is immune from lawsuits for official acts that did not violate clearly established laws, presidents can be held liable for criminal actions, but only after they are either removed from office or have left office after a term (or two).\n\nThis story does not mention what charges were filed against Trump to get an indictment and moreover, who issued the indictment. It seems far-fetched at best to believe that it could have come from the Justice Department or a federal prosecutor without the president knowing. That would leave a state court, most likely, and that may trigger a genuine constitutional crisis.\n\nFurthermore, Mensch’s own Freedom of Information Act (FOIA) lawyer, Mark S. Zaid, has his doubts about his client’s veracity, as noted at Twitchy. In a series of tweets, Zaid appeared to distance himself from Mensch, stating if she’s right, it’s the scoop of a lifetime but if she’s wrong, she and Taylor – who says he worked on President Bill Clinton’s White House staff – would lose whatever credibility they have left.\n\nBut the premise of Trump being railroaded by bogus charges – or any charges at this point – is valid, considering that the Deep State has it in for him and members of both political parties, as well as the establishment media, have pulled out all the stops to delegitimize his administration, thwart his agenda and get rid of him. Which all means he must really be a danger to them.\n\nAnd every single day, the Trump Derangement Syndrome becomes more and more profound.\n\nIt’s no secret that the President’s enemies want him out of office, but actionable or prosecutable evidence has yet to be presented to the public.\n\nThis may explain why, rather than targeting trump, the Deep State has been taking out Trump’s lieutenants in an attempt to sabotage the new administration.\n\nIt is not clear whether reports of the secret indictment are real or fake, but we expect a follow-up Tweet from the President in due course as this story makes the rounds on social media.\n\nThis kind of open hostility and contempt for a president is unprecedented in the modern era. There is absolutely no way in the world the establishment media and the far-Left Democratic Party would have stood for this kind of abuse heaped at Barack Obama, despite the fact that he routinely violated the Constitution and his oath of office. (RELATED: Democrats’ goal is to overthrow Trump presidency, even if they have to destroy America in the process)\n\nHowever, if they are successful in bringing down this duly elected, constitutional president, as the Patribotics.blog suggests, the proverbial stuff is going to hit the fan. Trump supporters, Republicans, conservatives and even some Independents are going to see his coup as proof that all bets are off, that there is no legitimacy left in American government, and that all of “them” who comprise the Washington political establishment are the real enemies of freedom.\n\nIt was Thomas Jefferson who once said, “The tree of liberty must be refreshed from time to time with the blood of patriots and tyrants.” Have we reached that point? It depends on what happens to our president.\n\nJ.D. Heyes is a senior writer for NaturalNews.com and NewsTarget.com, as well as editor of The National Sentinel.", "opengraph": {"title": "Has Trump already been indicted? Civil war could follow if Deep State takes out duly elected president", "type": "article", "url": "2017-05-17-has-trump-already-been-indicted-civil-war-could-follow-if-deep-state-takes-out-duly-elected-president.html", "site_name": "White House News", "description": "An “exclusive” report published online Monday claims that there has been a secret indictment against President Donald J. Trump, citing “separate sources” linked “to the intelligence and Justice communities.", "image": "wp-content/uploads/sites/80/2017/05/Trump-Donald-Thumbs-Up-Rally-2016-Flag.jpg", "locale": "en_US", "updated_time": "2017-05-17T12:09:51+00:00", "image:width": "1200", "image:height": "676", "image:type": "image/jpeg", "article:published_time": "2017-05-17T12:09:51+00:00", "article:modified_time": "2017-05-17T12:09:51+00:00", "article:author": "author/jdheyes", "article:publisher": "/", "article:section": "Politics", "article:tag": "president donald j. trump"}, "tags": ["President Donald J. Trump", "impeachment", "indictment", "civil war"], "tweets": [], "movies": [], "links": ["http://www.clinton.news/2017-05-04-corrupt-dnc-actually-admits-it-rigged-the-democratic-presidential-nomination-for-hillary-clinton.html", "http://twitchy.com/samj-3930/2017/05/14/well-this-is-awkward-louise-menschs-lawyer-tweets-concerns-about-her-credibility/", "https://twitter.com/TrueFactsStated", "http://DeepState.news", "http://www.shtfplan.com/headline-news/rumors-swirl-intelligence-sources-report-that-a-secret-indictment-has-been-issued-against-president-donald-trump_05142017?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+SHTFplan+%28SHTF+Plan+-+When", "http://trump.news/2017-05-11-democrats-goal-is-to-overthrow-trump-presidency-even-if-they-have-to-destroy-america.html", "https://thenationalsentinel.com/2017/05/15/democrats-goal-is-to-overthrow-trump-presidency-even-if-they-have-to-destroy-america-in-the-process/", "http://www.thenationalsentinel.com/", "http://twitchy.com/samj-3930/2017/05/14/well-this-is-awkward-louise-menschs-lawyer-tweets-concerns-about-her-credibility/", "http://www.shtfplan.com/headline-news/rumors-swirl-intelligence-sources-report-that-a-secret-indictment-has-been-issued-against-president-donald-trump_05142017?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+SHTFplan+%28SHTF+Plan+-+When", "https://thenationalsentinel.com/2017/05/15/democrats-goal-is-to-overthrow-trump-presidency-even-if-they-have-to-destroy-america-in-the-process/", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2017-05-17-has-trump-already-been-indicted-civil-war-could-follow-if-deep-state-takes-out-duly-elected-president.html&linkname=Has%20Trump%20already%20been%20indicted%3F%20Civil%20war%20could%20follow%20if%20Deep%20State%20takes%20out%20duly%20elected%20president", "https://www.addtoany.com/share"], "authors": [], "publish_date": "2017-05-17T12:09:51+00:00"}