{"result_id": "342026", "URL": "http://www.whitehouse.news/2022-04-04-centralized-digital-currency-coming-no-privacy-autonomy.html", "timestamp": "2023-04-25 18:12:54 CEST+0200", "meta": {"description": "The World Government Summit recently disclosed new details on the creation of a centralized, programmable digital currency. The Biden regime is now experimenting with a U.S. Central Bank Digital Currency (CBDC) on a “multi-country experimental” basis. A totalitarian “new world order” is being normalized; compliance is being financially rewarded. Covid-19 propaganda and unlawful mandates did […]", "lang": "en", "keywords": "accounting systems,behavioral control,body autonomy,Central Bank Digital Currency,digital currency,financial control,financial surveillance,government subservience,Klaus Schwab,new world order,personal digital identity,privacy,resource distribution,state power,World Government Summit", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "http://www.whitehouse.news/2022-04-04-centralized-digital-currency-coming-no-privacy-autonomy.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "World Government Summit: A centralized, digital currency is coming, and there will be no individual privacy or autonomy", "cleaned_text": "World Government Summit: A centralized, digital currency is coming, and there will be no individual privacy or autonomy\n\nThe World Government Summit recently disclosed new details on the creation of a centralized, programmable digital currency. The Biden regime is now experimenting with a U.S. Central Bank Digital Currency (CBDC) on a “multi-country experimental” basis. A totalitarian “new world order” is being normalized; compliance is being financially rewarded.\n\nCovid-19 propaganda and unlawful mandates did not solve infectious disease, respiratory illness, medical error or immunodeficiency. In fact, these problems only worsened over the past two years, as governments instilled mass formation psychosis, suspending civil liberties and the rule of law. But these acts of subjugation and abuse were never intended to improve anything – not treatments, not the quality of life, nothing. Instead, covid-19 mandates have conditioned populations to accept totalitarian control over their lives. The collective subconscious is now adapted to a world that is less free – a world that is more submissive to fraudulent powers and false authorities. This is a necessary step to implement a “great reset” or a “new world order.”\n\nWe are on the brink of a new financial world order\n\nPuppet U.S. president Joe Biden recently spoke about the impending “new world order.” “Now is a time when things are shifting,” Biden told a round table of CEOs at a quarterly meeting on March 21. “There’s going to be a new world order out there, and we’ve got to lead it. And we’ve got to unite the rest of the free world in doing it.”\n\nSo what is this “new world order” that Biden is talking about? This “new world order” most likely refers to a “new financial order.” Biden recently signed an executive order exploring “a U.S. Central Bank Digital Currency (CBDC).” The order places “urgency on research and development of a potential United States CBDC, should issuance be deemed in the national interest.” The government now warns of upcoming Russian cyber attacks. Will these cyber attacks be a false flag operation to implement this digital currency “in the national interest?” The federal government is currently developing the technological infrastructure to implement the digital dollar and working with the Federal Reserve bank to implement this system in the near future. This effort includes “multi-country experimentation” to “ensure U.S. leadership internationally.” America is trying to “lead” a “new world order” that is guided by a centralized, programmable digital currency.\n\nA new system of digital currency control was announced at the World Government Summit\n\nAt the World Government Summit in Abu Dhabi, a World Economic Forum (WEC) insider gave hints at what is to come. Pippa Malmgren is an American economist who advised former President George W. Bush. She advises presidents and prime ministers around the world and lectures on “the upside of COVID.” Malmgren’s values align with Klaus Schwab and the WEC, because she sees covid-19 as an opportunity for a great reset that prioritizes population control. During an interview at the World Government Summit, Malmgren ambitiously stated that a cashless society is coming.\n\n“We are on the brink of a dramatic change where we are about to, and I’ll say this boldly, we are about to abandon the traditional system of money and accounting and introduce a new one,” Malmgren said. “And the new one; the new accounting is what we call blockchain… It means digital, it means having an almost perfect record of every single transaction that happens in the economy, which will give us far greater clarity over what’s going on.” This means NO individual privacy and NO body autonomy rights.\n\nA centralized, government-controlled digital currency is coming. This new system of accounting and currency control would forever change the traditional banking system, upending accounting systems and implementing a new system of monetary control and enforcement of social credit scores and behavioral conditioning.\n\nMalmgren admitted the new digital currency “raises huge dangers in terms of the balance of power between states and citizens.” Malmgren said people will have no privacy, so we’re going to need a “digital constitution of human rights.” The currency will be programmable and could readily be tied to a social credit score that monitors and oversees online activity, carbon footprint, vaccine status, religious beliefs and whatever woke ideas are in fashion at any given time. “The new digital currency will enforce “equitable distribution” of resources, including limits on gun and ammo purchases, food purchases (to regulate the food supply) and gasoline, etc. This digital system of compliance and control will implement a Personal Digital Identity, that will make it hard to buy and sell without it. Vaccine passports, mask mandates, digital certificates of PCR and vaccine compliance are just an appetizer for what is to come.\n\n“What I see is superpowers introducing digital currency,” Malmgren said. “The Chinese were the first. I think the US is on the brink of moving in the same direction. The Europeans have committed to that as well.” She asked, “Will that new system of digital money and digital accounting accommodate the competing needs of the citizens of all these locations so that every human being has a chance to have a better life? That’s the only measure for whether a world order really serves.”\n\nHer words reflect statements made by Klaus Schwab and the WEC: “You’ll own nothing and be happy.” Under this new system of surveillance and control, no one will will own their own body or property. Their behavior and activity will be controlled by central economic planners who surveil all purchases and dictate what people are allowed to buy and sell and what conditions they must meet in order to do so.", "opengraph": {"title": "World Government Summit: A centralized, digital currency is coming, and there will be no individual privacy or autonomy", "type": "article", "url": "https://www.whitehouse.news/2022-04-04-centralized-digital-currency-coming-no-privacy-autonomy.html", "site_name": "White House News", "description": "The World Government Summit recently disclosed new details on the creation of a centralized, programmable digital currency. The Biden regime is now experimenting with a U.S. Central Bank Digital Currency (CBDC) on a “multi-country experimental” basis. A totalitarian “new world order” is being normalized; compliance is being financially rewarded. Covid-19 propaganda and unlawful mandates did […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2022/04/Digital-Grid-Money-Cash-Dollar-Signs.jpg"}, "tags": ["state power", "privacy", "resource distribution", "body autonomy", "World Government Summit", "government subservience", "personal digital identity", "accounting systems", "Klaus Schwab", "Central Bank Digital Currency", "new world order", "financial surveillance", "behavioral control", "digital currency", "financial control"], "tweets": [], "movies": [], "links": ["https://leohohmann.com/2022/03/31/bombshell-video-economist-at-world-government-summit-says-new-financial-world-order-about-to-shift-in-dramatic-new-direction/", "http://mindcontrol.news", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/09/fact-sheet-president-biden-to-sign-executive-order-on-ensuring-responsible-innovation-in-digital-assets/", "https://twitter.com/backtolife_2022/status/1509213785931800578", "http://moneysupply.news", "http://tyranny.news", "https://leohohmann.com/2022/03/31/bombshell-video-economist-at-world-government-summit-says-new-financial-world-order-about-to-shift-in-dramatic-new-direction/", "https://www.whitehouse.gov/briefing-room/statements-releases/2022/03/09/fact-sheet-president-biden-to-sign-executive-order-on-ensuring-responsible-innovation-in-digital-assets/", "https://twitter.com/backtolife_2022/status/1509213785931800578", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2022-04-04-centralized-digital-currency-coming-no-privacy-autonomy.html&linkname=World%20Government%20Summit%3A%20A%20centralized%2C%20digital%20currency%20is%20coming%2C%20and%20there%20will%20be%20no%20individual%20privacy%20or%20autonomy", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}