{"result_id": "342007", "URL": "https://www.whitehouse.news/2022-10-04-covid-official-social-distancing-rule-made-up.html", "timestamp": "2023-04-25 18:12:42 CEST+0200", "meta": {"description": "Another leading White House Wuhan coronavirus (COVID-19) pandemic official has admitted that the federal government’s six-feet social distancing rule is not based on actual science. White House Coronavirus Response Coordinator Dr. Ashish Kumar Jha, during an Aug. 16 C-SPAN interview, admitted that he and his colleagues used to really believe and talk a lot about the so-called […]", "lang": "en", "keywords": "air ventilation,badhealth,badmedicine,badscience,big government,CDC,coronavirus,covid-19,health freedom,infections,lies,medical fascism,Medical Tyranny,outbreak,pandemic,science deception,science fraud,social distancing,truth,White House", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2022-10-04-covid-official-social-distancing-rule-made-up.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "White House COVID official admits six feet social distancing rule is MADE UP", "cleaned_text": "White House COVID official admits six feet social distancing rule is MADE UP\n\nAnother leading White House Wuhan coronavirus (COVID-19) pandemic official has admitted that the federal government’s six-feet social distancing rule is not based on actual science.\n\nWhite House Coronavirus Response Coordinator Dr. Ashish Kumar Jha, during an Aug. 16 C-SPAN interview, admitted that he and his colleagues used to really believe and talk a lot about the so-called science behind social distancing. Now, however, they have changed their minds. (Related: Email reveals Fauci flagged an op-ed denouncing social distancing in schools.)\n\n“There’s really a new way of thinking about who is going to get infected,” said Jha. “We used to spend a lot of time talking about six feet of distance, 15 minutes of being together. We realize that’s actually not the right way to think about this.”\n\n“What we know about this virus, particularly these very contagious subvariants that are out there right now, it is really about the quality of air you’re breathing around you,” Jha claimed. “In a crowded indoor space with poor ventilation, you can be infected within minutes.”\n\nJha went on to claim that good ventilation is more important than maintaining six feet of distance, and going outdoors might be a good way of not getting infected with COVID-19.\n\n“If you are outdoors with, obviously, by definition, good ventilation, you can be outside for long periods of time and not get infected,” he said. “So, context matters. Crowds matter. Ventilation matters. That is a major new update in the CDC [Centers for Disease Control and Prevention] guidance.”\n\nNew CDC guidance on preventing infection is nothing new\n\nKyle Becker, writing for Becker News, noted that the CDC’s updated COVID-19 guidance is “nothing new” and “should look very familiar to people whose COVID response was managed by governors in states like Texas and Florida.”\n\nAccording to the new guidance:\n• Individuals exposed to the coronavirus are no longer required to quarantine.\n• Unvaccinated individuals will abide by similar guidelines as vaccinated people.\n• Children who are exposed to the coronavirus do not have to be pulled out of class pending COVID-19 testing.\n• People exposed to COVID-19 but remain asymptomatic no longer have to be tested.\n\n“This guidance acknowledges that the pandemic is not over, but also helps us move to a point where COVID-19 no longer severely disrupts our daily lives,” said senior CDC scientist Greta Massetti. “We know that COVID-19 is here to stay.”\n\nMassetti further commended the CDC for bringing recommendations for unvaccinated people in line with the vaccinated. This, she said, is an acknowledgment by the agency of the high levels of immunity to the coronavirus in the United States. She added that this is granted to the population by natural immunity and by so-called vaccine immunity.\n\n“Based on the latest [data] … it’s around 95 percent of the population,” said Massetti. “And so it really makes the most sense to not differentiate.”\n\nDr. Marcus Plescia, chief medical officer for the Association of State and Territorial Health Officials, noted that the CDC’s latest update represents the agency’s turn to putting a greater emphasis on giving individuals – even children – the freedom to make their own decisions about the level of risk they want to take and how they want to mitigate that risk.\n\n“That is consistent with where we are in the pandemic right now,” said Plescia. “I don’t really think there are many state or local jurisdictions that are feeling [like] they’re going to need to start making [new] mandates.”\n\n“There was ample scientific literature from the beginning to demonstrate that it was extremely unlikely to get COVID outdoors,” wrote Becker. He also criticized CDC teaching on vaccines, which he said “never stopped viral transmission.”\n\n“It never made sense to screen people for asymptomatic transmission with routine PCR testing. It is ‘very rare’ for COVID to spread through surface contact. Masks don’t stop airborne viruses. The list goes on and on. Add ‘social distancing’ to the list.”\n\nRead more news about COVID-19 at Pandemic.news.\n\nWatch this episode of the “Health Ranger Report” as Mike Adams, the Health Ranger, interviews Kristen Megan about the junk science behind masks and social distancing.\n\nThis video is from the Health Ranger Report channel on Brighteon.com.\n\nBirx admits she and Fauci made up “the science” on social distancing, lockdowns.\n\nFormer FDA commissioner says six-feet social distancing rule is arbitrary, “nobody knows where it came from.”\n\nTargeting the next generation: Children’s book publishers pummeling kids with fear-based propaganda about sickness, masks and social distancing.\n\nNew study claims that six-foot social distancing rule indoors is ineffective in preventing coronavirus transmission.\n\nMasks, social distancing and virtual learning are really about the installation of COMMUNISM in America.", "opengraph": {"title": "White House COVID official admits six feet social distancing rule is MADE UP", "type": "article", "url": "https://www.whitehouse.news/2022-10-04-covid-official-social-distancing-rule-made-up.html", "site_name": "White House News", "description": "Another leading White House Wuhan coronavirus (COVID-19) pandemic official has admitted that the federal government’s six-feet social distancing rule is not based on actual science. White House Coronavirus Response Coordinator Dr. Ashish Kumar Jha, during an Aug. 16 C-SPAN interview, admitted that he and his colleagues used to really believe and talk a lot about the so-called […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2022/10/Woman-Mask-Bus-Isolation.jpg"}, "tags": ["pandemic", "social distancing", "big government", "covid-19", "medical fascism", "science deception", "air ventilation", "White House", "outbreak", "science fraud", "infections", "Medical Tyranny", "truth", "coronavirus", "lies", "health freedom", "CDC"], "tweets": [], "movies": [], "links": ["https://www.naturalhealth365.com/not-based-on-science-covid-experts-admit-guidelines-were-made-up.html", "https://naturalnews.com/2022-03-29-fauci-flags-article-denouncing-social-distancing-schools.html", "https://beckernews.com/the-covid-experts-effectively-admit-they-made-up-the-whole-6-feet-social-distancing-thing-46447/", "http://cdc.news", "https://www.npr.org/sections/health-shots/2022/08/11/1116991600/with-new-guidance-cdc-ends-test-to-stay-for-schools-and-relaxes-covid-rules", "https://healthfreedom.news/", "https://pandemic.news/", "https://www.brighteon.com/40d9c579-3945-4915-bb4f-e5e8cc94f1bd", "https://www.brighteon.com/channels/hrreport", "https://www.brighteon.com/channels/hrreport", "https://naturalnews.com/2022-07-25-birx-fauci-fake-science-social-distancing-lockdowns.html", "https://biggovernment.news/2021-09-23-former-fda-commissioner-social-distancing-rule.html", "https://pandemic.news/2021-09-24-childrens-book-publishers-pummeling-kids-with-propaganda.html", "https://outbreak.news/2021-05-18-study-distancing-indoors-ineffective-preventing-coronavirus-transmission.html", "https://naturalnews.com/2021-02-21-masks-social-distancing-virtual-learning-installing-communism.html", "https://www.naturalhealth365.com/not-based-on-science-covid-experts-admit-guidelines-were-made-up.html", "https://beckernews.com/the-covid-experts-effectively-admit-they-made-up-the-whole-6-feet-social-distancing-thing-46447/", "https://www.npr.org/sections/health-shots/2022/08/11/1116991600/with-new-guidance-cdc-ends-test-to-stay-for-schools-and-relaxes-covid-rules", "https://www.brighteon.com/40d9c579-3945-4915-bb4f-e5e8cc94f1bd", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2022-10-04-covid-official-social-distancing-rule-made-up.html&linkname=White%20House%20COVID%20official%20admits%20six%20feet%20social%20distancing%20rule%20is%20MADE%20UP", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}