{"result_id": "342038", "URL": "https://www.whitehouse.news/2023-02-24-global-elite-waging-genocidal-war-steve-quayle.html", "timestamp": "2023-04-25 18:13:02 CEST+0200", "meta": {"description": "There is a three-pronged war brewing that will soon escalate into a global world war of epic proportions. The West and Russia are now talking nukes; communist China continues to make threats on Taiwan; and the powers that be are waging a chemical and social war on the American people. This genocidal war on Americans […]", "lang": "en", "keywords": "China,Dangerous,deep state,depopulation,fascism,genocide,Globalism,globalist elite,Health Ranger Report,national security,nuclear war,Russia,Steve Quayle,Tyranny,WWIII", "favicon": "wp-content/themes/NTTheme/images/Newstarget-fav.png", "canonical": "https://www.whitehouse.news/2023-02-24-global-elite-waging-genocidal-war-steve-quayle.html", "encoding": "UTF-8"}, "image": null, "domain": "www.whitehouse.news", "title": "The global elite are waging a genocidal war against We the People – WATCH as Mike Adams and Steve Quayle reveal key details", "cleaned_text": "The global elite are waging a genocidal war against We the People – WATCH as Mike Adams and Steve Quayle reveal key details\n\nThere is a three-pronged war brewing that will soon escalate into a global world war of epic proportions. The West and Russia are now talking nukes; communist China continues to make threats on Taiwan; and the powers that be are waging a chemical and social war on the American people.\n\nThis genocidal war on Americans is the primary topic of discussion in the following episode of the Health Ranger Report. Steve Quayle sat down with Mike Adams to talk about how very real things are getting.\n\n“This is the most perilous time that I can remember happening in real time in over 35 years of broadcasting in real time,” Quayle stated.\n\n“What I think is critical is that we’re now seeing statements coming out of the IMF that billions of people are going to die, that war is going to happen – this Friday we are seeing absolute movement of tanks and artillery, NATO movements into Romania, also into pre-staging to go into Ukraine.”\n\n“Every red line that Russia has stated would be their end red line – people don’t realize that we the West have declared war on Russia, there’s no doubt, there’s no getting away from it, we in the West destroyed the Nord Stream pipeline … and now we’re watching in real time massive readings, people that monitor radiation levels around the world – I’ve never seen such high counts, of counts per minute.”\n\nChina just broke all communications with the United States – something BIG is about to happen\n\nThe disaster in East Palestine, which released the largest chemical dioxin plume in history, is only the tip of the iceberg. It would appear as though the world’s global superpowers are now poised to strike all at once, unleashing hell on earth like never before.\n\n“China just broke all communications with the U.S.,” Quayle revealed to Adams, explaining the severity of such a move. “The military hotlines work, but China will not respond in any way, shape, or form.”\n\n“When goods don’t cross borders, armies do. And when communications cease, unfortunately that’s the worst sign in the world because something is getting ready to happen (i.e., an attack on Taiwan, and a nuclear first strike on America).”\n\nMeanwhile, the Biden regime’s State Department is acting as though all is well, claiming that Russia does not really mean any of the things it is saying right now. Quayle says this is “the greatest act of delusion promulgated by any defensive force.”\n\n“The same people who are burning the food warehouses, destroying the farmland, they’re all being orchestrated out of Washington, D.C. People need to understand: war has been declared on you.”\n\nThis is an interview you will not want to miss – the most important, perhaps, of all the interviews Adams has ever conducted. Be sure to take the time to watch it above.\n\n“The genocide of the majority of the human population by evil demonic-influenced people has been ongoing since The Fall but took on a new diabolical level during WWII when the invention of the nuclear bomb indicated that some men would not hesitate to annihilate all people as “collateral damage” in taking out their enemy,” wrote someone in response to the video.\n\n“And as the decades have passed and each generation of demonic-influenced men figure out that through science and technology, they can exterminate people, they too have never hesitated to do so.”\n\nMore related news coverage about escalating world war can be found at WWIII.news.", "opengraph": {"title": "The global elite are waging a genocidal war against We the People – WATCH as Mike Adams and Steve Quayle reveal key details", "type": "article", "url": "https://www.whitehouse.news/2023-02-24-global-elite-waging-genocidal-war-steve-quayle.html", "site_name": "White House News", "description": "There is a three-pronged war brewing that will soon escalate into a global world war of epic proportions. The West and Russia are now talking nukes; communist China continues to make threats on Taiwan; and the powers that be are waging a chemical and social war on the American people. This genocidal war on Americans […]", "image": "https://www.whitehouse.news/wp-content/uploads/sites/80/2023/02/steve-quayle-coronavirus-2020-03-18.png"}, "tags": ["globalist elite", "Health Ranger Report", "fascism", "deep state", "national security", "nuclear war", "Russia", "Dangerous", "WWIII", "genocide", "Steve Quayle", "depopulation", "China", "Tyranny", "Globalism"], "tweets": [], "movies": [], "links": ["https://www.brighteon.com/bba280df-9fa9-4f6d-9dc0-8f7af6eac17b", "https://naturalnews.com/2022-12-11-watch-steve-quayle-globalist-plan-mass-depopulation.html", "https://www.naturalnews.com/2023-02-17-east-palestine-train-wreck-largest-dioxin-plume.html", "http://wwiii.news", "https://www.brighteon.com/bba280df-9fa9-4f6d-9dc0-8f7af6eac17b", "https://naturalnews.com/2022-12-11-watch-steve-quayle-globalist-plan-mass-depopulation.html", "https://www.naturalnews.com/2023-02-17-east-palestine-train-wreck-largest-dioxin-plume.html", "https://www.addtoany.com/add_to/google_plus?linkurl=%2Fwhitehousenews%2F2023-02-24-global-elite-waging-genocidal-war-steve-quayle.html&linkname=The%20global%20elite%20are%20waging%20a%20genocidal%20war%20against%20We%20the%20People%20%E2%80%93%20WATCH%20as%20Mike%20Adams%20and%20Steve%20Quayle%20reveal%20key%20details", "https://www.addtoany.com/share", "https://support.naturalnews.com/Feedback.html"], "authors": [], "publish_date": null}