{"result_id": "343008", "URL": "https://wikispooks.com/wiki/Sputnik_V", "timestamp": "2023-04-25 18:13:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Sputnik_V", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Sputnik V - Wikispooks", "cleaned_text": "The Gam-COVID-Vac – trade-named Sputnik V (V for vaccine) – is a COVID-19 jab developed by the Gamaleya Research Institute of Epidemiology and Microbiology.\n\nSimilar to its Western counterparts, Sputnik V was approved in record time, despite having been tested only in a small number of people in early-stage clinical trials that lasted two months. Protests soon developed in the international scientific community over this, and the lack of publication of results from clinical trials.[1]\n\nHerman Gref, CEO and chairman of the executive board of the largest Russian bank Sberbank and member of the World Economic Forum’s board of trustees, played a prominent role in the development and production of Sputnik V.\n\nAs in the rest of the world, the injection status is being used to remove bodily autonomy with vaccine mandates, and introduce vaccine passports.\n\nThe Phase I-II results were eventually published on 4 September 2020, the Phase III trial – a necessary scientific step to prove vaccine safety and efficacy in billions of individuals – had not yet been completed in its entirety[2]\n\nIn December 2020, the Gamaleya Research Institute published preliminary data on 22,714 participants of its phase III trials[3]\n\nGamaleya revealed in December 2020 that many of those who received a placebo during the clinical trials for Sputnik V later got the actual vaccine, thinning out the control group.[4]\n\nSputnik V represents Gamaleya’s fifth attempt at creating a vaccine — its four previous attempts either failed or are still in trials.[5]\n\nSputnik V is a viral two-vector vaccine based on two human adenoviruses — a common cold virus — containing the gene that encodes the spike protein of SARS-CoV-2 to stimulate an immune response. The recombinant adenovirus type-26 (rAd26, component I) and adenovirus type-5 (rAd5, Component II) are both used as vectors in the vaccine. Both of them are administered intramuscularly: the rAd26 based vaccine is used on the first day and the rAd5 vaccine is used on the 21st day to boost response.\n\nSputnik V can be formulated as frozen (storage temperature is −18 °C) and freeze-dried \"Gam-COVID-Vac-Lyo\" (storage temperature is 2–8 °C) dosage forms. The first formulation was developed for large-scale use, it is cheaper and easier to manufacture. The production of a lyophilised formulation takes much more time and resources, although it is more convenient for storage and transportation. It is then diluted before injection.[6]\n\nIn violation of the most important testing standards\n\nA group of scientists from leading Russian universities has blasted the development process of Russia’s Sputnik V coronavirus vaccine as “completely unacceptable” and “ridiculous” in an open letter[7] raising new concerns over a lack of sufficient data on its safety and effectiveness.\n\nThe race-like atmosphere made the vaccine developers “hostage” to Russia’s political goals, they said. “It threatens the benign testing of the vaccine and, therefore, poses a threat to the health of Russians.” [8]\n\nThe experts said Russia’s state-run Gamaleya Research Institute, which is developing the vaccine, has ignored requests to share data — despite public pledges to do so — and have raised fresh fears over political meddling and a string of alleged shortcomings in the vaccine research.\n\nThe group heavily criticized Russia’s decision to start a mass vaccination program — which is officially only open to healthcare workers and teachers under the age of 60 with no underlying health conditions — while large-scale medical trials were still at such an early stage.\n\n“This completely unacceptable — even ridiculous — political action to create a competition between vaccines is in violation of the most important testing standards,” wrote the scientists — led by Vasiliy Vlassov, an esteemed epidemiologist at Moscow’s Higher School of Economics, along with Olga Rebrova, a professor at the Russian National Research Medical University, and Valery Aksyonov, scientific editor of Bionica Media.\n\nOther Russian doctors told The Moscow Times they were highly skeptical about taking the vaccine[9].\n\nOn 11 December 2020, AstraZeneca announced a clinical trial programme to assess safety and immunogenicity of a combination of AZD1222 and Sputnik V, developed by the Russian Gamaleya Research Institute. Dr Zoltán Kis, Research Associate at the Future Vaccine Manufacturing Hub, Imperial College (London), said:\n\n“Both the AstraZeneca/Oxford vaccine candidate and the Sputnik V vaccine are adenovirus vectored vaccines and both deliver genetic instructions for the cells of the body to produce the Spike protein of SARS-CoV-2. The AZD1222 vaccine candidate is based on a chimpanzee adenovirus and the Sputnik V vaccine is based on a human adenovirus, thus the vectors (or carriers) of these two vaccines are slightly different. “The immune system of the human body can generate an immune response against the adenoviral vector itself, thus if a second dose of the same adenovirus vectored vaccine is delivered, the immune system could destroy the vector, before the payload of the vaccine is delivered, therefore reducing the efficacy of the second vaccine dose. On the other hand, if the vector of the second (booster) dose of the vaccine is different from the vector of the first (prime) dose, the immune system will be less likely to destroy the vector of the vaccine, thus the efficacy of the heterologous boosting vaccination could be increased, compared to the situation where both the prime and boost doses were of the same vector type. Therefore, the reason why heterologous boosting could increase vaccine efficacy, is that the (partial) destruction of the second vaccine dose by the immune system can be avoided and because both vaccines contain instructions for producing the same antigen. “Furthermore, having the possibility of combining these two vaccine types would allow for greater flexibility in the vaccination programs. This could lead to greater accessibility to vaccines, thus increasing the rate and scale of Covid-19 vaccination coverage. “For these reasons, the news regarding clinical trials of this heterologous boosting Covid-19 vaccination is a promising one.”[10]\n\nIn October 2021, it was reported in the British media that the two vaccines are identical. Russia allegedly stole the original blueprints from Oxford University.[11][12]\n\nThere is no Russian VAERS-like database, and Russian corporate media has been largely silent on the subject of adverse reactions. Word-of-mouth warnings of severe effects has led to resistance to taking the injection, leading to government coercive measures.\n\nAs with its Western counterparts, many of those who received a placebo during the clinical trials for Sputnik V later got the actual vaccine, thinning out the control group.[14]\n\nA document leaked to Russian media in August 2020 showed that adverse events from the vaccine were “occurring frequently and very often.” While some of the side effects were mild and passed quickly, others apparently lingered on indefinitely[15][16]:\n\nIn October 2021, director Alexander Gintsburg revealed a previously undisclosed fact, that Sputnik V contains a tracker able to determine someone’s vaccination status:", "opengraph": {"image": "https://wikispooks.com/w/images/4/48/Kirill_sputnik.png"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/File:Tools.png", "http://anoniem.org?https://en.wikipedia.org/wiki/Gam-COVID-Vac", "/wiki/COVID-19/Vaccine", "https://wikispooks.com/w/index.php?title=Special:ExportRDF/Sputnik_V", "https://wikispooks.com/w/index.php?title=Special:Browse/:Sputnik_V", "/wiki/File:Kirill_sputnik.png", "/wiki/VAERS", "/wiki/Andrey_Botikov", "/wiki/Herman_Gref", "/wiki/Guinea/2021_coup_d%27%C3%A9tat", "/wiki/Russian", "/wiki/COVID-19/Vaccine", "/wiki/COVID-19_jab", "/wiki/Gamaleya_Research_Institute_of_Epidemiology_and_Microbiology", "/wiki/COVID-19/Vaccine/Authorisation", "#cite_note-1", "/wiki/Herman_Gref", "/w/index.php?title=Sberbank&action=edit&redlink=1", "/wiki/World_Economic_Forum", "/wiki/Bodily_autonomy", "/wiki/Vaccine/Mandation", "/wiki/Vaccine_passports", "#Diluted_phase_III_trial", "#Two-vector_vaccine", "#In_violation_of_the_most_important_testing_standards", "#Combining_with_AZD1222", "#Injuries_and_death", "#Contains_a_tracker", "#Geography", "#References", "#cite_note-2", "/wiki/Gamaleya_Research_Institute", "#cite_note-3", "#cite_note-4", "#cite_note-5", "/wiki/SARS-CoV-2", "/wiki/Gam-COVID-Vac-Lyo", "#cite_note-6", "#cite_note-7", "#cite_note-8", "/wiki/Gamaleya_Research_Institute", "/wiki/Moscow", "/w/index.php?title=Higher_School_of_Economics&action=edit&redlink=1", "/w/index.php?title=Olga_Rebrova&action=edit&redlink=1", "/w/index.php?title=Russian_National_Research_Medical_University&action=edit&redlink=1", "/w/index.php?title=Valery_Aksyonov&action=edit&redlink=1", "/w/index.php?title=Bionica_Media&action=edit&redlink=1", "/wiki/The_Moscow_Times", "#cite_note-9", "/wiki/AstraZeneca", "/wiki/AZD1222", "/wiki/Russia", "/wiki/Gamaleya_Research_Institute", "/w/index.php?title=Zolt%C3%A1n_Kis&action=edit&redlink=1", "/wiki/Imperial_College", "/wiki/AZD1222", "/wiki/AZD1222", "/wiki/Covid-19_vaccination", "/wiki/Covid-19_vaccination", "#cite_note-10", "/wiki/Oxford_University", "#cite_note-11", "#cite_note-12", "/wiki/File:Argentina_sputnik_V.png", "/wiki/File:Argentina_sputnik_V.png", "#cite_note-13", "/wiki/Argentina", "/wiki/VAERS", "/wiki/Corporate_media", "/w/index.php?title=Placebo&action=edit&redlink=1", "#cite_note-14", "#cite_note-15", "#cite_note-16", "/w/index.php?title=Alexander_Gintsburg&action=edit&redlink=1", "#cite_note-17", "/wiki/San_Marino", "/wiki/COVID_vaccine", "#cite_note-18", "/wiki/Bahrain", "#cite_note-19", "/wiki/Argentina", "/wiki/Belarus", "/wiki/Guinea", "/wiki/Hungary", "/wiki/Serbia", "/wiki/Pakistan", "/wiki/Philippines", "/wiki/United_Arab_Emirates", "#cite_ref-1", "https://www.bmj.com/content/370/bmj.m3205", "#cite_ref-2", "https://sputnikvaccine.com/newsroom/pressreleases/the-sputnik-v-vaccine-s-efficacy-is-confirmed-at-91-4-based-on-data-analysis-of-the-final-control-po/", "#cite_ref-3", "https://www.themoscowtimes.com/2020/11/13/more-countries-line-up-for-russias-sputnik-v-coronavirus-vaccine-a72042", "#cite_ref-4", "https://www.bbc.com/russian/news-55436957", "#cite_ref-5", "https://www.osnmedia.ru/obshhestvo/akademik-redko-obvinil-sozdatelej-sputnika-v-v-neeffektivnosti-vaktsiny/", "#cite_ref-6", "https://www.reuters.com/article/health-coronavirus-russia-vaccine-transp/rpt-exclusive-russia-focuses-on-freeze-dried-vaccine-doses-as-transport-fix-idUSL1N2I30ML", "#cite_ref-7", "https://trv-science.ru/2020/11/covid-19-logunov-retraction/", "#cite_ref-8", "https://www.themoscowtimes.com/2020/12/10/gross-violation-in-open-letter-russian-scientists-criticize-lack-of-vaccine-data-a72311", "#cite_ref-9", "https://www.themoscowtimes.com/2020/12/08/as-russia-begins-mass-coronavirus-vaccination-its-medics-arent-on-board-a72265", "#cite_ref-10", "https://www.sciencemediacentre.org/expert-reaction-to-astrazeneca-announcing-clinical-trial-programme-to-assess-combination-of-the-oxford-astrazeneca-vaccine-and-the-sputnik-v-vaccine/", "#cite_ref-11", "https://www.dailymail.co.uk/news/article-10080281/Kremlin-dismisses-unscientific-claims-Russia-STOLE-blueprint-Oxford-AstraZeneca-jab.html?ns_mchannel=rss&ns_campaign=1490&ito=1490", "#cite_ref-12", "https://www.independent.co.uk/news/world/europe/russia-astrazeneca-vaccine-blueprint-sputnik-b1935992.html", "#cite_ref-13", "https://bancos.salud.gob.ar/sites/default/files/2021-09/14o-informe-de-vigilancia-de-seguridad-en-vacunas.pdf", "#cite_ref-14", "https://www.bbc.com/russian/news-55436957", "#cite_ref-15", "https://www.fontanka.ru/2020/08/11/69416050/", "#cite_ref-16", "https://edwardslavsquat.substack.com/p/sputnik-v-is-sketchy", "#cite_ref-17", "https://tass.ru/obschestvo/12750415", "#cite_ref-18", "https://www.express.co.uk/news/world/1472461/EU-vaccine-latest-European-Union-Covid-certificate-news-san-marino-sputnik-V-video-VN", "#cite_ref-19", "https://www.reuters.com/world/middle-east/bahrain-approves-third-booster-shot-sputnik-v-vaccine-2021-09-04/", "/wiki/Wikispooks", "/wiki/Wikipedia", "/wiki/Wikipedia", "https://en.wikipedia.org/w/index.php?title=Gam-COVID-Vac&oldid=997028613"], "authors": [], "publish_date": null}