{"result_id": "343023", "URL": "https://wikispooks.com/wiki/Moncef_Slaoui", "timestamp": "2023-04-25 18:13:13 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Moncef_Slaoui", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Moncef Slaoui - Wikispooks", "cleaned_text": "Moncef Mohamed Slaoui is a Moroccan-born Belgian-American researcher and former head of GlaxoSmithKline's vaccines department. On May 15, 2020, Donald Trump announced that Slaoui would manage the U.S. government's Operation Warp Speed, a rush development to deliver 300 million doses of a COVID-19 jab by January 2021. In March 2021 he was \"fired from a joint venture of GlaxoSmithKline over allegations of sexual harassment\".[1][2]\n\nAfter Slaoui received his PhD, he moved to the United States with his girlfriend, who was doing post-doctoral research on influenzas. She got a position at SmithKline-RIT (which would later become part of GlaxoSmithKline) in Belgium, a center for vaccine research,and Slaoui got a job teaching immunology at the University of Mons in Belgium.\n\nIn 1988, after consulting SmithKline-RIT for three years, Slaoui joined the company as a vaccine researcher. In 2006, he was appointed head of research and development at GlaxoSmithKline, succeeding Tachi Yamada. In 2012, he oversaw GSK's purchase of Human Genome Sciences for over $3 billion.\n\nSlaoui oversaw the development of numerous vaccines, including Cervarix against cervical cancer, and reported tied to multiple deaths or severe crippling effects in many recipients. In 2015 the Indian Supreme Court investigated charges that young Indian village girls died after being given Cervarix from Slaoui’s GSK. It was done in illegal vaccine “human guinea pig” tests of the HPV vaccine where neither the girls nor their parents were told what it was. The study was reportedly funded by the Bill and Melinda Gates Foundation.[3]\n\nAs Chairman of Global Vaccines, Dr. Slaoui was directly involved in the GSK's vaccine pipeline, which led the industry during his time, with the broadest portfolio of vaccines of any company—48—and the creation of 14 new vaccines in ten years. [4]\n\nIn 2012 while Slaoui headed GSK global R&D and vaccine development, and sat on the GSK board, the company was fined $3 billion by the US Department of Justice, the largest ever fine against a pharmaceutical company. Among the charges was that GlaxoSmithKline deliberately withheld alarming safety data for its major-selling diabetes drug, Advandia, from the US FDA.\n\nA 2017 WHO monitoring report revealed that serious adverse effects from his’s HPV vaccine included complex regional pain syndrome (CRPS), postural orthostatic tachycardia syndrome (POTS) and chronic fatigue syndrome (CFS) that “exceeds any other vaccine.”[5]\n\nHe also spent 27 years researching on a malaria vaccine, Mosquirix, that was approved by the European Medicines Agency in 2015 and touted as the first in the world. In 2016, he discussed GSK's development of bioelectronic medicine.\n\nThe Slaoui Center for Vaccines Research in Rockville, Maryland—named after Slaoui and GSK's first research and development institute in the United States—was opened on December 14, 2016.\n\nIn September 2017, after leaving GSK, Slaoui joined European venture capital firm Medicxi and Chairman of the Board at Galvani, a bioelectronics R&D company company jointly owned by GlaxoSmithKine (GSK) and Verily Life Sciences.\n\nAfter leaving GSK from 2017 until he joined the Trump Operation Warp Speed in 2020, Slaoui was on the Board of Directors of the pharmaceutical company Moderna. He still holds $10 million worth of Moderna stock options.\n\nModerna claims that between January 11, when they got the DNA sequence of the virus from China, and January 13–in just two days–working together with Anthony Fauci’s National Institute of Allergies and Infectious Diseases (NIAID) of NIH, they managed to finalize the sequence for mRNA1273 vaccine against the novel coronavirus. At that point Fauci announced unprecedented plans to run human Phase I trials of the vaccine without prior animal studies. The FDA waived animal pretest requirements. The Moderna mRNA1273 tests were funded by the Bill & Melinda Gates Foundation-funded Coalition for Epidemic Preparedness Innovations (CEPI).[6]\n\nThe company states that on April 16, Moderna got an award from US government agency BARDA for $483 million to accelerate development of mRNA-1273. This award will fund the development of mRNA-1273 to FDA licensure and manufacturing process scale-up to enable large-scale production in 2020 for pandemic response. Then, on May 1, Moderna and Lonza Group announced a worldwide strategic collaboration to manufacture mRNA-1273 at a planned 1 billion doses per year. [7]", "opengraph": {"image": "https://wikispooks.com/w/images/0/00/30090786934_70c87085de_c.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/Has_companieshouse:", "/wiki/Has_companiesintheuk:", "/wiki/Has_companycheck:", "/wiki/Has_companydirectorcheck:", "/wiki/GlaxoSmithKline", "/wiki/Donald_Trump", "/wiki/Operation_Warp_Speed", "/wiki/COVID-19_jab", "#cite_note-1", "#cite_note-2", "#Career_at_GlaxoSmithCline", "#Cervarix", "#Other_vaccines", "#Covid-19_and_Moderna", "#References", "/wiki/GlaxoSmithKline", "/w/index.php?title=University_of_Mons&action=edit&redlink=1", "/wiki/Belgium", "/wiki/Researcher", "/wiki/Tachi_Yamada", "/w/index.php?title=Cervarix&action=edit&redlink=1", "/wiki/Bill_and_Melinda_Gates_Foundation", "#cite_note-3", "#cite_note-4", "/wiki/FDA", "#cite_note-5", "/w/index.php?title=Slaoui_Center_for_Vaccines_Research&action=edit&redlink=1", "/wiki/Galvani", "/w/index.php?title=Verily_Life_Sciences&action=edit&redlink=1", "/wiki/Moderna", "/wiki/Anthony_Fauci", "/w/index.php?title=National_Institute_of_Allergies_and_Infectious_Diseases&action=edit&redlink=1", "/wiki/Bill_%26_Melinda_Gates_Foundation", "/wiki/Coalition_for_Epidemic_Preparedness_Innovations", "#cite_note-6", "#cite_note-7", "#cite_ref-1", "https://www.cbsnews.com/news/moncef-slaoui-glaxosmithkline-board-sexual-harassment-claims/", "#cite_ref-2", "https://www.cnbc.com/2021/03/24/moncef-slaoui-fired-from-galvani-bioelectronics-board-of-directors-over-sexual-harassment-allegations.html", "#cite_ref-3", "https://journal-neo.org/2020/05/18/the-warp-speed-push-for-coronavirus-vaccines/", "#cite_ref-4", "https://www.hhs.gov/about/news/2020/05/15/trump-administration-announces-framework-and-leadership-for-operation-warp-speed.html", "#cite_ref-5", "https://www.anhinternational.org/2017/01/18/official-hpv-vaccine-vaccine-dangerous-yet/", "#cite_ref-6", "https://journal-neo.org/2020/05/18/the-warp-speed-push-for-coronavirus-vaccines/", "#cite_ref-7", "https://www.modernatx.com/modernas-work-potential-vaccine-against-covid-19"], "authors": [], "publish_date": null}