{"result_id": "343009", "URL": "https://wikispooks.com/wiki/AstraZeneca", "timestamp": "2023-04-25 18:13:08 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/AstraZeneca", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "AstraZeneca - Wikispooks", "cleaned_text": "AstraZeneca plc is a London-based British-Swedish multinational Big Pharma company. On 30 December 2020, the UK Department of Health and Social Care announced:\n\nAstraZeneca was founded in 1999 through the merger of the Swedish Astra AB and the British Zeneca Group (itself formed by the demerger of the pharmaceutical operations of Imperial Chemical Industries in 1993).[2][3] Since the merger AZN has been among the world's largest pharmaceutical companies and has made numerous corporate acquisitions, including Cambridge Antibody Technology (in 2006), MedImmune (in 2007), Spirogen (in 2013) and Definiens (by MedImmune in 2014).\n\nAlso since the merger, the combined company has been embroiled in numerous controversies over illegal marketing, product safety, anticompetitive behavior and tax avoidance.\n\nIn 2013, AstraZeneca moved its headquarters to Cambridge, United Kingdom, and concentrated its R&D in three sites: Cambridge; Gaithersburg, Maryland, USA (location of MedImmune) for work on biopharmaceuticals; and Mölndal (near Gothenburg) in Sweden, for research on traditional chemical drugs.[4]\n\nIn March 2020, AstraZeneca announced that it would be donating personal protective equipment, including 9 million face masks, to help support various international health organisations mitigate the COVID-19 pandemic.[5]\n\nReuters reported in July 2020 that AstraZeneca was \"to be exempt from coronavirus vaccine liability claims in most countries\".[6]\n\nIn April 2020, CEO Pascal Soriot reported that the company was working with GlaxoSmithKline and the University of Cambridge to develop a new laboratory capable of conducting 30,000 COVID-19 tests per day.[8]\n\nOn 21 May 2020, AZN announced it had received support of more than $1bn from the US Biomedical Advanced Research and Development Authority (BARDA) for the development, production and delivery of a COVID-19 vaccine, starting in the fall.[9] AZN said it has the capacity to manufacture 1 billion doses of the University of Oxford’s potential vaccine through 2020 and 2021 and it has already secured the first agreements for at least 400 million doses of the vaccine.[10]\n\nAZN also announced its licence agreement had been finalised with Oxford University for the recombinant adenovirus vaccine. The licensing of the vaccine, formerly ChAdOx1 nCoV-19 and now known as AZD1222, follows the recent global development and distribution agreement with the University’s Jenner Institute and the Oxford Vaccine Group. AstraZeneca has also agreed to support the establishment of a joint research centre at Oxford University for pandemic preparedness research. A Phase I/II clinical trial of AZD1222 began last month to assess safety, immunogenicity and efficacy in over 1,000 healthy volunteers aged 18 to 55 years across several trial centres in southern England. Data from the trial is expected shortly which, if positive, would lead to late-stage trials in a number of countries. AstraZeneca recognises that the vaccine may not work but is committed to progressing the clinical program with speed and scaling up manufacturing at risk.[11]\n\nIn December 2020, AstraZeneca announced a clinical trial programme to assess safety and immunogenicity of a combination of AZD1222, developed by AstraZeneca and Oxford University, and Sputnik V, developed by Russian Gamaleya Research Institute. Dr Zoltán Kis, Research Associate at the Future Vaccine Manufacturing Hub, Imperial College (London), said:\n\n“Both the AstraZeneca/Oxford vaccine candidate and the Sputnik V vaccine are adenovirus vectored vaccines and both deliver genetic instructions for the cells of the body to produce the Spike protein of SARS-CoV-2. The AstraZeneca/Oxford vaccine candidate is based on a chimpanzee adenovirus and the Sputnik V vaccine is based on a human adenovirus, thus the vectors (or carriers) of these two vaccines are slightly different. “The immune system of the human body can generate an immune response against the adenoviral vector itself, thus if a second dose of the same adenovirus vectored vaccine is delivered, the immune system could destroy the vector, before the payload of the vaccine is delivered, therefore reducing the efficacy of the second vaccine dose. On the other hand, if the vector of the second (booster) dose of the vaccine is different from the vector of the first (prime) dose, the immune system will be less likely to destroy the vector of the vaccine, thus the efficacy of the heterologous boosting vaccination could be increased, compared to the situation where both the prime and boost doses were of the same vector type. Therefore, the reason why heterologous boosting could increase vaccine efficacy, is that the (partial) destruction of the second vaccine dose by the immune system can be avoided and because both vaccines contain instructions for producing the same antigen. “Furthermore, having the possibility of combining these two vaccine types would allow for greater flexibility in the vaccination programs. This could lead to greater accessibility to vaccines, thus increasing the rate and scale of Covid-19 vaccination coverage. “For these reasons, the news regarding clinical trials of this heterologous boosting Covid-19 vaccination is a promising one.”[12]\n\nIn 2003 U.S. federal officials announced that AstraZeneca had pleaded guilty to criminal and civil charges relating to the illegal marketing of the prostate cancer drug Zoladex. The company agreed to pay $355 million, consisting of $64 million in criminal fines, a $266 million settlement of civil False Claims Act charges, and a $25 million settlement of fraud charges relating to state Medicaid programs. AstraZeneca, which agreed to enter into a corporate integrity agreement with the Inspector General of the U.S. Department of Health and Human Services, had been accused of giving illegal financial inducements such as grants and honoraria to physicians.[13]\n\nIn 2010 the USDOJ announced[14] that AstraZeneca would pay $520 million to resolve allegations that it illegally marketed its anti-psychotic drug Seroquel for uses not approved as safe and effective by the FDA. Among other things, the company was accused of having paid doctors to give speeches and publish articles (ghostwritten by the company) promoting those unapproved uses. AstraZeneca agreed to sign a corporate integrity agreement regarding its future behavior. In 2011 AstraZeneca settled[15] a related Seroquel case brought by state governments by agreeing to pay another $69 million.\n\nIn 2003 researchers at the University of Illinois-Chicago released[16] the results of research concluding that AstraZeneca’s Seroquel and two other schizophrenia drugs made by other companies created an elevated risk for diabetes. Subsequently, more than 25,000 lawsuits were filed against the company. In 2010 the company said[17] it would pay a total of $198 million to settle those cases. That same year, the UK’s Prescription Medicines Code of Practice Authority found[18] that AstraZeneca had failed to adequately describe the risks of Seroquel in an advertisement for the drug in a medical journal.\n\nIn 2010 AstraZeneca agreed[19] to pay £505 million to British revenue authorities to resolve a dispute related to the company’s use of transfer pricing techniques to reduce its tax liability.\n\nIn 2016 the US Securities and Exchange Commission announced that AstraZeneca would pay $5.5 million to settle a case[20] alleging that it committed accounting violations in connection with improper payments made in Russia and China to boost drug sales.", "opengraph": {"image": "https://wikispooks.com/w/images/2/27/AstraZeneca.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/Big_Pharma", "/wiki/UK", "/wiki/Department_of_Health_and_Social_Care", "/w/index.php?title=Medicines_and_Healthcare_Products_Regulatory_Agency&action=edit&redlink=1", "/wiki/COVID-19_jab", "/wiki/MHRA", "#cite_note-1", "#History", "#COVID-19_PPE", "#COVID-19_Vaccine", "#Cambridge_Testing", "#Oxford_Vaccine_AZD1222", "#Combining_AZD1222_and_Sputnik_V", "#Illegal_and_unethical_practices", "#References", "/w/index.php?title=Astra_AB&action=edit&redlink=1", "/w/index.php?title=Zeneca_Group&action=edit&redlink=1", "/wiki/Imperial_Chemical_Industries", "#cite_note-2", "#cite_note-3", "/wiki/AZN", "/w/index.php?title=MedImmune&action=edit&redlink=1", "/w/index.php?title=MedImmune&action=edit&redlink=1", "/wiki/Cambridge", "/wiki/United_Kingdom", "/wiki/Maryland", "/wiki/USA", "/w/index.php?title=MedImmune&action=edit&redlink=1", "/w/index.php?title=Gothenburg&action=edit&redlink=1", "/wiki/Sweden", "#cite_note-4", "/wiki/COVID-19_pandemic", "#cite_note-5", "/wiki/AZD1222", "/wiki/Coronavirus_vaccine", "#cite_note-6", "/wiki/File:Graham_Hutchinson.png", "/wiki/File:Graham_Hutchinson.png", "#cite_note-7", "/w/index.php?title=Graham_Hutchinson&action=edit&redlink=1", "/w/index.php?title=Central_Public_Health_Laboratory&action=edit&redlink=1", "/w/index.php?title=Pascal_Soriot&action=edit&redlink=1", "/wiki/GlaxoSmithKline", "/wiki/University_of_Cambridge", "/wiki/COVID-19", "#cite_note-8", "/wiki/AZN", "/w/index.php?title=Biomedical_Advanced_Research_and_Development_Authority&action=edit&redlink=1", "/wiki/COVID-19_vaccine", "#cite_note-9", "/wiki/AZN", "/wiki/University_of_Oxford", "#cite_note-10", "/wiki/AZN", "/wiki/Oxford_University", "/wiki/Vaccine", "/wiki/AZD1222", "/wiki/Jenner_Institute", "/wiki/Oxford_Vaccine_Group", "#cite_note-11", "/wiki/AZD1222", "/wiki/Sputnik_V", "/wiki/Russia", "/wiki/Gamaleya_Research_Institute", "/w/index.php?title=Zolt%C3%A1n_Kis&action=edit&redlink=1", "/wiki/Imperial_College", "/wiki/Sputnik_V", "/wiki/Sputnik_V", "#cite_note-12", "#cite_note-13", "/wiki/USDOJ", "#cite_note-14", "#cite_note-15", "/wiki/University_of_Illinois-Chicago", "#cite_note-16", "#cite_note-17", "#cite_note-18", "#cite_note-19", "/wiki/Securities_and_Exchange_Commission", "#cite_note-20", "/wiki/Russia", "/wiki/China", "#cite_ref-1", "https://www.gov.uk/government/news/oxford-universityastrazeneca-vaccine-authorised-by-uk-medicines-regulator", "#cite_ref-2", "http://money.cnn.com/magazines/fortune/global500/2009/industries/21/index.html", "#cite_ref-3", "http://www.astrazeneca.com/about-us/key-facts/", "#cite_ref-4", "http://www.astrazeneca.com/about-us/", "#cite_ref-5", "https://www.cambridgeindependent.co.uk/business/coronavirus-astrazeneca-donates-nine-million-face-masks-and-steps-up-covid-19-drugs-research-9104685/", "#cite_ref-6", "https://timesofindia.indiatimes.com/world/uk/astrazeneca-to-be-exempt-from-coronavirus-vaccine-liability-claims-in-most-countries/articleshow/77275378.cms", "#cite_ref-7", "https://twitter.com/GRHutchinson/status/1344296468862164993", "#cite_ref-8", "https://www.reuters.com/article/us-health-coronavirus-astrazeneca-idUSKBN21Q0PR", "#cite_ref-9", "https://www.reuters.com/article/us-health-coronavirus-astrazeneca/u-s-secures-300-million-doses-of-potential-astrazeneca-covid-19-vaccine-idUSKBN22X0J9", "#cite_ref-10", "https://uk.style.yahoo.com/coronavirus-astra-zeneca-to-supply-potential-covid-19-vaccine-azd1222-in-september-074224817.html", "#cite_ref-11", "https://www.astrazeneca.com/content/astraz/media-centre/press-releases/2020/astrazeneca-advances-response-to-global-covid-19-challenge-as-it-receives-first-commitments-for-oxfords-potential-new-vaccine.html", "#cite_ref-12", "https://www.sciencemediacentre.org/expert-reaction-to-astrazeneca-announcing-clinical-trial-programme-to-assess-combination-of-the-oxford-astrazeneca-vaccine-and-the-sputnik-v-vaccine/", "#cite_ref-13", "http://www.justice.gov/opa/pr/2003/June/03_civ_371.htm", "#cite_ref-14", "http://www.justice.gov/opa/pr/2010/April/10-civ-487.html", "#cite_ref-15", "http://www.cleveland.com/consumeraffairs/index.ssf/2011/03/astrazeneca_to_pay_69_million.html", "#cite_ref-16", "http://www.nytimes.com/2003/08/25/us/3-schizophrenia-drugs-may-raise-diabetes-risk-study-says.html", "#cite_ref-17", "http://articles.philly.com/2010-08-10/business/24973541_1_astrazeneca-plc-seroquel-antipsychotic", "#cite_ref-18", "http://www.ft.com/intl/cms/s/0/5476cc28-2b1b-11df-93d8-00144feabdc0.html#axzz2FRylomMB", "#cite_ref-19", "http://www.guardian.co.uk/business/2010/feb/23/astrazeneca-tax-uk-pharmaceuticals", "#cite_ref-20", "https://www.sec.gov/litigation/admin/2016/34-78730-s.pdf", "/wiki/Wikispooks", "/wiki/Wikipedia", "/wiki/Wikipedia", "https://en.wikipedia.org/w/index.php?title=AstraZeneca&oldid=957192470"], "authors": [], "publish_date": null}