{"result_id": "343015", "URL": "https://wikispooks.com/wiki/Moderna", "timestamp": "2023-04-25 18:13:10 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Moderna", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Moderna - Wikispooks", "cleaned_text": "For the vaccine, see Moderna COVID-19 vaccine\n\nModerna (formerly ModeRNA) is an American biotech company focused on drug discovery and drug and vaccine development based exclusively on messenger RNA (mRNA). After a decade of work and on financially shaky ground due to its inability to develop drugs safe enough for human testing, the company hit jackpot in April 2020, when Trump appointed Moderna board member Moncef Slaoui to Operation Warp Speed, the plan to vaccinate the entire American population by 2021. In November 2020, the company launched its Covid-19 vaccine, its first commercially allowed product.\n\nIn 2010, ModeRNA Therapeutics was formed to commercialize the research of stem cell biologist Derrick Rossi, who developed a method for modifying mRNA, transfecting it into human cells, then dedifferentiating it into stem cells that could then be further dedifferentiated into desired target cell types. Highly secretive, over its lifespan the company has been noticeably reluctant to release data about its product developments.[1]\n\nModerna has received considerable U.S. government/military funding[2] ($438 million) from the Biomedical Advanced Research and Development Authority (BARDA), a division of HHS overseen by HHS’ Assistant Secretary for Preparedness and Response (ASPR) Robert Kadlec. Moderna has also stated that it is directly collaborating with the U.S. government to bring its vaccine candidate to market.[3]\n\nModerna’s regulatory success has also been result of backing that it received in January 2020 from the Coalition for Epidemic Preparedness Innovations (CEPI), which was founded in 2017 by the governments of Norway and India along with the World Economic Forum (WEF) and the Bill and Melinda Gates Foundation.\n\nModerna’s Covid-19 vaccine has also received additional millions from long-time Moderna backer Bill Gates. The Bill & Melinda Gates Foundation is the only foundation listed as a “strategic collaborator” on the Moderna website. In April 2020, Gates authored an article where he described Moderna’s mRNA vaccine for Covid-19 as the “most exciting” and discussed it at length, writing \"It’s a bit like building your computer system and your first piece of software at the same time.\"[4]\n\nThe company has worked with BARDA for an improved Zika virus vaccine candidate, and DARPA for advancing mRNA therapies and vaccines for biodefense[5].\n\nIn December 2018, Moderna became the largest biotech initial public offering (IPO) in history, raising $600 million for 8% of its shares, implying an overall valuation of $7.5 billion[6]. Fitting for its military/intelligence ties, the company has a reputation for secrecy and little of its work has ever been published, and none peer-reviewed or scientifically validated[7].\n\nModerna's CEO Stéphane Bancel was selected a Young Global Leader by the World Economic Forum in 2009. This community, where most Young Leaders participate in yearly gatherings for 5 years and where ambitious Young Leaders get assessed and scouted by billionaires like Bill Gates, presumably was one of the reasons why he got the top job.\n\nModerna first teamed up with the WEF just a few years after its founding back in 2013, when it was named to the Forum’s community of Global Growth Companies (GGC). That year, Moderna was one of just three North American health companies to receive the honor and was additionally recognized by the Forum as “an industry leader in innovative mRNA therapeutics.”[8] Such carefully selected companies are given opportunities by the Forum “to shape global, regional and industry agendas and engage in meaningful exchanges about ways to continue on a sustainable and responsible path of growth.” Essentially, the roster of such companies constitutes a consortium of corporations that are promoted and guided by the Forum because of their commitment to “improving the state of the world,” that is, their commitment to supporting the Forum’s long-term agendas for the global economy and for global governance.[9]\n\nIn 2019 Moderna’s Bancel attended the World Economic Forum’s 2019 annual meeting[10] alongside Johnson & Johnson executive Paul Stoffels and other pharmaceutical and biotech leaders in order to “rub elbows with world leaders and one-percenters—and talk about the future of healthcare.” Other health-care figures in attendance included head of the World Health Organization, Tedros Adhanom Ghebreyesus, and “global health philanthropist” Bill Gates, whose foundation entered into “a global health project framework”[11] with Moderna in 2016 to “advance mRNA-based development projects for various infectious diseases.”.[9]\n\nIn 2016, Peter Kolchinsky, whose RA Capital Management owns a stake in the company stated, remarkably presciently[12]:\n\nNever proved safe enough to test in humans\n\nIn 2016 Moderna CEO Stéphane Bancel talked up his company’s “unbelievable” future at the annual J.P. Morgan Healthcare Conference. He promised that Moderna’s treatment for a rare and debilitating disease known as Crigler-Najjar syndrome, developed alongside biotech giant Alexion Pharmaceuticals, would enter human trials in 2016. It was to be the first therapy using a new mRNA technology that Bancel promised would yield dozens of drugs in the coming decade. But the Crigler-Najjar treatment has been indefinitely delayed, as it never proved safe enough to test in humans.[1]\n\nAs the health magazine STAT explained: \"In order to protect mRNA molecules from the body’s natural defenses, drug developers must wrap them in a protective casing. For Moderna, that meant putting its Crigler-Najjar therapy in nanoparticles made of lipids. And for its chemists, those nanoparticles created a daunting challenge: Dose too little, and you don’t get enough enzyme to affect the disease; dose too much, and the drug is too toxic for patients.\"[1]\n\nModerna states on its website, under the heading The ‘Software of Life’:\n\nUnder a rule put in place by the Securities and Exchange Commission in 2000 to allow company employees to sell shares without facing insider-trading charges, several Moderna executives (just like in fellow Big Pharma Pfizer) have - legally - sold shares worth more than $100 million during the summer and autumn 2020.[14] Since January, CEO Stéphane Bancel has sold roughly $40 million worth of Moderna stock held by himself or associated investment funds; Chief Medical Officer Tal Zaks, the medical face outwards of the US company and of the key figures in the development of its Covid-19 vaccine, has sold around $60 million; and President Stephen Hoge has sold more than $10 million.\n\nCommenting on the stock sales, Daniel Taylor, an associate professor of accounting at the Wharton School stated:\n\nIn July 2021, Tal Zak left the company and sold most of his remaining shares. Per August 23, he only had 1,5 million dollars in shares left. Also Bancel keeps selling down.[16]\n\nThe US-based company passed the profits it made on sales of its coronavirus vaccine in Europe to a shell company in Switzerland to avoid paying tax. By June 2021, orders from the EU brought in €10.3 billion, allowing the company to issue an income forecast for the year of €19 billion and a profit of €4.4 billion. But the countries of the EU will see none of it. Swiss corporation tax is a maximum of 13%, but the company can easily manage to reduce that to 7.8%. And having done so, its tax obligations are fulfilled.[17]\n\nThe company does the same in the United States. It is based in the state of Massachusetts, but its patents are registered in Delaware (the home state of US president Joe Biden), where royalties – including the income from vaccines – are not taxed at all.[17]\n\nSince 2011, Moderna has been led by CEO Stéphane Bancel, a French businessman who is not a scientist and comes from a pharma sales and operations background. A first-time biotech CEO, Bancel, has \"an unwavering belief that Moderna’s science will work — and that employees who don’t “live the mission” have no place in the company.\"[12]\n\nAn 2016 investigation by the health magazine STAT investigation found that Bancel had \"driven away top talent from Moderna with a culture of recrimination and a caustic work environment, including on-the-spot firings for failed experiments.\" At least a dozen highly placed executives have quit since 2012, including heads of finance, technology, manufacturing, and science. In 2016, respected leaders of Moderna’s cancer and rare disease programs both resigned, even though the company’s remarkable fundraising had put ample resources at their disposal.[1]\n\nAfter Noubar Afeyan and Robert Langer, Bancel is the largest individual shareholder in the company.\n\nStephen Hoge is President and a former McKinsey & Company management consultant who joined in 2012; he is the fourth-largest individual shareholder in the company.\n\nLorence Kim is CFO and a former Goldman Sachs biotech investment banking managing director who joined in 2014; he is the fifth-largest individual shareholder in the company.\n\nSince 2011, the Chairman of Moderna has been the CEO of Flagship Pioneering, businessman Noubar Afeyan. Afeyan holds his interest in Moderna through various Flagship Pioneering vehicles, however, at the 2018 IPO, documents filed stated that Afeyan owned 19.5% of the company, while Flagship owned 18%, thus giving Afeyan control over 37.5% of the company[18].\n\nDr. Tal Zaks, an Israeli citizen[19] who began his career at GlaxoSmithKline, oversaw “preclinical development, clinical development and regulatory affairs” for Moderna and all of its subsidiaries until he left the company in July 2021.\n\nWhitney Webb wrote a long analysis about the dubious science and business practices of Moderna:\n\n“In a single dose of a Moderna vaccine, there are 40 trillion messenger RNA molecules...Three-quarters of these molecules leave the arm of the injection, circulate through the bloodstream, and end up in the tiny capillary vessels. These little packages of the genes are absorbed into the cells around the blood vessels of the vascular endothelium. The packages open, the genes are released, your body then gets to work reading these genes and manufacturing trillions and trillions of COVID spike proteins. Hoffe said even though there are 40 trillion mRNA genes, each gene can produce “many, many COVID spike proteins. And the purpose of the spike proteins is that your body recognizes this as a foreign protein and will make antibodies against it so that you’re then protected against COVID.” But this antibody response comes at a heavy price, he said. “The spike protein…becomes part of the cell wall of ….these cells that line your blood vessels, which are supposed to be smooth so that your blood flows smoothly. Now you have these little spiky bits sticking out,” Hoffe said. From here, “blood platelets circulate in your vessels…to detect a damaged vessel and block that vessel to stop bleeding. So when the platelet comes through the capillary, it suddenly hits all these little COVID spikes that are jutting into the inside of the vessel. It is absolutely inevitable that a blood clot will form.” Hoffe claimed the clots are “too small and too scattered” to show up on CT scans, angiograms, or MRIs, but are numerous enough to cause damage. There’s some tissues in your body like intestine and liver and kidneys that can regenerate to quite a good degree. But brain and spinal cord and heart muscle and lungs do not. When they’re damaged, it’s permanent, like all these young people who are now getting myocarditis from these shots. They have permanently damaged hearts. This is the terrifying concern. And not only is the long-term outlook very grim, but with each successive shot, the damage will add and add and add. It’s going to be cumulative.”\n\n2 of the 10 of the members already have pages here:", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/File:Tools.png", "/wiki/Moderna_COVID-19_vaccine", "/wiki/Messenger_RNA", "/wiki/Moncef_Slaoui", "/wiki/Operation_Warp_Speed", "/wiki/Covid-19_vaccine", "#History", "#World_Economic_Forum", "#Never_proved_safe_enough_to_test_in_humans", "#Covid-19_Vaccine", "#Executives_Selling_Shares", "#Tax_avoidance", "#People", "#Chancellor_Rishi_Sunak", "#Further_reading", "#Related_Quotation", "#Known_members", "#References", "/w/index.php?title=Derrick_Rossi&action=edit&redlink=1", "#cite_note-stat-1", "#cite_note-2", "/w/index.php?title=Biomedical_Advanced_Research_and_Development_Authority&action=edit&redlink=1", "/wiki/Robert_Kadlec", "#cite_note-3", "/wiki/Coalition_for_Epidemic_Preparedness_Innovations", "/wiki/Norway", "/wiki/India", "/wiki/World_Economic_Forum", "/wiki/Bill_and_Melinda_Gates_Foundation", "/wiki/Bill_Gates", "/wiki/The_Bill_%26_Melinda_Gates_Foundation", "#cite_note-4", "/w/index.php?title=BARDA&action=edit&redlink=1", "/wiki/Zika_virus", "/wiki/DARPA", "#cite_note-5", "#cite_note-6", "#cite_note-7", "/wiki/St%C3%A9phane_Bancel", "/wiki/WEF/Young_Global_Leaders_2009", "/wiki/World_Economic_Forum", "/wiki/Bill_Gates", "#cite_note-8", "#cite_note-Webb-9", "#cite_note-10", "/wiki/Johnson_%26_Johnson", "/w/index.php?title=Paul_Stoffels&action=edit&redlink=1", "/wiki/World_Health_Organization", "/wiki/Tedros_Adhanom_Ghebreyesus", "/wiki/Bill_Gates", "#cite_note-11", "/wiki/MRNA", "#cite_note-Webb-9", "/w/index.php?title=Peter_Kolchinsky&action=edit&redlink=1", "#cite_note-stat2-12", "/wiki/St%C3%A9phane_Bancel", "/wiki/J.P._Morgan", "/w/index.php?title=Alexion_Pharmaceuticals&action=edit&redlink=1", "#cite_note-stat-1", "/w/index.php?title=STAT&action=edit&redlink=1", "/wiki/Lipid_nanoparticles", "#cite_note-stat-1", "/wiki/Moderna_COVID-19_vaccine", "#cite_note-13", "/wiki/Securities_and_Exchange_Commission", "/wiki/2000", "/w/index.php?title=Insider-trading&action=edit&redlink=1", "/wiki/Big_Pharma", "/wiki/Pfizer", "#cite_note-14", "/wiki/St%C3%A9phane_Bancel", "/w/index.php?title=Tal_Zaks&action=edit&redlink=1", "/wiki/Covid-19_vaccine", "/w/index.php?title=Stephen_Hoge&action=edit&redlink=1", "/w/index.php?title=Daniel_Taylor&action=edit&redlink=1", "/wiki/Wharton_School", "#cite_note-15", "/w/index.php?title=Tal_Zak&action=edit&redlink=1", "#cite_note-16", "/w/index.php?title=Profits&action=edit&redlink=1", "/wiki/Coronavirus_vaccine", "/wiki/Europe", "/wiki/Switzerland", "/wiki/Tax", "/wiki/EU", "#cite_note-brussels-17", "/wiki/Massachusetts", "/wiki/Delaware", "/wiki/Joe_Biden", "#cite_note-brussels-17", "/wiki/St%C3%A9phane_Bancel", "/wiki/Big_pharma", "#cite_note-stat2-12", "/w/index.php?title=STAT&action=edit&redlink=1", "/wiki/Cancer", "#cite_note-stat-1", "/w/index.php?title=Noubar_Afeyan&action=edit&redlink=1", "/w/index.php?title=Robert_Langer&action=edit&redlink=1", "/w/index.php?title=Stephen_Hoge&action=edit&redlink=1", "/wiki/McKinsey_%26_Company", "/w/index.php?title=Lorence_Kim&action=edit&redlink=1", "/wiki/Goldman_Sachs", "/w/index.php?title=Noubar_Afeyan&action=edit&redlink=1", "#cite_note-18", "/w/index.php?title=Tal_Zaks&action=edit&redlink=1", "#cite_note-19", "/wiki/GlaxoSmithKline", "https://twitter.com/tynewrc", "/wiki/Rishi_Sunak", "https://www.thelemepartners.com/", "#cite_note-20", "/wiki/Private_Eye", "#cite_note-21", "https://unlimitedhangout.com/2021/10/investigative-reports/moderna-a-company-in-need-of-a-hail-mary/", "/wiki/Property:Has_text", "/wiki/Property:Has_author", "/wiki/Charles_Hoffe#_cb75a620d593d36b993ef4a083b5b988", "/w/index.php?title=Genes&action=edit&redlink=1", "/wiki/COVID", "/w/index.php?title=MRI&action=edit&redlink=1", "/w/index.php?title=Myocarditis&action=edit&redlink=1", "/wiki/Charles_Hoffe", "/wiki/Property:Description", "/wiki/St%C3%A9phane_Bancel", "/wiki/COVID-19_vaccine", "/wiki/Moncef_Slaoui", "#cite_ref-stat_1-0", "#cite_ref-stat_1-1", "#cite_ref-stat_1-2", "#cite_ref-stat_1-3", "https://www.statnews.com/2017/01/10/moderna-trouble-mrna/", "#cite_ref-2", "https://federallabs.org/news/barda-pledges-up-to-483m-for-modernas-covid-19-vaccine-work", "#cite_ref-3", "https://www.thelastamericanvagabond.com/modernas-covid-19-vaccine-takes-lead-chief-medical-officers-recent-promotion-gene-editing-vaccines/#comments", "/wiki/Whitney_Webb", "#cite_ref-4", "https://www.gatesnotes.com/Health/What-you-need-to-know-about-the-COVID-19-vaccine", "#cite_ref-5", "https://www.modernatx.com/ecosystem/strategic-collaborators/mrna-strategic-collaborators-government-organizations", "#cite_ref-6", "https://edition.cnn.com/2020/05/01/us/coronavirus-moderna-vaccine-invs/index.html", "#cite_ref-7", "https://www.statnews.com/2016/09/13/moderna-therapeutics-biotech-mrna/", "#cite_ref-8", "https://www.prnewswire.com/news-releases/moderna-therapeutics-named-to-the-world-economic-forums-community-of-global-growth-companies-229077741.html", "#cite_ref-Webb_9-0", "#cite_ref-Webb_9-1", "https://unlimitedhangout.com/2021/10/investigative-reports/moderna-a-company-in-need-of-a-hail-mary/", "#cite_ref-10", "https://www.statnews.com/2019/01/21/davos-2019-attendees/", "#cite_ref-11", "https://www.modernatx.com/ecosystem/strategic-collaborators/foundations-advancing-mrna-science-and-research", "#cite_ref-stat2_12-0", "#cite_ref-stat2_12-1", "https://www.statnews.com/2016/09/13/moderna-therapeutics-biotech-mrna/", "#cite_ref-13", "https://www.modernatx.com/mrna-technology/mrna-platform-enabling-drug-discovery-development", "#cite_ref-14", "https://www.ctvnews.ca/health/coronavirus/as-pharmaceutical-execs-sell-shares-worth-millions-questions-arise-1.5189713", "#cite_ref-15", "https://www.npr.org/2020/09/04/908305074/bad-optics-or-something-more-moderna-executives-stock-sales-raise-concerns", "#cite_ref-16", "https://www.msn.com/de-ch/finanzen/unternehmen/die-seltsamen-aktien-verk%C3%A4ufe-der-moderna-chefs/ar-AAOhRYR?ocid=msedgdhp&pc=U531", "#cite_ref-brussels_17-0", "#cite_ref-brussels_17-1", "https://www.brusselstimes.com/news/eu-affairs/177354/vaccine-manufacturer-moderna-accused-of-tax-evasion/", "#cite_ref-18", "https://www.biospace.com/article/moderna-increases-ipo-goal-to-600-million/", "#cite_ref-19", "https://www.timesofisrael.com/modernas-israeli-top-medical-officer-weve-shown-today-that-our-vaccine-works/", "#cite_ref-20", "https://www.private-eye.co.uk/issue-1576/hp-sauce", "#cite_ref-21", "https://twitter.com/tynewrc/status/1542873315693436930"], "authors": [], "publish_date": null}