{"result_id": "343017", "URL": "https://wikispooks.com/wiki/2020s", "timestamp": "2023-04-25 18:13:11 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/2020s", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "2020s - Wikispooks", "cleaned_text": "The 2020s began with COVID-19, a disease caused by SARS-COV2, an airborne respiratory virus, commonly asymptomatic but occasionally fatal especially for people with co-morbidities. After a year of fearmongering about the virus, experimental gene therapies, referred to as \"COVID vaccines\", were launched on the public. Uptake was brisk in 2021, but quickly declined. Promises that they were \"safe and effective\" gradually gave way to bribes or other inducements, then threats and outright scapegoating of those who declined to be part of the experiment. By 2023, publicly available data revealed that the jabs were neither \"safe\" nor \"effective\". Plans to mandate future such jabs, and to use \"vaccine passports\" seemed however to be ongoing.\n\nJanuary 2020 saw disturbing reports from China, where the official narrative stated that the virus emerged zoonotically from a wet market. This contradicted a lot of evidence about the role of Ecohealth Alliance in moving US money to the Wuhan Institute of Virology, where so-called \"gain-of-function\" research was done on bat coronaviruses.\n\nCOVID dissidents were quickly followed by an unprecedented level of censorship. In March 2020, the WHO Director General declared that the virus was killing about 3.4% of those who caught it, and that it was a global pandemic. There followed a clampdown on treatment of COVID, a wave of media-stoked panic about COVID-19.\n\nAs if coordinated by The Deep State, over 90%[citation needed] of nations imposed \"Covid legislation\", for example COVID lockdowns, to curtail freedom of movement, and often also to limit freedom of speech, even by doctors who were questioning the validity of the dictats. Some governments held out[1] choosing instead to follow the WHO pandemic guidelines which clarified that such measures were unhelpful and/or counterproductive. Several of the leaders of these nations suffered sudden deaths, or were the victim of regime change operations, as did other prominent COVID-19 dissidents.\n\n“I once asked the question: is this pandemic, this coronavirus, a man-made phenomenon? I don’t know the answer yet, but I have my suspicions. Are politicians and others using this situation for their own purposes? You and I both know the answer to that question. You already see how it is used today... Doesn’t it seem to you that the powerful forces of the world would like to remake the world, without a ‘war’ (Emmanuel Macron has already called it a war), through this so-called ‘corona-psychosis’, or ‘info-demic’? Many people are asking: ‘what will happen after the pandemic?’” \n\n (3 April 2020) [2]\n\nBelarus President Alyaksander Lukashenko later reported a bribery attempt to induce him to carry out a so-called \"COVID-19 Lockdown\".\n\nWhile repeated claims were made about following \"The Science\", research into the use of existing drugs against COVID such as ivermectin was blocked, and patented drugs such as remdesivir were aggressively promoted. Intensive study was done of public opinion, and this was used to guide a global policy of gaslighting.\n\nExperimental injections referred to as \"COVID vaccines\" were heavily promoted by the commercially-controlled media, and gradual moves towards mandation were made. In November 2020 Tom Tugendhat, Chair of the Foreign Affairs Select Committee, floated mandatory Covid-19 vaccination for workers and travellers. He was one of scores of Bilderbergers who took important roles the COVID-19 project, as were WEF affiliates.\n\nThe so-called \"COVID vaccines\" were aggressively pushed by deep state functionaries. In February 2021 Mario Draghi was made Prime Minister of Italy, in which job he promoted mandatory \"COVID vaccination\" for healthcare workers in Italy.[3]\n\nThe so-called \"omicron\" variant of COVID-19, particularly mild and fast-spreading, emerged, possibly from southern Africa. Its phylogenetic origins were unexpected, pointing to a non-natural origin. Its ability to escape the \"vaccines\" was used to encourage people to take additional injections, so-called \"booster shots\".\n\nJoe Rogan's early January interview of MRNA inventor Robert Malone (whom [[Twitter had deplatformed a few days previously) garnered tens of millions of views worldwide. Malone helped popularise the ideas of Mattias Desmet about \"mass formation\".\n\nA growing awareness of the mildness of omicron lead to a rapid decrease in fear of COVID-19, and a concomitant rise in questions about why the COVID jabs were being so aggressively pushed, and by whom.\n\nWEF Young Global Leader Prime Minister of Canada, Justin Trudeau, and his handler, Chrystia Freeland a WEF Global Leader for Tomorrow had declared that the US/Canada would only be open to those who took COVID-19 injections. This inspired a peaceful demonstration by a number of Canadian truckers. The Canadian commercially-controlled media unsuccessfully failed to depict them as a fringe group enjoying only a tiny support, but the support for their stance in favour of bodily autonomy, both in Canada and worldwide was widespread and palpable. Violent measures were used to try to suppress the dissent, and the bank accounts of some of those involved were frozen, further heightening concerns about lack of due process and government overreach. The convoy inspired another one in USA, but the world's attention was drawn elsewhere by the 2022 Russian invasion of Ukraine.\n\nVladimir Putin started an invasion of Ukraine, after noting a massing of Ukrainian troops.[citation needed]\n\nAfter a \"pandemic planning\" exercise a year earlier about a weaponised strain of Monkeypox breaking out in 2022, an apparently weaponised strain of Monkeypox did indeed break out in 2022. Although more visually spectacular than COVID-19, the disease appeared to be more or less non-fatal, and therefore failed to exorcise a hold on the public imagination.\n\nIn July 2022 French President Emmanuel Macron's lost a vote on vaccine passports,[4] a defeat which \"was met with wild cheering and a standing ovation from opposition lawmakers, in footage that was widely circulated on social media\".[5]\n\nMario Draghi resigned in July 2022, and Italians were reported as \"reacting with great jubilation and are already gathering in the country’s major squares.\"[6]\n\nBooster uptake of COVID-19 jabs was very lowTemplate:How low in many countries, and some suspended the jabs for the healthy and/or young.[citation needed]", "opengraph": {"image": "https://wikispooks.com/w/images/6/67/Message-for-the-2020s.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://anoniem.org?https://en.wikipedia.org/wiki/2020s", "https://wikispooks.com/w/index.php?title=Special:ExportRDF/2020s", "https://wikispooks.com/w/index.php?title=Special:Browse/:2020s", "/wiki/File:Message-for-the-2020s.jpg", "/wiki/Enemy_image", "/wiki/Muslim_terrorism", "/wiki/COVID-19", "/wiki/Wuhan_Institute_of_Virology", "/wiki/2020", "/wiki/2020", "/wiki/2021", "/wiki/2021", "/wiki/2022", "/wiki/2022", "/wiki/2023", "/wiki/2023", "/wiki/2024", "/wiki/2025", "/wiki/2026", "/wiki/2027", "/wiki/2028", "/wiki/2029", "/wiki/COVID-19", "/wiki/COVID_vaccines", "/wiki/Safe_and_effective", "/wiki/2023", "/wiki/Vaccine_passport", "#2020", "#2021", "#Omicron", "#2022", "#Canadian_Truckers", "#Russian_invasion_of_Ukraine", "#Monkeypox", "#Summer_defeats_of_pro-mandate_policies", "#2023", "#Related_Quotation", "#References", "/wiki/2020", "/wiki/File:Daily_Mail_big_red_fake_effort_to_look_like_exponential_growth.jpg", "/wiki/File:Daily_Mail_big_red_fake_effort_to_look_like_exponential_growth.jpg", "/wiki/Daily_Mail", "/wiki/COVID_panic", "/wiki/Official_narrative", "/wiki/COVID-19/Origins", "/wiki/Ecohealth_Alliance", "/wiki/Wuhan_Institute_of_Virology", "/wiki/Gain-of-function", "/wiki/COVID_dissidents", "/wiki/COVID-19/Censorship", "/wiki/WHO_Director_General", "/wiki/Panic_about_COVID-19", "/wiki/The_Deep_State", "/wiki/Template:Citation_needed", "/wiki/Covid_legislation", "/wiki/COVID_lockdowns", "/wiki/Freedom_of_movement", "/wiki/Freedom_of_speech", "/wiki/Doctors", "#cite_note-1", "/wiki/WHO", "/wiki/COVID-19/Premature_death", "/wiki/Regime_change_operations", "/wiki/COVID-19_dissidents", "/wiki/COVID-19/Pandemic", "/wiki/Coronavirus", "/wiki/Emmanuel_Macron", "/wiki/COVID-19/Panic", "#cite_note-https:.2F.2Fsputniknews.com.2Feurope.2F202004031078824468-belaruss-president-warns-global-elites-using-covid-19-crisis-to-try-to-reshape-world-order.2FRT-2", "/wiki/Belarus_President", "/wiki/Alyaksander_Lukashenko", "/wiki/COVID-19_Lockdown", "/wiki/Following_%22The_Science%22", "/wiki/Ivermectin", "/wiki/Remdesivir", "/wiki/Gaslighting", "/wiki/COVID_vaccines", "/wiki/Corporate_media", "/wiki/Tom_Tugendhat", "/wiki/Chair_of_the_Foreign_Affairs_Select_Committee", "/wiki/Covid-19_vaccination", "/wiki/Bilderbergers_who_took_important_roles_the_COVID-19", "/wiki/COVID-19/Perpetrators/WEF", "/wiki/2021", "/wiki/COVID_vaccines", "/wiki/Deep_state_functionaries", "/wiki/Mario_Draghi", "/wiki/Prime_Minister_of_Italy", "/wiki/Mandatory_%22COVID_vaccination%22", "#cite_note-3", "/wiki/2022", "/wiki/Joe_Rogan", "/wiki/MRNA", "/wiki/Robert_Malone", "/wiki/Mattias_Desmet", "/wiki/Mass_formation", "/wiki/Freedom_Convoy_2022", "/wiki/WEF", "/wiki/Young_Global_Leader", "/wiki/Prime_Minister_of_Canada", "/wiki/Justin_Trudeau", "/wiki/Chrystia_Freeland", "/wiki/WEF", "/wiki/Global_Leader_for_Tomorrow", "/wiki/COVID-19_injection", "/wiki/Corporate_media", "/wiki/2022_Russian_invasion_of_Ukraine", "/wiki/2022_Russian_invasion_of_Ukraine", "/wiki/Vladimir_Putin", "/wiki/Ukraine", "/wiki/Template:Citation_needed", "/wiki/Monkeypox", "/wiki/Pandemic_planning", "/wiki/Monkeypox", "/wiki/Monkeypox", "/wiki/French_President", "/wiki/Emmanuel_Macron", "#cite_note-4", "#cite_note-5", "/wiki/Mario_Draghi", "#cite_note-6", "/wiki/COVID-19_jabs", "/w/index.php?title=Template:How_low&action=edit&redlink=1", "/wiki/Template:Citation_needed", "/wiki/Property:Has_text", "/wiki/Property:Has_author", "/wiki/Inequality#_140a3af4281c1b20e19b2188a117bfb1", "/wiki/Politics", "/wiki/Alienation", "/wiki/Craig_Murray", "#cite_ref-1", "/wiki/Sweden", "/wiki/Burundi", "/wiki/Tanzania", "/wiki/Belarus", "#cite_ref-https:.2F.2Fsputniknews.com.2Feurope.2F202004031078824468-belaruss-president-warns-global-elites-using-covid-19-crisis-to-try-to-reshape-world-order.2FRT_2-0", "https://sputniknews.com/europe/202004031078824468-belaruss-president-warns-global-elites-using-covid-19-crisis-to-try-to-reshape-world-order/", "/wiki/RT", "#cite_ref-3", "https://www.dailymail.co.uk/news/article-9426533/Covid-19-vaccinations-mandatory-health-workers-Italy.html", "#cite_ref-4", "https://yournews.com/2022/07/14/2377259/macrons-minority-government-defeated-on-vaccine-passports/", "#cite_ref-5", "https://republicbroadcasting.org/news/macrons-minority-government-defeated-on-vaccine-passports/", "#cite_ref-6", "https://wildsage.us/index.php/2022/07/18/beating-back-the-wef-and-the-sprouts-in-brussels/"], "authors": [], "publish_date": null}