{"result_id": "343001", "URL": "https://wikispooks.com/wiki/Robert_Malone", "timestamp": "2023-04-25 18:13:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Robert_Malone", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Robert Malone - Wikispooks", "cleaned_text": "Dr. Robert Wallace Malone is an American medical researcher and entrepreneur credited for his contributions to early gene transfer technology, setting the stage for the deployment of mRNA vaccines, DNA as a drug, and gene therapy.[1]\n\nHe has served as Adjunct Associate Professor of Biotechnology at Kennesaw State University, as Associate Professor at the Uniformed Services University of the Health Sciences, as faculty at the University of Maryland Medical School and at the University of California Davis. He as worked extensively with the US DoD and stated in his CV that he had security clearance from them.\n\nHe reportedly became a COVID-19 dissident after suffering a serious adverse event from a Moderna COVID-19 jab.[2] In June 2021 he went public with his concerns, and has since been an outspoken and articulate critic of the official narrative about COVID-19 and mandation of injections, something which was quickly censored by big tech.\n\nHe is married to Jill Glasspool-Malone, a fellow biotechnology researcher and entrepreneur. The couple runs a horse breeding business called Cielo Azure Lusitanos equipped with \"a full laboratory for stallion collection and foaling capabilities\", including collection and shipping of semen.[3] He reports that she is responsible for half of his prolific internet output, and that they have additional help. In Malone's book, Lies My Government Told Me, he states that large portions of the writing credited to him are actually written by Jill.[4]\n\nIn 2021 he became an influential figure in the COVID-19 dissident community. After censorship in late 2021, he reached a wider audience in early 2022 to whom he promoted the \"mass formation psychosis\" ideas developed by Mattias Desmet. Some commentators were doubtful about him[5] but he quickly gained a large subscriber base. In Autumn 2022 he brought a $25M lawsuit against Peter Breggin after he claimed that Malone was controlled opposition being run by the Deep State, increasing questions about his good intent.[6]\n\nBy March 2023, his close relationship to the COVID-19 Perpetrators was the subject of intense research[7] after documents such as a File:RWM+CV+March+2017.pdf found a wide audience. Central to Malone's writing has been opposition to the jab mandation, which became less of an issue in 2023 after the public admission that the jabs do nothing to curb the spread of the disease.\n\nMalone studied medicine at Northwestern University where he obtained a doctorate in medicine, then specialized in clinical research at Harvard University and specialized in the field of pathologies and virology at University of California, Davis[8]. While still a student nearing the end of his doctorate at the Salk Institute for Biological Studies in La Jolla, he was one of the principal authors and one of the driving forces of a study describing for the first time how the expression protein in a foreign cell can be triggered by DNA or RNA packaged in fatty globules (liposomes), at a time while gene therapy was still only a concept. His study is considered the first scientific publication on the basics of, for example, mRNA vaccines that are rolled out during the Covid-19 operation. The co-authors of the 1989 seminal article were Philip Felgner and Inder Verma. Malone was also part of the team that carried out the first mRNA vaccine experiments.\n\nDuring his career Robert Malone has had a lot of contact with the national security apparatus.[9][10] Robert and his wife, Jill Glasspool-Malone, collaborated in the formation of Inovio Pharmaceuticals, with Jill having reportedly been responsible for incorporating the company.[11][12]\n\nMalone served as Associate Director of Clinical Research at DynPort Vaccine Company from 2002-2003. His responsibilities included preparing planning documents and product development plans, participating in the safety review of a smallpox vaccine, identification of new technologies, and managing in-house publication.\n\nIn a slideshow titled \"Interpandemic Vaccination Controversy, Challenge, Opportunity\", dated November 5, 2008, Malone described the potential for rapid development and authorization of novel vaccines in response to pandemic strains of influenza.[13] Another slideshow, titled \"DNA Vaccines: Where did this come from, and where do we go from here?\", dated November 13, 2008, outlined the steps of Malone's development of DNA vaccine technology.[14]\n\nMalone served as Medical Director of Vaccines at Accelovance from 2008-2009. In this capacity, he delivered a presentation dated November 19, 2008 titled \"Vaccine and OTC Product Advancement\".[15] In December 2008, Malone delivered a presentation for BioPractice titled \"Emerging And Re-emerging Infectious Diseases: New Vaccine Product Opportunities\".[16]\n\nIn June 2010, Malone was hired as Medical Director of Vaccines at the Beardsworth Consulting Group.[17][18] He remained in this position until 2013.\n\nIn August 2014, Malone was asked by colleagues at the Defense Threat Reduction Agency (DTRA) to help NewLink Genetics (through their subsidiary, BioProtection Systems) manage their Ebola project.[19] According to his CV, Malone \"built and led the initial team\" that \"took the Canadian rVSV-ZEBOV-G Ebola vaccine from an abandoned vaccine candidate to funding in the 100 million USD range.\"[20] This included implementing \"effective stockpiling strategies, project planning and clinical trials development for dosing strategies\" and recruiting Merck to the project.\n\nRobert and Jill both participated in the Harvard Medical School Global Clinical Scholars Program in 2015-2016.[21]\n\nMalone co-founded Atheric Pharmaceutical in February 2016.[22] He co-authored a paper published in March 2016 describing development of medical countermeasures to the Zika virus. His co-authors included Jane Homan, Michael Callahan, Jill Glasspool-Malone, Lambodhar Damodaran, Adriano De Bernardi Schneider, Rebecca Zimler, James Talton, Ronald Cobb, Ivan Ruzic, Julie Smith-Gagen, Daniel Janies and James Wilson.[23]\n\nHe published a followup study in August 2016 titled Zika Fetal Neuropathogenesis: Etiology of a Viral Syndrome. His co-authors included Zachary Klase, Svetlana Khakhina, Adriano De Bernardi Schneider, Michael Callahan and Jill Glasspool-Malone.[24]\n\nMalone worked closely with the United States Army Medical Research Institute of Infectious Diseases (USAMRIID) on his analysis of drug compounds.[25]\n\nAt some point in 2020, Steve Kirsch reached out to Malone for help applying for an Emergency Use Authorization (EUA) from the Biomedical Advanced Research and Development Authority (BARDA).[26]\n\nIn early 2020, Michael Callahan reached out to Malone to inform him about the emerging SARS-CoV-2 outbreak in Wuhan, China. By this time, Malone was working with the Defense Threat Reduction Agency (DTRA)'s Discovery of Medical Countermeasures Against Novel Entities (DOMANE) program, through which Malone began investigating famotidine.[27][28] On April 14, BARDA awarded Malone's company, Alchem Laboratories, a $20.7 million contract the conduct a clinical trial on the drug. On May 24, 2020, Malone published a pre-print study titled \"COVID-19: Famotidine, Histamine, Mast Cells, and Mechanisms\" co-authored with Jill Glasspool-Malone and others.[29] It underwent revisions on June 22 and August 31 before being published in Frontiers in Pharmacology on March 23, 2021.\n\nOn May 21, 2021, Robert and Jill Glasspool-Malone commented on an IPWatchdog article titled “The mRNA IP and Competitive Landscape Through One Year of the COVID-19 Pandemic – Part I” in which the pair complained that he was not credited.[30]\n\nMalone warned in 2021 that the RNA-vaccine risks outweigh the benefits in children, adolescents, and young adults, and that those who have recovered from natural SARS-CoV-2 infection should not get the injection.\n\nOn June 11, 2021 Malone appeared on the Dark Horse podcast alongside Bret Weinstein and Steve Kirsch, warning of the potential dangers of COVID-19 gene therapy injections of children.[32][33][34]\n\nMalone talked about government's lack of transparency about the risks and forcing people to take these experimental injections in violation of bioethical laws. He also pointed out that significant part of the reasons we have no adequate data on the RMNA-vaccine safety is because the US Food and Drug Administration has deliberately chosen not to require rigorous post-vaccination data collection and analysis.\n\nVideos of his opinions about the \"COVID-19 Vaccines\" were quickly removed from YouTube. He was locked out of LinkedIn. Five days after his DarkHorse podcast appearance, Malone's scientific achievements were removed from Wikipedia.[35]\n\nIn a June 24, 2021 interview with Tucker Carlson on Fox News,[36] Malone said:\n\n“[O]ne of my concerns are that the government is not being transparent with us about what those risks are. And so, I'm of the opinion that people have the right to decide whether to accept a vaccine or not, especially since these are experimental vaccines, [...] And so, my concern is that I know that there are risks. But we don't have access to the data, and the data haven't been captured rigorously enough so that we can accurately assess those risks — and therefore … we don't really have the information that we need to make a reasonable decision.” \n\nRobert Malone (June 24, 2021) [37]\n\nOn 9th July he was interviewed for the Corona Investigative Committee, where he repeated his position.[38][39] He went on The Jimmy Dore Show on 15 September 2021.[40]\n\nOn 21 September 2021, Malone pitched Reliance Life Sciences' RelCoVax to an online audience at the Vaccines Summit-2021, an event he also chaired.[41][42]\n\nMalone was deplatformed by Twitter on December 29, 2021 after sharing a video produced by the Canadian Covid Care Alliance titled \"The Pfizer Inoculations For COVID-19 – More Harm Than Good.\"[43]\n\nHe subsequently participated in an 3 hour interview with Joe Rogan that has been watched by tens of millions. Topics included not only COVID-19 but also mass formation and the need to withstand totalitarian policies enacted by technocrats in the name of COVID-19.[44][45][46] The interview transcript was entered into the Congressional Record by Troy E. Nehls after Twitter and YouTube removed the interview from their platforms.[47]\n\nOn December 6, 2022, Malone published Lies My Gov't Told Me: And the Better Future Coming through Skyhorse Publishing and Children's Health Defense.[48]\n\nMalone testified at the National Citizens Inquiry (NCI) in Toronto, Canada on March 30, 2023, where he discussed the 5th generation of warfare during the COVID-19 event.[49]\n\nAs late as June 14, 2021, Malone's posts were extensively included in the historical section on Wikipedia's RNA vaccine page. He was listed as a co-developer of a \"highly efficient in-vitro and in-vivo RNA transfection system using cationic liposomes\" in 1989. On June 16, his name was removed and his services attributed to unnamed researchers at the Salk Institute, the University of California, and the University of Wisconsin.\n\nOn 20 July, 2021, a Wikipedia search on Robert Malone forwarded to a US sportsman with the same name. An expanded Wikipedia search on Robert W. Malone gave no results.[51], meaning he has been totally removed from the English-language section of the encyclopedia.\n\nA Google search on his name on July 20, 2021 showed that the memory hole process had started. The top results were to several fact checkers, but highly unusual for a prominent person, the search gave no links to Wikipedia, except to the French version of Wikipedia on page 2. The US sportsman Robert Malone did not show in the results.\n\nAt the same time, the Hungarian biochemist Katalin Kariko is suddenly being promoted by the corporate media as the inventor of mRNA vaccines - a convenient choice considering Kariko is the senior vice president of BioNTech, the developer of Pfizer's COVID injection.[50]\n\nAn English Wikipedia page on him was created on 29 July 2021. It fairly quickly drew attention from at least one editor suspected as working for British intelligence services, 'Philip Cross'.[52] Other language versions were kept and expanded (French,[53] German,[54] Spanish [55]), by 2023 his article exists in 12 languages.\n\nSubstack does allow for retroactively editing of articles.[56] When Robert Malone started to receive criticism from Peter Breggin[57], notably on how the concept of mass formation should not include the psychiatric term psychosis[58], Malone started to remove relevant parts that Breggin pointed out from his articles.\n\nBreggin, in his article: Dr. Robert Malone Attacks and Maligns Leading Freedom Fighters,[59] cited the following from the initial version of Malones article: Power and Strategy of False Narratives (which gets sent to subscribers via email):\n\nMalone (under the assumption that it is him who has the sole access to his Substack account) did immediately remove the word \"overpriced\",[60] which still can be found in the cache of search engines.[61][62][63][64] Later on removing the last paragraphs of this article altogether (the removed part starts with \"Regarding the Breggins,\").[65]\n\nAt one point there was a call from Malone to Breggin,[66] which Malone mentioned on his Substack as well,[67] the mention of this he also later removed.[68]\n\nIn October 2022, Malone started a defamation lawsuit against Breggin for 25 Million USD.[66] Breggin commented on the effect: \"Does he want to make us too afraid and too exhausted to criticize his public policy theories and his numerous highly destructive attacks on leaders of the health freedom movement?\", while Malone comes across as oversensitive to the charge of being \"controlled opposition\"[69]\n• Interview at The Last American Vagabond", "opengraph": {"image": "https://wikispooks.com/w/images/f/f1/Robert_malone.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/Has_companieshouse:", "/wiki/Has_companiesintheuk:", "/wiki/Has_companycheck:", "/wiki/Has_companydirectorcheck:", "/wiki/File:Robert_w_malone-Twitter1.png", "/w/index.php?title=Gene_transfer&action=edit&redlink=1", "/wiki/MRNA_vaccines", "/w/index.php?title=DNA&action=edit&redlink=1", "/w/index.php?title=Gene_therapy&action=edit&redlink=1", "#cite_note-1", "/w/index.php?title=Kennesaw_State_University&action=edit&redlink=1", "/w/index.php?title=Uniformed_Services_University_of_the_Health_Sciences&action=edit&redlink=1", "/w/index.php?title=University_of_Maryland_Medical_School&action=edit&redlink=1", "/wiki/University_of_California_Davis", "/wiki/US_DoD", "/wiki/COVID-19_dissident", "/wiki/Moderna", "/wiki/COVID-19_jab", "#cite_note-2", "/wiki/2021", "/wiki/Official_narrative", "/wiki/Mandation_of_injections_for_COVID-19", "/wiki/Big_tech", "/w/index.php?title=Jill_Glasspool-Malone&action=edit&redlink=1", "/w/index.php?title=Cielo_Azure_Lusitanos&action=edit&redlink=1", "#cite_note-3", "#cite_note-4", "/wiki/COVID-19_dissident", "/wiki/Mass_formation_psychosis", "/wiki/Mattias_Desmet", "#cite_note-5", "/wiki/Peter_Breggin", "/wiki/Controlled_opposition", "/wiki/Deep_State", "#cite_note-6", "/wiki/COVID-19_Perpetrators", "#cite_note-7", "/wiki/File:RWM%2BCV%2BMarch%2B2017.pdf", "/wiki/Jab_mandation", "#Education", "#Career", "#Smallpox", "#Influenza", "#Ebola", "#Zika", "#COVID-19", "#RNA_Vaccine_warnings", "#June_2021_Dark_Horse_podcast", "#December_2021_Interview_with_Joe_Rogan", "#Censorship", "#Creation_of_a_new_Wikipedia_page", "#Criticism", "#Rewriting_of_Substack_articles", "#Resources", "#Quotes_by_Robert_Malone", "#References", "/wiki/Northwestern_University", "/wiki/Harvard_University", "/wiki/Virology", "/wiki/University_of_California,_Davis", "#cite_note-8", "/w/index.php?title=Salk_Institute_for_Biological_Studies&action=edit&redlink=1", "/w/index.php?title=La_Jolla&action=edit&redlink=1", "/wiki/MRNA_vaccines", "/wiki/Covid-19", "/wiki/1989", "/w/index.php?title=Philip_Felgner&action=edit&redlink=1", "/w/index.php?title=Inder_Verma&action=edit&redlink=1", "#cite_note-9", "#cite_note-10", "/w/index.php?title=Jill_Glasspool-Malone&action=edit&redlink=1", "/w/index.php?title=Inovio_Pharmaceuticals&action=edit&redlink=1", "#cite_note-11", "#cite_note-12", "/w/index.php?title=DynPort_Vaccine_Company&action=edit&redlink=1", "/wiki/Smallpox", "/wiki/Pandemic", "/w/index.php?title=Influenza&action=edit&redlink=1", "#cite_note-13", "/w/index.php?title=DNA_vaccine&action=edit&redlink=1", "#cite_note-14", "/w/index.php?title=Accelovance&action=edit&redlink=1", "#cite_note-15", "/w/index.php?title=BioPractice&action=edit&redlink=1", "#cite_note-16", "/w/index.php?title=Beardsworth_Consulting_Group&action=edit&redlink=1", "#cite_note-17", "#cite_note-18", "/wiki/Defense_Threat_Reduction_Agency", "/w/index.php?title=NewLink_Genetics&action=edit&redlink=1", "/w/index.php?title=BioProtection_Systems&action=edit&redlink=1", "/wiki/Ebola", "#cite_note-19", "#cite_note-20", "/wiki/Merck", "/w/index.php?title=Harvard_Medical_School_Global_Clinical_Scholars_Program&action=edit&redlink=1", "#cite_note-21", "/w/index.php?title=Atheric_Pharmaceutical&action=edit&redlink=1", "#cite_note-22", "/w/index.php?title=Medical_countermeasures&action=edit&redlink=1", "/wiki/Zika", "/w/index.php?title=Jane_Homan&action=edit&redlink=1", "/wiki/Michael_Callahan", "/w/index.php?title=Jill_Glasspool-Malone&action=edit&redlink=1", "/w/index.php?title=Lambodhar_Damodaran&action=edit&redlink=1", "/w/index.php?title=Adriano_De_Bernardi_Schneider&action=edit&redlink=1", "/w/index.php?title=Rebecca_Zimler&action=edit&redlink=1", "/w/index.php?title=James_Talton&action=edit&redlink=1", "/w/index.php?title=Ronald_Cobb&action=edit&redlink=1", "/w/index.php?title=Ivan_Ruzic&action=edit&redlink=1", "/w/index.php?title=Julie_Smith-Gagen&action=edit&redlink=1", "/w/index.php?title=Daniel_Janies&action=edit&redlink=1", "/wiki/James_Wilson", "#cite_note-23", "/w/index.php?title=Zachary_Klase&action=edit&redlink=1", "/w/index.php?title=Svetlana_Khakhina&action=edit&redlink=1", "/w/index.php?title=Adriano_De_Bernardi_Schneider&action=edit&redlink=1", "#cite_note-24", "/w/index.php?title=United_States_Army_Medical_Research_Institute_of_Infectious_Diseases&action=edit&redlink=1", "#cite_note-25", "/wiki/Steve_Kirsch", "/wiki/Emergency_Use_Authorization", "/w/index.php?title=Biomedical_Advanced_Research_and_Development_Authority&action=edit&redlink=1", "#cite_note-26", "/wiki/Michael_Callahan", "/wiki/SARS-CoV-2", "/wiki/Wuhan", "/wiki/China", "/wiki/Defense_Threat_Reduction_Agency", "/w/index.php?title=Discovery_of_Medical_Countermeasures_Against_Novel_Entities&action=edit&redlink=1", "/w/index.php?title=Famotidine&action=edit&redlink=1", "#cite_note-27", "#cite_note-28", "/w/index.php?title=Alchem_Laboratories&action=edit&redlink=1", "/w/index.php?title=Jill_Glasspool-Malone&action=edit&redlink=1", "#cite_note-29", "/w/index.php?title=Frontiers_in_Pharmacology&action=edit&redlink=1", "/w/index.php?title=Jill_Glasspool-Malone&action=edit&redlink=1", "/w/index.php?title=IPWatchdog&action=edit&redlink=1", "#cite_note-30", "/wiki/File:Robert_w_malone-Twitter2.png", "/wiki/File:Robert_w_malone-Twitter3.png", "/wiki/File:Robert_w_malone-Twitter3.png", "#cite_note-31", "/wiki/2021", "/w/index.php?title=Dark_Horse_podcast&action=edit&redlink=1", "/w/index.php?title=Bret_Weinstein&action=edit&redlink=1", "/wiki/Steve_Kirsch", "#cite_note-32", "#cite_note-33", "#cite_note-34", "/wiki/Universal_Declaration_on_Bioethics_and_Human_Rights", "/wiki/US_Food_and_Drug_Administration", "/wiki/COVID-19_Vaccines", "/wiki/YouTube", "/wiki/LinkedIn", "/wiki/Wikipedia", "#cite_note-35", "/wiki/Tucker_Carlson", "/wiki/Fox_News", "#cite_note-36", "#cite_note-https:.2F.2Fnews.yahoo.com.2Fsingle-most-qualified-mrna-expert-173600060.html-37", "/wiki/Corona_Investigative_Committee", "#cite_note-38", "#cite_note-39", "/wiki/The_Jimmy_Dore_Show", "#cite_note-40", "/w/index.php?title=Reliance_Life_Sciences&action=edit&redlink=1", "/w/index.php?title=RelCoVax&action=edit&redlink=1", "/w/index.php?title=Vaccines_Summit-2021&action=edit&redlink=1", "#cite_note-41", "#cite_note-42", "/wiki/File:Robert_Malone_1_January_2022_Interview_with_Joe_Rogan.jpg", "/wiki/File:Robert_Malone_1_January_2022_Interview_with_Joe_Rogan.jpg", "/wiki/Joe_Rogan", "/wiki/Peter_Duesberg", "/wiki/90s", "/wiki/Great_Barrington_declaration", "/wiki/COVID_censorship", "/wiki/Twitter", "/w/index.php?title=Canadian_Covid_Care_Alliance&action=edit&redlink=1", "#cite_note-43", "/wiki/Joe_Rogan", "/wiki/COVID-19", "/wiki/Mass_formation", "/wiki/Totalitarian", "/wiki/Technocrats", "/wiki/COVID-19", "#cite_note-44", "#cite_note-45", "#cite_note-46", "/wiki/Congressional_Record", "/w/index.php?title=Troy_E._Nehls&action=edit&redlink=1", "#cite_note-47", "/w/index.php?title=Skyhorse_Publishing&action=edit&redlink=1", "/wiki/Children%27s_Health_Defense", "#cite_note-48", "/w/index.php?title=National_Citizens_Inquiry&action=edit&redlink=1", "/wiki/Toronto", "/wiki/Canada", "/wiki/5th_generation_of_warfare", "/wiki/COVID-19_event", "#cite_note-49", "/wiki/2021", "/w/index.php?title=Salk_Institute&action=edit&redlink=1", "/wiki/University_of_California", "/wiki/University_of_Wisconsin", "/wiki/File:Wikipedia-entry-thumb.jpg", "/wiki/File:Wikipedia-entry-thumb.jpg", "#cite_note-coercioncode-50", "/wiki/File:Wikipedia-entry-removed-thumb.jpg", "/wiki/File:Wikipedia-entry-removed-thumb.jpg", "#cite_note-coercioncode-50", "#cite_note-51", "/wiki/Memory_hole", "/wiki/Fact_checker", "/wiki/Wikipedia", "/w/index.php?title=Katalin_Kariko&action=edit&redlink=1", "/wiki/Corporate_media", "/wiki/MRNA_vaccines", "/wiki/BioNTech", "/wiki/Pfizer", "#cite_note-coercioncode-50", "/wiki/2021", "/wiki/Philip_Cross", "#cite_note-52", "#cite_note-53", "#cite_note-54", "#cite_note-55", "/wiki/2023", "/wiki/Substack", "#cite_note-56", "/wiki/Peter_Breggin", "#cite_note-57", "/wiki/Mass_formation", "#cite_note-58", "#cite_note-59", "/wiki/Peter_McCullough", "/w/index.php?title=Harvey_Risch&action=edit&redlink=1", "/w/index.php?title=Vitamins&action=edit&redlink=1", "/w/index.php?title=Telemedicine&action=edit&redlink=1", "/w/index.php?title=Foster_Colson&action=edit&redlink=1", "#cite_note-60", "/wiki/Search_engines", "#cite_note-61", "#cite_note-62", "#cite_note-63", "#cite_note-64", "#cite_note-65", "#cite_note-Breggin-66", "#cite_note-67", "#cite_note-68", "#cite_note-Breggin-66", "#cite_note-69", "https://odysee.com/@Corona-Ausschuss:3/Sitzung-60-Die-Zeit-ist-kein-flacher-Kreis-3-Robert-Malone:d", "https://www.thelastamericanvagabond.com/dr-robert-malone-interview-inventor-of-mrna-technology-censored-for-speaking-out-on-vaccine-risks/", "https://sites.google.com/housatonicits.com/home0003/research/robert-wallace-malone-b1959", "/wiki/Property:Has_text", "/wiki/Generations_of_warfare#_57e269743f8d5b648b401cce6fd63ea1", "/wiki/Google", "/w/index.php?title=Jordon_Walker&action=edit&redlink=1", "/wiki/Pfizer", "/wiki/Veritas", "/wiki/Mass_formation_psychosis", "/wiki/Rogan", "/w/index.php?title=These_results_are_changing_rapidly&action=edit&redlink=1", "/wiki/COVID_censorship", "/wiki/Wayback_machine", "/wiki/Social_media", "/wiki/Conspiracy_theories", "/wiki/O%E2%80%99Keefe", "/wiki/Search_engine#_29e705af0c66a077be9f28744220ac9b", "#cite_ref-1", "https://doi.org/10.1038/d41586-021-02483-w", "#cite_ref-2", "https://web.archive.org/web/20230210172547/https://pennybutler.com/robert-malone-moderna-injury/", "#cite_ref-3", "http://archive.today/2023.03.04-071036/https://www.lusitanostud.com/new-page", "#cite_ref-4", "https://www.google.ca/books/edition/Lies_My_Gov_t_Told_Me/p9taEAAAQBAJ?hl=en&gbpv=1&dq=Lies+My+Government+Told+Me", "#cite_ref-5", "https://www.podbean.com/site/EpisodeDownload/PB117BAAD9Q66F", "#cite_ref-6", "https://rumble.com/v1nl12y-dr.-robert-malone-warns-something-strange-is-happening-worldwide-tearing-ou.html", "#cite_ref-7", "https://georgewebb.substack.com/p/where-was-robert-malone-on-911", "#cite_ref-8", "https://www.rwmalonemd.com/", "#cite_ref-9", "http://archive.today/2021.10.15-003733/https://twitter.com/gumby4christ/status/1448762599277936650", "#cite_ref-10", "http://archive.today/2022.01.01-101327/https://threadreaderapp.com/thread/1448762599277936650.html", "#cite_ref-11", "http://archive.today/2023.01.22-041301/https://twitter.com/rwmalonemd/status/1430929920121835527", "#cite_ref-12", "https://web.archive.org/web/20211116181002/https://static1.squarespace.com/static/550b0ac4e4b0c16cdea1b084/t/60b61dbe39f1e800244e53e4/1622547902895/RWM+CV+1+June+2021+.pdf", "#cite_ref-13", "https://web.archive.org/web/20230306080423/https://www.slideshare.net/rwmalonemd/interpandemic-vaccination-controversy-challenge-opportunity-presentation", "#cite_ref-14", "https://web.archive.org/web/20230306080624/https://www.slideshare.net/rwmalonemd/Naked-DNA-and-DNA-Vaccines-A-Retrospective", "#cite_ref-15", "https://web.archive.org/web/20220921214759/https://www.slideshare.net/rwmalonemd/Accelovance-Vaccines-and-OTC", "#cite_ref-16", "https://web.archive.org/web/20230306080505/https://www.slideshare.net/rwmalonemd/Emerging-and-ReEmerging-Infectious-Disease-Vaccines-09Dec08-Final", "#cite_ref-17", "http://archive.today/2023.03.05-183739/https://www.newspapers.com/clip/114992006/dr-malone/", "#cite_ref-18", "https://archive.ph/HTZ5b", "#cite_ref-19", "https://web.archive.org/web/20170714055404/http://www.atheric.com/team", "#cite_ref-20", "https://web.archive.org/web/20230119104151/https://static1.squarespace.com/static/550b0ac4e4b0c16cdea1b084/t/58e5406b5016e1f1acacae75/1491419246742/RWM+CV+March+2017.pdf", "#cite_ref-21", "https://doi.org/10.1371/journal.pntd.0004530", "#cite_ref-22", "https://archive.ph/DZhAm", "#cite_ref-23", "https://doi.org/10.1371/journal.pntd.0004530", "#cite_ref-24", "https://doi.org/10.1371/journal.pntd.0004877", "#cite_ref-25", "https://web.archive.org/web/20230119104151/https://static1.squarespace.com/static/550b0ac4e4b0c16cdea1b084/t/58e5406b5016e1f1acacae75/1491419246742/RWM+CV+March+2017.pdf", "#cite_ref-26", "https://web.archive.org/web/20230222180536/https://rumble.com/v27aicu-full-episode-64-defeat-the-mandates-anniversary-with-robert-malone-md.html", "#cite_ref-27", "https://doi.org/10.1126/science.abc4739", "#cite_ref-28", "https://web.archive.org/web/20200711060533/https://cen.acs.org/pharmaceuticals/Pepcid-treat-COVID-19/98/i25", "#cite_ref-29", "https://doi.org/10.21203/rs.3.rs-30934/v2", "#cite_ref-30", "http://archive.today/2023.03.04-185835/https://ipwatchdog.com/2021/04/11/mrna-ip-competitive-landscape-one-year-covid-19-pandemic-part/id=132130/", "#cite_ref-31", "http://web.archive.org/web/20210718130625/https://www.cryptogon.com/?p=61789", "#cite_ref-32", "/w/index.php?title=Dark_Horse_podcast&action=edit&redlink=1", "https://web.archive.org/web/20210806105046/https://www.youtube.com/watch?v=QGv_QnEvX-w", "#cite_ref-33", "https://articles.mercola.com/sites/articles/archive/2021/06/21/mrna-inventor-interviewed-about-injection-dangers.aspx", "#cite_ref-34", "https://podcasts.apple.com/us/podcast/how-to-save-the-world-in-three-easy-steps/id1471581521?i=1000525032595", "https://archive.fo/xC2qx", "#cite_ref-35", "https://www.lifesitenews.com/news/inventor-of-mrna-technology-removed-from-wikipedia-after-he-warned-against-taking-covid-jabs/", "#cite_ref-36", "https://www.bitchute.com/video/Dec6KSJbs16t/", "#cite_ref-https:.2F.2Fnews.yahoo.com.2Fsingle-most-qualified-mrna-expert-173600060.html_37-0", "https://news.yahoo.com/single-most-qualified-mrna-expert-173600060.html", "#cite_ref-38", "https://www.facebook.com/renate.holzeisen/posts/1456046624734214", "#cite_ref-39", "https://odysee.com/@Corona-Ausschuss:3/Sitzung-60-Die-Zeit-ist-kein-flacher-Kreis-3-Robert-Malone:d", "#cite_ref-40", "https://www.youtube.com/watch?v=iwPKnOhJRYg", "#cite_ref-41", "https://web.archive.org/web/20210420005033/https://scientiameetings.com/conferences/vaccines/speakers", "#cite_ref-42", "https://web.archive.org/web/20230208073041/https://rumble.com/v28ntb2-sep-21-2021-robert-malone-relcovax-2ndgen-multivalent-sars-cov-2-vaccine-ca.html", "#cite_ref-43", "http://archive.today/2022.01.01-005103/https://www.visiontimes.com/2021/12/31/robert-malone-twitter-ban-pfizer-clinical-trial.html", "#cite_ref-44", "https://www.dailyangle.com/articles/dr-robert-malone-spends-3-hours-with-joe-rogan-after-twitter-ban", "#cite_ref-45", "https://odysee.com/@Hartemeester:0/joe-rogan-interviews-dr.robert-malone-joe-rogan-podcast:9", "#cite_ref-46", "https://www.reddit.com/r/conspiracy/comments/ru5ii7/joe_rogan_and_dr_robert_malone_md_interview/", "https://web.archive.org/web/20220102083931/https://www.reddit.com/r/conspiracy/comments/ru5ii7/joe_rogan_and_dr_robert_malone_md_interview/", "https://archive.fo/lHrfS", "#cite_ref-47", "https://nehls.house.gov/posts/joe-rogan-experience-1757-dr-robert-malone-md-full-transcript", "http://web.archive.org/web/20220103174745/https://nehls.house.gov/posts/joe-rogan-experience-1757-dr-robert-malone-md-full-transcript", "https://archive.is/koDav", "#cite_ref-48", "https://web.archive.org/web/20230109022648/https://www.skyhorsepublishing.com/9781510773240/lies-my-govt-told-me/", "#cite_ref-49", "http://archive.today/2023.03.31-194247/https://www.theepochtimes.com/governments-used-fifth-generation-warfare-on-canadians-during-covid-robert-malone-tells-national-citizens-inquiry_5160315.html", "#cite_ref-coercioncode_50-0", "#cite_ref-coercioncode_50-1", "#cite_ref-coercioncode_50-2", "https://coercioncode.com/2021/07/11/dr-robert-malone-mrna-vaccine-inventor-censored/", "#cite_ref-51", "https://en.wikipedia.org/w/index.php?search=Robert+W.+Malone&title=Special%3ASearch&go=Go&ns0=1", "#cite_ref-52", "https://archive.is/ZjkDA", "#cite_ref-53", "https://web.archive.org/web/20210720190624/https://fr.wikipedia.org/wiki/Robert_Malone", "#cite_ref-54", "https://web.archive.org/web/20210720190455/https://de.wikipedia.org/wiki/Robert_Malone", "#cite_ref-55", "https://web.archive.org/web/20210720190629/https://es.wikipedia.org/wiki/Robert_Malone", "#cite_ref-56", "https://support.substack.com/hc/en-us/articles/360037462772-If-I-edit-a-post-after-emailing-it-to-my-subscribers-will-the-updated-post-be-emailed-to-them-again-", "https://web.archive.org/web/20220127081832/https://support.substack.com/hc/en-us/articles/360037462772-If-I-edit-a-post-after-emailing-it-to-my-subscribers-will-the-updated-post-be-emailed-to-them-again-", "#cite_ref-57", "https://www.americaoutloud.com/stop-citing-the-themis-report-its-hot-garbage/", "#cite_ref-58", "https://breggin.com/article-detail/post_detail/Desmet-credits-Malone-for-adding-psychosis-to-the-term-mass-formation", "#cite_ref-59", "https://breggin.com/article-detail/post_detail/Dr-Robert-Malone-Attacks-and-Maligns-Leading-Freedom-Fighters", "https://web.archive.org/web/20221103062629/https://breggin.com/article-detail/post_detail/Dr-Robert-Malone-Attacks-and-Maligns-Leading-Freedom-Fighters", "https://archive.ph/aPhJ6", "#cite_ref-60", "https://web.archive.org/web/20221003101724/https://rwmalonemd.substack.com/p/power-and-strategy-of-false-narratives", "https://archive.ph/U03y6", "#cite_ref-61", "http://archive.today/2023.01.03-222105/https://www.ecosia.org/search?method=index&q=site:rwmalonemd.substack.com%20overpriced%20vitamins", "#cite_ref-62", "http://archive.today/2023.01.03-223237/https://duckduckgo.com/?q=site:rwmalonemd.substack.com+overpriced+vitamins&ia=web", "#cite_ref-63", "http://archive.today/2023.01.03-223941/https://metager.de/meta/meta.ger3?eingabe=site:rwmalonemd.substack.com+overpriced+vitamins&focus=web", "#cite_ref-64", "https://web.archive.org/web/20230103224157/https://metager.de/meta/meta.ger3?eingabe=site:rwmalonemd.substack.com+overpriced+vitamins&focus=web", "#cite_ref-65", "https://web.archive.org/web/20230106042645/https://rwmalonemd.substack.com/p/power-and-strategy-of-false-narratives", "https://archive.ph/vaY9G", "#cite_ref-Breggin_66-0", "#cite_ref-Breggin_66-1", "https://www.americaoutloud.com/robert-malone-sues-the-breggins-for-25-million/", "https://web.archive.org/web/20221128005259/https://www.americaoutloud.com/robert-malone-sues-the-breggins-for-25-million/", "#cite_ref-67", "https://web.archive.org/web/20220906150415/https://rwmalonemd.substack.com/p/well-being-stoking-rage", "https://archive.ph/2022.09.06-150415/https://rwmalonemd.substack.com/p/well-being-stoking-rage", "#cite_ref-68", "https://web.archive.org/web/20230107024454/https://rwmalonemd.substack.com/p/well-being-stoking-rage", "https://archive.ph/JpZiQ", "#cite_ref-69", "https://rwmalonemd.substack.com/p/power-and-strategy-of-false-narratives"], "authors": [], "publish_date": null}