{"result_id": "343004", "URL": "https://wikispooks.com/wiki/Andrew_Pollard", "timestamp": "2023-04-25 18:13:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Andrew_Pollard", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Andrew Pollard - Wikispooks", "cleaned_text": "Andrew Pollard is Professor of Paediatric Infection and Immunity at the University of Oxford, Honorary Consultant Paediatrician at Oxford Children’s Hospital and Vice Master of St Cross College, Oxford.[1]\n\nIn 2001 Andrew Pollard was appointed Director of the Oxford Vaccine Group, which comprises around 75 members across a number of disciplines, including consultants in paediatrics and vaccinology, clinical research fellows, research nurses, statisticians, post-doctoral laboratory scientists, research assistants and DPhil students.\n\nOVG’s Director, Andrew Pollard, is concurrently Senior Advisor to the Medicines and Healthcare Products Regulatory Agency (MHRA) Panel, advises the European Medicine Agency (EMA) and chairs the Joint Committee on Vaccination and Immunisation (JCVI).[2]\n\nOn 21 May 2020, Liz Watkins Barton reported on Facebook:\n\nOne day after revelations that the Gates/Fauci Moderna vax caused severe illnesses in 20% of high-dose recipients, Bill Gates got devastating news about his other “warp-speed” COVAX bet.\n\nThe Oxford Vaccine Group (OVG) spiked-protein vaccine was on an even faster track than Moderna. In May, Melinda Gates predicted it would be jab-ready by years’ end. Oxford and UK officials promised 30 million doses by September\n\nOn April 24, OVG scientists announced that macaque studies proved the vaccine effective. OVG quickly recruited 510 healthy volunteers for human trials. Raw data released this week reveal the OVG team was lying.\n\nAll vaccinated macaques sickened after exposure to COVID-19. Edinburgh University’s Eleanor Riley told Forbes the vax provided ‘insufficient’ antibodies to prevent infection and viral shedding. Vaxxed monkeys spread the disease as readily as unvaccinated.\n\nThe OVG is politically wired. Lead developer, Andrew Pollard juggles scandalous conflicts that allow him to license, register, + mandate his own untested vaccines to the masses. Pollard’s political contacts won him $110 million in government grants for his jab. Pollard is Senior Advisor to Britain’s MHRA Panel which licenses vaccines, chairs Britain’s JCVI committee that mandates them + advises the European Medicine Agency (EMA) He takes payments from virtually all the big vax makers.\n\nIn 2014, Pollard developed GlaxoSmithKline’s notorious Bexero Meningitis vax, and then mandated it to children precipitating a Kawasaki disease epidemic. The package insert says Bexero may cause Kawasaki in 3 out of every 1000 children.\n\nPollard used his power and deceitful puffery about the monkey trial to prematurely bulldoze his COVID-19/Vaccine into human trials. He shunned placebo tests + restricted safety studies to a tight timeline to hide long-term injuries. He included only super healthy people while planning to roll out his vaccine to vulnerable children with chronic co-morbidities and fragile elders.\n\nPollard, is steaming ahead with his ineffective vaccine. He claims that it might make symptoms milder. But a vaccine that hides symptoms + allows transmission is worse than no vaccine at all.[3]", "opengraph": {"image": "https://wikispooks.com/w/images/4/4a/Andrew_Pollard.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/Has_companieshouse:", "/wiki/Has_companiesintheuk:", "/wiki/Has_companycheck:", "/wiki/Has_companydirectorcheck:", "/wiki/Category:Pages_with_unsourced_text", "/wiki/University_of_Oxford", "#cite_note-1", "#OVG_Director", "#JCVI_Chair", "#Facebook_critique", "#References", "/wiki/Oxford_Vaccine_Group", "/wiki/OVG", "https://www.gov.uk/government/groups/the-review-panel-mhra", "https://www.ema.europa.eu/en", "/wiki/Joint_Committee_on_Vaccination_and_Immunisation", "#cite_note-2", "/wiki/Facebook", "/wiki/Bill_Gates", "/wiki/Anthony_Fauci", "https://edition.cnn.com/2020/05/22/investing/moderna-coronavirus-vaccine-stock-sales/index.html", "/wiki/Bill_Gates", "/wiki/COVID-19/Vaccine", "/wiki/Oxford_Vaccine_Group", "https://edition.cnn.com/2020/05/22/investing/moderna-coronavirus-vaccine-stock-sales/index.html", "/wiki/Melinda_Gates", "/wiki/OVG", "/wiki/OVG", "/wiki/OVG", "/wiki/COVID-19", "/wiki/Edinburgh_University", "/w/index.php?title=Eleanor_Riley&action=edit&redlink=1", "/wiki/OVG", "/wiki/JCVI", "/wiki/GlaxoSmithKline", "/wiki/COVID-19/Vaccine", "#cite_note-3", "#cite_ref-1", "https://www.ovg.ox.ac.uk/team/andrew-pollard", "#cite_ref-2", "https://www.gov.uk/government/groups/joint-committee-on-vaccination-and-immunisation", "#cite_ref-3", "https://www.facebook.com/photo.php?fbid=2683849391834827&set=a.1545484785671299&type=3&theater"], "authors": [], "publish_date": null}