{"result_id": "343002", "URL": "https://wikispooks.com/wiki/Talk:COVID-19/Vaccine", "timestamp": "2023-04-25 18:13:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Talk:COVID-19/Vaccine", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Talk:COVID-19/Vaccine - Wikispooks", "cleaned_text": "By design -- as far es the ON is concerned -- a vaccine has the potential to make a strong immune system more resilient, but in contrast a weak immune system might suffer more likely from adverse reactions. Doesn't that sound like the common \"the strong will survive\"-refrain of social darwinism aka eugenics? The line has to be drawn somewhere and this line may be manipulated by choosing the right subjects for tests. A vaccine might be of little harm to a well fed middle class steak eater but not so for the rest of humanity. Urban (talk) 08:51, 25 May 2020 (UTC)\n\nAnd upper middle class people in the West might anyway receive a different vaccine formula than people in Afghanistan, India etc... Terje (talk) 09:50, 25 May 2020 (UTC)---\n\nSome information I found on Stem cell therapy used in vaccines\n\nNot sure if these links are useful to anyone, I did a search of stem cell therapy being used in vaccines. I will be looking further into it. Sorry if this information is not useful.\n\nGood points above here; some more from the Erasmus University Rotterdam https://science.sciencemag.org/content/sci/early/2021/02/16/science.abf4896.full.pdf -- User:Jun 17:47, 17 February 2021 (UTC)\n\nWanted to put in some parts from a Gallup poll, but then stopped looking at their numbers.[1] Is there an accounting system that would give you 101%, that I am not aware of ?? Thanks for any help. Epoch Times report -- Sunvalley (talk) 17:36, 15 March 2021 (UTC)\n\nI will remove this section and put it here since it is way too outdated. IMO Only the Moon of Alabama observation makes sense to keep, but then it may be better added to the Sputnik V article. So for the time being I leave it here, please put back in if I'm mistaken. --Sunvalley (talk) 21:00, 11 May 2021 (UTC)\n\nOn 11 August 2020, Science Magazine reported that Russia had \"approved\" the world’s first COVID-19 vaccine, as the nation’s Ministry of Health issued what’s called a registration certificate for a vaccine candidate that has been tested in just 76 people. The certificate allows the vaccine, \"Sputnik V\", developed by the Gamaleya Research Institute in Moscow, to be given to “a small number of citizens from vulnerable groups,” including medical staff and the elderly. But the certificate stipulates that the vaccine cannot be used widely until 1 January 2021, presumably after larger clinical trials have been completed.\n\nGamaleya has developed vaccines before, and Mikhail Murashko, the Russian minister of health, said in a government press release that the COVID-19 vaccine showed “high efficacy and safety” and there were no serious side effects. The same release suggested the vaccine would confer 2 years of immunity to SARS-CoV-2, the virus that causes COVID-19. That estimate is apparently based on vaccines Gamaleya has made with similar technology.\n\nRussian President Vladimir Putin reportedly endorsed the use of the Gam-COVID-Vac Lyo vaccine, which is dubbed \"Sputnik V” saying it had “passed all necessary steps” and noting that one of his adult daughters had received it. (Putin has not clearly acknowledged his children in public, but he does sometimes refer to them; one is a medical doctor in Moscow.) Putin, who apparently made these comments at a government meeting, added, “I hope we can start a massive release of this vaccine soon.”[2]\n\nOn 12 August 2020, Moon of Alabama reported that Western media had indulged in an anti-Russian frenzy to sow fear and doubt about the vaccine based on a willful misinterpretation of the Russian announcement: \"Russia has not approved a vaccine against Covid-19 and it is not skipping large-scale clinical trials.\"[3]\n\nAdding |so_called=1 would be a considerable change, not least because all references to COVID vaccines should then be changed to reflect that, i.e. \"COVID vaccines\", but I think it is justified in terms of accuracy. Any thoughts? -- Robin (talk) 17:48, 8 November 2021 (UTC)\n\nDon't know if this would be helpful?\n\nI was on the online patient thing, and I saw some articles about the Vaccine and some names for them.\n\nDon't know if this is useless information. But I thought it might help.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#Some_thoughts", "#Some_information_I_found_on_Stem_cell_therapy_used_in_vaccines", "#Nasal-Spray", "#Gallup_Polls", "#Removing_section", "#Russian_vaccine_candidate", "#.22.7Cso_called.22", "#Don.27t_know_if_this_would_be_helpful.3F", "/w/index.php?title=Social_darwinism&action=edit&redlink=1", "/wiki/Eugenics", "/wiki/User:Urban", "/wiki/User_talk:Urban", "/wiki/User:Terje", "/wiki/User_talk:Terje", "https://www.bloomberg.com/features/2020-moderna-biontech-covid-shot/", "https://www.webmd.com/lung/news/20200403/fda-oks-1st-stem-cell-human-trial-for-covid-19", "https://www.cdc.gov/flu/prevent/cell-based.htm", "https://newsroom.ucla.edu/releases/stem-cell-research-covid-19", "https://www.sciencemediacentre.co.nz/2020/08/27/covid-19-vaccines-developed-with-human-embryonic-cells-expert-reaction/", "/wiki/Erasmus_University_Rotterdam", "https://science.sciencemag.org/content/sci/early/2021/02/16/science.abf4896.full.pdf", "/wiki/User:Jun", "/w/index.php?title=Gallup&action=edit&redlink=1", "#cite_note-1", "https://www.theepochtimes.com/the-biggest-covid-19-vaccine-skeptics-frontline-health-care-workers_3724145.html", "/wiki/User:Sunvalley", "/wiki/User_talk:Sunvalley", "/wiki/User:Jun", "/wiki/User_talk:Jun", "/wiki/Moon_of_Alabama", "/wiki/Sputnik_V", "/wiki/User:Sunvalley", "/wiki/User_talk:Sunvalley", "/wiki/User:Robin", "/wiki/User_talk:Robin", "/wiki/File:COVID-19_vaccine.jpg", "/wiki/File:COVID-19_vaccine.jpg", "https://sputnikvaccine.com/", "/wiki/Russia", "/wiki/COVID-19", "/wiki/Sputnik_V", "/wiki/Gamaleya_Research_Institute", "/wiki/Moscow", "/w/index.php?title=Mikhail_Murashko&action=edit&redlink=1", "/wiki/COVID-19", "/wiki/SARS-CoV-2", "/wiki/COVID-19", "/wiki/Vladimir_Putin", "/w/index.php?title=Gam-COVID-Vac_Lyo&action=edit&redlink=1", "https://sputnikvaccine.com/", "#cite_note-2", "/wiki/Moon_of_Alabama", "/wiki/Russia", "/wiki/Covid-19", "#cite_note-3", "/wiki/File:Vaccine_redefinition_April_2020.jpg", "/wiki/COVID_vaccines", "/wiki/COVID_vaccines", "/wiki/User:Robin", "/wiki/User_talk:Robin", "/wiki/User:Terje", "/wiki/User_talk:Terje", "/wiki/User:Robin", "/wiki/User_talk:Robin", "https://www.qwant.com/?q=Spikevax&client=ext-chrome-sb&t=web", "https://www.qwant.com/?q=COMIRNATY&client=ext-chrome-sb&t=web", "#cite_ref-1", "http://archive.today/2021.02.21-005726/https://news.gallup.com/poll/328688/front-line-workers-no-keener-others-vaccine.aspx", "#cite_ref-2", "https://www.sciencemag.org/news/2020/08/russia-s-approval-covid-19-vaccine-less-meets-press-release", "#cite_ref-3", "https://www.moonofalabama.org/2020/08/western-media-falsely-claim-that-russias-covid-19-vaccine-is-ready-to-go.html"], "authors": [], "publish_date": null}