{"result_id": "343032", "URL": "https://wikispooks.com/wiki/Pfizer%E2%80%93BioNTech_COVID-19_vaccine", "timestamp": "2023-04-25 18:13:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Pfizer%E2%80%93BioNTech_COVID-19_vaccine", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Pfizer–BioNTech COVID-19 vaccine - Wikispooks", "cleaned_text": "The Pfizer–BioNTech COVID-19 vaccine (tozinameran), sold under the brand name Comirnaty, is an mRNA-based COVID-19 vaccine developed by the German biotechnology company BioNTech in collaboration with Pfizer. As of 30 March 2021, Pfizer and BioNTech aimed to manufacture about 2.5 billion doses in 2021.[1]\n\nOn 26 October 2021, the FDA approved the vaccine for children over 5.[2]\n\nThe actual product is a trade secret, but a Pfizer injection contains maybe 14.400 trillion synthetic spike proteins wrapped in lipid nanoparticles. The nanoparticles might be able to carry 8 mRNA proteins each.[4] The nanoparticles are made up of the widely used pharmaceutical ingredient polyethylene glycol (PEG). This is the first time they are used in an injection.[5]\n\nThe lipid shell plays a triple role. First, it protects the genetic material from degradation prior to cellular uptake. Second, the lipid shell, which also contains cholesterol, facilitates cellular uptake through fusion with the lipid membrane of the cell. And finally, it acts as an adjuvant.\n\nA 2019 study showed that small doses of PEG can lead to dramatic pathological immune activation. Animal studies has shown that it is responsible for both anaphylaxis and cardiovascular collapse, and injected PEG activates multiple allergic reactions in humans as well.[6]\n\nIn the clinical phase the RNA, was produced with completely different techniques to how it is being mass produced. During the clinical phase they only needed small volumes of vaccine, they were able to use very expensive techniques that delivered highly purified end products. Now that they have entered mass production, that is no longer possible, they have had to switch to lower-cost processes, e.g. using huge quantities of DNA that functions as the substrate to be able to produce the RNA in an in-vitro transcription reaction….[7]\n\nOn 21 December 2020, following approval by the UK's MHRA and the US FDA, the European Medicines Agency (EMA) authorised the Pfizer BioNTech Covid-19 vaccine for the EU's nearly 448 million inhabitants. The EMA said the drug had demonstrated an efficacy of 95% and could be used in people aged 16 and over:\n\nOn 26th of July 2021, the cybersecurity researcher Ehden Biber started to publish the contract Pfizer has with Brazil and Albania online, using the hashtag #PfizerLeak on Twitter.[9][10][11] The exposure was quickly censored by Twitter.\n• As part of the sale, Pfizer made the governments explicitly acknowledge that long-term effects are still not known: “Purchaser further acknowledges that the long-term effects and efficacy of the Vaccine are not currently known and that there may be adverse effects of the Vaccine that are currently not known.”[12]\n• Pfizer asked for additional indemnity from civil cases, meaning that the company would not be held liable for rare adverse effects or for its own acts of negligence, fraud or malice. This includes those linked to company practices – for example, if Pfizer sent the wrong vaccine or made errors during manufacturing.[13]\n• The corporation asked the countries to put up sovereign assets, such as embassy buildings and military bases, as a guarantee against the cost of any future legal cases.[13]\n\nIn September 2021, Pfizer announced a COVID pill that is meant to be taken alongside the COVID vaccine. Pfizer is so confident that the pill will be swiftly approved and mandated by governments that it has already started manufacturing at scale at the same time as it started a phase 2/3 study.[14]\n\nPfizer CEO Albert Bourla instantly cashed in on the announcement, selling 60 percent of his Pfizer stock at $41.99, its highest level in more than a year. [15] The sale had been arranged in advance under a so-called Rule 10b5-1 trading plan, which allows corporate executives to make predetermined stock transactions in compliance with insider trading laws. Bourla adopted the trading plan in August of this year.[16]\n\nSally Susman, the company’s executive vice president and chief corporate affairs officer, dumped more than 43,000 shares to the tune of about $1.8 million. [17] The sale was allegedly made under a Rule 10b5-1 plan Susman adopted in November 2019.\n\nIn December 2020, CEO Bourla said he and his management colleagues wouldn't take his company’s Covid-19 vaccine shot just yet, telling CNBC that he and other executives will not “cut the line.”[18]\n\nIn September 2021, the BBC reported on two 11 year old fraternal twins from Virginia who are taking part in the trial.[19]\n\n“Frederick Kempe: There was some fake news during this period of time about the vaccines, you know, all sorts of conspiracy theories. How did you deal with that and how did you navigate that and where do you feel the primary source of this sort of fake news was? How damaging was this to us? Albert Bourla: I’m afraid it [caused] quite a lot of damage and particularly with us, we were targeted by a lot of, let’s say, dark organizations that you don’t really know [who owns them]. You suspect that there are some countries behind. We were getting a lot of briefings from CIA, from FBI, about cyberattacks that may happen to us, but also about the spread of misinformation. You know, there are two groups of people: There are the people that they are vaccinated. There are people that are skeptical about the vaccination, and both of them are afraid. Those that are getting the vaccine, they are afraid of the disease, and they believe that because people are not getting vaccinated, they are increasing the risk to them. They are increasing the exposure. So they are mad with them that they don’t get the vaccine. Those that don’t get the vaccine, they’re afraid of the vaccine and they are mad with the people that are pressing them to get it. Those I understand. They are very good people. They are decent people. But they had a fear, and I understand it, and they don’t want to take chances. But there is a very small part of professionals [who] circulate, on purpose, misinformation so that they will mislead those that they have concerns [with the vaccine]. Those people are criminals. They’re not bad people. They are criminals because they literally cost millions of lives.” “The dynamics in the COVID more and more indicate a potential that we will have a clearly repeated business… Now we still don’t have data about the immunity of our vaccine because it is early. But we do see that the people that have the disease, more and more publications indicate that after several months, the immune response goes down. So there is a need to boost.”” “But this is because these COVID-19 vaccines have reached the public rollout phase by, and I’ll say it in quotes, “cutting corners”. And by cutting corners, I’m not implying that people were skipping key steps, although honestly, there could be some potential questions around that.” “None of us were expecting, I don’t think, that the vaccines would be rolled out very early on in the phase three clinical trials. So the phase three trials are not done. So in essence, what this means is the public rollout right now is an extension of the phase three clinical trial. So those being vaccinated now are, whether they realize it or not, part of the phase three experiment.” “We made a big mistake. We didn’t realize it until now... We thought the spike protein was a great target antigen... So by vaccinating people we are inadvertently inoculating them with a toxin.... We have known for a long time that the spike protein is a pathogenic protein. It is a toxin. It can cause damage in our body if it gets into circulation... Now, we have clear-cut evidence that the vaccines that make the cells in our deltoid muscles manufacture this protein — that the vaccine itself, plus the protein — gets into blood circulation.” “Anyone who’s over 70 who gets one of these mRNA vaccines will probably sadly die within about two to three years. And I would say anyone who gets the mRNA injection, no matter what age you are, your life expectancy will be reduced to, you know, die if you’re in your thirties within five to ten years, and you probably will have allergy, neuro-cognitive issues, inflammation, and of course infertility is the major one” “Two months is not enough time to know that we won’t have that antibody enhancement problem,” Merritt said. “And I will make this military point: It’s the perfect binary weapon. There’s no way I know exactly what that mRNA is programmed to do and neither do you and neither do most doctors. The doctors can’t get that data. That rests with the guys at the very top of this project. They say it’s to the spiked protein but how do we prove it?\n\n\n\n So if I were China and I wanted to take down our military, that’s easy,” she continued. “I could hook onto this coronavirus, like the spiked protein or another protein, I just design an mRNA to do that, but I know it doesn’t exist in nature so nobody is going to die from the vaccine, and then two years later I release whatever it is I made, the counterpart, and it causes this immunity enhancement death. So it’s a time-delayed death. That’s what binary poisons are: I give you point one, and then later on you accidentally come in contact with point two and you die.” “The toxicity of 1st generation vaccines is incidental & presumably is because they REQUIRE this gene based technology to execute their plans.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "425", "height": "355", "embed_code": "<iframe width=\"425\" height=\"355\" src=\"https://www.youtube.com/embed/On5RYFbcxWY\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/On5RYFbcxWY"}], "links": ["/wiki/File:Tools.png", "http://anoniem.org?https://en.wikipedia.org/wiki/Pfizer%E2%80%93BioNTech_COVID-19_vaccine", "/wiki/COVID-19_vaccine", "/wiki/RNA_Vaccine", "https://wikispooks.com/w/index.php?title=Special:ExportRDF/Pfizer%E2%80%93BioNTech_COVID-19_vaccine", "https://wikispooks.com/w/index.php?title=Special:Browse/:Pfizer%E2%80%93BioNTech_COVID-19_vaccine", "/wiki/Byram_Bridle", "/wiki/RNA_Vaccine", "/wiki/BioNTech", "#cite_note-1", "/wiki/FDA", "#cite_note-2", "/wiki/Project_Veritas", "#Autopsies", "#Lipid_nanoparticles", "#Thorough_evaluation_means_continue_to_collect_data", "#PfizerLeak", "#COVID_pills", "#Financial_dealings", "#Child_testing", "#Related_Quotations", "#Related_Documents", "#References", "/wiki/Reutlingen_Pathological_Institute", "/wiki/Reutlingen_Pathological_Institute", "/wiki/File:Submarine_pfizer.png", "/wiki/File:Submarine_pfizer.png", "#cite_note-3", "/wiki/Reutlingen_Pathological_Institute", "https://www.bitchute.com/video/Hx9lPA1SeISt/", "/wiki/File:Biontech.png", "/wiki/File:Biontech.png", "/wiki/File:Biontech_strings_3_months.png", "/wiki/File:Biontech_strings_3_months.png", "/wiki/Lipid_nanoparticles", "#cite_note-4", "/w/index.php?title=Polyethylene_glycol&action=edit&redlink=1", "#cite_note-5", "/wiki/Adjuvant", "#cite_note-6", "#cite_note-7", "/wiki/UK", "/wiki/MHRA", "/wiki/FDA", "/wiki/European_Medicines_Agency", "/wiki/BioNTech", "/wiki/Covid-19_vaccine", "/wiki/EU", "/wiki/EMA", "/wiki/EU", "#cite_note-8", "/wiki/2021", "/wiki/Ehden_Biber", "/wiki/Brazil", "/wiki/Albania", "/wiki/Twitter", "#cite_note-9", "#cite_note-10", "#cite_note-11", "#cite_note-12", "#cite_note-bureau-13", "#cite_note-bureau-13", "#cite_note-14", "/wiki/Albert_Bourla", "#cite_note-15", "/wiki/Insider_trading_laws", "#cite_note-16", "/w/index.php?title=Sally_Susman&action=edit&redlink=1", "#cite_note-17", "/wiki/Covid-19_vaccine", "/wiki/CNBC", "#cite_note-18", "/wiki/BBC", "/wiki/Virginia", "#cite_note-19", "/wiki/Property:Has_text", "/wiki/Property:Has_author", "/wiki/Albert_Bourla#_8458825b58543a8972a8d7b4dbd5be81", "/wiki/CIA", "/wiki/FBI", "/wiki/Frederick_Kempe", "/wiki/Albert_Bourla", "/wiki/Albert_Bourla#_ee01036f198c464f9c3324ce63a8978f", "/wiki/Albert_Bourla", "/wiki/Byram_Bridle#_13cb7fb75ccdc3b7aa0eeaa23df17d53", "/wiki/Byram_Bridle", "/wiki/Byram_Bridle#_2c85d9f1c5b8bbdc8b4d3d56c810ddcb", "/wiki/Byram_Bridle", "/wiki/Byram_Bridle#_dbdff255ae442b52cd904a769b9a659e", "/w/index.php?title=Spike_protein&action=edit&redlink=1", "/w/index.php?title=Antigen&action=edit&redlink=1", "/wiki/Vaccinating", "/w/index.php?title=Pathogenic&action=edit&redlink=1", "/w/index.php?title=Protein&action=edit&redlink=1", "/w/index.php?title=Toxin&action=edit&redlink=1", "/wiki/Byram_Bridle", "/wiki/Dolores_Cahill#_e135586551fe0e6b9c1afa0357bd4b50", "/w/index.php?title=Infertility&action=edit&redlink=1", "/wiki/Dolores_Cahill", "/wiki/Lee_Merritt#_a17f3cd39ac027223ee3b688c2883305", "/w/index.php?title=Antibody_enhancement&action=edit&redlink=1", "/wiki/Weapon", "/wiki/MRNA", "/wiki/China", "/wiki/Lee_Merritt", "/wiki/Michael_Yeadon#_bd8dcca67faadd7ce6426ffc7a379126", "/wiki/Michael_Yeadon", "/wiki/Property:Display_docType", "/wiki/Property:Has_author", "/wiki/Property:Description", "/wiki/Document:Researcher_blows_the_whistle_on_data_integrity_issues_in_Pfizer%E2%80%99s_vaccine_trial", "/w/index.php?title=Paul_D_Thacker&action=edit&redlink=1", "/wiki/Pfizer", "/wiki/Document:Why_are_government_experts_holding_off_vaccinating_under-16s_in_the_UK%3F", "/wiki/Deepti_Gurdasani", "/wiki/COVID-19/Vaccine", "/wiki/Propaganda", "/wiki/Big_Pharma", "/wiki/JCVI", "#cite_ref-1", "https://investors.biontech.de/news-releases/news-release-details/pfizer-and-biontech-supply-european-union-200-million-additional", "#cite_ref-2", "https://www.bbc.co.uk/news/world-us-canada-59048318", "#cite_ref-3", "https://pathologie-konferenz.de/en/", "#cite_ref-4", "https://twitter.com/petelincoln48/status/1422019750415069187", "#cite_ref-5", "https://ijvtpr.com/index.php/IJVTPR/article/view/23/51", "#cite_ref-6", "https://ijvtpr.com/index.php/IJVTPR/article/view/23/51", "#cite_ref-7", "http://enformtk.u-aizu.ac.jp/howard/gcep_dr_vanessa_schmidt_krueger/", "#cite_ref-8", "https://www.bbc.co.uk/news/world-europe-55401136", "#cite_ref-9", "https://senseofawareness.com/2021/07/29/pfizerleak-exposing-the-pfizer-manufacturing-and-supply-agreement-day-12/", "http://web.archive.org/web/20210730102035/https://senseofawareness.com/2021/07/29/pfizerleak-exposing-the-pfizer-manufacturing-and-supply-agreement-day-12/", "https://archive.ph/bhusU", "#cite_ref-10", "http://archive.today/2021.08.05-044954/https://twitter.com/Eh_den", "#cite_ref-11", "http://archive.today/2021.07.27-133348/https://twitter.com/eh_den/status/1419992103116025858", "#cite_ref-12", "https://gogo.al/wp-content/uploads/2021/01/LEXO-KONTRATEN-E-PLOTE.pdf", "#cite_ref-bureau_13-0", "#cite_ref-bureau_13-1", "https://www.thebureauinvestigates.com/stories/2021-02-23/held-to-ransom-pfizer-demands-governments-gamble-with-state-assets-to-secure-vaccine-deal", "#cite_ref-14", "https://nationalfile.com/pfizer-is-now-developing-a-twice-per-day-covid-pill-that-must-be-taken-alongside-vaccines/", "#cite_ref-15", "http://d18rn0p25nwr6d.cloudfront.net/CIK-0000078003/57afef57-8280-4e7f-9b8c-78bb14852af9.pdf", "#cite_ref-16", "https://www.anti-empire.com/pfizer-ceo-sold-62-of-his-stock-on-day-of-vaccine-reveal/", "#cite_ref-17", "http://d18rn0p25nwr6d.cloudfront.net/CIK-0000078003/b3aabe38-af36-4936-a888-627803d27cd9.pdf", "#cite_ref-18", "https://www.cnbc.com/2020/12/14/pfizers-ceo-hasnt-gotten-his-covid-vaccine-yet-saying-he-doesnt-want-to-cut-in-line.html", "#cite_ref-19", "https://www.bbc.co.uk/news/av/world-us-canada-58670094"], "authors": [], "publish_date": null}