{"result_id": "343043", "URL": "https://wikispooks.com/wiki/I_wish_I%27d_gotten_the_vaccine", "timestamp": "2023-04-25 18:13:20 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/I_wish_I%27d_gotten_the_vaccine", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "\"I wish I'd gotten the vaccine\" - Wikispooks", "cleaned_text": "\"I wish I'd gotten the vaccine\" are the last words of many reported victims of COVID-19, wheezed out almost inaudibly from the death bed - but clear enough to be picked up by media. This storyline featured in countless such reports which began to appear in large numbers around the time when vaccine clinics were noticing a lack of volunteers, from mid 2021. The script was simple - \"anti-vaxxers\" suffer or die because of their choice not to get injected. Alternative treatments, together with the risks presented by the jabs, are never mentioned - the \"vaccines\" are presented as the one true deliverance from the deadly plague.\n\nThe wave of \"I wish I'd gotten the vaccine\" reports mirror the \"he didn't believe in COVID-19 until he caught it\" reports of a year previously. It is unknown whether they were premeditated and planned by a PR Agency.\n\n\"Shelly Wachter was wary of getting vaccinated against the coronavirus because of what she described as the “white noise” surrounding its safety. After she had knee replacement surgery in Omaha a few weeks ago, though, she contracted covid-19, the disease caused by the virus. She was hospitalized and treated with supplemental oxygen, an ordeal she described as “pretty terrifying” to the Lincoln Journal Star. “Now, knowing what I do, I would get the shot,” Wachter said. Doing so, she said, “could have saved myself and my family so much by having gotten the vaccination.”[1]\n\nIn July 2021, Arkansas mother had regrets as she spent the last 12 days inside hospital watching her 13-year-old son Alexx breathe with the help of a ventilator. (In a different news story from same month it is her daughter Caia[2]) Either way, she pointed out \"I just want people to get their kids their shots. Everybody just needs to get the shot.\"[3]\n\nIn July 2021, Leslie Lawrenson, an anti-vaxxer died. His family then went on the rounds on ITV corporate media television, saying how much he regretted not having it.[4]\n\n\"In July 2021, Glenn Barratt, a British father-of-one who caught Covid-19 while watching England play in the Euros told nurses 'I wish I had got vaccinated’ before he died. Barratt had spent his last three weeks on a ventilator. Speaking after Glenn’s death, his cousin, Ken Meech, said he believes if Glenn had got his two Covid jabs he would still be here today.\"[5]\n\n\"August 2021, the brother of US conservative radio host Phil Valentine said his Covid experience has led Valentine to reconsider his stance on the vaccine. “If he had to do it over again, he would be more adamantly pro-vaccination, and that is what he will bring in his message when he gets back to that microphone which we hope is sooner rather than later.” Valentine later died in hospital.\"\n\n\"In September 2021, the anti-vaxxers 'Gertraut' and 'Hubert Maier' ended up in a Munich ICU. \"I was against vaccinations because you kept hearing different things. But I should never have done that, and that's why I said: I am ready today to appeal to people to get vaccinated,\" said Mrs. Maier.\" Similar stories came out of France[6] and Italy[7].\n\n\"In October 2021, an unvaccinated Virginia couple in their 40s died of COVID-19, leaving behind four children — and the dad with one tragic regret before he succumbed. “He called me up and said, ‘Mom, I love you, and I wish that I’d got the shot,’”.\"[8]\n\n\"In November 2021, British Gemma Roberts, a former anti-vaxxer who reportedly died 'eight times' in hospital after contracting Covid-19 and sepsis is urging others to get jabbed. \"I wish I'd had the vaccine before, I think everyone should have it now. I was one of those people scared of having the jab. I heard it killed people. \"I took a chance and almost didn't pull through. Medical professionals saved my life, that's who I will listen to now.\"\"[9]\n\n\"In November 2021, Glynn Steel, an animal lover who refused to get the COVID vaccine because it wasn’t vegan died from the virus. But before he died on November 16, he said to his wife Emma, “I have never felt so ill, I wish I’d had the vaccine.”\"[10]\n\nIn December 2021, Australian doctors and nurses had to dig deep to find compassion for patients who chose not to have a Covid vaccine, too late realising the severity of their error. An unvaccinated patient lies on a hospital bed. Sick, dying of Covid, realising too late they should have got the jab. Another, ill and panicking, asks if they can get the vaccination now. It’s too late, the doctor has to tell them. Yet another, gasping for air, can’t even find the breath to ask.[11]", "opengraph": {"image": "https://wikispooks.com/w/images/f/fe/MTRoche.png"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "425", "height": "355", "embed_code": "<iframe width=\"425\" height=\"355\" src=\"https://www.youtube.com/embed/WGYAswz1vug\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/WGYAswz1vug"}], "links": ["/wiki/Event", "/wiki/COVID-19/Media_Manipulation", "https://wikispooks.com/w/index.php?title=Special:ExportRDF/I_wish_I%27d_gotten_the_vaccine", "https://wikispooks.com/w/index.php?title=Special:Browse/:I_wish_I%27d_gotten_the_vaccine", "/wiki/File:I_wish_Id_gotten_the_vaccine.png", "/wiki/2021", "/w/index.php?title=Worldwide&action=edit&redlink=1", "/wiki/Anti-vaxxers", "/wiki/File:MTRoche.png", "/wiki/File:MTRoche.png", "/wiki/ITV", "/wiki/Crisis_actor", "/wiki/COVID-19", "/wiki/Anti-vaxxers", "/wiki/COVID-19/Vaccines", "/wiki/PR", "#cite_note-1", "/wiki/Arkansas", "/w/index.php?title=Ventilator&action=edit&redlink=1", "#cite_note-2", "#cite_note-3", "/wiki/Leslie_Lawrenson", "/wiki/Anti-vaxxer", "/wiki/ITV", "/wiki/Corporate_media", "/wiki/Television", "#cite_note-4", "/w/index.php?title=Ventilator&action=edit&redlink=1", "#cite_note-5", "/wiki/Phil_Valentine", "/wiki/File:Bordeaux,_Nice_and_Montreuil.jpg", "/wiki/File:Bordeaux,_Nice_and_Montreuil.jpg", "/w/index.php?title=Bordeaux&action=edit&redlink=1", "/wiki/Nice", "/w/index.php?title=Montreuil&action=edit&redlink=1", "/wiki/Anti-vaxxers", "/wiki/Munich", "/wiki/France", "#cite_note-6", "/wiki/Italy", "#cite_note-7", "/wiki/Virginia", "/wiki/COVID-19", "#cite_note-8", "/wiki/2021", "/wiki/Anti-vaxxer", "#cite_note-9", "/w/index.php?title=Vegan&action=edit&redlink=1", "#cite_note-10", "#cite_note-11", "/w/index.php?title=Henry_Dyne&action=edit&redlink=1", "/wiki/BBC", "/wiki/Fact_checkers", "#cite_note-12", "https://www.bitchute.com/channel/IdAWoKXGZxTm/", "#cite_ref-1", "https://www.washingtonpost.com/politics/2021/08/02/over-over-same-refrain-people-sick-with-covid-i-wish-id-gotten-vaccine/", "#cite_ref-2", "https://www.nbcnews.com/health/kids-health/after-teen-daughter-hospitalized-covid-mom-regrets-saying-no-vaccine-n1274227", "#cite_ref-3", "https://www.thv11.com/article/news/i-wish-i-wouldve-made-better-choices-for-her-arkansas-mom-regrets-not-getting-her-child-vaccinated/91-f6d38e7e-883e-4c98-a3f9-00f5f52e8bac", "#cite_ref-4", "https://www.bbc.co.uk/news/uk-england-dorset-58080116", "#cite_ref-5", "https://www.nationalworld.com/health/coronavirus/i-wish-i-got-vaccinated-dying-dads-message-to-nurses-after-contracting-covid-while-watching-euros-3317303", "#cite_ref-6", "https://www.ouest-france.fr/pays-de-la-loire/la-roche-sur-yon-85000/vendee-non-vaccine-le-patient-sauve-du-covid-regrette-d-avoir-risque-la-vie-de-tout-le-monde-aeaaa008-30cb-11ec-a362-2875df5c4251", "#cite_ref-7", "https://video.lefigaro.fr/figaro/video/covid-19-des-que-je-le-pourrai-je-le-ferai-a-rome-le-regret-des-patients-non-vaccines/", "#cite_ref-8", "https://nypost.com/2021/10/17/i-wish-that-id-got-the-shot-dad-of-4-who-died-of-covid/", "#cite_ref-9", "https://www.birminghammail.co.uk/news/midlands-news/i-wish-id-vaccine-woman-22226828", "#cite_ref-10", "https://7news.com.au/lifestyle/health-wellbeing/uk-vegan-who-refused-covid-jab-died-of-virus-after-begging-for-vaccine-c-4745957", "#cite_ref-11", "https://www.theguardian.com/australia-news/2021/dec/04/if-id-known-i-would-have-got-it-on-the-frontline-of-australias-pandemic-of-the-unvaccinated", "#cite_ref-12", "https://apnews.com/article/fact-checking-528817055623"], "authors": [], "publish_date": null}