{"result_id": "343038", "URL": "https://wikispooks.com/wiki/Self-spreading_vaccine", "timestamp": "2023-04-25 18:13:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Self-spreading_vaccine", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Self-spreading vaccine - Wikispooks", "cleaned_text": "Self-spreading vaccines, also known as transmissible or self-propagating vaccines, are genetically engineered vaccines that move through populations in the same way as communicable diseases, \"but rather than causing disease, they confer protection\".[1]\n\nIn a document from the Johns Hopkins Bloomberg School of Public Health, \"the vision\" is described as \"that a small number of individuals in a target population could be vaccinated, and the vaccine strain would then circulate in the population much like a pathogenic virus, resulting in rapid, widespread immunity.\"[1] In the event of a grave public health threat, self-spreading vaccines could potentially be used to broadly inoculate human populations...thus eliminating the need for mass vaccination operations\". [1]\n\nThere are 2 main types of self-spreading vaccines:\n• Recombinant vector vaccines and live viral vaccines. Recombinant vector vaccines combine the elements of a pathogenic virus that induce immunity (removing the portion that causes disease) with a transmissible viral vector.\n• Live viral vaccines are attenuated, meaning that the vaccine viruses are much less pathogenic than wild-type and would be similar to the oral polio vaccine or the live attenuated influenza vaccine (LAIV) in that those vaccines can sometimes transmit from person to person.\" [1]\n\nThe Johns Hopkins report also noted other possible unintended effects: “There is a not insignificant risk of the vaccine virus reverting to wild-type virulence, as has sometimes occurred with the oral polio vaccine\"[1][2] \"Additionally, self-spreading vaccines would potentially infect individuals with contraindications, such as allergies, that could be life-threatening.\"\n\n“The ethical and regulatory challenges surrounding informed consent and prevention and monitoring of adverse events would be critical challenges to implementing this approach even in an extreme event,” the document points out,[1] as it would contravene the principles established at the Nuremberg trials.\n\nPotential applications are mentioned in a 2015 research paper[3] \"The spate of recent infectious disease outbreaks, including Ebola virus disease and Middle East respiratory syndrome, emphasize the need for development of new innovative tools to manage these emerging diseases. [4] insit Conspicuously circumventing the illegality and ethics of use on humans by insisting the research is only for animal populations, the researchers described \"a disseminating CMV-based approach is also being developed toward the control of Ebola virus in wildlife reservoir and transmission species in Africa. Approximately 30% of past human Ebola virus outbreaks are known to have resulted from the direct handling of infected ape carcasses, identifying apes as a critical wildlife Ebola virus transmission species. Ebola virus is also regarded as a major threat to the survival of African ape populations in the wild. Consequently, a disseminating CMV-based strategy is being developed as part of an ongoing multidisciplinary effort between human health scientists and the conservationists at the World Wildlife Fund to target Ebola virus infection in African great apes (bonobo, chimpanzee and gorilla) and potentially also fruit bats.\"\n\nWriting in 2015, they state that \"although still in relatively early stages, the nascent field of self-disseminating transmissible vaccines has the potential to solve many current intractable public health and conservation problems that cannot be addressed by conventional vaccines\". \"Adaptation of new technologies such as CRISPR/Cas9 will also greatly increase the ease and speed with which these new vaccine vectors can be constructed following identification of a target pathogen\".[4]\n\n\"The next five years has the potential to place us in the position of being able to achieve high vaccine coverage against ‘nascent’ zoonotic pathogens in animal species involved in transmission that are otherwise inaccessible to conventional vaccination.\" [4]\n\nSection 21 of the German Protection against Infection Act permits that \"vaccines containing micro-organisms which can be excreted by the vaccinated person and taken up by others, may be employed. The basic constitutional right to physical integrity (Article 2 paragraph 2 sentence 1 of the Basic Law) shall be limited in this respect.\"[5][6]\n\nWikipedia does not have an article about self-spreading vaccines (sometimes referred to as \"vaccine shedding\"), it's article on vaccine shedding refers to viral shedding that was induced by a vaccine.[7][8]\n\nA document that outlined Pfizer’s clinical trial for the COVID-19 vaccine mentions:[9][10]", "opengraph": {"image": "https://wikispooks.com/w/images/6/6c/Self-spreading_vaccine.png"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/Vaccine", "/wiki/Medical", "https://wikispooks.com/w/index.php?title=Special:ExportRDF/Self-spreading_vaccine", "https://wikispooks.com/w/index.php?title=Special:Browse/:Self-spreading_vaccine", "/wiki/File:Self-spreading_vaccine.png", "/wiki/Kim_Alberts", "/wiki/Nuremberg_trials", "/wiki/Genetically_engineered", "#cite_note-Hopkins-1", "/wiki/Johns_Hopkins_Bloomberg_School_of_Public_Health", "/wiki/Vaccinated", "#cite_note-Hopkins-1", "#cite_note-Hopkins-1", "#Recombinant_vector_vaccines_and_live_viral_vaccines", "#Formally_only_research_on_animals", "#Allowed_under_German_law", "#Wikipedia", "#Pfizer", "#Further_Resources", "#References", "#cite_note-Hopkins-1", "#cite_note-Hopkins-1", "#cite_note-2", "/w/index.php?title=Allergies&action=edit&redlink=1", "#cite_note-Hopkins-1", "/wiki/Nuremberg_trials", "#cite_note-3", "/wiki/Ebola", "/w/index.php?title=Middle_East_respiratory_syndrome&action=edit&redlink=1", "#cite_note-NCBI-4", "/wiki/Africa", "/wiki/World_Wildlife_Fund", "/wiki/CRISPR", "/w/index.php?title=Pathogen&action=edit&redlink=1", "#cite_note-NCBI-4", "#cite_note-NCBI-4", "#cite_note-5", "#cite_note-6", "/wiki/Wikipedia", "/wiki/Vaccine", "#cite_note-7", "#cite_note-8", "/wiki/Pfizer", "#cite_note-9", "#cite_note-10", "https://www.thelastamericanvagabond.com/self-spreading-vaccines-self-amplifying-mrna-vaccines-covid-vaccine-menstrual-disruption/", "#cite_ref-Hopkins_1-0", "#cite_ref-Hopkins_1-1", "#cite_ref-Hopkins_1-2", "#cite_ref-Hopkins_1-3", "#cite_ref-Hopkins_1-4", "#cite_ref-Hopkins_1-5", "https://jhsphcenterforhealthsecurity.s3.amazonaws.com/181009-gcbr-tech-report.pdf", "https://archive.is/T4Kuz", "#cite_ref-2", "https://doi.org/10.1016/S0264-410X(01)00184-0", "#cite_ref-3", "/w/index.php?title=Aisling_A._Murphy&action=edit&redlink=1", "/w/index.php?title=Michael_A._Jarvis&action=edit&redlink=1", "/w/index.php?title=Plymouth_University&action=edit&redlink=1", "/w/index.php?title=Alec_J._Redwood&action=edit&redlink=1", "/w/index.php?title=Murdoch_University&action=edit&redlink=1", "#cite_ref-NCBI_4-0", "#cite_ref-NCBI_4-1", "#cite_ref-NCBI_4-2", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4732410/", "https://archive.is/k9ZOJ", "#cite_ref-5", "https://germanlawarchive.iuscomp.org/?p=2487", "#cite_ref-6", "https://www.gesetze-im-internet.de/ifsg/__21.html", "#cite_ref-7", "http://archive.today/2022.01.19-195656/https://en.wikipedia.org/wiki/Vaccine_shedding", "#cite_ref-8", "http://archive.today/2021.10.02-223151/https://en.wikipedia.org/wiki/Viral_shedding", "#cite_ref-9", "https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "https://web.archive.org/web/20210308053257/https://cdn.pfizer.com/pfizercom/2020-11/C4591001_Clinical_Protocol_Nov2020.pdf", "#cite_ref-10", "https://eu.usatoday.com/story/news/factcheck/2021/05/20/fact-check-covid-19-vaccine-isnt-transmitted-others-via-contact/5184605001/"], "authors": [], "publish_date": null}