{"result_id": "343006", "URL": "https://wikispooks.com/wiki/Kate_Bingham", "timestamp": "2023-04-25 18:13:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Kate_Bingham", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Kate Bingham - Wikispooks", "cleaned_text": "Kate Bingham, daughter of the late Lord Bingham (former Lord Chief Justice), is a British hedge fund manager.[1] She was the first Chair of the UK Vaccine Task Force which was set up to manage the introduction of a COVID-19 jab in the UK and its global distribution. On her appointment, Kate Bingham said:\n\nBy October 2020, it was reported that [Britain]] had stockpiled 340 million doses from six prototype vaccines – the most of any country. Whilst admitting there were still plenty of uncertainties, Kate Bingham said a \"partially effective vaccine is better than no vaccine at all\" and that any vaccine would likely require more than one dose:\n\nShe added the UK had stockpiled so many doses in order to \"maximise our chances\", and said it is important to cover every \"different immune profile\". Ms Bingham, who was taking part in the Novavax vaccine trial herself, urged elderly people and people from black, Asian and minority ethnic groups to come forward to join the vaccine trials.[3]\n\nOn 1 November 2020, the Sunday Times alleged that Kate Bingham had shared 'official sensitive' information about UK vaccine plans with private companies in the USA, and also commented that she had been appointed to the UK Vaccine Task Force despite having no vaccine experience, mentioning that she was married to a Tory government minister.[4] A response by the UK Department for Business, Energy and Industrial Strategy on the same date said that they had approved the content, and that there was nothing which was not publicly available nor could be readily deduced. BEIS added that it was her business skills in drugs discovery, and reputation amongst pharmaceutical and vaccine companies which was the reason for her appointment, rather than being a vaccines expert.\n\nLater in November it was reported that Kate Bingham had \"insisted\" on employing her own team of eight PR consultants from London agency Admiral Associates at the equivalent of £167,000 per annum each. One government source was reported as saying that the consultants had helped her prepare for interviews, assisted with press statements and set up an official government podcast.[5]\n\nToday there were calls for Kate Bingham to be handed a Damehood as Britain raced ahead in the global race to vaccinate its population with some claiming that her appointment was one of the PM's few inspired decisions of the first lockdown. Professor Sir John Bell, Regius Professor of Medicine at Oxford, said recently that the UK had \"only got 30m doses of the Pfizer/BioNTech because of her\" with others saying she secured millions more from other companies through sheer perseverance, using her contacts and demanding meetings with CEOs until they gave in. Today she revealed she cracked open the wine and 'broke dry January' last night after learning another jab she bought 60 million doses of, and set be made in Britain, was proven to beat Covid-19. Kate also said that she was one of the people who took part in the Novavax trial that found doses are 89.3 per cent effective at fighting coronavirus including the mutant strain found in Kent.[6]", "opengraph": {"image": "https://wikispooks.com/w/images/f/ff/Kate_Bingham.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["/wiki/Has_companieshouse:", "/wiki/Has_companiesintheuk:", "/wiki/Has_companycheck:", "/wiki/Has_companydirectorcheck:", "https://en.wikipedia.org/wiki/Lord_Chief_Justice_of_England_and_Wales", "/wiki/British", "/wiki/Hedge_fund", "#cite_note-1", "/wiki/UK_Vaccine_Task_Force", "/wiki/COVID-19_jab", "/wiki/UK", "/wiki/COVID-19", "#cite_note-2", "#Prototype_vaccines", "#Sharing_information", "#Eight_PR_consultants", "#Dame_Kate.3F", "#References", "/w/index.php?title=Novavax&action=edit&redlink=1", "#cite_note-3", "/wiki/UK_Vaccine_Task_Force", "/wiki/Tory", "#cite_note-4", "https://www.gov.uk/government/organisations/department-for-business-energy-and-industrial-strategy", "/w/index.php?title=Admiral_Associates&action=edit&redlink=1", "#cite_note-5", "/wiki/Daily_Mail", "/wiki/John_Bell", "/wiki/Pfizer", "/wiki/BioNTech", "/wiki/Covid-19", "/w/index.php?title=Novavax&action=edit&redlink=1", "#cite_note-6", "#cite_ref-1", "https://find-and-update.company-information.service.gov.uk/officers/gc9huYFymgp3ZNRu_fV_rUopBkk/appointments", "#cite_ref-2", "https://www.gov.uk/government/news/kate-bingham-appointed-chair-of-uk-vaccine-taskforce", "#cite_ref-3", "https://www.mirror.co.uk/news/uk-news/oxford-coronavirus-vaccine-boss-warns-22841596", "#cite_ref-4", "https://www.thetimes.co.uk/article/vaccine-taskforce-head-kate-bingham-shared-uk-plans-with-private-firms-rtlzrz8v5", "#cite_ref-5", "https://www.independent.co.uk/news/uk/home-news/covid-vaccine-taskforce-pr-taxpayer-cost-b1683887.html", "#cite_ref-6", "https://www.dailymail.co.uk/news/article-9201439/Kate-Bingham-helped-UK-romp-ahead-jab-race-despite-shaky-start-claims-cronyism.html"], "authors": [], "publish_date": null}