{"result_id": "343011", "URL": "https://wikispooks.com/wiki/Jane_B%C3%BCrgermeister", "timestamp": "2023-04-25 18:13:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/favicon.ico", "canonical": "https://wikispooks.com/wiki/Jane_B%C3%BCrgermeister", "encoding": "UTF-8"}, "image": null, "domain": "wikispooks.com", "title": "Jane Bürgermeister - Wikispooks", "cleaned_text": "Jane Bürgermeister is an Austrian investigative journalist who, as the anticipated July 2009 release date for Baxter’s Swine flu (H1N1) pandemic vaccine was approaching, warned the world that the greatest crime in the history of humanity was underway.\n\nEarlier in 2009, she had filed criminal charges with the FBI against the World Health Organization (WHO), the United Nations (UN), and several of the highest ranking government and corporate officials, accusing them of bioterrorism and attempts to commit mass murder. She had also prepared an injunction against forced vaccination which was being legislated for in America.\n\nThese actions followed her charges filed in April 2009 against Baxter AG and AVIR Green Hills Biotechnology of Austria for producing contaminated Bird flu vaccine, alleging this was a deliberate act to cause and profit from a pandemic.[1]\n\nJane Bürgermeister was born in Switzerland from an Irish mother and Austrian father and lives in Vienna, Austria. She is the sister of Michael Buergermeister, received a masters degree from the University of Edinburgh, Scotland, and has written for the magazine Nature, the British Medical Journal, The Scientist, Reuters Health, and The Guardian among other publications.[2]\n\nIn March 2004, Jane Bürgermeister wrote an article titled \"UN warns of dangers of drugs sold on Internet\" in the British Medical Journal:\n\n\"The illegal sale over the Internet of drugs and medicines without a valid prescription is posing an increasing risk to people's health, the UN drugs watchdog has warned.\"\n\n\"In its annual report the Vienna based International Narcotics Control Board (INCB) urged governments to do more to tackle the threat posed to people's health by the escalating trade in drugs over the Internet. The report said that websites were offering popular drugs, such as sildenafil (Viagra) and tamoxifen, without a valid prescription.\"[3]\n\nIn its reports for 2001 and 2002 the Board noted the increasing use of the Internet and the mail for illicit trade in narcotic drugs and psychotropic substances, including the smuggling of drugs diverted from domestic distribution channels. That trend continued during 2003. Swiss authorities noted during the past year a significant increase in illegal mail order shipments containing psychotropic substances ordered on the Internet. As Swiss legislation prohibits the import and export of psychotropic substances by mail without formal authorisation by the competent authorities, those shipments were confiscated and the addressees were informed that ordering psychotropic substances via the Internet was not permitted. The illegal shipments originated in Pakistan. Internet sites sell mainly psychotropic substances in Schedule IV; however, they also include offers for Ritalin (methylphenidate) (see also paragraph 188 below). Selling such illegal supplies without prescription and the required medical advice poses a danger to customers, particularly when the substances sold are advertised, against medical opinion, as mild and harmless.[4]\n\nIn June 2004, the BMJ published another article by Bürgermeister \"German prosecutors probe again into bribes by drug companies\":\n\nGerman prosecutors are investigating whether pharmaceutical companies gave bribes to hospital doctors to boost the use of their drugs. Munich state prosecutors confirmed that they have searched the offices of a pharmaceutical company in the city, seizing files. And according to a report in the regional daily newspaper Westfalen-Blatt (19 May), state prosecutors are investigating seven to nine pharmaceutical companies in Germany. Raids were carried out on the offices of companies in Frankfurt and Darmstadt. Anton Winkler, the press spokesman of the Munich state prosecution office, said that the investigation was still in its infancy. “I cannot give any details yet, but the pharmaceutical company we are investigating in Munich is not GlaxoSmithKline Beecham,” he told the BMJ. He noted that an investigation opened against SmithKline Beecham in Germany in 1999 by the Munich state prosecutor, who started investigations into the activities of 4000 doctors accused of accepting bribes from SmithKline Beecham across the whole country. This was concluded this week. Seventy one doctors in the city and dozens of employees of SmithKline Beecham have been accused of bribery. In December 2000, the company merged with GlaxoWellcome to form GlaxoSmithKline. The news of a fresh investigation into pharmaceutical companies comes at a time of growing concern about increasing corruption in Germany’s health sector. A report by a corruption expert—Frankfurt’s state prosecutor, Wolfgang Schaupensteiner—says a third of all those who accept bribes work in the health sector. He said that the number of pharmaceutical and medical technology companies that have offered money or other illegal incentives to doctors leapt from 7.9% in 2001 to 14.1% in 2002. One case made headlines this week when the head of the rehabilitation department of Munich’s state health insurance (Allgemeine Ortskrankenkasse (AOK) Munich) company was imprisoned for four years and 10 months for having accepted bribes worth €260,000 (£173,060; $316,890) from clinics since 1998. Transparency International, an independent organisation, alleged that bribery and corruption in the German health sector costs taxpayers €10bn each year. But Dr Ursula Auerswald, vice president of the German Chamber of Doctors, rejected the claims as “cheap, polemical, and self righteous.” “That these people do not provide concrete proof on a regular basis and do lasting damage to trust in the health service, is something that they ignore without any conscience,” she said.[5]\n\nNeurophotonics, described as the application of light-based tools and technologies to observe the finest details of the human nervous system and brain, is advancing brain research and the development of therapies for neuro-diseases and psychiatric disorders. Valentin Nagerl, professor of neuroscience and bio-imaging at the University of Bordeaux, noted that the development of new kinds of bio-sensors (and actuators), advanced microscopy techniques and image analysis tools among other elements is helping to push the broad and dynamic field of neuroscience forwards. However, further improvements across every area are needed to advance the scope and usefulness of neurophotonics methods. Research groups across the globe are working on such developments, integrating elements of optics, biology and physics to craft ever better technologies to penetrate ever deeper into living tissues such as brain. While substantial funding programmes like the BRAIN initiative put the US in a strong position for neuroscience research, other regions are also excelling in the development of neurophotonics instruments and techniques. With a history of manufacturing optical systems and pioneers like Leica and Zeiss, Germany is at the forefront of the commercialisation of super-resolution microscopy techniques, which have made it possible to study the complex and dynamic inner life of cells at the level of the individual protein building blocks. Meanwhile, in France scientists have been focusing on biological applications and discoveries enabled by these new techniques, Nagerl pointed out. Of the many emerging developments in neuroscience, Nagerl considers the new generation of super-resolution light microscopes to be a breakthrough. By improving the ability to look deep inside biological tissue, these microscopes for instance allow taking extremely sharp and detailed images of neurons and their activity in real time as the animal subject goes about its everyday tasks. This discovery brought professor Stefan Hell, director at the Max Planck Institute for Biophysical Chemistry in Gottingen, and his colleagues a Nobel Prize in 2014. By breaking Abbe's limit, the diffraction barrier in optical microscopy, Hell was able to increase the power of resolution tenfold, and he also showed there was room to obtain even better resolutions, making it possible to study, in real time, molecules and processes within the brain.[6]\n\nIn February 2009, the Austrian subsidiary of Baxter distributed 72 kilos of material contaminated with live virus vaccines for avian influenza to 16 laboratories in 4 countries and unleashed an investigation by the Austrian police. The Canadian Press explained:\n\n\"The contaminated product, which Baxter calls 'experimental virus material', was made at the Orth-Donau research facility in Austria. Baxter makes its flu vaccine - including a human H5N1 vaccine for which a licence is expected shortly - at a facility in the Czech Republic. \"People familiar with biosecurity rules are dismayed by evidence that human H3N2 and avian H5N1 viruses somehow co-mingled in the Orth-Donau facility. That is a dangerous practice that should not be allowed to happen, a number of experts insisted. \"Accidental release of a mixture of live H5N1 and H3N2 viruses could have resulted in dire consequences. \"While H5N1 doesn't easily infect people, H3N2 viruses do. If someone exposed to a mixture of the two had been simultaneously infected with both strains, he or she could have been an incubator for a hybrid virus able to transmit easily to and among people. \"That mixing process, called reassortment, is one of two ways pandemic viruses are created.\"[7]\n\nIn April 2009 Jane Bürgermeister pressed charges against Baxter International for having produced an avian flu vaccine contaminated with a live virus which could have triggered a birdflu pandemic. In a YouTube video of 4 April 2010, she talked of the dangers posed by vaccines such as the Swine flu (H1N1) vaccine, citing the warnings of Infowars' Alex Jones about \"sophisticated and terrible vaccines being developed that destroy our capacity to feel emotions like anger or fear\".[8]\n\nJane Bürgermeister claims that she was fired in July 2009, after filing a series of criminal charges against Baxter International and the WHO, but continued to blog at https://birdflu666.wordpress.com until the account was closed. Her \"Bird flu 666 Wordpress blog\" (Against the Eugenicist Globalists, their Vaccines and Depopulation Plans) continues here: https://thefourthempire.blogspot.com/. On 16 May 2020, she tweeted:\n\n\"Trump says there will be a warp speed #coronavirus jab for all Americans, end of year, Bill Gates, funding vaccine, says for 7 billion plus ppl, that is, all ppl in world apart from a few million like Royals. GR pandemic plan is for ALL people, same plan as for Swine flu jabs 2009.\"[9]\n\nEnglish Wikipedia has repeatedly removed Jane Bürgermeister's page, although as of February 2021, she had a Spanish language page.\n\n“If this readiness exercise took place, it went unnoticed to the public. The question is, was it originally going to concern the Swine flu pandemic? If so, was it altered due to the bold actions taken from an Irish Austrian across the Atlantic, named Jane Bürgermeister? Was the Swine flu originally going to be the international crisis that according to Joe Biden was going to \"test the metal of this guy\"? We may never know the answer. Was it a coincidence that when Bürgermeister brought forth her charges to the FBI in June of 2009 that the true number of reported cases and deaths from the Swine flu were actually minimal, and the exaggerated climbing numbers were never mentioned again on mainstream media? Swine flu was all hushed up? The summer passed, and all was well, and then, slowly the vaccines were reintroduced, this time more calmly. The media carefully explained the importance of the vaccines in the fall, and softly warned of a pandemic that was scheduled for the upcoming flu season that could kill millions of people without it. At the time of writing this book, I do not know what fall and winter will bring but I have one serious question. Was a tragedy averted by the actions of Bürgermeister whose criminal charges are still in the legal court systems? We may never know if the two were connected. But even though all are innocent until proven guilty, the charges have brought the Swine flu scandal into the light, slowing down what appeared to many to be the ominous plans of an alleged non-transparent syndicate and their plans for a \"North American Union\".”", "opengraph": {"image": "https://wikispooks.com/w/images/d/d4/Jane_B%C3%BCrgermeister.jpg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "300pxpx", "height": "355", "embed_code": "<iframe width=\"300pxpx\" height=\"355\" src=\"https://www.youtube.com/embed/e-HL1Dy-Fgc\" frameborder=\"0\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/e-HL1Dy-Fgc"}], "links": ["/wiki/Has_companieshouse:", "/wiki/Has_companiesintheuk:", "/wiki/Has_companycheck:", "/wiki/Has_companydirectorcheck:", "/wiki/Austria", "/wiki/Baxter", "/wiki/Swine_flu_(H1N1)", "/wiki/FBI", "/wiki/World_Health_Organization", "/wiki/United_Nations", "/wiki/Bioterrorism", "/wiki/Mass_murder", "/wiki/Baxter", "https://patents.justia.com/assignee/avir-green-hills-biotechnology-research-development-trade-ag", "/wiki/Austria", "/wiki/Bird_flu", "#cite_note-1", "#Background", "#Publications", "#Drugs_sold_on_the_Internet", "#Bribes_by_drug_companies", "#Neurophotonics", "#Reassortment_creates_pandemic_viruses", "#Blogger_on_Twitter", "#Censorship", "#Related_Quotation", "#References", "/wiki/Switzerland", "/wiki/Irish", "/wiki/Austria", "/wiki/Michael_Buergermeister", "/wiki/University_of_Edinburgh", "/w/index.php?title=Nature&action=edit&redlink=1", "/w/index.php?title=British_Medical_Journal&action=edit&redlink=1", "/w/index.php?title=The_Scientist&action=edit&redlink=1", "/wiki/The_Guardian", "#cite_note-2", "/w/index.php?title=British_Medical_Journal&action=edit&redlink=1", "/wiki/Internet", "/wiki/Vienna", "/wiki/International_Narcotics_Control_Board", "/wiki/Internet", "#cite_note-3", "/wiki/INCB", "/wiki/Internet", "/wiki/Swiss", "/wiki/Internet", "/wiki/Pakistan", "#cite_note-4", "/w/index.php?title=BMJ&action=edit&redlink=1", "/wiki/Germany", "/wiki/GlaxoSmithKline", "/wiki/Transparency_International", "#cite_note-5", "#cite_note-6", "/wiki/Austria", "/wiki/Baxter", "/wiki/Baxter", "/wiki/Austria", "/wiki/Baxter", "/wiki/Czech_Republic", "https://en.wikipedia.org/wiki/Reassortment", "#cite_note-7", "/wiki/Baxter_International", "/wiki/YouTube", "/wiki/Vaccine", "/wiki/Swine_flu_(H1N1)", "/wiki/Infowars", "/wiki/Alex_Jones", "#cite_note-8", "/wiki/Baxter_International", "/wiki/WHO", "https://birdflu666.wordpress.com", "/wiki/Bird_flu", "https://thefourthempire.blogspot.com/", "/wiki/Donald_Trump", "/wiki/COVID-19", "/wiki/American", "/wiki/Bill_Gates", "/wiki/Vaccine", "/wiki/Greece", "/wiki/Swine_flu", "#cite_note-9", "/wiki/Wikipedia", "/wiki/Property:Has_text", "/wiki/Property:Has_author", "/wiki/National_Level_Exercise_2009#_0cad35df0b1608b221af17d4d17f2932", "/wiki/Swine_flu", "/wiki/Swine_flu", "/wiki/Joe_Biden", "/wiki/FBI", "/wiki/Swine_flu", "/wiki/Swine_flu", "/wiki/Vaccine", "/wiki/Swine_flu", "/w/index.php?title=North_American_Union&action=edit&redlink=1", "/w/index.php?title=Dianne_Marshall&action=edit&redlink=1", "#cite_ref-1", "https://www.globalresearch.ca/journalist-files-charges-against-who-and-un-for-bioterrorism-and-intent-to-commit-mass-murder/14276", "#cite_ref-2", "https://www.facebook.com/michael.buergermeister.5/posts/1591938587651181?comment_id=1594499957395044", "#cite_ref-3", "https://www.bmj.com/content/328/7440/603.2.full", "#cite_ref-4", "https://www.incb.org/documents/Publications/AnnualReports/AR2003/AR_03_Chapter_II.pdf", "#cite_ref-5", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC420312/pdf/bmj3281333a.pdf", "#cite_ref-6", "https://go.gale.com/ps/anonymous?id=GALE%7CA532077291", "#cite_ref-7", "http://www.legitgov.org/baxter_sends_live_avian_flu_viruses_270209.html", "#cite_ref-8", "https://www.youtube.com/watch?time_continue=2&v=e-HL1Dy-Fgc&feature=emb_logo", "#cite_ref-9", "https://twitter.com/JaneBurgermeis2/status/1261605617111883776"], "authors": [], "publish_date": null}