{"result_id": "344039", "URL": "https://www.winterwatch.net/2022/05/godfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition/", "timestamp": "2023-04-25 18:14:02 CEST+0200", "meta": {"description": "The following video is a portion of a Jan. 11, 2018, legal deposition of \"acclaimed\" vaccinologist Dr. Stanley Plotkin, who is widely considered a godfather of modern vaccine programs. In the video, we hear an astute attorney asking Plotkin revealing questions about vaccination research practices. Plotkin's answers deliver a series of devastating truth bombs: Q:", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.winterwatch.net/wp-content/uploads/2016/06/torch-resize.png?fit=11%2C32&ssl=1", "canonical": "https://www.winterwatch.net/2022/05/godfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition/", "encoding": "UTF-8"}, "image": null, "domain": "www.winterwatch.net", "title": "Godfather of Vaccines Freely Admits to Unethical Skulduggery During Legal Deposition | Winter Watch", "cleaned_text": "The following video is a portion of a Jan. 11, 2018, legal deposition of “acclaimed” vaccinologist Dr. Stanley Plotkin, who is widely considered a godfather of modern vaccine programs. In the video, we hear an astute attorney asking Plotkin revealing questions about vaccination research practices. Plotkin’s answers deliver a series of devastating truth bombs:\n\nQ: Have you ever used orphans to study experimental vaccines?\n\nQ. Have you ever used the mentally handicap to study experimental vaccines?\n\nA: (Hesitant until he was cited from his own writings, whereby he confirmed.) Yes.\n\nQ: Have you experimented on the children of mothers in prison or jail?\n\nThen comes the doozy at minute 00:01:20 in which Dr. Plotkin acknowledges that he expressed a preference for experimenting “on children and adults who are human in form but not in social potential.”\n\nSo here we see the totally unethical use of experimental measles vaccines on orphans, the mentally handicapped, babies of mothers in jail and even the wide sweeping- humans in form but not in social potential. But when we ask for a vaccinated versus un-vaccinated study of outcomes, we’re somehow asking for the murder millions of children.\n\nThis is a very inverted, Luciferian and supremacist mindset. This is especially the case given that the threat from measles had been receding for decades and was already on a steady decline before vaccines were employed. Yet, if one were to search for commentary about Plotkin, he’s treated as an untouchable. Everything is accolades and hero worship with absolutely no criticism of the in-your-face God-awful ethics expressed here.\n\nA primary question to be asked is what were the deaths and side effects from Plotkin’s unethical experimentation?\n\nDr. Plotkin, 86, was born and raised in New York City, the son of Jewish parents who emigrated from England. In the 1960s, he played a pivotal role in discovery of a vaccine against the rubella virus (German Measles) while working at Wistar Institute in Philadelphia.\n\nBy the time the combination MMR (measles, mumps and German measles) vaccine was introduced in 1971 and Plotkin and his associates did their victory laps, measles mortality rates were exceeding rare. The disease had morphed into a less-virulent form. The second chart does show measles being largely eradicated in the late 1960s after the vaccine was licensed. However, in 1990, with measles quite rare, the Harma industry recommended a second dose.\n\nIf measles is experienced generation after generation, the disease becomes weaker in its manifestation. Over time, a permanent immunity develops in future generations of that particular lineage. If there is a virgin population that has never experienced the disease, then these individuals are more likely to experience more severe complications of that illness.\n\nFor the record, I experienced a series of these childhood affiliations, one after another, in the 1950s. I remember being quite sick from the mumps, including a high fever, but it wasn’t the end of the world. Measles and chicken pox were more annoyances than anything else. In looking at charts of affliction rates and given that the current odds of catching these annoying childhood illnesses are nearly non-existent in the U.S. today, why take the chance on a vaccination with potential side effects that are far more serious than the illnesses they’re meant to prevent?\n\nStudies have shown that people with a natural immunity from measles are 35% less likely to develop Parkinson’s disease, which is a nervous system disorder marked by slowness of movement, shaking, stiffness and, in the later stages, loss of balance.\n\nAccording to Anita Petek-Dimmer, “Chronic tendencies, such as recurring respiratory infections, often heal after measles. Chronic health problems disappear, such as psoriasis or chronic kidney problems. The children’s hospital in Basle (Switzerland) used to get children with chronic kidney infections to contract measles intentionally in order to heal them, up until the 1960s.”\n\nChildren susceptible to infections are healthier and stronger after contracting measles, studies have shown, and the need for future medical treatments clearly decreased. For example, children in the Third World countries are less likely to contract malaria and parasites after having measles. The risk of suffering breast cancer decreases to less than one half. Multiple sclerosis rates are also much lower among people who have had measles. Hay fever is more rare in children who have older siblings and had measles than in those who were vaccinated against it.\n\nA large African study showed that children who have had measles are at 50% lower risk for allergies than those vaccinated. Furthermore, it has been shown that experiencing measles protects from diseases of the immune system and skin diseases, as well as degenerative cartilage, bone and tumorous diseases.\n\nThe hidden story of post-vaccination autism and neurological troubles:\n\nAfter their first MMR vaccination, 10% of children develop fever, malaise and a rash within five to 21 days, and 3% suffer lasting side effects of 18 days on average. Older women appear to be more at risk of joint pain, acute arthritis and even (rarely) chronic arthritis. Anaphylaxis is a rare but serious allergic reaction to the vaccine.\n\nIn 2014, the FDA approved the listing of two additional potentially adverse side effects of the vaccination on its label: acute disseminated encephalomyelitis (ADEM) and transverse myelitis (with permission to also add “difficulty walking” to the package inserts).\n\nA 2012 IOM report found that the measles component of the MMR vaccine can cause measles inclusion body encephalitis in immuno-compromised individuals. Between 1 in 25,000 and 1 in 40,000 children are thought to acquire ITP in the six weeks following an MMR vaccination, which is a higher rate than found in un-vaccinated populations.", "opengraph": {}, "tags": ["Transhumanist Scheming", "Suppressed & Hidden History", "Brainwashing & Propaganda", "Jewish Power & Influence", "(p)Harma Industry Skulduggery"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "600", "height": "338", "embed_code": "<iframe src=\"https://www.youtube.com/embed/yevV_slu7Dw\" width=\"600\" height=\"338\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\">﻿</iframe>", "src": "https://www.youtube.com/embed/yevV_slu7Dw"}], "links": ["https://www.youtube.com/watch?v=rGDNsqk0KR0&list=PLbDqqjs2g3N1F9FXps4JWJZzHDWI4mRjd", "https://www.winterwatch.net/?s=vaccin", "http://news.ubc.ca/2012/07/20/severe-flu-increases-risk-of-parkinsons-ubc-research/", "https://en.wikipedia.org/wiki/Anaphylaxis", "https://en.wikipedia.org/wiki/FDA", "https://en.wikipedia.org/wiki/Acute_disseminated_encephalomyelitis", "https://www.winterwatch.net/2022/05/godfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition/?share=custom-1600884568", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Fwww.winterwatch.net%2F2022%2F05%2Fgodfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition%2F&media=https%3A%2F%2Fi0.wp.com%2Fwww.winterwatch.net%2Fwp-content%2Fuploads%2F2018%2F11%2FMMR-Vaccine.jpg%3Ffit%3D600%252C350%26ssl%3D1&description=Godfather%20of%20Vaccines%20Freely%20Admits%20to%20Unethical%20Skulduggery%20During%20Legal%20Deposition", "https://twitter.com/share", "mailto:?subject=%5BShared%20Post%5D%20Godfather%20of%20Vaccines%20Freely%20Admits%20to%20Unethical%20Skulduggery%20During%20Legal%20Deposition&body=https%3A%2F%2Fwww.winterwatch.net%2F2022%2F05%2Fgodfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition%2F&share=email", "https://www.winterwatch.net/2022/05/godfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition/?share=jetpack-whatsapp", "#", "https://www.winterwatch.net/2022/05/godfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition/#print"], "authors": [], "publish_date": null}