{"result_id": "344044", "URL": "https://www.winterwatch.net/2020/11/corrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking/", "timestamp": "2023-04-25 18:14:08 CEST+0200", "meta": {"description": "The studies the FDA relied upon for its measles, mumps and rubella (MMR) vaccine approval was finally revealed in May, 2019. This after FOIA requests forced the FDA's hand. The fact that this sunlight was delayed so long in itself points to massive corruption and unethical behavior. These studies should have been open sourced years", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.winterwatch.net/wp-content/uploads/2016/06/torch-resize.png?fit=11%2C32&ssl=1", "canonical": "https://www.winterwatch.net/2020/11/corrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking/", "encoding": "UTF-8"}, "image": null, "domain": "www.winterwatch.net", "title": "Corrupt FDA Finally Releases Results of MMR Vaccine Trial Study, and It’s Shocking | Winter Watch", "cleaned_text": "The studies the FDA relied upon for its measles, mumps and rubella (MMR) vaccine approval was finally revealed in May, 2019. This after FOIA requests forced the FDA’s hand. The fact that this sunlight was delayed so long in itself points to massive corruption and unethical behavior. These studies should have been open sourced years ago and available to anybody.\n\nBut we also learned that the FDA approval was only based on small, short-duration studies on 834 children — this for a vaccine that would be administered to hundreds of millions of children around the world. It compared contraindications for MMR compared with rubella only or with other lots of MMR. Not only were the study sizes criminally negligent, but they were never tested against a salient non-vaxxed control group. The study duration was a mere 42 days.\n\nGastrointestinal illness (G.I.) is a common complaint of autistics. In a study group, 11% of the children suffered from G.I., and another 11% were afflicted with upper respiratory illness (URI).\n\nIt gets even worse. In another study group, where a whopping 64 out of 102 children suffered URI, and 43 out of 102 were hit with G.I.\n\nIn this next sorry-ass study, responses were reported for taking the full MMR of 102 children. Among them, 44 reported URI, and 43 G.I. Eleven reported a “measles like rash” and 28 reported “anorexia,” which apparently is Newspeak for vomiting.\n\nHere is another token study of 41 children that revealed about half, or 20, ran high fevers over of 101 F after being subjected to the MMR vaccine.\n\nWhen we ask for a vaccinated versus un-vaccinated study of outcomes, we’re somehow asking for the murder millions of children. In actuality, virulent measles causing death was largely eradicated before measles vaccine was introduced in 1963.\n\nIt is essential now to run studies on long term health effects on two groups. People that are 60-64 in 2019 who had the measles, against those who were vaccinated in the first years it was introduced. Who are the most healthy today, and who suffers from chronic illness. A additional common sense study of these two groups against those who received a second toxic dose in 1989-1990 would also reveal a lot. I doubt any Kakistocracy run foundation would fund the revelation of such a dirty secret.\n\nRead: Godfather of Vaccines Freely Admits to Unethical Skulduggery During Legal Deposition\n\nOther pilot studies have shown that people with a natural immunity from measles are 35% less likely to develop Parkinson’s disease, which is a nervous system disorder marked by slowness of movement, shaking, stiffness and, in the later stages, loss of balance.\n\nAccording to Anita Petek-Dimmer, “Chronic tendencies, such as recurring respiratory infections, often heal after measles. Chronic health problems disappear, such as psoriasis or chronic kidney problems. The children’s hospital in Basle (Switzerland) used to get children with chronic kidney infections to contract measles intentionally in order to heal them, up until the 1960s.”\n\nChildren susceptible to infections are healthier and stronger after contracting measles, studies have shown, and the need for future medical treatments clearly decreased. For example, children in the Third World countries are less likely to contract malaria and parasites after having measles. The risk of suffering breast cancer decreases to less than one half. Multiple sclerosis rates are also much lower among people who have had measles. Hay fever is more rare in children who have older siblings and had measles than in those who were vaccinated against it.\n\nA large African study showed that children who have had measles are at 50% lower risk for allergies than those vaccinated. Furthermore, it has been shown that experiencing measles protects from diseases of the immune system and skin diseases, as well as degenerative cartilage, bone and tumorous diseases.\n\nWinter Watch Takeaway: You can’t make this up. The Crime Syndicate continues to outdo themselves with this racket. They run inadequate sample trials that turn up noticeable negative reactions. Then the study results are buried and has to be dragged into public sunlight by a FOIA request 41 years later. Then, once the revelations are made, the mainstream stick-it-where-the-moon-don’t-shine media fails to report this to the public, leaving the real reporting to ignored and maligned alt-media sites like Winter Watch, which are in turn labelled “fake news” and are shut down.", "opengraph": {}, "tags": ["(p)Harma Industry Skulduggery", "Suppressed & Hidden History"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "600", "height": "338", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/Fil_fsdL4ZA?start=21\" width=\"600\" height=\"338\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/Fil_fsdL4ZA?start=21"}, {"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/eR6NEv6yCEg\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/eR6NEv6yCEg"}], "links": ["https://childrenshealthdefense.org/wp-content/uploads/FDA-Relied-Upon-STUDIES-LICENSING-MMR-VACCINE-FOIA.pdf", "https://www.winterwatch.net/2020/04/godfather-of-vaccines-freely-admits-to-unethical-skulduggery-during-legal-deposition/", "https://www.winterwatch.net/2020/11/corrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking/?share=custom-1600884568", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Fwww.winterwatch.net%2F2020%2F11%2Fcorrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking%2F&media=https%3A%2F%2Fi0.wp.com%2Fwww.winterwatch.net%2Fwp-content%2Fuploads%2F2019%2F05%2FMMR-vaccination-FDA.jpg%3Ffit%3D600%252C350%26ssl%3D1&description=Corrupt%20FDA%20Finally%20Releases%20Results%20of%20MMR%20Vaccine%20Trial%20Study%2C%20and%20It%27s%20Shocking", "https://twitter.com/share", "mailto:?subject=%5BShared%20Post%5D%20Corrupt%20FDA%20Finally%20Releases%20Results%20of%20MMR%20Vaccine%20Trial%20Study%2C%20and%20It%27s%20Shocking&body=https%3A%2F%2Fwww.winterwatch.net%2F2020%2F11%2Fcorrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking%2F&share=email", "https://www.winterwatch.net/2020/11/corrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking/?share=jetpack-whatsapp", "#", "https://www.winterwatch.net/2020/11/corrupt-fda-finally-releases-results-of-mmr-vaccine-trial-study-and-its-shocking/#print"], "authors": [], "publish_date": null}