{"result_id": "344025", "URL": "https://www.winterwatch.net/2021/03/dire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab/", "timestamp": "2023-04-25 18:13:47 CEST+0200", "meta": {"description": "Winter Watch welcomes special guest writer Giuseppe Vafanculo. He's a former professional journalist with more than 500 byline articles in major-market newspapers and magazines in the 1980s. His midlife career change led him to graduate summa cum laude from a top-five U.S. College of Oriental Medicine with a Masters of Science in Oriental Medicine and", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.winterwatch.net/wp-content/uploads/2016/06/torch-resize.png?fit=11%2C32&ssl=1", "canonical": "https://www.winterwatch.net/2021/03/dire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab/", "encoding": "UTF-8"}, "image": null, "domain": "www.winterwatch.net", "title": "Dire Warning of the Vaxpocalypse by Heroic Defectors from Team Jab | Winter Watch", "cleaned_text": "Winter Watch welcomes special guest writer Giuseppe Vafanculo. He’s a former professional journalist with more than 500 byline articles in major-market newspapers and magazines in the 1980s. His midlife career change led him to graduate summa cum laude from a top-five U.S. College of Oriental Medicine with a Masters of Science in Oriental Medicine and a Bachelors of Science in Eastern/Western Nutrition. Vafanculo is nationally board certified and licensed in Wisconsin and Virginia. He has owned and operated an Oriental Medicine/Acupuncture/Holistic Health practice for 15 years. The outrages of the COVID-19 scamdemic brought Vafanculo back to the new mass Internet media in 2020. This is Guiseppe’s sixth post at Winter Watch. The rest can be found here.\n\nImagine you are a shining star in the British medical system. Then you realize that vaccines and Big Pharma are poisoning and killing patients. In thanks for this realization, Dr. Vernon Coleman was ostracized by the system, but continued his quest to share the truth, writing over 100 books that sold over 2 million copies. Now he is the “Old Man in a Chair,” producing daily warnings about the deadly COVID-19 scamdemic since day one.\n\nIn recent days Dr. Coleman (www.vernoncoleman.org) issued a shocking warning to his viewership:\n\nDo you remember that video in which Bill and Melinda Gates sat and smirked as they talked about how the next pandemic would make people sit up and take notice? Well, I think I know what is going to happen. We all know that the evil elite, the Agenda 21 and Great Reset promoters, have all along intended to kill between 90% and 95% of the world’s population. Sadly, I fear it is probably too late to save many of those who have had the vaccine. Millions are doomed and I fear that many will die when they next come into contact with the coronavirus. But something has gone seriously wrong with the plans of the elite. And the result is that now those of us who haven’t had the vaccine also appear to be in serious danger. We need to keep our immune systems in tip top condition by eating wisely and taking vitamin D supplements. And we may at some point need to keep away from those who have had the vaccine. They are, I believe, now a very real danger to the survival of the human species.\n\nConsider Dr. Sherri Tenpenny, once a successful, young up-and-comer running an emergency room in Ohio and making some extra money on the side as an expert witness. Her testimony put parents in prison for shaken-baby syndrome. Then Dr. Tenpenny’s light went on. She realized she was helping to imprison innocent parents. She has spent over two decades researching vaccines (www.vaxxter.com); she is convinced nearly all Sudden Infant Death Syndrome (SIDS) cases cover up vaccine murder. She has since spent more than 40,000 hours reading the actual studies of vaccine testing and has devoted her life to telling the truth about the maiming and deadly results of any inoculation jab.\n\nDr. Tenpenny now warns of mass deaths numbering in the millions coming 3 to 6 months after receiving a COVID-19 injection of the untested, unproven, flawed science of Pfizer, Moderna, Astra Zenenca, and Johnson & Johnson.\n\nDr. Tenpenny explains the bleak scenario ahead for individuals who accepted the gaslighting lies and have been jabbed:\n\nDr. Tenpenny pointed out what COVID-19 really stands for: “Certificate of Vaccine Identification Artificial Intelligence COVID-19 is an acronym for Certificate of Vaccine Identification 19 (19 deciphers into 1 for A and 9 for I, thus AI). Dr. Tenpenny notes:\n• \n• This “vaccine” is not a vaccine, but an exceptionally well-designed genetic modification killing tool\n• It can cause full-blown autoimmune disease anywhere from 2 years and up to 20 years after injection\n• Not only does the shot NOT stop the host from getting sick, the antibody (AB) itself turns on the host’s body, creating havoc & massive auto-immune disease\n• Governments around the world are saying NO to mRNA vaccines because they are a form of MASS MURDER = GENOCIDE\n• Remember that genocide is absolutely a key part of the Deep State Plan.\n\nPonder Dr. Lee Merritt, a decorated Navy physician and surgeon now residing in the conservative heartland of Omaha, Nebraska (https://drleemerritt.com). One would not expect Dr. Merritt to go against decades of Big Pharma loyalty. Yet she is sounding a shrill alarm:\n\nAccording to Dr. Merritt, all the trans-national vaccine companies are infiltrated by Chinese military agents and are compromised to prepare this binary biological weapon.\n\nThis current mRNA vaccine is preparing the world for a mass death when billions will die all within a few weeks. This is their intent. This is unprecedented next-generational warfare.\n\nIn animal studies, after mRNA injections have been administered to cats, when the virus arrived once again into the body, it arrived like a Trojan Horse, undetected by the cats’ own immune system. The virus multiplied unchallenged and all animals involved in the experiment died from various causes. What happened is all animals died… but they didn’t die of the “vaccine”. What they died from what used to be called “immune enhancement” and now they call it “antibody dependent enhancement” (ADE). Here’s what happens: They make the RNA and you get the “vaccine” and you do fine. Now, you challenge the animal with the virus that you are supposed to be immunizing against. So when they challenged those cats with SARS [a.k.a. SARS-CoV-1, a coronavirus species], instead of killing the virus or weakening it, the immune response that they built into your system went out and stealthed the virus, so the virus came into the cat’s body like a Trojan Horse, unseen by the cat’s own immune system, and then it replicated without checks and killed the cat with overwhelming sepsis and cardiac failure. And that [also] happened in ferrets, that happened every time they tried this. Let me just point out. We have never made it through an animal study successfully for this type of virus. We have never done this in humans before–we don’t really have a track record of success. This vaccine was rolled out to distribution centers before they even made a show of caring about the FDA approving it. Do you realize that? I’ve never seen that happen before.\n\nDr. Thomas Binder is a German MD, a cardiologist. He is a self-described humanist. He has been sounding the clarion call of how truly evil the COVID-19 Scamdemic is since it began in earnest March 2020. On April 11, 2020, while doing a live radio interview on “The Richie Allen Show,” Dr. Binder’s door was kicked in and he was arrested by police in full SWAT gear. He was placed in a mental institution and later released. He remains unbowed.\n\nDr. Binder recently alerted his followers that millions of people will be murdered by the COVID-19 injections:\n\nGuys – please realise that it is not about a virus, medicine and science but about the final battle of multi-billionaire psychopaths who consider themselves ‘Übermenschen’ against the empathetic humanity, considered ‘Untermenschen’ by them: Evil versus good! I studied medicine, received a doctorate in immunology & virology, specialised in internal medicine & cardiology, have 32 years experience in diagnostics & therapy of ARI & am fed up with being dictated how to treat the flu by arrogantly ignorant technocrats. While it is impossible to control a respiratory virus, it is a breeze to control you. There is no pandemic of a respiratory virus. There is a pandemic of brainless and heartless cowards! If you do not know, by now at least, about the corona swindle aka swine flu swindle 2.0, you are what is called an idiot. If you do know about it, but do not dare to speak out about this greatest crime against humanity and help to finally stop it, you are what is called a coward. Even after one year, there is no representative cohort for the epidemiological surveillance of an alleged pandemic by means of tests for antibodies and T-cell immunity. Nothing else than meaningless numbers of the non-validated, non-standardised RT-PCR “test” are still provided.\n\nDr. Vernon Coleman sums up this apocalyptic quackccination event now being rolled out on a compliant, obedient public:\n\nI think the elite thought they were safe. I think they devised a plan that would result in millions of deaths but which would not harm them.\n\n But I believe they made a huge, crucial mistake. And this brings us to the third problem – a problem I don’t think they expected. This problem has just been outlined by Dr. Geert Vanden Bossche, who is a very eminent vaccine specialist. Indeed, I was originally sceptical about what he said because Dr. Bossche has previously worked with GAVI and the Gates Foundation. He is the last person in the world who could be described as being opposed to vaccination. Dr. Bossche has pointed out that the vaccines which are currently being used are the wrong weapons to use for the war against this virus infection. Disastrously, by giving vaccines to millions we are teaching the virus how to mutate and to become stronger and more deadly. Trying to devise new vaccines for new mutations simply makes things worse because the scientists cannot possibly get ahead of the mutated viruses. And the people who have been vaccinated are now sharing mutated viruses with those around them. The mutations are becoming stronger and deadlier. Ending the lockdowns will be perfectly timed to ensure that new mutations of the COVID-19 virus are spread far and wide.\n\n There’s another associated problem, too. Normally, our bodies contain white blood cells which help us defeat infections. Cells called NK cells – the NK stands for natural killers – help kill off invading bad cells. Once the NK cells have done their work our antibodies appear and clear up the mess. However, Dr. Bossche explains that the COVID-19 vaccines are triggering the production of very specific antibodies, which compete with the natural defenses of the individuals who had the vaccines. The natural defense systems of those who have been vaccinated are being suppressed because the specific antibodies which have been produced by the vaccine just take over. And these specific antibodies, the ones produced by the vaccines, are permanent. They are there forever within the bodies of the vaccinated. The disastrous result is that the natural immune systems of the tens or hundreds of millions who are having the vaccines are being effectively destroyed. Their immune systems will not be able to fight any mutated variation of the virus which develops within their bodies. And those mutated viruses can spread out into the community. I believe this is why new virus variations are appearing in areas where the vaccine has been given to lots of people. The bottom line is that giving the vaccines will give the virus an opportunity to become infinitely more dangerous. Every vaccinated individual has the potential to become a mass murderer because their bodies are becoming laboratories making lethal viruses. And worse still, some of the vaccinated individuals may become asymptomatic carriers – spreading lethal viruses around them. And the people who have had the vaccine won’t be able to respond to the mutations because their immune systems have been taken over by an artificial defense system, given to them by the vaccine and designed to combat the original form of the COVID-19 virus. The vaccinated individuals are going to be very much at risk when the new mutations start to spread. Their bodies are permanently and exclusively geared to defend against a form of the virus which is rapidly becoming out of date. Giving new vaccines won’t help because the mutated virus will not be vulnerable. The scientists who are making vaccines won’t be able to get ahead of the mutating virus. This should have been foreseen. It’s why flu vaccines often don’t work. The politicians and their advisors will lie and blame those who haven’t had the vaccine for the development of new mutations and for the rise in deaths that is going to take place. But if Dr. Bossche is right, and I believe he is, then it is the vaccinated individuals who are going to threaten mankind. They will be a major threat to anyone who has been vaccinated. But they will also be a major threat to the unvaccinated because the viruses they are shedding are more dangerous than the original one. We are in very dangerous territory. If we don’t stop this vaccination programme now then it is no exaggeration to say that the very future of mankind is at risk.\n\nAs this writer has reported in previous articles at www.winterwatch.net, COVID-19 is a massive con job.\n\nThe globalist parasites did not make the vaccines because this unknown, new virus suddenly appeared. Spearheaded by Gates, Fauci, and the other Great Reset operatives the past seven documentable years, bioweapon laboratories in the United States and China created a gain-of-function, attenuated virus (a non-lethal bioweapon known as COVID-19).\n\nFor the past year the COVID-19 scamdemic has terrorized the ignorant masses and driven billions of sheeple to take the “only solution,” an unproven, untested, genetically modifying vaccine. An injection intent on rewriting the human operating system, according to Moderna. Booster updates required every 3-6 months.\n\nThis has always been about global vaccine compliance, which serves a depopulation agenda. At its core, it’s a transhuman experimentation program.\n\nGiuseppe Vafanculo is the creator and host of Revolution Radio’s (www.freedomslips.com) “The Perfect Triangle” Fridays 6-8 p.m. ET live on Studio A. Vafanculo is co-host of “The Wisdom Circle” Wednesdays 12-2 p.m. ET live on Studio A; and “Operation Scorpio” Saturdays 1-4 p.m. ET live on Studio A. He is also the producer and regular commentator on “Need to Know: The Fetzer Report” weekday evenings live on YouTube, Facebook and Twitter. Archived at Jim Fetzer Bitchute. Russ Winter plans on participating every other week on these earlier shows.", "opengraph": {}, "tags": ["(p)Harma Industry Skulduggery", "Greenwashing"], "tweets": [], "movies": [], "links": ["https://www.winterwatch.net/?s=vafanculo", "https://vernoncoleman.org/", "http://www.vaxxter.com/", "https://drleemerritt.com", "https://www.archyde.com/20-minutes-police-arrest-corona-skeptical-doctor/", "https://www.winterwatch.net/category/guest-post/", "http://www.freedomslips.com", "https://www.bitchute.com/channel/Rbtrop3rRlZl/", "https://www.winterwatch.net/2021/03/dire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab/?share=custom-1600884568", "https://www.pinterest.com/pin/create/button/?url=https%3A%2F%2Fwww.winterwatch.net%2F2021%2F03%2Fdire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab%2F&media=https%3A%2F%2Fi0.wp.com%2Fwww.winterwatch.net%2Fwp-content%2Fuploads%2F2021%2F03%2FSheep-of-a-cliff.jpg%3Ffit%3D600%252C350%26ssl%3D1&description=Dire%20Warning%20of%20the%20Vaxpocalypse%20by%20Heroic%20Defectors%20from%20Team%20Jab", "https://twitter.com/share", "mailto:?subject=%5BShared%20Post%5D%20Dire%20Warning%20of%20the%20Vaxpocalypse%20by%20Heroic%20Defectors%20from%20Team%20Jab&body=https%3A%2F%2Fwww.winterwatch.net%2F2021%2F03%2Fdire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab%2F&share=email", "https://www.winterwatch.net/2021/03/dire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab/?share=jetpack-whatsapp", "#", "https://www.winterwatch.net/2021/03/dire-warning-of-the-vaxpocalypse-by-heroic-defectors-from-team-jab/#print"], "authors": [], "publish_date": null}