{"result_id": "344032", "URL": "https://www.winterwatch.net/2022/08/mrna-vaccines-dr-robert-malone-dr-theo-schetters-discuss-rise-of-all-cause-mortality-rate-where-are-we-now/", "timestamp": "2023-04-25 18:13:54 CEST+0200", "meta": {"description": "mRNA-vaccins and the rise of the all-cause mortality rate. Een gesprek met Robert Malone, Theo https://youtu.be/4ngjpR2IObg?t=472", "lang": "en", "keywords": "", "favicon": "https://i0.wp.com/www.winterwatch.net/wp-content/uploads/2016/06/torch-resize.png?fit=11%2C32&ssl=1", "canonical": "https://www.winterwatch.net/2022/08/mrna-vaccines-dr-robert-malone-dr-theo-schetters-discuss-rise-of-all-cause-mortality-rate-where-are-we-now/", "encoding": "UTF-8"}, "image": null, "domain": "www.winterwatch.net", "title": "mRNA Vaccines: Dr. Robert Malone, Dr. Theo Schetters Discuss Rise of All-Cause Mortality Rate. Where Are we Now? | Winter Watch", "cleaned_text": "“And the question is, what do you do with these new ideas? How do you decide which ideas are good and deserve to be followed up on? Science is a game of whack-a-mole. It’s finding the right project and hitting it. ”\n\n Drew Weissman, Roberts Family Professor, University of Pennsylvania, and co-developer\n\n mRNA technology\n\nThe University of Pennsylvania admitted in December 2020 that “The Pfizer/BioNTech and Moderna COVID-19 mRNA vaccines both use licensed University of Pennsylvania technology. As a result of these licensing relationships, Penn, Dr. Weissman and Dr. Kariko have received and may continue to receive significant financial benefits in the future based on the sale of these products. BioNTech provides funding for Dr. Weissman’s research into the development of additional infectious disease vaccines.” It turns out that Dr. Katalin Kariko is both an adjunct professor at UPenn’s Perelman School of Medicine and also a BioNTech vice president.\n\n On November 5, 2018, BioNTech stated: “BioNTech AG, a rapidly growing biotechnology company focused on the development of immunotherapies for the precise and individualized treatment of cancer and prevention of infectious diseases and the University of Pennsylvania (Penn), Philadelphia, USA, today announced that they have entered into a strategic research collaboration. The goal of the exclusive, multi-year partnership is to develop novel nucleoside-modified mRNA vaccine candidates for the prevention and treatment of various infectious diseases. Under the terms of the agreement, BioNTech and the lab of Drew Weissman, MD, PhD, at Penn will exchange their in-depth knowledge and experience in mRNA research and development to advance the discovery of novel vaccine candidates. Penn will be responsible for a dedicated preclinical research program from discovery through to the completion of IND-enabling studies in up to ten infectious disease indications. BioNTech will be eligible to receive an exclusive worldwide license to further develop and commercialize product candidates arising from the research collaboration. If proprietary Penn technology is part of a new mRNA-based vaccine, the university will be eligible to receive additional milestone payments and royalties from BioNTech. Detailed financial terms were not disclosed.”\n\nDrew Weissmann’s work led directly to the Coronavirus vaccines including the Pfizer/BioNTech injection. In December 2020, Penn Medicine stated: “The scientific team whose 2005 messenger RNA biology discovery at the University of Pennsylvania helped pave the way for the COVID-19 vaccines from Pfizer/BioNTech and Moderna received their first dose of the Pfizer/BioNTech vaccine together on Friday, Dec. 18 at Penn, more than 20 years after they began their basic science collaboration. Drew Weissman, MD, PhD, a professor of Infectious Diseases in Penn’s Perelman School of Medicine, and Katalin Karikó, PhD, an adjunct associate professor at Penn and a senior vice president at BioNTech, together discovered that exchanging one of the four building blocks of messenger ribonucleic acid (mRNA) molecules could greatly increase its therapeutic potential. They shared their perspectives as longtime researchers in the field who are comfortable taking the vaccines themselves, and called on the public to trust the decades of scientific research that has led to these important vaccines now being deployed in the global fight against the virus, encouraging others to get vaccinated when it becomes available to them.”\n\nUNIVERSITY THAT FUNDS BIDEN’S THINK TANK & HOSTS FACTCHECK.ORG HAS CONTACT WITH BIONTECH, GETS PAID FOR VACCINE SALES & FDA APPROVALS\n\n Feb 7, 2022\n\n By Patrick Howley | National File\n\nUniversity of Pennsylvania gets more money if more vaccines are sold, and gets “milestone payments” when the FDA approves a Pfizer-BioNTech vaccine, according to SEC documents.\n\n Documents obtained by NATIONAL FILE show that the University of Pennsylvania, which hosts and funds Joe Biden’s think tank called the Penn Biden Center, directly profits from the sale of Pfizer-BioNTech and Moderna Coronavirus vaccines.\n\nThe University gets more money if more vaccines are sold. The University of Pennsylvania also gets “milestone payments” when the Food and Drug Administration (FDA) approves a Pfizer-BioNTech vaccine. BioNTech pays the University of Pennsylvania Board of Trustees directly, and the university is protected from civil liability if people try to sue for “bodily injury” or “death” caused by BioNTech vaccines.\n\nBioNTech signed a licensing agreement in 2018 with the University of Pennsylvania, which directly funds the Penn Biden Center for Diplomacy and Global Engagement. Even though Coronavirus had not yet broken out when the deal was made, the 2018 agreement ensured massive payments for the University of Pennsylvania if its technology ended up getting used in new mRNA-based vaccines. Well, UPenn’s technology did end up getting used in the mRNA-based Coronavirus vaccine produced by Pfizer and BioNTech, and the deal has led to massive revenue for the university. Joe Biden, who was working for the University of Pennsylvania when the deal was made, received more than $900,000 from the University of Pennsylvania in the two years before he ran for president in this past election.\n\nThe University of Pennsylvania also houses the pro-vaccine website FactCheck.org. University of Pennsylvania president Amy Gutmann is now Biden’s nominee for Ambassador to Germany. The Biden administration’s FDA has speedily approved or authorized Pfizer-BioNTech vaccines including for children — all while the Penn Biden Center’s parent university enjoys massive profits from vaccine sales and FDA approval. And the Pfizer-connected FDA even knew about numerous adverse events for children related to the Pfizer-BioNTech vaccine, but allowed children to be injected with it anyway. Now, as the FDA considers emergency use authorization for a Pfizer-BioNTech vaccine for children as young as six months old, the direct financial relationship between these vaccines and Joe Biden’s think tank must be exposed.\n\nUniversity of Pennsylvania Profits From Pfizer-BioNTech And Moderna Vaccines\n\n NATIONAL FILE’s source explained to us that “UPenn earns massive payments (actual terms confidential, likely in the billions)” from Pfizer/BioNTech and Moderna vaccines.\n\n The University of Pennsylvania admitted in December 2020 that “The Pfizer/BioNTech and Moderna COVID-19 mRNA vaccines both use licensed University of Pennsylvania technology. As a result of these licensing relationships, Penn, Dr. Weissman and Dr. Kariko have received and may continue to receive significant financial benefits in the future based on the sale of these products. BioNTech provides funding for Dr. Weissman’s research into the development of additional infectious disease vaccines.” It turns out that Dr. Katalin Kariko is both an adjunct professor at UPenn’s Perelman School of Medicine and also a BioNTech vice president.\n\n On November 5, 2018, BioNTech stated: “BioNTech AG, a rapidly growing biotechnology company focused on the development of immunotherapies for the precise and individualized treatment of cancer and prevention of infectious diseases and the University of Pennsylvania (Penn), Philadelphia, USA, today announced that they have entered into a strategic research collaboration. The goal of the exclusive, multi-year partnership is to develop novel nucleoside-modified mRNA vaccine candidates for the prevention and treatment of various infectious diseases. Under the terms of the agreement, BioNTech and the lab of Drew Weissman, MD, PhD, at Penn will exchange their in-depth knowledge and experience in mRNA research and development to advance the discovery of novel vaccine candidates. Penn will be responsible for a dedicated preclinical research program from discovery through to the completion of IND-enabling studies in up to ten infectious disease indications. BioNTech will be eligible to receive an exclusive worldwide license to further develop and commercialize product candidates arising from the research collaboration. If proprietary Penn technology is part of a new mRNA-based vaccine, the university will be eligible to receive additional milestone payments and royalties from BioNTech. Detailed financial terms were not disclosed.”\n\nDrew Weissmann’s work led directly to the Coronavirus vaccines including the Pfizer/BioNTech injection. In December 2020, Penn Medicine stated: “The scientific team whose 2005 messenger RNA biology discovery at the University of Pennsylvania helped pave the way for the COVID-19 vaccines from Pfizer/BioNTech and Moderna received their first dose of the Pfizer/BioNTech vaccine together on Friday, Dec. 18 at Penn, more than 20 years after they began their basic science collaboration. Drew Weissman, MD, PhD, a professor of Infectious Diseases in Penn’s Perelman School of Medicine, and Katalin Karikó, PhD, an adjunct associate professor at Penn and a senior vice president at BioNTech, together discovered that exchanging one of the four building blocks of messenger ribonucleic acid (mRNA) molecules could greatly increase its therapeutic potential. They shared their perspectives as longtime researchers in the field who are comfortable taking the vaccines themselves, and called on the public to trust the decades of scientific research that has led to these important vaccines now being deployed in the global fight against the virus, encouraging others to get vaccinated when it becomes available to them.”\n\nHERE IS THE Securities and Exchange Commission (SEC) LICENSING AGREEMENT BETWEEN BIONTECH AND THE TRUSTEES OF THE UNIVERSITY OF PENNSYLVANIA DATED OCTOBER 9, 2018: The agreement states that “All payments to Penn hereunder shall be made by deposit of USD in the requisite amount to the “The Trustees of the University of Pennsylvania…”", "opengraph": {}, "tags": ["(p)Harma Industry Skulduggery", "Scamdemic", "Sub-Zero Kakistocracy", "Suppressed & Hidden History"], "tweets": [], "movies": [], "links": ["mailto:dreww@pennmedicine.upenn.edu"], "authors": [], "publish_date": null}