{"result_id": "346011", "URL": "https://worldcouncilforhealth.org/news/statements/bivalent-vaccines-approved/", "timestamp": "2023-04-25 18:14:24 CEST+0200", "meta": {"description": "Regulatory agencies have neglected to inform the public that no human studies were done before the approval of the bivalent vaccines and that the clinical study referenced included only eight mice. This is unprecedented and reckless.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/statements/bivalent-vaccines-approved/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Bivalent Vaccines Approved After Testing on 8 Mice and 0 Humans", "cleaned_text": "On August 31, the U.S. Food and Drug Administration (FDA) amended the emergency use authorizations (EUAs) of both the Moderna Covid-19 injection and the Pfizer-BioNTech Covid-19 injection. The EUAs now include the use of new “bivalent vaccines”, also known as “updated boosters”, that contain mRNA from the original strain of SARS-CoV-2 as well as a shared mRNA component of the BA.4 and BA.5 lineages of the Omicron variant.\n\nThe UK’s Medicines and Healthcare products Regulatory Agency (MHRA) has likewise approved the use of both Moderna and Pfizer/BioNTech’s additional booster after they were “found to meet the UK regulator’s standards of safety, quality and effectiveness.”\n\nThe “updated boosters” are available for use just two months after an initial or booster injection. While Moderna’s booster is approved for those aged 18 and older, Pfizer’s has been approved for anyone aged 12 and older.\n\nAccording to the FDA, the approval of both “bivalent vaccines” was based on the “totality of available evidence, including extensive safety and effectiveness data for each of the monovalent mRNA Covid-19 vaccines, safety and immunogenicity data obtained from a clinical study of a bivalent COVID-19 vaccine that contained mRNA from omicron variant BA.1 lineage that is similar to each of the vaccines being authorized, and nonclinical data obtained using a bivalent COVID-19 vaccine that contained mRNA of the original strain and mRNA in common between the BA.4 and BA.5 lineages of the omicron variant.”\n\nThese regulatory agencies have neglected to inform the public that no human studies were done before the approval of the new “updated boosters” and that the clinical study referenced included only eight mice. This is both unprecedented and reckless.\n\nThe agencies have also failed to adequately take into account the extensive safety data available worldwide that has consistently demonstrated concerning safety signals, including data publicly available via the Vaccine Adverse Event Reporting System (VAERS), the national early warning system that the FDA co-manages with the U.S. Centers for Disease Control and Prevention.\n\nThe World Council for Health’s (WCH) pharmacovigilance report confirmed that data on adverse drug reactions from the experimental Covid-19 injections exist in an amount sufficient for the recall of similar products in the past. This same data tells us that new mRNA injections should not be approved for use.\n\nThe World Council for Health has and continues to call for an immediate halt to the worldwide and unnecessary Covid-19 vaccination program. The new “bivalent vaccines” have not undergone sufficient testing and have been built upon an already flawed and proven dangerous injection. In fact, when they are rolled out to the public this week will be the first time the new “bivalent vaccines” will be used on humans. The WCH encourages everyone to say no to further injections and instead continue to do your own research and take personal responsibility for your health.", "opengraph": {"locale": "en_US", "type": "article", "title": "Bivalent Vaccines Approved After Testing on 8 Mice and 0 Humans", "description": "Regulatory agencies have neglected to inform the public that no human studies were done before the approval of the bivalent vaccines and that the clinical study referenced included only eight mice. This is unprecedented and reckless.", "url": "https://worldcouncilforhealth.org/news/statements/bivalent-vaccines-approved/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Statements", "updated_time": "2022-09-19T11:02:14+01:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/09/Newsroom-bivalent-injections.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/09/Newsroom-bivalent-injections.jpeg", "image:width": "1120", "image:height": "630", "image:alt": "bivalent vaccines", "image:type": "image/jpeg", "article:published_time": "2022-09-06T16:49:34+01:00", "article:modified_time": "2022-09-19T11:02:14+01:00"}, "tags": ["Statements"], "tweets": [], "movies": [], "links": ["https://www.gov.uk/government/news/first-bivalent-covid-19-booster-vaccine-approved-by-uk-medicines-regulator", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://www.fda.gov/news-events/press-announcements/coronavirus-covid-19-update-fda-authorizes-moderna-pfizer-biontech-bivalent-covid-19-vaccines-use", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/"], "authors": [], "publish_date": "2022-09-06T16:49:34+01:00"}