{"result_id": "346006", "URL": "https://worldcouncilforhealth.org/resources/war-on-words/", "timestamp": "2023-04-25 18:14:20 CEST+0200", "meta": {"description": "Language naturally changes over time, but sometimes these changes aren't organic. When that happens it might be considered a war on words.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/resources/war-on-words/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "The War on Words and What You Can Do About It", "cleaned_text": "What does the word vaccine actually mean? When a president, governor, or prime minister refers to a vaccine, do they mean what you think they mean? Language naturally changes over time, but sometimes these changes aren’t organic, and when that happens it might be considered a war on words.\n\nWe’ve seen many things change over the last two years, from the way we interact with each other to how we spend our time. Some of these changes are impossible to ignore while others have been subtle and more difficult to pinpoint, such as a shift in the meaning of words and how those words are being used.\n\nWhile they may appear subtle, these shifts matter. Unchecked, they can confuse, mislead, and even cause harm. That’s why it’s so crucial to be vigilant, identify these shifts, and take action. Before we explore some of the words and terms that have become weaponized over the last two years, we need to understand and appreciate just why this matters so much.\n\nThe Power of Language and Propaganda\n\nLanguage is one of the unique attributes of being human. No other animal on this planet employs words to convey meaning or even has the physiology with which to do so. Languages themselves evolve, with words building up meaning over time. Words can trigger particular thoughts, emotions, memories, and ideas. This is why language is so powerful. Language shapes the way we think and feel and even how we perceive the world.\n\nMany religious traditions revere language as the driving force behind creation. It’s certainly why governments and political parties seek to manipulate the power of language through propaganda. If they can manipulate the way people use and understand certain words, they can quite literally alter how people perceive reality.\n\nThis is why, whenever there is a conscious effort to exploit or manipulate words, it is important to pay attention. And we need to pay attention right now. Over the course of the pandemic, we have seen a new war on words in an effort to control whole populations and ‘nudge’ them into certain actions or behaviors. This has been done in two ways: either by exploiting the powerful connotations of a particular word and ransacking its meaning or by changing the definition of a word altogether.\n\nHere’s a quick look at a few terms that have been exploited over the last two years:\n\nIn this instance, politicians and public health bodies have co-opted words with a strong, positive connotation for their own ends. Safe and effective quickly became a mantra used to describe the Covid-19 vaccines at a time when the data to back up the use of this term was still not yet available. Even today, in the face of official data demonstrating that the injections are actually risky and ineffective, this mantra is still being used. Just because someone repeatedly says that something is safe and effective, doesn’t mean it is.\n\nPrior to September 2021, the US Center for Disease Control (CDC) defined a vaccine as, “A product that stimulates a person’s immune system to produce immunity to a specific disease, protecting the person from that disease.”\n\nMost would recognize this as a suitable definition. However, by this definition, the new mRNA jabs technically could not be defined as vaccines. They were never designed to produce immunity to Covid-19, only to reduce the severity of symptoms. Rather than call the mRNA technologies something more accurate, the CDC simply changed the definition of vaccine to, “A preparation that is used to stimulate the body’s immune response against diseases.”\n\nIn making this change, the CDC argued that this was simply to avoid any suggestion that vaccines offer 100% immunity. When Merriam-Webster chose to alter their own dictionary definition of vaccine, they acknowledged this was in part to incorporate mRNA technology within the meaning. But who decides what vaccine means? There is a strong case for stating that since mRNA technologies do not function in the same way as previous vaccines, they should not be defined as such.\n\nSeeing daily reports on the number of Covid cases within our respective countries has become normal for many of us. But what exactly is a Covid case? The case numbers we see are based on the number of people testing positive for the virus SARS-CoV-2. This is the virus that causes the disease known as Covid-19—it is not Covid-19 itself. A person may carry SARS-CoV-2 and not have Covid-19, just as a person may carry the Varicella-Zoster virus that can lead to shingles, without ever actually getting shingles. The assumption that testing positive for SARS-CoV-2 means you have Covid-19 is simply inaccurate. This inaccuracy also suggests the Covid case figures are wildly inflated.\n\nThis definition has become something of a moving target. Whether you’re considered fully vaccinated or not depends on where you live and when you are asking. In some countries, two jabs are still enough for a person to be considered fully vaccinated against Covid-19. In Austria, the bar has been raised to three jabs, with many countries such as the UK, Croatia, Switzerland, and Greece intending to follow suit. In Israel, where a fourth jab is already available, each booster shot only extends a person’s fully vaccinated status for six months.\n\nIn today’s world, governments appear to be dictating what fully vaccinated means—and exploiting their power to change the definition as they please.\n\nLet’s Use Terms The Right Way\n\nThe misuse of these terms—and many others—has become commonplace. As a result, many people still believe the mRNA ‘vaccines’ offer lasting immunity simply because they are defined as vaccines and that is what vaccines are supposed to do. People understandably worry about the number of Covid cases, not realizing that in fact, many of these ‘cases’ are not Covid cases at all. Likewise, people see these novel mRNA technologies as safe and effective, even though the latest data suggests otherwise.\n\nThis is not, however, a done deal. It’s time for all of us to make the conscious effort to use these terms correctly—and, where appropriate, to gently correct those who misuse them. In doing so, we bring a more accurate picture of how things truly are—and with clarity comes empowerment and understanding.", "opengraph": {"locale": "en_US", "type": "article", "title": "The War on Words and What You Can Do About It", "description": "Language naturally changes over time, but sometimes these changes aren't organic. When that happens it might be considered a war on words.", "url": "https://worldcouncilforhealth.org/resources/war-on-words/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Resources", "updated_time": "2022-02-17T05:11:36+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/02/shutterstock_1577342590-1024x576.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/02/shutterstock_1577342590-1024x576.jpeg", "image:width": "1024", "image:height": "576", "image:alt": "war on words", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/", "https://www.miamiherald.com/news/coronavirus/article254111268.html", "https://www.cdc.gov/vaccines/vac-gen/imz-basics.htm", "https://www.miamiherald.com/news/coronavirus/article254111268.html", "https://eu.usatoday.com/story/news/factcheck/2021/11/30/fact-check-merriam-webster-changed-vaccine-definition-accuracy/6354415001/"], "authors": [], "publish_date": "February 17, 2022"}