{"result_id": "346029", "URL": "https://worldcouncilforhealth.org/news/vaccine-mandates-in-india/", "timestamp": "2023-04-25 18:14:43 CEST+0200", "meta": {"description": "The World Council for Health celebrates following Monday's victory in the fight against vaccine mandates in India.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/vaccine-mandates-in-india/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Landmark Decision in India Supreme Court Stops Covid-19 Vaccine Mandates", "cleaned_text": "The World Council for Health (WCH) celebrates with the people of India following Monday’s victory in the fight against vaccine mandates. Citing “bodily integrity and personal autonomy,” India’s Supreme Court has ruled that people cannot legally be forced to take Covid-19 vaccines.\n\nJustices B. R. Gavai and L. Nageswara Rao also requested that data on adverse events related to the Covid-19 injections be made “publicly accessible”.\n\n“With respect to the infringement of bodily integrity and personal autonomy of an individual considered in the light of vaccines and other public health measures introduced to deal with the Covid-19 pandemic, we are of the opinion that bodily integrity is protected under Article 21 of the Constitution and no individual can be forced to be vaccinated. Further, personal autonomy of an individual, which is a recognized facet of the protections guaranteed under Article 21, encompasses the right to refuse to undergo any medical treatment in the sphere of individual health.”\n\nThe court also said that “no data” had been shown to them to refute the “emerging scientific opinion which appears to indicate that the risk of transmission of the virus from unvaccinated individuals is almost on par with that from vaccinated persons.” \n\n\n\nWhile India’s government has the ability to impose restrictions on rights, the restrictions must meet the 3-fold requirements: legality, legitimate need, and proportionality. The recent mandates failed to pass this test.\n\nAdditionally, according to the court, “Persons who are keen to not be vaccinated on account of personal beliefs or preferences, can avoid vaccination, without anyone physically compelling them to be vaccinated.”\n\nThe World Council for Health maintains that it is illegal and unlawful for anyone to participate, directly or indirectly, in this harmful experimental vaccination programme.", "opengraph": {"locale": "en_US", "type": "article", "title": "Landmark Decision in India Supreme Court Stops Covid-19 Vaccine Mandates", "description": "The World Council for Health celebrates following Monday's victory in the fight against vaccine mandates in India.", "url": "https://worldcouncilforhealth.org/news/vaccine-mandates-in-india/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "News", "updated_time": "2022-05-04T05:47:51+01:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/05/Statement-Newsroom-Vaccine-Mandates-in-India.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/05/Statement-Newsroom-Vaccine-Mandates-in-India.jpeg", "image:width": "1120", "image:height": "630", "image:alt": "India Supreme Court Decision", "image:type": "image/jpeg", "article:published_time": "2022-05-04T04:45:03+01:00", "article:modified_time": "2022-05-04T05:47:51+01:00"}, "tags": ["News", "Statements"], "tweets": [], "movies": [], "links": ["https://indianexpress.com/article/india/supreme-court-centre-covid-19-vaccine-policy-7897266/", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://worldcouncilforhealth.org/news/2021/12/covid-19-vaccines/14001/"], "authors": [], "publish_date": "2022-05-04T04:45:03+01:00"}