{"result_id": "346040", "URL": "https://worldcouncilforhealth.org/members/nuremberg-new-zealand/", "timestamp": "2023-04-25 18:14:50 CEST+0200", "meta": {"description": "Welcome to Nuremberg NZ. The trial has begun. After the second world war the Nazi war criminals were tried. Notably the argument \"I was just doing what I was", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/members/nuremberg-new-zealand/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Nuremberg New Zealand", "cleaned_text": "Welcome to Nuremberg NZ. The trial has begun. After the second world war the Nazi war criminals were tried. Notably the argument “I was just doing what I was told”, was not a valid excuse. In New Zealand, our basic human rights are being trampled on, because of a virus with a similar mortality rate to the seasonal flu. The excuse is that all these human rights violations are for our own safety. Coercion from Politicians and Media have resulted in more than half the population of Aotearoa being bullied into taking an experimental injection for which the long term side effects are completely unknown. As well as having no way of knowing the long term health effects, we are being constantly told this is a “safe and effective vaccine”. Surely the question must be asked “How can a vaccine that has killed more people than all other vaccines combined in the last 30 years, in just 8 months, be safe?” Furthermore when we consider the claim “effective” against the Springer report, https://link.springer.com/article/10.1007/s10654-021-00808-7#Sec4 which conclusively concludes “Increases in COVID-19 are unrelated to levels of vaccination across 68 countries and 2947 counties in the United States” , we can very clearly see that there is no reasonable basis for proportionality of the covid response measures. It is therefore our belief here at Nuremberg.nz that those responsible for multiple breachs of The Nuremberg Code 1947 The Helsinki Declaration 1952 The UNESCO Declaration on Bioethics and Human Rights NZ Bill of Rights 1990 Will ultimately have their day of reckoning. The www.nuremberg.nz project is designed as a space where you can add your claim to what will ultimately be the largest class action in New Zealand.", "opengraph": {"locale": "en_US", "type": "article", "title": "Nuremberg New Zealand | World Council for Health", "description": "Welcome to Nuremberg NZ. The trial has begun. After the second world war the Nazi war criminals were tried. Notably the argument \"I was just doing what I was", "url": "https://worldcouncilforhealth.org/members/nuremberg-new-zealand/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "updated_time": "2022-01-25T14:42:54+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/03/wch-homepage-thumb.jpg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/03/wch-homepage-thumb.jpg", "image:width": "1200", "image:height": "630", "image:alt": "World Council for Health", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}