{"result_id": "346010", "URL": "https://worldcouncilforhealth.org/multimedia/dr-katarina-lindley-comments-at-the-fda-vaccines-and-related-biological-products-advisory-committee/", "timestamp": "2023-04-25 18:14:21 CEST+0200", "meta": {"description": "Steering Committee member of World Council for Health Dr. Katarina Lindley made the following comments at the FDA Vaccines and Related Biological Products", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/multimedia/dr-katarina-lindley-comments-at-the-fda-vaccines-and-related-biological-products-advisory-committee/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Dr. Katarina Lindley Comments at the FDA Vaccines and Related Biological Products Advisory Committee", "cleaned_text": "Steering Committee member of World Council for Health Dr. Katarina Lindley made the following comments at the FDA Vaccines and Related Biological Products Advisory Committee\n\nGood afternoon I’m Dr Kat Lindley, family physician and member of GCS and Steering Committee of the World Council for Health\n\nI have no conflicts of interest.\n\nmRNA technology combined with Lipid nano particle is a key component of the recent Pfizer and Moderna vaccine mass rollout under EUAs. It should be recognized that 18 months on, the mechanism of action, and pharmacodynamics of this mRNA-LNP platform is still only partially understood.\n\nTo assume that the platform is intrinsically safe and doesn’t require case by case safety assessment and regulatory scrutiny is in my opinion reckless and runs counter to the very purpose of a drug regulator.\n\nEach component the mRNA is programmed to express, is synonymous to a new chemical entity in the body and should be treated as such with full regulatory scrutiny to test long term safety.\n\nWe know already that LNPs and their cargos move great distances from the site of injection into the lymphatic and blood circulation, and have been detected in the spleen, brain, heart tissue, bone marrow, adrenals and ovaries. How can we move forward when pharmacokinetics studies have already shown there is spike production in regional lymph nodes for two months or longer?\n\nNot only should the LNPs not be administered in healthy people, everything you are coding for must be addressed with full scrutiny.\n\nAvailable bio-distribution and pharmacokinetic studies to date reveal a very different picture of what happens following injection compared with the over-simplistic and predictable picture projected by health authorities and vaccine manufacturers.\n\nSafety signals are now clearly evident yet are being ignored. VAERS data alone, which is significantly underreported, show 1.3 million COVID-19 injection harms with over 28 thousand reported deaths.\n\nMany of us, who have been dealing with the fallout of this speedy rollout of the new technology, have much graver concerns than those reflected by the VAERS data. We are already dealing with a significant increase in complex neurological, endocrine, autoimmune, and cardiac issues. You would have to be a gambler, or something much worse, to argue there is no risk of fertility issues – which could be catastrophic for our future generations?\n\nHas the FDA really learned nothing from the thalidomide, Vioxx and other regulatory disasters of the past?\n\n“The Food and Drug Administration is responsible for protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products, and medical devices;\n\nThe FDA needs to remember that its responsibilities are ultimately to the people of this great nation. That includes a deep responsibility for children and our future generations. My expectation is that FDA will continue its mission of protecting public’s safety and best interest against any and all harm. Future framework with this new technology is an existential threat to the public health and should not be approved.\n\nThank you for your time!", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Katarina Lindley Comments at the FDA Vaccines and Related Biological Products Advisory Committee | World Council for Health", "description": "Steering Committee member of World Council for Health Dr. Katarina Lindley made the following comments at the FDA Vaccines and Related Biological Products", "url": "https://worldcouncilforhealth.org/multimedia/dr-katarina-lindley-comments-at-the-fda-vaccines-and-related-biological-products-advisory-committee/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "updated_time": "2022-11-13T22:36:51+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/06/Dr-Kat-Lindley-FDA-Comments-June-28.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/06/Dr-Kat-Lindley-FDA-Comments-June-28.jpeg", "image:width": "1280", "image:height": "720", "image:alt": "FDA Vaccines", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}