{"result_id": "346004", "URL": "https://worldcouncilforhealth.org/news/independent-pharmacovigilance-report-recall-of-covid-19-vaccines/", "timestamp": "2023-04-25 18:14:19 CEST+0200", "meta": {"description": "A new report has confirmed that data on adverse drug reactions from the experimental Covid-19 vaccines exist in an amount sufficient for the recall of similar products in the past.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/independent-pharmacovigilance-report-recall-of-covid-19-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Press Release: Independent Pharmacovigilance Report Confirms Evidence for Recall of Covid-19 Vaccines", "cleaned_text": "FOR IMMEDIATE RELEASE\n\nSaturday, June 11, 2022\n\nContact: Dr. Katarina Lindley at [email protected]\n\n\n\nAdverse Reactions for Novel Covid-19 Vaccines More Numerous Than for Similar Products by Factor of Between 10 and 169\n\nBATH, UK — A new report prepared by the World Council for Health (WCH) has confirmed that data on adverse drug reactions from the experimental Covid-19 vaccines exist in an amount sufficient for the recall of similar products in the past.\n\nThe report was prepared to determine whether sufficient pharmacovigilance data exist on official and public databases (WHO VigiAccess, CDC VAERS, EudraVigilance, and UK Yellow Card Scheme) to establish a safety signal on the novel Covid-19 injections.\n\nOn all databases, it was found that adverse drug reaction (ADR) reports linked to Covid-19 injections are more numerous than other similar products by a factor of between 10 and 169 (see graph below). Many of the ADR reports are serious in nature and there exists sufficient evidence of associated harm on these databases to indicate a product recall.\n\nIn total, more than 40,000 deaths are linked to the novel Covid-19 vaccines in the official databases analysed.\n\nIn addition, the WCH pharmacovigilance report found that several thousand adverse drug reactions on official databases are related to the use of the experimental Covid-19 vaccines among young boys and girls for whom the vaccine had not been approved at the time.\n\nThe purpose of pharmacovigilance databases is to provide a signal of safety, and not to prove causality. To ensure that harms are detected in time, suspicion that an event is linked to the administration of the medicine is enough to register an event. “There is no need to prove that the medicine caused the adverse reaction, just the suspicion is good enough,” Dr. June Raine, head of the UK’s Medicines and Healthcare products Regulatory Agency, said in 2006. When sufficient pharmacovigilance data show a signal of harm, administration of the product should be ceased, the product recalled, and the safety signal investigated.\n\nIt should also be noted that such systems of passive surveillance result in significantly fewer ADR reports than active surveillance reporting. As a result, the actual number of adverse events that occurred in temporal relation to Covid-19 injections is likely to be much higher than revealed by the available official data.\n\nIn December 2021, World Council for Health called on regulators and governments around the world to immediately cease use of all experimental Covid-19 injections.\n\nDr. Tess Lawrie, co-founder of the World Council for Health, calls for people to come together to raise awareness of vaccine injury so that those harmed can get the help they deserve. “It is concerning that a grassroots organisation has had to do this work and point out that none of these experimental vaccines are safe according to publicly available official data. Why have the regulators not done their job and protected us?“\n\nWorld Council for Health Covid-19 Vaccine Pharmacovigilance Report: https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/\n\n\n\nWorld Council for Health Calls for an Immediate Stop to the Covid-19 Experimental “Vaccines”: https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/ \n\n\n\nWorld Council for Health Statement on Covid-19 Vaccines: https://worldcouncilforhealth.org/news/2021/12/covid-19-vaccines/14001/\n\n\n\nWorld Council for Health Statement on Risk of Myocarditis in Children: https://worldcouncilforhealth.org/news/2022/01/risk-of-myocarditis-in-children/18570/", "opengraph": {"locale": "en_US", "type": "article", "title": "Press Release: Independent Pharmacovigilance Report Confirms Evidence for Recall of Covid-19 Vaccines", "description": "A new report has confirmed that data on adverse drug reactions from the experimental Covid-19 vaccines exist in an amount sufficient for the recall of similar products in the past.", "url": "https://worldcouncilforhealth.org/news/independent-pharmacovigilance-report-recall-of-covid-19-vaccines/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "News", "updated_time": "2022-06-11T20:26:33+01:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/06/Newsroom-pharmacovigilance-report-2.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/06/Newsroom-pharmacovigilance-report-2.jpeg", "image:width": "1120", "image:height": "630", "image:alt": "Recall of Covid-19 Vaccines", "image:type": "image/jpeg", "article:published_time": "2022-06-11T20:21:21+01:00", "article:modified_time": "2022-06-11T20:26:33+01:00"}, "tags": ["News", "News Releases"], "tweets": [], "movies": [], "links": ["/cdn-cgi/l/email-protection#553e342134273c3b3415213d302236613d7b3a2732", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://www.theguardian.com/society/2006/may/12/health.medicineandhealth", "https://www.theguardian.com/society/2006/may/12/health.medicineandhealth", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/ ", "https://worldcouncilforhealth.org/news/2021/12/covid-19-vaccines/14001/", "https://worldcouncilforhealth.org/news/2022/01/risk-of-myocarditis-in-children/18570/"], "authors": [], "publish_date": "2022-06-11T20:21:21+01:00"}