{"result_id": "346023", "URL": "https://worldcouncilforhealth.org/news/statements/cdc-covid-19-vaccines-on-childhood-vaccine-schedule/", "timestamp": "2023-04-25 18:14:37 CEST+0200", "meta": {"description": "The US Centers for Disease Control and Prevention (CDC) Committee on Immunization Practices (ACIP) is scheduled to meet this week on October 19-20. A Vaccines", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/statements/cdc-covid-19-vaccines-on-childhood-vaccine-schedule/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Call to Action: CDC Advisory Committee Voting to Add Covid-19 Vaccines to Childhood Vaccine Schedule", "cleaned_text": "The US Centers for Disease Control and Prevention (CDC) Committee on Immunization Practices (ACIP) is scheduled to meet this week on October 19-20. A Vaccines for Children (VFC) vote on adding the Covid-19 vaccines to the CDC Childhood Immunization Schedule is on the agenda.\n\nMore than enough evidence exists showing that these injections are neither safe nor effective. Not only do they not belong on the routine childhood immunization schedule, they should not be given to children at all. Please see the WCH Pharmacovigilance Report for further details.\n\nIf these shots are successfully added to the childhood vaccine schedule in the US, Pfizer and Moderna will further escape product liability.\n\nThe CDC is now accepting comments from the public on meeting agenda items. We encourage everyone to voice their opinion and to share data with the ACIP ahead of this important vote.\n\nPublic comments are due by Thursday, October 20. Use this form to submit yours individually, as an organization, or anonymously.\n\nAs of the writing of this statement, more than 350 comments have already been recorded and can be viewed here.\n\nIn addition to submitting comments, ACIP committee members can be reached by phone.\n\nBelow you will find examples of letters sent in the UK in an effort to inform elected officials of the reality of these injections. We invite you to use use language from these letters and the data in them to help inform your messages to the ACIP.\n\nThe following is a letter sent to the Secretary of State for Health & Social Care from the Children’s Covid Vaccine Advisory Council (CCVAC): We, the undersigned health professionals and scientists, call upon you urgently to pause the covid19 vaccine rollout for healthy children, while a thorough and independent safety review is undertaken. We have between us written numerous letters to your predecessors, regarding both the safety and necessity of these mRNA products in children. We would urge you to consider very carefully the role of vaccination in ever younger and younger children against SARS-CoV-2, despite the gradual but significant reducing virulence of successive variants, the increasing evidence of rapidly waning vaccine efficacy, the increasing concerns over long-term vaccine harms, and the knowledge that the vast majority of this young age group have already been exposed to SARS-CoV-2 repeatedly and have demonstrably effective immunity. Thus, the balance of benefit and risk which supported the rollout of mRNA vaccines to the elderly and vulnerable in 2021, is totally inappropriate for children in 2022. Below are links to all the letters we have written to the regulators over the past year. The detailed questions contained, have never been properly addressed. Legal challenges are also in progress.\n• 17th May 2021: https://www.hartgroup.org/wp-content/uploads/2021/05/Covid19_Vaccine_in_Children_FULL_document.pdf appendix to above letter You may be aware that members of the Pandemic Response All Party Parliamentary Group have also written regarding increased all-cause mortality in 15-19-year-old males, again with no proper answer. https://dailysceptic.org/2022/01/08/end-covid-vaccination-of-children-because-the-risksoutweigh-the-benefits-government-told-by-mps-and-scientists/ The health of the nation’s children is of paramount concern and must surely be a high priority for an incoming Minister. We entreat you to apply the precautionary principle to the use of these products which still have no long-term safety data for children. Pausing the rollout would cost nothing.\n\nThe following is a letter sent to the Chief Executive of the UKHSA from HART (Health Advisory & Recovery Team): We, the undersigned, are writing to express our deep concern at the guidance regarding further mRNA vaccination after any episode of myocarditis, as detailed in the UKHSA guidance for healthcare professionals. The majority of patients with vaccine-associated myocarditis present with chest pain. This may be misinterpreted, by either the patient or doctor, as musculoskeletal pain, which is a recognised non-serious side effect of these products and cardiac pathology could be missed. Any patient presenting with chest pain should be assessed immediately in hospital as this may be life-threatening. During the covid pandemic, anyone admitted to hospital with a positive test result was considered to have severe Covid-19. With myocarditis, every patient presenting with cardiac symptoms needs hospital assessment including ECGs, blood troponin levels and echocardiograms. This would therefore not fit the definition of a mild illness. A recent BMJ review quotes “Most people were admitted to hospital (≥84%) for a short duration (two to four days).” The review further quotes, “persistent echocardiogram abnormalities, as well as ongoing symptoms or a need for drug treatments or restriction from activities in >50% of patients”. Where cardiac MRI scans have been performed, 89% of patients have shown Late Gadolinium Enhancement (LGE), which is known to be a predictor of a bad prognosis. Inflammation of the heart can lead to fibrosis and other complications such as arrhythmias and death. Left undiagnosed and therefore untreated, there is also a real risk of silent left ventricular dysfunction. Myocarditis should be considered far from being a mild illness. The long term prognosis for post-vaccination myocarditis is also uncertain but early follow-up studies in children have shown two-thirds had persistent changes on cardiac MRI scans 3-8 months later, despite clinical improvement. A detailed US FDA advisory committee report from late 2021, showed that 40% of affected adolescents were still symptomatic at 3 month follow-up and 50% were still restricting their physical activity. Viral myocarditis can have serious late consequences with an approximately 20% six-year mortality. In the absence of appropriate long-term follow-up, it is reckless to assume that vaccine-associated myocarditis has a milder outcome. It is therefore concerning that the UKHSA guidance contains advice such as:\n• “Where appropriate the patient should be seen face to face and this assessment should include their vital signs.” We would consider a face-to-face assessment essential and feel the phrase “where appropriate” to be misplaced. ““If patients have mild symptoms, they do not require a referral to secondary care at this point.” Again, every patient with chest pain or palpitations should have an urgent ECG and blood sent for cardiac troponins. The term mild myocarditis refers to symptoms which resolve and therefore can only be considered a retrospective diagnosis.\n• It is impossible to substantiate the statement that “the majority of cases appear to be mild and self-limiting”, whilst acknowledging that “no long-term follow-up data is available yet on hospitalised patients” Myocarditis incidence has been underplayed: Quoted risk of vaccine-associated myocarditis varies widely, with younger age and male sex being the two biggest risk factors and the vast majority of studies have shown a greater risk after a second dose. In Hong Kong, where specific information about myocarditis is given to all vaccinees, 1 in 2680 adolescent boys developed myocarditis after their second dose of Pfizer. A change in policy to a single dosage for this age-group, was estimated to have saved several cases. For boys aged 12-17, post-vaccine-myocarditis exceeds rates of hospitalisation for Covid-19 itself. It is also concerning that there has been no serious attempt to prospectively study the incidence of myocarditis. A prospective study from the US military, found that myocarditis post smallpox vaccination was 200-fold higher than background rates, compared with 7.5 x expected when using routine self-reporting. Blood testing post-vaccination elucidated asymptomatic cases at a further 6-fold higher rate. A small prospective study of secondary school-children in Thailand, using diary cards and blood troponins on day 3 and day 7, showed 29% with a potential cardiac symptom and 18% with abnormal ECGs. This is only a preprint but needs replicating before sweeping assertions of safety can be made. In most series, myocarditis has occurred after the second dose, yet government guidance suggests patients who have suffered with myocarditis following initial vaccination, may still undergo further vaccinations: “If there is no evidence of ongoing myocarditis, they can be offered vaccination with the Pfizer (Cominarty) vaccine from 12 weeks after their last dose if further doses are due. If there is evidence of ongoing effects of acute or subacute myocarditis, then an individual risk benefit assessment should be undertaken” None of the vaccine trials included patients with a past history of myocarditis and we are aware of no data to support this advice. Giving a Covid-19 vaccine to someone with a past history of myocarditis of any cause, would require a thorough assessment and individual discussion of benefit and risk. Any episode of post-vaccination myocarditis should be seen as an absolute contraindication to receiving any further doses, as the risk of this serious cardiac condition is known to increase after the second dose. The UKHSA has acknowledged the total absence of long-term follow up following vaccine-associated myocarditis. Continuing with the policy outlined above is therefore reckless.\n• We ask that you urgently update the advice to ensure that all patients with relevant symptoms are seen face to face and receive at minimum an ECG and cardiac troponins, proceeding to Echocardiogram and cardiac MRI if initial investigations support a diagnosis of myocarditis.\n• We also urge you to recognise myocarditis as cardiac pathology and to not refer to this as a mild illness. This is misleading as we do not have long-term safety data to quantify the use of the word “mild”. Myocarditis has undoubtedly proved fatal for some.\n• The guidance should also be corrected to advise that a diagnosis of vaccine-associated myocarditis should be an absolute contraindication to further doses.\n• These changes should be notified to all GPs, vaccination centres and emergency medicine departments.\n\nThe following is a letter sent by the CCVAC to the Prime Minister of the UK: Firstly, congratulations on becoming our new Prime Minister. You will no doubt have many pressing matters as you take up office. But what can be more important than the health and well-being of the nation’s children? We, the undersigned health professionals and scientists, have huge concerns about the safety and necessity of Covid-19 vaccines for children, for reasons detailed in the linked letters below. We call upon you, urgently, to pause the Covid-19 vaccine rollout for healthy children, while a thorough and independent safety review is undertaken. Between us, we have written numerous letters to the regulators, copied to your predecessor, regarding use of these mRNA products in children. We strongly urge you to reconsider their deployment for the following reasons. Covid-19 was always a much milder illness in children, with around a 1 in 2,000,000 risk of death for otherwise healthy children. Successive variants have become less virulent, reducing the risk still further. In addition, there is considerable evidence of rapidly waning vaccine efficacy, and increasing concerns over immediate vaccines injuries (such as myocarditis with its known potential for severe and possibly permanent cardiac damage). There is still a total lack of long-term safety data and the worrying rise in excess non-Covid deaths in young males aged 15-19 years has yet to be explained. Lastly, the vast majority of children have already been exposed to SARS-CoV-2 repeatedly and have achieved demonstrably effective immunity, which is far superior to vaccine-induced immunity. In short, the balance of benefit and risk, used to support the rollout of mRNA vaccines to the elderly and vulnerable in 2021, is totally inappropriate and inapplicable for children in 2022. Below are links to all the fully referenced letters we have written to the MHRA, the JCVI and the CMOs over the past year. The detailed questions posed have never been properly addressed by these regulators. Groups of health professionals from around the world have similar concerns and indeed some countries have already paused children’s Covid-19 vaccines, particularly for those who have already had SARS-CoV-2 infection. The Danish Minister of Health recently declared that vaccinating children had been a mistake and has withdrawn it for healthy children.\n• 17th May 2021 – https://www.hartgroup.org/wp-content/uploads/2021/05/Covid-19_Vaccine_in_Children_FULL_document.pdf appendix to above letter You may be aware that members of the Pandemic Response All Party Parliamentary Group also wrote to the JCVI in January 2022, regarding the documented increase in all-cause mortality in 15-19-year-old males, again with no satisfactory reply given to address their concerns. The health of the nation’s children is of paramount concern and must surely be a high priority for an incoming Prime Minister. You will no doubt be aware of Sir Christopher Chope’s tireless work on a Covid-19 Vaccine Damage Bill, pushing for proper and fair compensation for thousands of vaccine-damaged adults. You cannot allow the risk of Covid-19 vaccine injuries in children, who stand to gain zero benefit from vaccination due to the overwhelming majority having already been infected, and who have therefore already acquired natural immunity. We entreat you to apply the precautionary principle to the use of these products, which still have no long-term safety data and remain in Phase 3 clinical trials. The evidence of damage that this rushed policy is causing for children mounts daily. In addition to concerns about the physical risk to children posed by these mRNA products, we would also remind you of the acknowledged and significant psychological and educational damage to children which resulted from the school closures and masking requirements implemented by your predecessor. We would ask that, as a matter of urgency, you make clear that school closures and masking of schoolchildren will not be repeated under your watch. At the beginning of your term as Prime Minister, you now have a critical opportunity to prevent avoidable damage to children, and the inevitable outcry and backlash that will follow, by pausing the rollout with immediate effect, as well as bringing to an end all harmful covid restrictions in schools. This is a risk-free action. Until then, the political and health risks of these damaging policies will only escalate. Wishing you well in the challenging job you have ahead.", "opengraph": {"locale": "en_US", "type": "article", "title": "Call to Action:  CDC Advisory Committee Voting to Add Covid-19 Vaccines to Childhood Vaccine Schedule", "description": "The US Centers for Disease Control and Prevention (CDC) Committee on Immunization Practices (ACIP) is scheduled to meet this week on October 19-20. A Vaccines", "url": "https://worldcouncilforhealth.org/news/statements/cdc-covid-19-vaccines-on-childhood-vaccine-schedule/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Statements", "updated_time": "2022-10-18T20:43:42+01:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/10/Newsroom-Covid-19-Vaccines-on-Childhood-Vaccine-Schedule-2.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/10/Newsroom-Covid-19-Vaccines-on-Childhood-Vaccine-Schedule-2.jpeg", "image:width": "1120", "image:height": "630", "image:alt": "Covid-19 Vaccines on Childhood Vaccine Schedule", "image:type": "image/jpeg", "article:published_time": "2022-10-18T20:43:32+01:00", "article:modified_time": "2022-10-18T20:43:42+01:00"}, "tags": ["Statements"], "tweets": [], "movies": [], "links": ["https://www.regulations.gov/document/CDC-2022-0111-0001", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://www.regulations.gov/commenton/CDC-2022-0111-0001", "https://www.regulations.gov/document/CDC-2022-0111-0001/comment", "https://www.gov.uk/government/publications/myocarditis-and-pericarditis-after-covid-19-vaccination/myocarditis-and-pericarditis-after-covid-19-vaccination-guidance-for-healthcare-professionals", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9023259/", "https://www.bmj.com/content/378/bmj-2021-069445.long", "https://publications.aap.org/pediatrics/article/148/5/e2021053427/181357/COVID-19-Vaccination-Associated-Myocarditis-in?autologincheck=redirected", "https://doi.org/10.1007/s00330-019-06643-5", "https://www.jpeds.com/article/S0022-3476(22)00282-7/fulltext#%2520", "https://www.fda.gov/media/153514/download", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC3106486/", "https://www.gov.uk/government/publications/myocarditis-and-pericarditis-after-covid-19-vaccination/myocarditis-and-pericarditis-after-covid-19-vaccination-guidance-for-healthcare-professionals", "https://www.ncbi.nlm.nih.gov/labs/pmc/articles/PMC8767823/", "https://jamanetwork.com/journals/jamapediatrics/fullarticle/2789584", "https://www.medrxiv.org/content/10.1101/2021.08.30.21262866v2.full", "https://www.preprints.org/manuscript/202208.0151/v1", "https://www.bmj.com/content/378/bmj-2021-069445.long", "https://www.gov.uk/government/publications/myocarditis-and-pericarditis-after-covid-19-vaccination/myocarditis-and-pericarditis-after-covid-19-vaccination-guidance-for-healthcare-professionals", "https://www.hartgroup.org/updated-analysis-of-deaths-in-males-15-19-years-of-age/", "https://boriquagato.substack.com/p/danish-national-board-of-health-admits", "https://en.coronasmitte.dk/general-information/vaccination", "https://childrensunion.org/6-month-to-4-years-covid-vaccines/", "https://childrensunion.org/ccvac-pause-covid-roll-out/", "https://www.hartgroup.org/open-letter-to-the-mhra-regarding-child-death-data/", "https://www.hartgroup.org/gmc-reply-07-12-2021/", "https://www.hartgroup.org/open-letter-to-the-gmc/", "https://www.hartgroup.org/open-letter-to-mhra-14-11-2021/", "https://www.hartgroup.org/open-letter-to-mhra-23-08-2021/", "https://www.hartgroup.org/open-letter-to-mhra-06-06-2021/", "https://www.hartgroup.org/open-letter-to-mhra-17-05-2021/", "https://www.hartgroup.org/wp-content/uploads/2021/05/Covid-19_Vaccine_in_Children_FULL_document.pdf", "https://dailysceptic.org/2022/01/08/end-covid-vaccination-of-children-because-the-risks-outweigh-the-benefits-government-told-by-mps-and-scientists/", "https://bills.parliament.uk/bills/2926"], "authors": [], "publish_date": "2022-10-18T20:43:32+01:00"}