{"result_id": "346026", "URL": "https://worldcouncilforhealth.org/multimedia/geert-vanden-bossche-vaccines/", "timestamp": "2023-04-25 18:14:40 CEST+0200", "meta": {"description": "Watch Dr. Geert Vanden Bossche’s presentation at the Better Way Conference on May 20, 2022 in Bath, UK.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/multimedia/geert-vanden-bossche-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Dr. Geert Vanden Bossche: The Role of Vaccines | Better Way Conference", "cleaned_text": "Watch Dr. Geert Vanden Bossche’s presentation at the Better Way Conference in Bath, UK.\n\nConversation 1: What is our role in reclaiming science?\n\n Is There a Role for Vaccines in the Future?\n\n May 20, 2022 | Bath, UK\n\nLearn more about the Better Way Conference here. Read the Better Way Charter and 7 Principles of a Better Way here.\n\nPublic release of all conversations began the week of July 25. On-demand passes to watch all of the weekend’s conversations are still available here. Find all of the available conference videos in the WCH Video Library.\n\nGeert Vanden Bossche received his DVM from the University of Ghent, Belgium, and his PhD degree in Virology from the University of Hohenheim, Germany. He held adjunct faculty appointments at universities in Belgium and Germany. After his career in Academia, Geert joined several vaccine companies (GSK Biologicals, Novartis Vaccines, Solvay Biologicals) to serve various roles in vaccine R&D as well as in late vaccine development.\n\nGeert then moved on to join the Bill & Melinda Gates Foundation’s Global Health Discovery team in Seattle (USA) as Senior Program Officer; he then worked with the Global Alliance for Vaccines and Immunization (GAVI) in Geneva as Senior Ebola Program Manager. At GAVI he tracked efforts to develop an Ebola vaccine. He also represented GAVI in fora with other partners, including WHO, to review progress on the fight against Ebola and to build plans for global pandemic preparedness.\n\nBack in 2015, Dr. Geert Vanden Bossche scrutinized and questioned the safety of the Ebola vaccine that was used in ring vaccination trials conducted by WHO in Guinea. His critical scientific analysis and report on the data published by WHO in the Lancet in 2015 was sent to all international health and regulatory authorities involved in the Ebola vaccination program. After working for GAVI, Geert joined the German Center for Infection Research in Cologne as Head of the Vaccine Development Office. He is at present primarily serving as a Biotech / Vaccine consultant while also conducting his own research on Natural Killer cell-based vaccines.\n\nOn November 15, 2021, Dr. Geert Vanden Bossche gave a presentation to World Council for Health about the impact of mass vaccination on the innate immune system and how to remedy.", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Geert Vanden Bossche: The Role of Vaccines | Better Way Conference", "description": "Watch Dr. Geert Vanden Bossche’s presentation at the Better Way Conference in Bath, UK.", "url": "https://worldcouncilforhealth.org/multimedia/geert-vanden-bossche-vaccines/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:tag": "Better Way Conference", "updated_time": "2022-09-28T15:37:08+01:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/08/geert-vanden-bossche.jpg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/08/geert-vanden-bossche.jpg", "image:width": "1041", "image:height": "583", "image:alt": "Geert Vanden Bossche", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://betterwayconference.org/", "https://worldcouncilforhealth.org/better-way-charter/", "https://betterwayconference.org/virtual-pass/", "https://worldcouncilforhealth.org/video-series/conferences/better-way-conference/", "https://worldcouncilforhealth.org/multimedia/geert-vanden-bossche-impact-mass-vaccination/"], "authors": [], "publish_date": "August 16, 2022 at 9:58 am"}