{"result_id": "346041", "URL": "https://worldcouncilforhealth.org/news/statements/uk-government-advice-for-pregnant-women/", "timestamp": "2023-04-25 18:14:50 CEST+0200", "meta": {"description": "A recent update to the United Kingdom government website has brought to light a document advising that pregnant and breastfeeding women should not be given", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/statements/uk-government-advice-for-pregnant-women/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "UK Government's Contradictory Advice for Pregnant and Breastfeeding Women", "cleaned_text": "A recent update to the United Kingdom government website has brought to light a document advising that pregnant and breastfeeding women should not be given the Pfizer/BioNTech Covid vaccine.\n\nThe document, ‘Summary of the Public Assessment Report for COVID-19 Vaccine Pfizer/BioNTech’ includes a paragraph in Section 3.4 ‘Toxicology’ that states:\n\nIn the context of supply under Regulation 174, it is considered that sufficient reassurance of safe use of the vaccine in pregnant women cannot be provided at the present time: however, use in women of childbearing potential could be supported provided healthcare professionals are advised to rule out known or suspected pregnancy prior to vaccination. Women who are breastfeeding should also not be vaccinated. These judgements reflect the absence of data at the present time and do not reflect a specific finding of concern.\n\nThe World Council for Health questions why the UK government has such contradictory advice on its website. If it is the case that the Summary report above is deemed out of date and that the UK government has concluded the Pfizer/BioNTech vaccine is now safe for pregnant and breastfeeding women, we question on what data such a conclusion can be based.\n\nThe Summary report states that a combined fertility and developmental study in rats is ongoing but it is not clear whether this has now been completed; either way, such a study is not enough to establish safety in humans. There exists no robust or long-term safety data on the impact of this gene-based injection on pregnancy or on babies. However, there are clear safety signals on pharmacovigilance databases, including from the UK government’s own Yellow Card Scheme, which have shown numerous reproductive and pregnancy related harms.\n\nThere exists confusion and conflicting reports as to when the paragraph above was included in the document. While the last update was on 16 August 2022, the paragraph is found in archived versions of the Summary. It is also notable that, despite the recent update, it has not been removed. The World Council for Health wishes to highlight the clear contradiction between this recommendation and that currently given by the UK authorities, which is that Covid-19 vaccination is strongly recommended for pregnant and breastfeeding women.\n\nGiven the paucity of data and the existence of clear safety signals indicating harmful effects of Covid-19 vaccination on all men, women, and children, the World Council for Health continues to call for an immediate halt in the Covid-19 vaccination programme, until such data are available and can be independently reviewed.\n\nDr. Tess Lawrie addressed this significant contradiction during the World Council for Health General Assembly Meeting on 28 August 2022.\n\nFor more information on Covid-19 injections and the concerns related to fertility and pregnancy, please watch this recent presentation given by World Council for Health Steering Committee member Christof Plothe.\n\nIf you are uncertain whether to take another Covid injection, the World Council for Health recommends a cautious approach while you learn more about the risks and benefits. Whatever your decision, we are here to support you on your journey to reclaiming control of your health, well-being and sovereignty.", "opengraph": {"locale": "en_US", "type": "article", "title": "UK Government's Contradictory Advice for Pregnant and Breastfeeding Women", "description": "A recent update to the United Kingdom government website has brought to light a document advising that pregnant and breastfeeding women should not be given", "url": "https://worldcouncilforhealth.org/news/statements/uk-government-advice-for-pregnant-women/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Statements", "updated_time": "2022-11-13T22:16:17+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/08/Newsroom-UK-pregnant-women.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/08/Newsroom-UK-pregnant-women.jpeg", "image:width": "1120", "image:height": "630", "image:alt": "Pregnant and Breastfeeding Women", "image:type": "image/jpeg", "article:published_time": "2022-08-31T20:11:27+01:00", "article:modified_time": "2022-11-13T22:16:17+00:00"}, "tags": ["Statements"], "tweets": [], "movies": [], "links": ["https://www.gov.uk/government/publications/regulatory-approval-of-pfizer-biontech-vaccine-for-covid-19/summary-public-assessment-report-for-pfizerbiontech-covid-19-vaccine", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://yellowcard.ukcolumn.org/yellow-card-reports", "https://web.archive.org/web/20220113214332/https://www.gov.uk/government/publications/regulatory-approval-of-pfizer-biontech-vaccine-for-covid-19/summary-public-assessment-report-for-pfizerbiontech-covid-19-vaccine", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/", "https://worldcouncilforhealth.org/multimedia/ga-55/", "https://strongandfreecanada.org/iron-will/the-most-disturbing-data-yet-on-vaccine-infertility-christof-plothe-d-o/", "https://worldcouncilforhealth.org/resources/covid-19-vaccine-pharmacovigilance-report/"], "authors": [], "publish_date": "2022-08-31T20:11:27+01:00"}