{"result_id": "346017", "URL": "https://worldcouncilforhealth.org/resources/a-practical-approach-to-keeping-healthy-after-your-covid-19-jab/", "timestamp": "2023-04-25 18:14:29 CEST+0200", "meta": {"description": "As the type of technology being used in these injections has never been used before, some of the conditions arising are new. Therefore, this clinical guidance", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/resources/a-practical-approach-to-keeping-healthy-after-your-covid-19-jab/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "A practical approach to keeping healthy after your Covid-19 jab", "cleaned_text": "Can the Covid-19 injections make you sick?\n\nVaccine side effects can occur with mRNA Covid-19 injections (Moderna, Pfizer BioNTech, or Comirnaty) as well as the DNA-type of Covid-19 injections (Johnson & Johnson and AstraZeneca).\n\nSide effects are more common with two vaccine doses than a single dose and can be categorized as:\n\nImmediate side effects can be localized to the site of the injection or involve the whole body.\n\nInjection site reactions are very common and include localized pain, tenderness, redness, and swelling. These local types of reactions usually go away within a few days.\n\nYou may use the following over-the-counter medications to reduce local pain and discomfort associated with immediate side effects:\n\nIf you have no other medical reasons that prevent you from taking these medications normally, you can take them to help to relieve these post-vaccination side effects. When using over-the-counter medications, always follow the directions of the package insert and consult a healthcare provider if unsure.\n\nCovid-19 like (or flu-like) symptoms are common after the Covid-19 vaccination. Some health advisory agencies report that this is normal and a sign that your body is building protection. However, just because these side effects occur commonly, does not mean that they are normal or healthy. A health prevention therapy should not cause illness.\n\nVaccine-induced Covid-19 like illness often presents with a combination of the following symptoms:\n\nThese symptoms may disappear within 48 to 72 hours. However, some people may have a more extended Covid-19 like illness that lasts for a week or more and may even test positive for Covid-19. To avoid a lengthy illness, people with Covid-19 like symptoms after vaccination may benefit from following the World Council for Health’s Covid-19 treatment guidance which can be found here.\n\nPost Covid-19 Injection Syndrome or pCoIS (also called Post Covid-19 Vaccine Syndrome or pCoVS) is a new complex multi-system inflammatory syndrome. A syndrome is a collection of symptoms that may differ from person to person. Emerging data show that pCoIS is similar to Long Covid or Chronic Fatigue Syndrome and manifests as a combination of the following symptoms:\n• numbness and tingling in the extremities\n\nUnlike Long Covid, pCoIS does not appear to necessarily progress from a Covid-19 like illness but may arise spontaneously weeks after a Covid-19 injection. As pCoIS is a new condition, we don’t know the long-term significance of the symptoms.\n\nThe World Council for Health experts currently recognises the following eight categories of pCoIS disease:\n\nIt is possible to have more than one type of pCoIS complication. As more data becomes available, it is likely that this definition will be updated.\n\nWhat causes post Covid-19 Injection Syndrome and other serious Covid-19 injection side effects?\n\nDoctors and scientists at the forefront of pCoIS research think that Covid-19 vaccine side effects may be caused by:\n• The injected viral gene (nucleic acids), which gives the cells in our body the ‘recipe’ to make the spike protein\n• Other substances in the injection (adjuvants, excipients or contaminants)\n\nDuring a Covid-19 infection, the spike protein causes much of the damage, including: harm to lung and heart muscle, inflammation, and clotting. The vaccine instructs our cells to make Covid-19 viral spike protein. In some people, this manufactured spike protein appears to cause similar damage among people previously well and Covid-19 free.\n\nSpike proteins and some vaccine contents, such as the lipid nanoparticles, may also cause a type of allergic reaction to one or more of the injection contents or products that cause Mast Cell Activation Syndrome (MCAS). Mast cells contain chemicals that are released during allergic reactions and other immune responses which can cause harm to the body.\n\nMany doctors and scientists have safety concerns related to the ingredients included in the Covid-19 injections. One of the primary reasons for this concern is that pharmaceutical companies do not have to share this information if it is not considered in their commercial interest to do so. As a result, many of the ingredients of the Covid-19 injections are not known.\n\nEmerging evidence from independent scientists suggests that there may also be contaminants in some of the vaccine solutions and that those contaminants may be responsible for certain side effects. You can learn more about these contaminants from European doctors and scientists here.\n\nHow can post Covid-19 Injection Syndrome (pCoIS) be prevented and treated?\n\nThe best way to prevent pCoIS is to avoid having one of the Covid-19 genetic based vaccinations (Pfizer, Moderna, Janssen, or AstraZeneca) to begin with. We are only starting to gain experience in recognizing, diagnosing, and treating pCoIS, and much further study is certainly required.\n\nBecause pCoIS shares features with Long Covid, some doctors are using the same medicines and nutritional supplements that they are also using to treat Long Covid. Many of these are available over the counter. In general, it should be advisable to intensify your efforts to maintain a healthy lifestyle that includes a healthy diet, exercise, weight, diabetes, and blood pressure management.\n\nIf you are experiencing symptoms of pCoIS, your doctor can do some tests that might help determine the best path to recovery. These tests may include a full blood count, immune system markers, inflammatory markers, clotting profile, and liver function tests. It is important to note that we are still in the early stages of understanding how to assess and treat pCoIS. Always consult with your doctor before commencing or changing any medical treatment.\n\nMany of the established medicines and nutritional supplements being used are available over the counter. These include:\n\nIt may be necessary to consult with specialist doctors for specific complications. For example, you may need to see a cardiologist to manage inflammatory heart conditions such as myocarditis and pericarditis or a neurologist to manage neurological conditions.\n\nWhen will we know more about Covid-19 vaccine side effects and how to treat them?\n\nThe first step to learning more about Covid-19 vaccine side effects is for public health officials to acknowledge and robustly consider the millions of adverse events that have already been reported all over the world. In order to do this, there must be transparent systems to monitor and track vaccine adverse reactions and research funding must be made available so that doctors and scientists can explore the reported data. These data will reveal more about how to prevent and treat the various types of pCoIS.\n\nThere are many questions raised by scientists and doctors about these new gene therapy vaccines including:\n• How long do our cells continue to make spike protein?\n• Was the possibility of the Covid-19 virus protein genetic code integrating into the human genome (DNA) excluded in the vaccine studies?\n\nIn order to gain a complete understanding of the efficacy and safety of Covid-19 injections, international cardiovascular, neurological, and immunological experts agree that:\n• Follow up of all vaccinated people is needed\n• Regulation and research needs to be conducted by an independent scientific committee, not by vaccine manufacturers (Pfizer-BioNtech, Moderna, AstraZeneca, and Johnson & Johnson)\n• Additional research needs to be done to determine possible toxic effects of the injections and how to prevent them\n• There must be a method of screening for new Covid-19 vaccine disorders and possible genetic changes\n• Independent, non-biased funding for comprehensive research needs to be established\n\nWho is at risk of having side effects to the Covid-19 injections?\n\nSerious side effects are occurring in people of all ages, and it is currently not known why some people experience these side effects and others do not. Research is urgently needed to understand who is most likely to experience medium to long-term complications from the Covid-19 vaccines. However, a complete understanding of who is most at risk from complications will not be known until the long-term studies have been properly conducted.\n\nWhat can I do if I think my illness is related to the Covid-19 jab?\n\nConsult your doctor as soon as possible if you have new-onset symptoms after receiving a Covid-19 vaccine. They may be able to help you treat your symptoms, and the sooner you receive that treatment the better. You may also report the problem to the vaccine side effect reporting system in your country. Doing this helps doctors, scientists, and the public gain a better understanding of the potential risks of this new technology.\n\nIf you want to connect with others who have experienced post-Covid-19 Injection Syndrome, please visit realnotrare.com and UKCVfamily.org.", "opengraph": {"locale": "en_US", "type": "article", "title": "A practical approach to keeping healthy after your Covid-19 jab | World Council for Health", "description": "As the type of technology being used in these injections has never been used before, some of the conditions arising are new. Therefore, this clinical guidance", "url": "https://worldcouncilforhealth.org/resources/a-practical-approach-to-keeping-healthy-after-your-covid-19-jab/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Resources", "updated_time": "2022-11-12T13:00:50+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/shutterstock_1154790973-1024x683.jpg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/shutterstock_1154790973-1024x683.jpg", "image:width": "1024", "image:height": "683", "image:alt": "keeping healthy", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://worldcouncilforhealth.org/subscribe/", "https://worldcouncilforhealth.org/resources/how-to-report-covid-19-vaccine-side-effects/", "#immediate-side-effects", "#covid-19-like-illness", "#pCoVS-pCoIS", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://worldcouncilforhealth.org/resources/how-to-report-covid-19-vaccine-side-effects/", "https://worldcouncilforhealth.org/resources/a-practical-approach-to-keeping-healthy-after-your-covid-19-jab/", "https://odysee.com/@de:d/Pressekonferenz--Tod-durch-Impfung-Undeklarierte-Bestandteile-der-COVID-19-Impfstoffe:b", "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/WHO-VigiAccess-Sept30-2021.pdf", "https://worldcouncilforhealth.org/resources/how-to-report-covid-19-vaccine-side-effects/", "https://www.realnotrare.com/", "https://www.ukcvfamily.org/"], "authors": [], "publish_date": "October 9, 2021"}