{"result_id": "346005", "URL": "https://worldcouncilforhealth.org/news/statements/experimental-covid-19-vaccines-impact-male-fertility/", "timestamp": "2023-04-25 18:14:19 CEST+0200", "meta": {"description": "Pfizer experimental COVID-19 vaccines leads to lower levels of fertility in men, according to a new peer-reviewed study.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/statements/experimental-covid-19-vaccines-impact-male-fertility/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Experimental Covid-19 Vaccines Impact Male Fertility", "cleaned_text": "The World Council for Health is increasingly concerned by the impact of the experimental Covid-19 vaccines on human fertility and once again calls for an immediate halt to the vaccination program.\n\nPfizer’s novel Covid-19 vaccine leads to lower levels of fertility in men, according to a new peer-reviewed study. The paper, which has been accepted for publication in the journal Andrology evaluated the impact of the experimental Covid-19 vaccines on sperm motility and concentration and found that, three months after vaccination, semen concentration was reduced by 15.4%.\n\nThe researchers found that there was a decrease in sperm concentration between 75 and 120 days post-vaccination. The decrease led to a reduction in the motile sperm count by 22.1%, and a reduction in sperm count concentration of 15.4%.\n\nThe semen testing, which was completed 150 days following vaccination, showed that post-vaccination levels remained lower than pre-vaccination levels, although there was some improvement over time. The men were not tested following the third and fourth injections; further damage to sperm motility and counts are therefore possible following subsequent doses and no long-term fertility data are currently available.\n\nThe original Pfizer bioavailability studies (English translation here) show that the vaccine lipid nanoparticles concentrate in the ovaries, as well as the liver, spleen, adrenal glands and the testes which could have a major effect on human reproduction.\n\nAmong Covid-vaccinated women, there are strong indications that the experimental Covid-19 injections are interfering with female reproductive health, with high rates of menstrual irregularities, including delayed menstruation and early menopause, being reported to international pharmacovigilance databases including the WHO’s Vigiaccess.org, United States VAERS, and the United Kingdom’s Yellow card pharmacovigilance system.\n\nThe World Council for Health has repeatedly called for an end to the rollout of Covid-19 vaccines. There is a concerning safety signal with these experimental products that extends beyond reproductive harms.\n\nIn addition, new vaccines or injections that utilise the novel nano-lipid particle technology and that have not undergone rigorous safety testing (a minimum of 7 to 10 years is required for new drug products) should not be authorised.\n\n\n\nDr. Katarina Lindley said:\n\n‘It’s deeply concerning that we are faced with yet another alarming side effect from these experimental vaccines, one that has implications for the propagation of humanity. With babies as young as six months old now being injected, it’s clear that health implications could be felt for generations. Enough harm has already been done. Immediate action to remove these products from circulation is needed.’", "opengraph": {"locale": "en_US", "type": "article", "title": "Experimental Covid-19 Vaccines Impact Male Fertility", "description": "Pfizer experimental COVID-19 vaccines leads to lower levels of fertility in men, according to a new peer-reviewed study.", "url": "https://worldcouncilforhealth.org/news/statements/experimental-covid-19-vaccines-impact-male-fertility/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Statements", "updated_time": "2022-11-13T22:19:55+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/06/fertilityphoto_2022-06-27_15-00-02.jpg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/06/fertilityphoto_2022-06-27_15-00-02.jpg", "image:width": "1120", "image:height": "630", "image:alt": "Fertility Photo", "image:type": "image/jpeg", "article:published_time": "2022-06-27T14:55:52+01:00", "article:modified_time": "2022-11-13T22:19:55+00:00"}, "tags": ["Statements"], "tweets": [], "movies": [], "links": ["https://onlinelibrary.wiley.com/doi/10.1111/andr.13209", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://www.docdroid.net/xq0Z8B0/pfizer-report-japanese-government-pdf#page=17", "https://www.naturalnews.com/files/Pfizer-bio-distribution-confidential-document-translated-to-english.pdf", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/"], "authors": [], "publish_date": "2022-06-27T14:55:52+01:00"}