{"result_id": "346028", "URL": "https://worldcouncilforhealth.org/resources/segregating-unvaccinated/", "timestamp": "2023-04-25 18:14:43 CEST+0200", "meta": {"description": "Many nations are now implementing policies that include segregating unvaccinated people and denying them access to basic services. But is it worthwhile?", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/resources/segregating-unvaccinated/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Does segregating people who have not been vaccinated keep vaccinated people safe?", "cleaned_text": "Many nations are now implementing policies that exclude from society people who’ve chosen not to be vaccinated. These restrictions include denying access to public places and basic services, effectively segregating unvaccinated people from the vaccinated. While these policies vary by nation, they range from banning people from attending large events, theaters, cinemas, cafes, and restaurants, to confining them to their homes based on vaccination status. Similar measures include imposing fines (see Greece) or denying medical treatment, as in Singapore.\n\nThe justification given for such measures is apparently to protect the wider population from the spread of Covid-19 and to ensure that those who have chosen to not take the vaccine do not burden health services. There are two assumptions behind these rationales:\n• People who have not been vaccinated spread SARS-CoV-2 far more than those who have taken Covid-19 vaccines\n• People who have not been vaccinated are more likely to need medical attention and be hospitalized if they become infected with SARS-CoV-2\n\nBoth of these assumptions are just that—assumptions. In terms of evidence, they are on increasingly shaky ground. In fact, emerging data are suggesting that the opposite is true for spreading the virus, and it’s even beginning to appear in the mainstream narrative.\n\nDo people who have not been vaccinated spread the virus more than the vaccinated?\n\nStudy after study after study has found that the vaccinated can carry just as much viral load as those that are not vaccinated. One such study published in The Lancet found that while vaccination reduces the risk of infection and accelerates viral clearance, the vaccinated have a similar viral load to people who aren’t vaccinated, and “can efficiently transmit infection in household settings, including to fully vaccinated contacts.” In the US, a recent study also found “no difference in viral loads when comparing unvaccinated individuals to those who have vaccine ‘breakthrough’ infections.”\n\nThis should not be surprising. The Covid-19 vaccines were never designed to prevent infection or transmission, a fact that has now been acknowledged many times over by prime ministers and public health figures. And what of natural immunity? Many people that haven’t been jabbed have acquired immunity from previous infection, a fact rarely acknowledged by public health policymakers. Some may argue that this immunity wanes—but so does vaccine-induced immunity, and apparently far more quickly.\n\nAre the unvaccinated more likely to get sick enough to require hospital care?\n\nPoliticians are claiming that hospitals and ICUs are full of people needing treatment for severe Covid-19 that have not been jabbed —and this is used to justify locking them down, requiring proof of vaccination to enter buildings, firing unvaccinated employees, and more. However, recent data paints a very different picture.\n\nThe UK’s Health Security Agency published a report which stated that of those hospitalized with Covid-19—either with confirmed or possible/probable Omicron—as of 29 December 2021, 25.3% of those had not been inoculated while 66.4% were either double or triple vaccinated. In Israel, the double-vaccinated and triple-vaccinated have been driving the Omicron wave, while double-vaccinated people in Scotland appear to be more likely to be admitted to hospital with Covid-19 than people that haven’t been vaccinated. The Robert Koch Institute published a report in December 2021 showing the number of vaccinated and boosted people who contracted the Omicron variant was higher than those who have not taken the vaccine. And a study published in Nature Public Health Emergency Collection in September 2021 stated:\n\nIt is also worth remembering that in some areas, those hospitalized for other conditions—such as a broken leg—are reclassified as Covid-19 hospitalizations if they test positive for SARS-CoV-2 while in hospital. In other words, Covid-19 is not what put them there. What’s more, they may have contracted the virus while in the hospital.\n\nClearly, there is an inadequate scientific basis for segregating people. Why then, are governments and health officials taking such draconian measures? Some politicians have admitted that they seek to pressure people into getting the experimental vaccine by requiring vaccine passports and making life more challenging. This is coercion and it is unlawful. It is also highly convenient for any authority seeking to divert attention from their own misdemeanours or failings to lay blame at someone else’s door. We have seen this occur time and time again throughout history and it is rarely if ever justified.\n\nAcross the globe, in countries such as Lithuania, Israel, The Philippines, France, Australia, New Zealand, and elsewhere, people’s lives are being destroyed by the very governments charged with protecting them. They are losing their jobs, being banned from shops, basic services, education, and are even being denied medical care. There have been reports of governments considering the forcible detention of men, women, and children in ‘quarantine camps’, something that has already been rolled out in some countries, including Australia.\n\nHistorically, such measures have been the reserve of brutal dictatorships and fascist regimes. Today’s supposedly liberal leaders use hate speech when referring to people not vaccinated, and call on ‘the science’ to justify their cruelty. But as we have seen, ‘the science’ is not playing ball. In the face of an increasing body of research showing that the vaccine-cautious are not more infectious or more likely to end up hospitalized, segregation policies appear even more ludicrous.\n\nWhat should be deeply concerning to all of us, is that while public figures demonize those choosing not to take the covid jab, everyone’s freedoms are being taken away. Several countries have already moved the goalposts and stipulated that only those with booster jabs will earn the privileges of the fully vaccinated. In terms of freedoms, suddenly the double-jabbed are no better off than the not jabbed.\n\nJust say no to segregating unvaccinated people\n\nIn November 2021, The Lancet published an urgent warning to government officials around the world to stop falsely claiming that “the unvaccinated threaten the vaccinated for COVID-19,” saying it is “wrong and dangerous to speak of a pandemic of the unvaccinated,” and that “historically, both the USA and Germany have engendered negative experiences by stigmatizing parts of the population for their skin color or religion.” Human rights group Amnesty International has also urged leaders to avoid discrimination against people that have chosen to not take the experimental vaccine.\n\nThere is no scientific justification to segregate people who choose not to take the experimental Covid-19 ‘vaccine’. They are no more dangerous to public health than anyone else. Any policy of exclusion, therefore, has nothing to do with keeping citizens safe, and everything to do with social control. This is why we call on everyone —jabbed or not —to refuse to comply with segregation. Saying no to such divisive and discriminatory measures is saying yes to evidence-based health policy, social cohesion, and togetherness.", "opengraph": {"locale": "en_US", "type": "article", "title": "Does segregating people who have not been vaccinated keep vaccinated people safe?", "description": "Many nations are now implementing policies that include segregating unvaccinated people and denying them access to basic services. But is it worthwhile?", "url": "https://worldcouncilforhealth.org/resources/segregating-unvaccinated/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Resources", "updated_time": "2022-03-09T15:47:51+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2022/01/segregating-unvaccinated-people-1024x576.jpeg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2022/01/segregating-unvaccinated-people-1024x576.jpeg", "image:width": "1024", "image:height": "576", "image:alt": "segregating unvaccinated people at home", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.rt.com/news/546197-greece-fines-seniors-unvaccinated/", "https://www.news.com.au/world/coronavirus/global/singapore-introduces-harsh-new-penalty-for-unvaccinated-citizens/news-story/2cb6028749c481a06127beda533c30d5", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00648-4/fulltext", "https://www.medrxiv.org/content/10.1101/2021.11.12.21265796v1", "https://www.medrxiv.org/content/10.1101/2021.07.31.21261387v1", "https://www.thelancet.com/journals/laninf/article/PIIS1473-3099(21)00648-4/fulltext", "https://www.medrxiv.org/content/10.1101/2021.07.31.21261387v1", "https://www.youtube.com/watch?v=fL00v2YjWKI", "https://www.realclearpolitics.com/video/2021/08/06/cdc_director_vaccines_no_longer_prevent_you_from_spreading_covid.html#!", "https://worldcouncilforhealth.org/resources/natural-immunity-vs-vaccine/", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3949410", "https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/1044481/Technical-Briefing-31-Dec-2021-Omicron_severity_update.pdf", "https://datadashboard.health.gov.il/COVID-19/general", "https://www.heraldscotland.com/news/19843315.covid-scotland-case-rates-lowest-unvaccinated-double-jabbed-elderly-drive-rise-hospital-admissions/", "https://t.me/COVID19Up/12593", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8481107/", "https://worldcouncilforhealth.org/news/2021/12/australia/14004/", "https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(21)02243-1/fulltext", "https://www.reuters.com/world/europe/dont-discriminate-against-unvaccinated-amnesty-international-tells-italy-2022-01-16/"], "authors": [], "publish_date": "January 21, 2022"}