{"result_id": "346020", "URL": "https://worldcouncilforhealth.org/news/statements/product-labeling-fda/", "timestamp": "2023-04-25 18:14:34 CEST+0200", "meta": {"description": "WCH is requesting the FDA update its product labeling for the Pfizer and Moderna Covid vaccines, and invites the public to submit comments.", "lang": "en", "keywords": "", "favicon": "https://worldcouncilforhealth.org/wp-content/uploads/2021/09/cropped-WCH-mark-favicon-32x32.png", "canonical": "https://worldcouncilforhealth.org/news/statements/product-labeling-fda/", "encoding": "UTF-8"}, "image": null, "domain": "worldcouncilforhealth.org", "title": "Tell the FDA to Update Product Labeling for Covid Vaccines", "cleaned_text": "The Coalition Advocating for Adequately Labeled Medicines (CAALM)* has recently filed a Citizen Petition requesting the US Food and Drug Administration (FDA) update product labeling for the Pfizer and Moderna Covid vaccines.\n\nThe petition outlines ten points covering safety and efficacy concerns and calls on the FDA to update the product labeling which is seriously out of date and to alert prescribers via Dear Health Care Provider (DHCP) letters. The ten points are as follows:\n• Add language clarifying that phase III trials were not designed to determine and failed to provide substantial evidence of vaccine efficacy against SARS-CoV-2 transmission or death.\n• Add language clarifying that the immunobridging surrogate endpoint used in multiple authorized indications has not been validated to predict clinical efficacy.\n• Add safety and efficacy results data from manufacturer randomized trials of current bivalent boosters that reported results after EUA was granted.\n• Add a clear statement that FDA authorized a new Pfizer vaccine formulation containing Tris buffer without requiring clinical studies to evaluate efficacy, safety or bioequivalence to the formulation containing phosphate buffer.\n• Add a clear statement disclosing that a Pfizer phase III randomized trial in pregnant women (NCT04754594) was completed as of July 2022 but there have been no results reported.\n• Add a clear statement that Pfizer vaccine efficacy wanes after 2 months following dose 2 according to the Pfizer phase III randomized trial.\n• The following adverse event types should be added to the Adverse Reactions section of labeling:\n• The following reproductive health and lactation related adverse event types should be added to the Adverse Reactions section of labeling:\n• Labeling should present trial results on serious adverse events in tables with statistics, as is done for non-serious adverse events.\n\nEach point is backed by robust evidence and this is clearly referenced within the petition.\n\nTell the FDA: Update Product Labeling for C19 Vaccines\n\nWorld Council for Health joins CAALM in its request to the FDA to update product labeling, and invites everyone to submit comments to the FDA here. The FDA has 150 days to respond to the petition.\n\nThe FDA’s stated mission includes ‘protecting the public health by ensuring the safety, efficacy, and security of human and veterinary drugs, biological products and medical devices.’ This is an opportunity for the FDA to fulfill this mission by acting according to the evidence presented. In doing so, it may begin to repair public trust by informing people of the grave risks associated with these experimental gene therapies, misleadingly called ‘vaccines’.\n\nWCH reminds the FDA and all regulatory agencies around the world that informed consent is an inalienable and universal human right and any person or organisation failing to honour and uphold this right will be held liable.\n\nIn the meantime, World Council for Health reiterates its call for all Covid-19 injections to be stopped immediately, since the evidence – including that cited within CAALM’s Citizen Petition – indicates that these experimental gene therapies are causing immeasurable harm.\n\n*CAALM is a coalition of current and former FDA advisors and academic researchers from around the US, including drug safety advocate Kim Witczak, Professor Peter Doshi, Professor Martin Makaray, Dr Vinay Prasad and Professor Linda Wastilla. A full list of signatories is included on page 17 of the petition.", "opengraph": {"locale": "en_US", "type": "article", "title": "Tell the FDA to Update Product Labeling for Covid Vaccines", "description": "WCH is requesting the FDA update its product labeling for C19 vaccines, and invites the public to submit comments.", "url": "https://worldcouncilforhealth.org/news/statements/product-labeling-fda/", "site_name": "World Council for Health", "article:publisher": "https://www.facebook.com/WorldCouncilforHealth/", "article:section": "Statements", "updated_time": "2023-02-08T20:15:24+00:00", "image": "https://worldcouncilforhealth.org/wp-content/uploads/2023/02/product-labeling-fda.jpg", "image:secure_url": "https://worldcouncilforhealth.org/wp-content/uploads/2023/02/product-labeling-fda.jpg", "image:width": "1120", "image:height": "630", "image:alt": "Product Labeling FDA", "image:type": "image/jpeg", "article:published_time": "2023-02-08T20:15:21+00:00", "article:modified_time": "2023-02-08T20:15:24+00:00"}, "tags": ["Statements"], "tweets": [], "movies": [], "links": ["https://www.regulations.gov/document/FDA-2023-P-0360-0001", "https://www.regulations.gov/document/FDA-2023-P-0360-0001", "https://worldcouncilforhealth.org/terms-and-conditions/", "https://worldcouncilforhealth.org/privacy-policy/", "https://www.regulations.gov/document/FDA-2023-P-0360-0001", "https://worldcouncilforhealth.org/campaign/covid-19-vaccine-cease-and-desist/#full"], "authors": [], "publish_date": "2023-02-08T20:15:21+00:00"}