{"result_id": "348015", "URL": "https://www.worldhealth.net/news/uk-warns-those-significant-allergies-should-avoid-pfizer-covid-19-vaccine", "timestamp": "2023-04-25 18:15:56 CEST+0200", "meta": {"description": "“Any person with a history of anaphylaxis to a vaccine, medicine or food should not receive the Pfizer BioNTech vaccine,”", "lang": "en", "keywords": "COVID-19, Pfizer, vaccine, allergy, adverse, reaction, side effect, BioNTech,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/uk-warns-those-significant-allergies-should-avoid-pfizer-covid-19-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "The UK Warns Those With Significant Allergies Should Avoid The Pfizer COVID-19 Vaccine", "cleaned_text": "After 2 National Health Services members developed allergic reactions to the Pfizer COVID-19 vaccine a warning has been issued from the UK’s Regulatory Agency for those with significant allergies to avoid the vaccine.\n\n\"As is common with new vaccines the MHRA (Medicines and Healthcare products Regulatory Agency) have advised on a precautionary basis that people with a significant history of allergic reactions do not receive this vaccination after two people with a history of significant allergic reactions responded adversely yesterday,\" Stephen Powis, the national medical director for England's National Health Service said in a statement on Wednesday (Dec. 9).\n\nBoth of the NHS members have a history of severe allergies and carry adrenaline auto-injectors around on their person where ever they go, according to a report in the Guardian. Both of these HSN workers developed anaphylaxis like symptoms, or severe allergic reactions shortly after receiving the vaccine, and both have since recovered after receiving treatment.\n\n\"Any person with a history of a significant allergic reaction to a vaccine, medicine or food (such as previous history of anaphylactoid reaction, or those who have been advised to carry an adrenaline autoinjector) should not receive the Pfizer/BioNtech vaccine,\" according to the new MHRA guidance. The guidance also notes that \"resuscitation facilities\" should be available for all vaccinations at all times.\n\nThe very first doses of the Pfizer-BioNTech vaccine were administered to several thousand people in the U.K. on Tuesday, according to the BBC. According to a report in Reuters, The MHRA will be further investigating and Pfizer as well as BioNTech will be supporting the investigation. Pfizer has previously said that those with a history of severe adverse allergic reactions were not included in their late-stage trials, and the patient information leaflet with the injection says that it should not be given to those allergic to any substance in the vaccine.\n\n\"Allergic reaction occurs with quite a number of vaccines, and perhaps even more frequently with drugs. So it is not unexpected,\" Stephen Evans, a professor of pharmacoepidemiology at the London School of Hygiene and Tropical Medicine said in remarks to journalists published by Britain's Science Media Center.\n\n“What would be wise, as the MHRA have already advised, would be for anyone who has known severe allergic reaction such that they need to carry an EpiPen, to delay having a vaccination until the reason for the allergic reaction has been clarified,\" he said.\n\n“We have a range of resources and technology to support the safety monitoring of any Covid-19 vaccination programme. The use of AI will be one element of that.”\n\nThe MHRA recently paid the British firm Genpact (UK) Ltd £1.5m for an artificial intelligence software tool “to process the expected high volume of Covid-19 adverse drug reactions [ADRs] and ensure that no details from the ADRs’ reaction text are missed”. However, the regulator did not say if the technology was already in place and if it had been monitoring for possible adverse reactions or whether it had picked up any other bad reactions.\n\n“Any person with a history of anaphylaxis to a vaccine, medicine or food should not receive the Pfizer BioNTech vaccine,” MHRA Chief Executive June Raine said in a statement.\n\nAccording to Reuters, “a top U.S. official said on Wednesday that Americans with known severe allergic reactions may not be candidates for Pfizer’s COVID-19 vaccine until more was understood about what had happened.” The FDA recently released documents in preparation for an advisory committee meeting to investigate the data.\n\n“It’s reasonable to let the world know about this, and to be aware of it in terms of people who have had reactions like this to vaccines. I think to say medicines, foods or any other allergies is past the boundary of science,” said Gregory Poland, a virologist and vaccine researcher with the Mayo Clinic in Rochester, Minnesota.", "opengraph": {"locale": "en_US", "type": "article", "title": "The UK Warns Those With Significant Allergies Should Avoid The Pfizer COVID-19 Vaccine", "description": "\n\nAfter 2 National Health Services members developed allergic reactions to the Pfizer COVID-19 vaccine a warning has been issued from the UK’s Regulatory Agency for those with significant allergies to avoid the vaccine.", "url": "https://www.worldhealth.net/news/uk-warns-those-significant-allergies-should-avoid-pfizer-covid-19-vaccine", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_80034052.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}