{"result_id": "348044", "URL": "https://www.worldhealth.net/news/no-more-annual-flu-shot-new-target-universal-influenza-vaccine/", "timestamp": "2023-04-25 18:16:16 CEST+0200", "meta": {"description": "A new antibody discovered in the blood of some people vaccinated against or infected with influenza can recognize a broad variety of flu viruses.", "lang": "en", "keywords": "vaccine, influenza, antibody, immune system, flu, virus, mutations, epitope,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/no-more-annual-flu-shot-new-target-universal-influenza-vaccine", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "No More Annual Flu Shot? New Target For Universal Influenza Vaccine", "cleaned_text": "A new antibody discovered in the blood of some people vaccinated against or infected with influenza can recognize a broad variety of flu viruses.\n\nScientists at Scripps Research, University of Chicago and Icahn School of Medicine at Mount Sinai have identified a new Achilles' heel of influenza virus, making progress in the quest for a universal flu vaccine. Antibodies against a long-ignored section of the virus, which the team dubbed the anchor, have the potential to recognize a broad variety of flu strains, even as the virus mutates from year to year, they reported Dec. 23, 2021 in the journal Nature.\n\n\"It's always very exciting to discover a new site of vulnerability on a virus because it paves the way for rational vaccine design,\" says co-senior author Andrew Ward, Ph.D., professor of Integrative Structural and Computational Biology at Scripps Research. \"It also demonstrates that despite all the years and effort of influenza vaccine research there are still new things to discover.\"\n\n\"By identifying sites of vulnerability to antibodies that are shared by large numbers of variant influenza strains we can design vaccines that are less affected by viral mutations,\" says study co-senior author Patrick Wilson, MD, who was previously at the University of Chicago and recently recruited to Weill Cornell Medicine as a professor of pediatrics and a scientist in the institution's Gale and Ira Drukier Institute for Children's Health. \"The anchor antibodies we describe bind to such a site. The antibodies themselves can also be developed as drugs with broad therapeutic applications.\"\n\nIn a typical year, influenza affects more than 20 million people in the United States and leads to more than 20,000 deaths. Vaccines against influenza typically coax the immune system to generate antibodies that recognize the head of hemagglutinin (HA), a protein that extends outward from the surface of the flu virus. The head is the most accessible regions of HA, making it a good target for the immune system; unfortunately, it is also one of the most variable. From year to year, the head of HA often mutates, necessitating new vaccines.\n\nResearchers have designed experimental influenza vaccines to be more universal, spurring the body to create antibodies against the less-variable stalk region of HA, which extends like a stem between the influenza virion and the HA head. Some of these universal flu vaccines are currently in early clinical trials.\n\nIn the new study, a collaborative team of scientists characterized 358 different antibodies present in the blood of people who had either been given a seasonal influenza vaccine, were in a phase I trial for an experimental, universal influenza vaccine, or had been naturally infected with influenza.\n\nMany of the antibodies present in the blood of participants were antibodies already known to recognize either the HA head or stalk. But a collection of new antibodies stood out; the antibodies bound to the very bottom of the stalk, near where each HA molecule is attached to the membrane of the flu virion.\n\nThe co-first authors of the manuscript -- Julianna Han, a staff scientist in the Ward lab, and Jenna Guthmiller, a postdoctoral fellow at the University of Chicago -- named this section of HA the anchor, and began studying it further. In all, the scientists identified 50 different antibodies to the HA anchor, from a total of 21 individuals. The antibodies, they discovered, recognized a variety of H1 influenza viruses, which account for many seasonal flu strains. Some of the antibodies were also able to recognize pandemic H2 and H5 strains of influenza in lab tests. And in mice, the antibodies successfully protected against infection by three different H1 influenza viruses.\n\n\"In order to increase our protection to these highly mutating viruses, we need to have as many tools as we can,\" says Han. \"This discovery adds one more highly potent target to our repertoire.\" Importantly, these antibodies appear to be fairly common in people, and belong to a class of antibodies that any person's body can produce -- an important consideration in designing a vaccine to spur their development.\n\n\"The human immune system already has the ability to make antibodies to this epitope, so it's just a matter of applying modern protein engineering methods to make a vaccine that can induce those antibodies in sufficient numbers,\" adds Guthmiller.\n\nThe researchers say that future, improved iterations of a universal vaccine could more purposefully aim to generate anchor antibodies. Until now, scientists designing universal vaccines hadn't paid attention to whether the anchor region of the stem was included as a target. Ideally, a universal influenza vaccine will lead to antibodies against multiple sections of the virus -- such as both the HA anchor and the stalk -- to increase protection to evolving viruses.\n\nThe researchers are planning future studies on how to design a vaccine that most directly targets the HA anchor of different influenza strains.\n\nIn addition to Han and Ward, authors of the study, \"Broadly neutralizing antibodies target a hemagglutinin anchor epitope,\" include Sara Richey and Alba Torrents de la Pena of Scripps; Jenna Guthmiller, Henry Utset, Lei Li, Linda Yu-Ling Lan, Carole Henry, Christopher Stamper, Olivia Stovicek, Haley Dugan, Nai-Ying Zheng, Micah Tepora, Dalia Bitar, Siriruk Changrob, Min Huang and Patrick Wilson of University of Chicago; Meagan McMahon, George O'Dell, Alec Freyn, Fatima Amanat, Victoria Rosado, Shirin Strohmeier, Adolfo Garcia-Sastre, Raffael Nachbagauer, Peter Palese and Florian Krammer of Icahn School of Medicine at Mount Sinai; Monica Fernandez-Quintero and Klaus Liedl of University of Innsbruck, Lauren Gentles and Jesse Bloom of Fred Hutchinson Cancer Research Center; and Lynda Coughlan of University of Maryland School of Medicine\n\nThis work was supported by funding from the National Institute of Allergy and Infectious Diseases (K99AI159136, U19AI082724,U19AI109946, U19AI057266, P01AI097092, R01AI145870-01, R21AI146529, and T32AI007244-36), the NIAID Centers of Excellence for Influenza Research and Surveillance (HHSN272201400005C, HHSN272201400008C), the NIAD Centers of Excellence for Influenza Research and Response (75N93019R00028), the NIAID Collaborative Influenza Vaccine Innovation Centers (75N93019C00051), the Bill and Melinda Gates Foundation (OPP1084518) and the Austrian Science Fund (P34518).", "opengraph": {"locale": "en_US", "type": "article", "title": "No More Annual Flu Shot? New Target For Universal Influenza Vaccine", "description": "\nA new antibody discovered in the blood of some people vaccinated against or infected with influenza can recognize a broad variety of flu viruses.\nScientists at Scripps Research, University of Chicago and Icahn School of Medicine at Mount Sinai have identified a new Achilles' heel of influenza virus, making progress in the quest for a universal flu vaccine. Antibodies against a long-ignored section of the virus, which the team dubbed the anchor, have the potential to recognize a broad variety of flu strains, even as the virus mutates from year to year, they reported Dec. 23, 2021 in the journal Nature.\n", "url": "https://www.worldhealth.net/news/no-more-annual-flu-shot-new-target-universal-influenza-vaccine", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_80034052.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/flu/about/burden/index.html", "https://www.nature.com/articles/s41591-020-1118-7"], "authors": [], "publish_date": null}