{"result_id": "348018", "URL": "https://www.worldhealth.net/news/new-york-city-being-sued-making-vaccine-mandatory", "timestamp": "2023-04-25 18:15:58 CEST+0200", "meta": {"description": "Traditionally NY is one of the states that allows for people to refuse vaccinations for medical or religious reasons, which have now been rescinded", "lang": "en", "keywords": "New York, vaccine, exemptions, resinded, lawsuit, Robert F Kennedy, MMR, measles, unlawful, anti-Semitic, totalitarian, arbitrary, Vera Sharav, China, Peter Pitts,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/new-york-city-being-sued-making-vaccine-mandatory", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "New York City Being Sued For Making Vaccine Mandatory", "cleaned_text": "5 Brooklyn mothers, identified by using only initials, have filed a lawsuit against New York City saying the arbitrary state of emergency order and threat of $1000.00 fine or 6 months in jail is unlawful, anti-Semitic, and totalitarian; they are accusing Mayor Bill de Blasio of unlawfully targeting the Jewish community.\n\nAttorney Robert F Kennedy has filed the lawsuit which includes testimony from five doctors and patient advocates, one of them being Vera Sharav a child survivor of the Holocaust who is referring to the situation as being similar to her personal experience of antisemitism.\n\nPublic health law officials suggest this case could go in either direction, it will all rest on how dangerous a judge believes measles to be, and if there are other measures that can be taken instead. What it is clearly doing is forcing the gap to be even wider for those who are wary of the government and medical establishments.\n\nTraditionally NY is one of the states that allows for people to refuse vaccinations for medical or religious reasons. Religious exemptions have now been rescinded when the mayor declared the state of emergency giving him the power to order MMR vaccinations in the 4 Brooklyn zip code where 285 measles case have been reported over the past 7 months, particularly among the Orthodox Jewish community.\n\nThe mothers supported by doctors and advocates are demanding the order be suspended citing that vaccines go against their religious belief of not putting a foreign body into their bodies and believe the arbitrary order unfairly targets this Jewish community, and have sited scripture to defend their beliefs that they should not put foreign bodies into their children.\n\nPerhaps the most compelling and fiery testimony comes from the patient advocates such as Vera Sharav who has become outspoken about the medical establishment and vaccines. In her strongly worded affidavit she draws on her memories and personal experience with anti-Semitism pointing to similarities of totalitarianism. “As a survivor of the Holocaust, I am especially attuned toward recognizing the signs of government overreach. Dictatorships always invoke \"the greater good of society\" when they trample individual human rights.”\n\nMother A.L suggests a strong sense of antisemitism in the community and online has been triggered by this order. “What is happening right now in Brooklyn neighborhoods is an absolute witch hunt. Members of the Jewish community are being publicly castigated and talked about in the most anti-semitic ways I could possibly imagine.We are a city of almost 9 million people. There is no possible way that a certain group or zip code could encompass all of the germs and exposure in this great city of constantly moving people.”\n\nAll mothers have highlighted the known fact of immunity from the MMR shot wanes with time, many adults are far behind on their booster shots such as de Blasio himself who appeared to admit that he is do for a booster shot; when asked if he had the MMR he replied “...long ago…” In some countries the measles shot is given separately, however it is only offered as part of the MMR shot within the USA: mumps, measles, and rubella.\n\nMother A.L goes on to say ”So why is it that my child is considered such a threat, when it is likely that a little less than half of the adults in this city - regardless of where they live - have equal chance of contracting and passing on this or any other vaccine-preventable illness?” Mother B.D is calls for the quarantine of people of New York City with measles and those exposed to measles first, “rather than make a blanket order for mass vaccination.”\n\nAlthough they do plan to track unvaccinated people by tracing anyone who may have come into contact with those who have measles, health commissioner of New York City Dr. Oxiris Barbot did not elaborate on whether or not those who continue to refuse vaccination will be fined twice or not.\n\nMayor de Blasio does have power to declare a state of emergency “in the event of reasonable apprehension of immediate danger” or “that the public safety is imperiled. It can be declared for the entire city, or just certain zip codes” which can last for 30 days or until as long as the chief executive rescinds it, de Blasio has said it will last until 4/17/2019, but he does have the power to extend it.\n\nIn the past the Supreme Court sided with the State of Massachusetts when it introduced mandatory smallpox vaccines in 1905 and imposed a $5.00 refusal fine. Siting medical grounds Rev Henning Jacobson challenged this, saying his “son developed allergic reactions to the first vaccine that he didn’t want to do it again.” At the time the judge ruled their “concerns were not enough to override the possible public health risk.”\n\nVera Sharav has been a strong advocate against the medical establishment since the 1980s when she quit her job to care for her son who was diagnosed with schizophrenia and to raise awareness of mental health issues. Sharav was part of the influential movement of parents pushing for greedy Big Pharma to drop the price of the schizophrenia drug Clozapine, unfortunately shortly after her son starting taking this drug he died from an associated side effect of the drug causing organ failure. The entire ordeal has driven Sharav to fiercely campaign against the greed, control, manipulation, corruption, and bribery between Big Pharma and some of the medical establishment.\n\nSome bioethicists agree Vera Sharav’s campaigns have set out to raise awareness about the corruption in medicine, while others question her judgement and label her as an anti-vaxxer. However here she is not focusing on possible harm rather as she sees it anti-Semitism and asks, “What standard, if any, did Mayor de Blasio use to issue such an unprecedented, warlike declaration against a vulnerable, marginalized minority; a minority that has been the target of violent acts of Antisemitism?”\n\nJane Orient, MD of the Association of American Physicians and Surgeons says that she has not been able to find evidence of the vaccine being safer than measles itself and adds “life is fraught with risks” going on to talk about the risks of vaccine exposure.\n\nRichard Moskowitz, MD had measles as a child and survived and thinks his immune system is stronger for it, says he “does not offer vaccines for his patients because, he says, they are creating a population with chronically weak immune systems.” Dr. Moskowitz highlights China which mandates with no exemptions vaccines for everyone: “Even with more than 99 percent of the population vaccinated, over 700 outbreaks were recorded in 2014 alone, with roughly 26,000 cases,” which is citing a 2015 World Health Organization report.\n\nLatest figures suggest that number has dropped to more than 96% of the population being vaccinated. According to a report China and India account for 33% of the world’s unvaccinated children. This figure will likely grow as more become wary of government made vaccines after storage issues were revealed to have rendered millions of vaccines ineffective.\n\nDoes this situation really constitute as a state of emergency, this could be something of a coin toss for the judge whose desk this is on. 285 cases is small based on a caseload for a city with a population of 9 million, however that changes when it is condensed to 4 zip codes. The judge will have to take into account how measles is transmitted, how deadly the morbidity will be, and if other measures can be enforced such as quarantine.\n\nAdvocates pushing for forced vaccinations such as Peter Pitts formerly of the FDA believes there is no question of how dangerous measles can be, and is furious over the outbreak. “Measles is a serious disease and it shouldn't sound trite when people call it a childhood disease. It's a killer and its eradication was a major public health victory. This is not a disease that, as it progresses seriously, you can deal with at home with tender love and care. It can cause serious, life-long complications.”\n\nFamilies sometimes, both in past and present day, deliberately infect their children with measles or chickenpox rather than vaccinating them. Pitts splutters this idea of childhood disease infection parties, and believes anti-vaxxer parents should be jailed. “I think the mayor's order to have mandatory vaccinations was absolutely the appropriate thing to do and I wish the penalty was more robust. People should be put in prison and their children in foster care. This is child abuse at the molecular level.”\n\nAccording to Batra Hershey the religious component may not hold up. The 1905 Massachusetts precedent allowing forced vaccine may not have taken religion into account, but there are other rules that may give New York City an advantage. New York falls into a dictum in the 2nd Circuit that allows judges to disregard religion in certain circumstances and that has been upheld in the city before.\n\nIn the case of Prince vs Massachusetts the judge concluded: “A law that is neutral and of general applicability need not be justified by a compelling governmental interest even if the law has the incidental effect of burdening a particular religious practice.” And: “The right to practice religion freely does not include liberty to expose the community or the child to communicable disease or the latter to ill health or death.”\n\nThe United States Court of Appeals sided with New York City against Catholic parents whose children had been excluded from school using this dictum in 2015. These children were not vaccinated on religious grounds and were excluded in 12/2011 and 01/2012 after a classmate was diagnosed with chickenpox. The judge relied heavily on Prince vs Massachusetts when ruling the exclusion was justified.\n\nSome health experts say that while the order is a valid move, it may have the side effect of pushing those wary of vaccines even further from mainstream medicine and health authorities. As Batra Hershey explains, “I do think this might be going a little too far, they haven't done the quarantines or limiting movements that other places have. They went straight down this path that no other city has really done in a very, very long time. You're talking about making someone put something into their body. It's not mandatory treatment, it's mandatory vaccination. I think it may have been better for the authorities in New York to think about how the anti-vaccination community would react to this.”\n\nParents Educating and Advocating for Children’s Health circulates a magazine called PEACH which is a religious handbook against vaccines. To counteract this Blima Marcus has created PIE: Parents Informed and Educated, and warns the situation is complex with layers of cultural beliefs and deep routed concerns that could be intensified with such a hard lined approach.\n\n'It's not getting to the root of the problem,” says Marcus “The government needs to put their efforts into understanding the root cause of the hesitancy and fears of vaccinating and addressing that...What you really need to gain from the community is trust with slow, long-term education. You'll really get people to listen and reverse the damage that's been done by the anti-vaccine movement that's so vocal here.”", "opengraph": {"locale": "en_US", "type": "article", "title": "New York City Being Sued For Making Vaccine Mandatory", "description": "5 Brooklyn mothers, identified by using only initials, have filed a lawsuit against New York City saying the arbitrary state of emergency order and threat of $1000.00 fine or 6 months in jail is unlawful, anti-Semitic, and totalitarian; they are accusing Mayor Bill de Blasio of unlawfully targeting the Jewish community.", "url": "https://www.worldhealth.net/news/new-york-city-being-sued-making-vaccine-mandatory", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_80034052.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}