{"result_id": "348028", "URL": "https://www.worldhealth.net/news/breakthrough-technology-could-lead-one-time-hiv-treatment", "timestamp": "2023-04-25 18:16:05 CEST+0200", "meta": {"description": "TAU researchers demonstrate initial success in neutralizing the virus with a single vaccine", "lang": "en", "keywords": "HIV, AIDS, CRISPR, virus, vaccine, B cells, immune system, bone marrow, lymphatic system, antibodies,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/breakthrough-technology-could-lead-one-time-hiv-treatment", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Breakthrough Technology Could Lead to One-Time HIV Treatment", "cleaned_text": "Researchers from Tel Aviv University demonstrated the success of a novel technology that may be developed into a one-time vaccine to treat people with HIV and AIDS. The team used CRISP systems, best known as a gene-editing technique, to engineer type B white blood cells that activate the immune system to produce HIV-neutralizing antibodies.\n\nThe study was led by Dr. Adi Barzel and Ph.D. student Alessio Nehmad, both from the School of Neurobiology, Biochemistry and Biophysics at The George S. Wise Faculty of Life Sciences and the Dotan Center for Advanced Therapies at TAU in collaboration with the Sourasky Medical Center (Ichilov). The study was conducted in collaboration with additional researchers from Israel and the US. The study was published in the prestigious journal Nature.\n\nThere is currently no permanent cure for AIDS. There is also no genetic treatment for AIDS, so the research opportunities are vast. \"Based on this study,\" says Dr. Barzel, \"we can expect that over the coming years we will be able to produce a medication for AIDS, additional infectious diseases and certain types of cancer caused by a virus, such as cervical cancer, head and neck cancer and more.\"\n\nDr. Barzel explains: \"We developed an innovative treatment that may defeat the virus with a one-time injection, with the potential of bringing about tremendous improvement in the patients' condition. When the engineered B cells encounter the virus, the virus stimulates and encourages them to divide, so we are utilizing the very cause of the disease to combat it. Furthermore, if the virus changes, the B cells will also change accordingly in order to combat it, so we have created the first medication ever that can evolve in the body and defeat viruses in the 'arms race'.”\n\nOver the last two decades, the lives of many AIDS patients have improved as a result of game-changing treatments. These treatments control the virus to convert the disease from what was once a universally lethal to a chronic illness. However, the researchers underline that there is still a long way to go before a treatment is found that would provide patients with a permanent cure. The development from Dr. Barzel’s laboratory offers one possible route for the endeavor. HIV destroys certain white blood cells that are critical for immune health, weakening the body’s defenses against serious infections. The technique developed in his lab involves the injection of genetically-engineered type B white blood cells into a patient's body, catalyzing the immune system to secrete antibodies that neutralize the HIV.\n\nB cells are a type of white blood cells responsible for generating antibodies against viruses, bacteria and more formed in bone marrow. When they mature, B cells move into the blood and lymphatic system and from there to the different body parts.\n\nDr. Barzel explains: \"Until now, only a few scientists, and we among them, had been able to engineer B cells outside of the body. In this study, we were the first to do this within body and then make those cells generate the desired antibodies. The genetic engineering is conducted with viral carriers derived from viruses that were also engineered. We did this to avoid causing any damage, and solely bring the gene coded for the antibody into the B cells in the body.”\n\n“Additionally, in this case we have been able to accurately introduce the antibodies into a desired site in the B cell genome. All lab models that had been administered the treatment responded, and had high quantities of the desired antibody in their blood. We produced the antibody from the blood and made sure it was actually effective in neutralizing the HIV virus in the lab dish.\"\n\nThe genetic editing was done with a CRISPR, a technology based on a bacterial immune system against viruses. The bacteria use the CRISPR systems as a sort of molecular \"search engine\" to locate viral sequences and cut them in order to disable them.\n\nPh.D. student Alessio Nehmad elaborates on the use of CRISPR: “We incorporate the capability of a CRISPR to direct the introduction of genes into desired sites along with the capabilities of viral carriers to bring desired genes to desired cells. Thus, we are able to engineer the B cells inside a patient's body. We use two viral carriers of the AAV family, one carrier codes for the desired antibody and the second carrier codes the CRISPR system. When the CRISPR cuts in the desired site in the genome of the B cells it directs the introduction of the desired gene: the gene coding for the antibody against the HIV virus, which causes AIDS.\"", "opengraph": {"locale": "en_US", "type": "article", "title": "Breakthrough Technology Could Lead to One-Time HIV Treatment", "description": "\n\nResearchers from Tel Aviv University demonstrated the success of a novel technology that may be developed into a one-time vaccine to treat people with HIV and AIDS. The team used CRISP systems, best known as a gene-editing technique, to engineer type B white blood cells that activate the immune system to produce HIV-neutralizing antibodies.", "url": "https://www.worldhealth.net/news/breakthrough-technology-could-lead-one-time-hiv-treatment", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_126743967.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://en-lifesci.tau.ac.il/lp-en-nbb", "https://en-lifesci.tau.ac.il/", "https://www.nature.com/articles/s41587-022-01328-9"], "authors": [], "publish_date": null}