{"result_id": "348040", "URL": "https://www.worldhealth.net/news/nasal-vaccine-alzheimers-enters-phase-1-trial", "timestamp": "2023-04-25 18:16:13 CEST+0200", "meta": {"description": "A new phase 1 trial of a nasal vaccine for Alzheimer’s disease is beginning.", "lang": "en", "keywords": "dementia, Alzheimer's, nasal, vaccine, brain, cognitive, mortality, trial, neurodegenerative, immune system, inflammation, amyloid, tau, lifestyle, Protollin,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/nasal-vaccine-alzheimers-enters-phase-1-trial", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Nasal Vaccine For Alzheimer’s Enters Phase 1 Trial", "cleaned_text": "Scientists are now trialing the vaccine in a small group of humans to see whether it is safe.\n\nScientists have developed a nasal vaccine that was effective at protecting and treating mice with Alzheimer’s.\n\nA new phase 1 trial of a nasal vaccine for Alzheimer’s disease is beginning. Scientists have used the vaccine with success in mouse models that simulate some of the characteristics of Alzheimer’s.\n\nIf the new trial shows the vaccine to be safe in humans, further studies will test whether it is also effective.\n\nAlzheimer’s disease is a neurodegenerative condition and the most common type of dementia.\n\nPeople with the disease typically develop the symptoms after the age of 60. Alzheimer’s is characterized by the progressive loss of cognitive functioning, and when it is most severe, a person may not be able to respond to the world around them.\n\nAn estimated 5.8 million people in the United States had Alzheimer’s disease in 2020, and it is the sixth leading cause of death in adults.\n\nThere is currently no cure for Alzheimer’s, and treatments usually focus on helping people manage its symptoms.\n\nScientists from the Brigham and Women’s Hospital, in Boston, are now starting a phase 1 clinical trial to see whether a potential treatment could be safe for humans.\n\nPreviously, the team showed that the nasal vaccine could prevent and treat the disease in a mouse model that simulates Alzheimer’s. These studies were published in 2005, 2008, and 2012.\n\nDr. Howard L. Weiner, leader of the research and co-director of the Ann Romney Center for Neurologic Diseases at the hospital, says, “The launch of the first human trial of a nasal vaccine for Alzheimer’s is a remarkable milestone.”\n\n“Over the last 2 decades, we’ve amassed preclinical evidence suggesting the potential of this nasal vaccine for Alzheimer’s disease. If clinical trials in humans show that the vaccine is safe and effective, this could represent a nontoxic treatment for people with Alzheimer’s, and it could also be given early to help prevent Alzheimer’s in people at risk,” says Dr. Weiner.\n\nThe vaccine uses the adjuvant Protollin to stimulate the immune system. As a part of other treatments, this has been shown to be safe in humans.\n\nThe scientists hope that the vaccine will activate white blood cells located in lymph nodes in the neck, encouraging these immune cells to clear beta amyloid plaques. Scientists believe that these amyloid plaques are a key cause of Alzheimer’s symptoms.\n\nSpeaking to Medical News Today, Dr. Oscar Lopez, the director of the Alzheimer’s Disease Research Center, at the University of Pittsburgh, said, “This is a new avenue for the treatment of Alzheimer’s disease and other neurodegenerative disorders.”\n\n“The mechanism of action — stimulation of the immune system — and the nasal administration of the compound make this therapy very attractive for the treatment of Alzheimer’s disease,” he explained.\n\n“The investigators are going to initiate a phase 1 study, usually done to determine the appropriate dosage and pharmacokinetics of the medications. If this is positive, they will be able to move forward with phase 2 and phase 3 studies to determine the efficacy and safety of the treatment.”\n\nWhile the beginning of the phase 1 trial is an exciting development, there are still many hurdles in proving that the vaccine is a safe and effective treatment.\n\nSpeaking to MNT, Prof. Tara Spires-Jones — personal chair of neurodegeneration and deputy director of the Centre for Discovery Brain Sciences, at the University of Edinburgh — explained that there is a significant gap between mouse models and human participants: “In Alzheimer’s disease, we have a poor track record of translating from mice to humans. Mice aren’t perfect models.”\n\nPlus, she noted, “This trial involves only 16 people, and it is looking primarily at safety. They’ve used a similar approach in humans before, so [we know] it’s safe in some populations.”\n\n“[However, in the trial] they’re taking people who are older and actually have symptomatic Alzheimer’s disease and using tiny amounts of this vaccine to make sure it’s safe for people with Alzheimer’s disease. So it’s just very early days yet.”\n\n“If it’s safe for them, then they’ll go on to another stage of the trial, where they start to look at whether it’s effective. So for now, it’s just testing whether this is even going to be possible to use.”\n\nProf. Spires-Jones added that there is a good rationale behind the study:\n\n“In terms of scientific rationale, the idea that brain immune cells are involved in developing Alzheimer’s disease is strong. This particular approach is very general — it doesn’t target anything specific about Alzheimer’s — so whether this general boost in people will effectively combat Alzheimer’s disease is unknown.”\n\n“In fact, it could [also] go the wrong way because we know that the immune system cells are involved in multiple ways at different stages of the disease,” she noted.\n\n“So my take-home from this is that it’s exciting that things are moving forward, but you want to be cautious, as it’s very early days, and we’re not sure if it’s going to be even safe, much less effective.”\n\nProf. Spires-Jones explained that the timing and approach of targeting the immune response would be crucial.\n\n“The immune cells are, in part, helpful in the brain — they’re clearing pathologies. And then, in part, they get sort of sick and harmful and secrete toxic stuff and cause this inflammation,” she said.\n\n“But the worry is that if you’re not specifically targeting that immune response at the right time in the disease process, or you’re not doing it the right way, then you could potentially make things worse in the brain.”\n\n“There has also been a little bit of concern classically in the field that if you do clear this amyloid protein out of the brain — especially if it’s wrapped around the blood vessels where they have degenerated — you could cause a little damage,” Prof Spires-Jones told us. “I don’t think that’s played out because amyloid lowering is generally pretty safe, so I wouldn’t worry overly about that.”\n\n“But this is not specifically amyloid lowering — this is blanket immune-boosting — and I’m not sure anyone knows yet whether a global boost is a good thing. But it was helpful in the mice.”\n\nProf. Spires-Jones suggested that the new treatment has a better chance at preventing Alzheimer’s disease than treating its symptoms.\n\n“I think it’s more likely that this would be effective at preventing instead of treating, just because our experience of everything that’s been tried at treating people who already have pathologies has been poor, at best,” she said.\n\n“If this works, it would be amazing. If we could prevent Alzheimer’s disease, it would be the best possible outcome, and this would theoretically be a safe way because the researchers suggest that this kind of vaccine has been used in humans before.”\n\n“If it was safe and we could give it to everybody in their mid-60s who might even have a small amount of risk, or who already have amyloid-positive signs, that would be an absolute game-changer. That’s more likely to work, in my view,” Prof. Spires-Jones said.\n\nMany instances of dementia, and Alzheimer’s disease in particular, can be prevented with lifestyle and behavioral changes, and Prof. Spires-Jones said that highlighting this is crucial.\n\n“The most important take-home message of any study like this is that, right now, we estimate that about 40% of all-cause dementia, of which Alzheimer’s is about 60%, could be prevented by lifestyle, modifiable risk factors.”\n\nThe researcher explained: “These are the same things you’d want to be doing anyway to protect your heart and your vascular system to lower your risk of stroke and heart attack. These are things like exercise, eating healthy food, and keeping physically, mentally, and socially active.”\n\n“One quite surprising [risk factor] is that hearing loss is associated with increased risk of dementia — we don’t really understand whether that’s causative or an effect of the brain changes, but it certainly wouldn’t hurt to get your hearing aids and wear them and keep stimulated.”\n\nShe added: “This doesn’t mean that lifestyle or behavioral changes can help everybody. There are 60% of dementias and Alzheimer’s disease [cases] that are genetically pushed. So it’s not to blame people who have dementia — there are some people who are just going to be unlucky.”\n\n“But for some of us, [making key changes] can prevent [the disease] and make a big difference, so we may as well all take good care of ourselves. That protects our brain, as well as the rest of our body.”", "opengraph": {"locale": "en_US", "type": "article", "title": "Nasal Vaccine For Alzheimer’s Enters Phase  1 Trial", "description": "\n\n\nAlzheimer’s disease is a leading cause of mortality.\nThere is currently no known cure.\nScientists have developed a nasal vaccine that was effective at protecting and treating mice with Alzheimer’s.\nScientists are now trialing the vaccine in a small group of humans to see whether it is safe.\n", "url": "https://www.worldhealth.net/news/nasal-vaccine-alzheimers-enters-phase-1-trial", "image": "https://www.worldhealth.net/media/original_images/Sleep_alzheimers.png", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/aging/aginginfo/alzheimers.htm", "https://www.cdc.gov/aging/aginginfo/alzheimers.htm", "https://doi.org/10.1172/jci23241", "https://doi.org/10.1002/ana.21340", "https://doi.org/10.1016/j.neurobiolaging.2011.01.006", "https://weinerlab.bwh.harvard.edu/?page_id=154", "https://doi.org/10.1016/j.vaccine.2004.03.035", "https://www.nia.nih.gov/health/what-happens-brain-alzheimers-disease", "https://www.neurology.pitt.edu/people/oscar-l-lopez-md-faan", "https://www.ed.ac.uk/discovery-brain-sciences/our-staff/research-groups/prof-tara-spires-jones"], "authors": [], "publish_date": null}