{"result_id": "348031", "URL": "https://worldhealth.net/news/a_history_of_cancer_vaccines/", "timestamp": "2023-04-25 18:16:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/static/images/favicon.ico", "canonical": "https://worldhealth.net/news/a_history_of_cancer_vaccines", "encoding": "UTF-8"}, "image": null, "domain": "worldhealth.net", "title": "A History of Cancer Vaccines", "cleaned_text": "The history of cancer vaccines is a history of failure.\n\nFor 20 years, scientists have dreamed of creating vaccines that teach the body to destroy tumors. Yet after hundreds of clinical trials, not a single vaccine has been approved to treat cancer.\n\n\"The whole field . . . was riddled with these high expectations,\" says Jill O'Donnell-Tormey, who directs the nonprofit, New York-based Cancer Research Institute, a longtime funder of vaccine trials. \"Then everybody failed.\"\n\nYet everybody is still trying. There are at least six cancer vaccine trials planned or under way in South Florida, and more than 100 other trials around the country. Their goal is not to prevent cancer, but to treat it -- to stimulate the body to attack cancers of the skin, prostate, pancreas, breast and lungs, to name a few.\n\nWhich raises an obvious question: Why?\n\nWhy pour millions of dollars into scores of vaccines tested on thousands of patients for an idea that has consistently disappointed?\n\nAs much as anything, the answer comes down to the elegance of the idea.\n\nThe three ways doctors treat cancer now -- surgery, radiation, chemotherapy -- are brutal, aggressive approaches that can cause permanent harm or even death. The ideal vaccine, by contrast, would nudge the body to heal itself -- an advance that could reduce the cutting, burning and poisoning that now comprise the anti-cancer arsenal, says Dr. Steven Burakoff, director of the New York University Cancer Institute.\n\n\"If you want to think about the optimal therapy,\" he says, \". . . think about the possibility of mobilizing our own immune system to do something about cancer.\"\n\nLast month, researchers announced a successful trial of an experimental vaccine that may prevent cervical cancer. The vaccine, being developed under the brand name Gardasil, could reach the market next year and save hundreds of thousands of lives. But in the world of cancer vaccines, the cervical cancer vaccine is an aberration.\n\nCervical cancer is one of very few cancers that is caused by a virus; the vaccine prevents cancer by preventing the virus from taking hold in the body. The vaccine, therefore, can't be used for anyone who already has cervical cancer.\n\nVaccines capitalize on the body's innate ability to detect and destroy invaders. A vaccine is a pseudo-invader, usually a slightly altered version of a disease-causing virus. The body responds to a vaccine by building custom-made cells whose sole purpose is to attack the pseudo-invader.\n\nSome of those cells remain in the system long after the vaccine pseudo-invaders have been destroyed. If the real invader -- the virus -- shows up, the cells swarm and attack, destroying the virus before it can harm the body.\n\nEven in the absence of a vaccine, the immune system is usually able to fight off infection. You get a cold (or the chicken pox, or the flu), and then you get better.\n\nThere is evidence that the immune system naturally attacks some nascent cancers as well, Burakoff says.\n\nIn patients whose immune systems have been decimated by AIDS, the rate of certain cancers increases dramatically -- suggesting that in healthy patients, the immune system destroys many would-be cancers before they grow to noticeable size.\n\nAnd researchers have found immune cells known as killer T-cells attacking cancer in some patients. In the early 1980s, scientists identified a melanoma antigen -- a protein that was on the surface of cancerous melanoma cells, but not, by and large, on healthy cells.\n\nThis discovery gave rise to a wave of optimism: Immunologists believed they could use a vaccine to strengthen the immune system's natural response and cure melanoma, a deadly form of skin cancer.\n\n\"Twenty years ago, when people announced immunology would conquer cancer, people didn't realize how little they knew about the immunology of cancer,\" says Dr. Jose Lutzky, director of the melanoma program at Mount Sinai Medical Center in Miami Beach. \"Tumors . . . evade the immune system by producing proteins that make them invisible. If a vaccine has a target on the tumor, the tumor can make the target disappear.\"\n\nBut, in a molecular game of cat and mouse, discovering these complexities has inspired researchers to create ever more complex vaccines.\n\nMost new vaccines add molecules to incite a stronger immune response. Some use genetically modified whole cancer cells. Others block a compound that tells the immune system to stop making T-cells.\n\nThe scientists say their increasing understanding of the immune system will lead to improved vaccines.\n\n\"I really think we're doing better now,\" Lutzky says. \"I could be wrong, but I don't think so.\"\n\nFor more news or to subscribe, please visit http://www.miami.com", "opengraph": {"locale": "en_US", "type": "article", "title": "A History of Cancer Vaccines", "description": "The history of cancer vaccines is a history of failure. For 20 years, scientists have dreamed of creating vaccines that teach the body to destroy tumors. Yet after hundreds of clinical trials, not a single vaccine has been approved to treat cancer.\n", "url": "https://worldhealth.net/news/a_history_of_cancer_vaccines", "image": "https://www.worldhealth.net/static/images/whn_logo.png", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}