{"result_id": "348029", "URL": "https://worldhealth.net/news/anti-aging-vaccine-shows-promise-mice-will-it-work-humans/", "timestamp": "2023-04-25 18:16:06 CEST+0200", "meta": {"description": "The new vaccine ameliorated certain signs of aging in mice.", "lang": "en", "keywords": "aging, anti-aging, vaccine, immune system, GPNMB, senescent, stress, inflammation, arteries, cancer, Alzheimer's, atherosclerosis, senolytic, antibody,", "favicon": "/static/images/favicon.ico", "canonical": "https://worldhealth.net/news/anti-aging-vaccine-shows-promise-mice-will-it-work-humans", "encoding": "UTF-8"}, "image": null, "domain": "worldhealth.net", "title": "Anti-aging vaccine shows promise in mice — will it work in humans?", "cleaned_text": "An experimental vaccine successfully eliminated aging cells from the bodies of mice, helping to prolong the rodents' lives and reverse some signs of age-related disease. The researchers say the experiment is a step on the road to a similar vaccine for humans, but could it really work?\n\n\"I think the data was extremely strong … I think it's a really good proof-of-principle,\" Paul Robbins, a professor of biochemistry, molecular biology and biophysics and an associate director of the Institute on the Biology of Aging and Metabolism at the University of Minnesota, said of the mouse study. In theory, the same approach would work in humans. But the big question is whether that vaccine would be safe in humans, Robbins, who was not involved in the research, told Live Science. To figure that out, the researchers would need to conduct additional studies in animals, including non-human primates, and thorough safety trials in human patients.\n\nThe new vaccine targets senescent cells, which are cells that have stopped multiplying due to damage or stress, but don't die when they should, according to the National Institute on Aging (NIA). These cells accumulate as we age, as the immune system becomes less efficient at clearing such cells from the body. Senescent cells release compounds that trigger inflammation and thus damage nearby healthy cells. And evidence suggests that this buildup of senescent cells contributes to a slew of age-related diseases, including cancer, Alzheimer's and atherosclerosis, a disease where plaque builds up in the arteries.\n\nFor the past decade, scientists have been working to develop \"senolytic therapies,\" or drugs that can clear senescent cells from the body. Some of these drugs have reduced inflammation, delayed the onset of age-related diseases and extended the life span of rodents. A couple dozen of these drugs have entered clinical trials in human patients, Robbins said.\n\nThe potential benefit of using a vaccine rather than drugs to target senescent cells is that people could be given the shot at, say, age 50 and avoid accruing senescent cells in the first place, Robbins said. A vaccinated person's immune system would be trained to look for senescent cells and destroy them on sight; in contrast, someone taking senolytic drugs would need to take them repeatedly, as senescent cells would reaccumulate after each course of treatment, he said.\n\nTo develop their senolytic vaccine, the researchers selected a specific target, or \"antigen,\" on senescent cells — a sort of bullseye for the immune system to aim at. But because cells throughout the body can become senescent, different senescent cells look different than one another, senior author Dr. Tohru Minamino, a professor at Juntendo University Graduate School of Medicine and the director of cardiovascular medicine at Juntendo University Hospital in Tokyo, told Live Science in an email.\n\nIn this proof-of-concept study, the team zeroed in on just one cell type: senescent vascular endothelial cells, which line the insides of arteries, veins and capillaries. They analyzed which proteins appear in large quantities on the surfaces of these cells, to see which proteins would make a good target for their vaccine.\n\nFrom the proteins identified, they picked one called \"glycoprotein nonmetastatic melanoma protein B\" (GPNMB), which seems to accumulate with age in some tissues and contribute to various diseases, according to a 2011 report in the journal Aging. The same protein also appears in abundance on certain cancer cell types, including melanomas, according to a 2018 report in the journal Steroids.\n\nIn their own study, the team examined tissue samples from human patients with atherosclerosis and found that their vascular endothelial cells bore far more GPNMB than the cells of those without the disease. Evidence suggests that molecules spewed by senescent cells directly contribute to the buildup of plaque in atherosclerosis, according to a 2020 report in the journal Clinical Chemistry and Laboratory Medicine; with this in mind, the team wanted to see whether expunging GPNMB-heavy cells from the body would help reduce the density of these plaques.\n\nTo test this idea, the team used a mouse model of atherosclerosis and then eliminated GPNMB-positive cells from the rodents, using genetic modification. Upon removing the cells, they found that the amount of plaque in the mice's arteries swiftly decreased. These findings convinced the team to make GPNMB the target of their senolytic vaccine.\n\nThe team specifically created a peptide vaccine, a type of vaccine that targets short segments of a longer protein sequence. Once injected into mice, the vaccine prompted the immune system to build antibodies against portions of the GPNMB protein; these antibodies latched onto the protein and tagged the attached cells for destruction. GPNMB-positive cells, arterial plaques and inflammatory molecules significantly decreased in mice given the vaccine, compared with mice given a placebo shot. Specific molecular markers of senescence were also reduced in vaccinated mice compared with controls, they found.\n\nTo see if the vaccine showed any effect on general signs of aging, the team vaccinated middle-age mice, a little over a year old, and then tested their agility at about 1.5 years old. Mice given a placebo shot moved less often and more slowly in their old age, but mice given the vaccine remained far more spry, the team found. What's more, in a third experiment, the team found that mice given the vaccine lived slightly longer than mice given the placebo, hinting that the shot may somewhat prolong life span.\n\nThe team didn't notice any side effects in their vaccinated mice, which is somewhat surprising, Robbins said. Since the GPNMB protein can be found on a variety of cells, not just senescent ones, one might expect some off-target effects. In general, \"I don't think there's ever going to be an antigen that's specific to senescent cells,\" so there will always be a concern that the vaccine might send the immune system after healthy cells without intending to, he said. The researchers will have to look out for such effects as they move their vaccine toward human trials.\n\nIn addition to moving the new vaccine into human trials, the team plans to develop additional vaccines that target different types of senescent cells, which may have different surface proteins that can be targeted by the immune system, Minamino said. But first the team will need to identify those proteins and then formulate vaccines to match, he said.\n\n\"At this point, we don't know what senescent cell subtype we should be targeting\" in anti-aging treatments and vaccines, Robbins noted. It may be that one subtype of senescent cell causes more trouble than the next, but at this point, we just don't know. That said, there's a new National Institutes of Health grant called \"The Cellular Senescence Network\" (SenNet) aimed at figuring that out. The goal of the field, in the long-term, is to develop a senolytic vaccine or drug that can counter multiple aspects of aging, in one go, he said.\n\nThe new findings were published Dec. 10 in the journal Nature Aging.", "opengraph": {"locale": "en_US", "type": "article", "title": "Anti-aging vaccine shows promise in mice — will it work in humans?", "description": "\n\nAn experimental vaccine successfully eliminated aging cells from the bodies of mice, helping to prolong the rodents' lives and reverse some signs of age-related disease. The researchers say the experiment is a step on the road to a similar vaccine for humans, but could it really work? ", "url": "https://worldhealth.net/news/anti-aging-vaccine-shows-promise-mice-will-it-work-humans", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_24062089.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.nia.nih.gov/news/does-cellular-senescence-hold-secrets-healthier-aging", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3181167/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6166407/", "https://www.degruyter.com/document/doi/10.1515/cclm-2020-0601/html", "https://grants.nih.gov/grants/guide/rfa-files/RFA-RM-21-008.html", "https://go.redirectingat.com/?id=92X1590019&xcust=livescience_us_1149050062168777300&xs=1&url=https%3A%2F%2Fwww.nature.com%2Farticles%2Fs43587-021-00151-2&sref=https%3A%2F%2Fwww.livescience.com%2Fvaccine-against-aging-senescent-cells-in-mice"], "authors": [], "publish_date": null}