{"result_id": "348050", "URL": "https://worldhealth.net/news/south-dakota-considering-state-bill-outlaw-all-vaccine-medical-mandates", "timestamp": "2023-04-25 18:16:21 CEST+0200", "meta": {"description": "South Dakota legislators have introduced a bill that would end vaccine mandates & all future medical mandates that may be introduced in the state in the future", "lang": "en", "keywords": "medical, mandates, vaccines, intervention, bodily integrity, legislation, exemptions,", "favicon": "/static/images/favicon.ico", "canonical": "https://worldhealth.net/news/south-dakota-considering-state-bill-outlaw-all-vaccine-medical-mandates", "encoding": "UTF-8"}, "image": null, "domain": "worldhealth.net", "title": "South Dakota Considering State Bill To Outlaw All Vaccine & Medical Mandates", "cleaned_text": "A growing number of legislators in the state of South Dakota believe you should have the right to decide what goes into your body and have introduced a bill that would end vaccine mandates and all future medical mandates that may be introduced in the state in the generations to come.\n\nThe US Supreme Court made a decision 115 years ago when there was a deadly smallpox epidemic that the City of Cambridge, Massachusetts was allowed to charge a pastor $5 to opt out of a city wide vaccine mandate, the law didn’t apply to children.\n\nThis set a precedent that has been the basis for the mandate of dozens of now liability free vaccines for children and adults where neither an epidemic or one case exists; the costs for which can be thousands of dollars per year to opt out. This precedent is even the basis on which the Supreme Court ruled that women can be forcibly sterilized for the good of themselves and that of society.\n\nThe current vaccine mandate enforcement has driven communities, including those who never questioned vaccines before, to back a basic question that the mandate brings forth, that being who owns your body? Naturally the knee jerk normal reaction is I do, but that is not what the current mandate or precedent is driving.\n\nIt would appear as if most governments think that they own your body, even under the American Constitution of individual liberties, the current mandate helps the government strive to take control away from you, even in your medical choices, and if they can’t it appears as if they will find a reason to justify it and the means by which to carry out their wishes.\n\nIn America in present day there are no wide spreading deadly epidemics of communicable disease, despite the fact we are still subjected to fear mongering campaigns. To the best of my knowledge no such event has happened in my lifetime, if I want to be scared about a deadly epidemic I have to look many many years into the past. Which means that the circumstances for the justifications of the actions by the government in Jacobson vs Massachusetts in the current day only exist in history books.\n\nGiving the age of medical technology we are in, and thanks to the advances that mark stark differences from back then to now do we really want any mandate based on that far in the past, why do mandates still exist even? In the case of Jacobson, if it can be used to justify the sexual mutilation of women, what else can it be used to justify as the age of medical technology progresses in the years to come?\n\nWhat new medical technologies and mind/body tech will Google, The Gates Foundation, or even Elon Musk invent, manage to convince governments and NGOs that it is for the good of society and then force people into utilizing it? Just where and when should the battle to end coerced medical care begin? It would appear as if it has started now in South Dakota.\n\nHouse Majority Leader and South Dakota Representative Lee Qualm has introduced HB1235, An Act To Revise Provisions Regarding Immunizations, and the bill repeals all vaccine mandates in the state. This means that this would be the first American state to have no vaccine mandates at all to join other governments like Canada, Japan, and the UK in allowing their citizens uncoerced vaccine decision making.\n\nIF the bill progresses further it will end ALL medical mandates completely, giving citizens back ownership of their body and all medical decision making. The bill adds a new law that reads:\n\n\"Section 5. That a NEW SECTION be added:\n\nEvery person has the inalienable right to bodily integrity, free from any threat or compulsion that the person accepts any medical intervention, including immunization. No person may be discriminated against for refusal to accept an unwanted medical intervention, including immunization.\"\n\nSouth Dakota wants to codify into law that you own your body and you make your own medical decisions, and that no one can coerce those choices or discriminate against you because of them. This isn’t just about vaccines, this is ALL medical intervention, as it should be.\n\nThe dialogue people should be having is not to let the government take away our right to bodily integrity, or use loopholes that permit anyone to make decisions, especially about our own bodies, based on outdated conversations that are not true. It is also a falsehood that we don’t have the right to our bodily integrity to begin with, and that any government is doing a favor for granting certain medical exemptions.\n\nDo you know what happened way back then, have you looked for yourself? Courts in the turn of the century did not care that Pastor Jacobson protested the violation of his body and bank account based on his arguments of the vaccines not being safe, or that he and his son had previous reactions to the vaccines and that they violated his religious conscience. The courts certainly didn’t care that Carrie Buck was a woman of sound mind who wanted to retain her ability to have children after being raped and impregnated by a family member. Buck was declared to be an intellectually disabled imbecile by the court, even though there was no evidence to support it, and then they forced her to be sterilized, for her own protection and that of society, of course:\n\n\"...Carrie Buck 'is the probable potential parent of socially inadequate offspring, likewise afflicted, that she may be sexually sterilized without detriment to her general health and that her welfare and that of society will be promoted by her sterilization...\"\n\nTo justify this action the court stated having compelling interest:\n\n\"...in order to prevent our being swamped with incompetence. It is better for all the world, if instead of waiting to execute degenerate offspring for crime, or to let them starve for their imbecility, society can prevent those who are manifestly unfit from continuing their kind. The principle that sustains compulsory vaccination is broad enough to cover cutting the Fallopian tubes. Jacobson v. Massachusetts, 197 U.S. 11 , 25 S. Ct. 358, 3 Ann. Cas. 765. Three generations of imbeciles are enough.\"\n\nAnd there you have it, this was the justification that was based on the existence of vaccine mandates to violate Carrie Buck’s right to her bodily integrity. These actions are unconscionable, and such is the fact that this logic is allowed to stand in law books today, but nonetheless Buck vs Bell is still a law, as is Jacobson.\n\nPresent day South Dakota is saying that it is time to reject these untruths that you do not own your body and is considering rejecting the laws that allow the state to do what it wants with your body.\n\nIs it not time that all of America decides who owns the right to an individual’s medical choices? Who is it that has to live or die with the consequences of those medical choices is it the state or the person in the body?\n\nThis is about much more than vaccines, if governments have the right to coerce vaccination of Henning Jacobson and they also have the right to forcibly remove Carrie Buck’s reproductive organs, what else can they do to you now or in the future? Who owns your body???", "opengraph": {"locale": "en_US", "type": "article", "title": "South Dakota Considering State Bill To Outlaw All Vaccine & Medical Mandates", "description": "\nA growing number of legislators in the state of South Dakota believe you should have the right to decide what goes into your body and have introduced a bill that would end vaccine mandates and all future medical mandates that may be introduced in the state in the generations to come.\n\nThe US Supreme Court made a decision 115 years ago when there was a deadly smallpox epidemic that the City of Cambridge, Massachusetts was allowed to charge a pastor $5 to opt out of a city wide vaccine mandate, the law didn’t apply to children. ", "url": "https://worldhealth.net/news/south-dakota-considering-state-bill-outlaw-all-vaccine-medical-mandates", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_106945164.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}