{"result_id": "348013", "URL": "https://worldhealth.net/news/updated-cdc-covid-19-guidance/", "timestamp": "2023-04-25 18:15:54 CEST+0200", "meta": {"description": "The CDC updated COVID guidance on May13, 2021", "lang": "en", "keywords": "COVID-19, SARS-CoV-2, mask, distance, restrictions, guidelines, vaccine,", "favicon": "/static/images/favicon.ico", "canonical": "https://worldhealth.net/news/updated-cdc-covid-19-guidance", "encoding": "UTF-8"}, "image": null, "domain": "worldhealth.net", "title": "Updated CDC COVID-19 Guidance", "cleaned_text": "Research has been showing that rona rarely spreads outdoors, but the CDC has remained cautious and has not been highlighting this despite current research showing that almost all documented transmission occurred indoors and transmission via surfaces is not thought to be common, rather the agency has been focused on the tiny risks listed on their intricate list that has been both confusing and frightening, making it less than as helpful as it was intended to be.\n\nThe agency has just updated its guidance on May 13, 2021, for COVID behaviors, being specifically advantageous to those who have chosen to take any of the experimental vaccines being offered under emergency use authorization from the FDA.\n• None If you are fully vaccinated , you can resume activities that you did prior to the pandemic.\n• None Fully vaccinated people can resume activities without wearing a mask or physically distancing, except where required by federal, state, local, tribal, or territorial laws, rules, and regulations, including local business and workplace guidance.\n\nHowever, if you have a condition or are taking medications that weaken your immune system, you may NOT be fully protected even if you are fully vaccinated. Talk to your healthcare provider. Even after vaccination, you may need to continue taking all precautions.\n• None 2 weeks after their second dose in a 2-dose series, such as the Pfizer or Moderna vaccines, or\n• None 2 weeks after a single-dose vaccine, such as Johnson & Johnson’s Janssen vaccine\n• None You can resume activities that you did prior to the pandemic.\n• None You can resume activities without wearing a mask or staying 6 feet apart (some states have lowered this to 3 feet), except where required by federal, state, local, tribal, or territorial laws, rules, and regulations, including local business and workplace guidance.\n• None , you do not need to get tested before or after travel or self-quarantine after travel.\n• None You need to pay close attention to the situation at your international destination before traveling outside the United States.\n• None You do NOT need to get tested before leaving the United States unless your destination requires it.\n• None You still need to or documentation of recovery from COVID-19 before boarding an international flight to the United States.\n• None You should still get tested 3-5 days after international travel.\n• None You do NOT need to self-quarantine after arriving in the United States.\n• None If you’ve been around someone who has COVID-19, you do not need to stay away from others or get tested unless you have symptoms.\n• None However, if you live or work in a correctional or detention facility or a homeless shelter and are around someone who has COVID-19, you should still get tested, even if you don’t have symptoms.\n\nWhat You Should Keep Doing\n\nFor now, if you’ve been fully vaccinated:\n• None You will still need to follow the guidance at your workplace and local businesses.\n• None , you should still take steps to protect yourself and others . You will still be on planes, buses, trains, and other forms of public transportation traveling into, within, or out of the United States, and in U.S. transportation hubs such as airports and stations. Fully vaccinated arriving in the United States are still within 3 days of their flight (or show documentation of recovery from COVID-19 in the past 3 months) and should still get tested 3-5 days after their trip.\n• None You should still watch out for , especially if you’ve been around someone who is sick. If you have symptoms of COVID-19, you should get and away from others.\n• None People who have a condition or are taking medications that weaken the immune system, should talk to their healthcare provider to discuss their activities. They may need to keep taking all\n\nKeep in mind these shots do not guarantee that you will not get sick and develop COVID-19, but if you do studies suggests that it might help you to experience less severe symptoms of illness.\n• None How effective the vaccines are against variants of the virus that causes COVID-19. Early data show the vaccines may work against some variants but could be less effective against others.\n• None How well the vaccines protect people with weakened immune systems, including people who take immunosuppressive medications.\n\nThose that don’t meet the “fully vaccinated” requirements, regardless of age must continue taking all precautions, unless you become “fully vaccinated.”\n• None Everyone 2 years and older should wear a mask that covers their nose and mouth to help protect yourself and others in public.\n• None Stay 6 feet apart from others who don’t live with you (some states are now at 3 feet).\n• None when it is available to you.\n• None with soap and water. Use hand sanitizer if soap and water aren’t available.", "opengraph": {"locale": "en_US", "type": "article", "title": "Updated CDC COVID-19 Guidance", "description": "\n\nResearch has been showing that rona rarely spreads outdoors, but the CDC has remained cautious and has not been highlighting this despite current research showing that almost all documented transmission occurred indoors and transmission via surfaces is not thought to be common, rather the agency has been focused on the tiny risks listed on their intricate list that has been both confusing and frightening, making it less than as helpful as it was intended to be. ", "url": "https://worldhealth.net/news/updated-cdc-covid-19-guidance", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_317230022.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/coronavirus/2019-ncov/vaccines/fully-vaccinated.html#vaccinated", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/travel-during-covid19.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/map-and-travel-notices.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/testing-international-air-travelers.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/index.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/face-masks-public-transportation.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/international-travel-during-covid19.html", "https://www.cdc.gov/coronavirus/2019-ncov/travelers/testing-international-air-travelers.html", "https://www.cdc.gov/coronavirus/2019-ncov/symptoms-testing/symptoms.html", "https://www.cdc.gov/coronavirus/2019-ncov/testing/diagnostic-testing.html", "https://www.cdc.gov/coronavirus/2019-ncov/if-you-are-sick/isolation.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/prevention.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/how-to-wear-cloth-face-coverings.html", "https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/social-distancing.html", "https://www.cdc.gov/coronavirus/2019-ncov/vaccines/index.html", "https://www.cdc.gov/handwashing/when-how-handwashing.html"], "authors": [], "publish_date": null}