{"result_id": "348043", "URL": "https://worldhealth.net/news/t-cells-common-colds-cross-protect-against-infection-sars-cov-2/", "timestamp": "2023-04-25 18:16:16 CEST+0200", "meta": {"description": "People with higher levels of T cells from common cold coronaviruses are less likely to become infected with SARS-CoV-2.", "lang": "en", "keywords": "t cells, immune system, colds, infection, SARS-CoV-2, variants, omnicron, COVID-19, coronavirus, protection,", "favicon": "/static/images/favicon.ico", "canonical": "https://worldhealth.net/news/t-cells-common-colds-cross-protect-against-infection-sars-cov-2", "encoding": "UTF-8"}, "image": null, "domain": "worldhealth.net", "title": "T cells from common colds cross-protect against infection with SARS-CoV-2", "cleaned_text": "“Being exposed to the SARS-CoV-2 virus doesn’t always result in infection, and we’ve been keen to understand why. We found that high levels of pre-existing T cells, created by the body [the immune system] when infected with other human coronaviruses like the common cold, can protect against COVID-19 infection....\"\n\nA new study, published in Nature Communications and led by Imperial College London researchers, provides the first evidence of a protective role for these T cells. While previous studies have shown that T cells induced by other coronaviruses can recognize SARS-CoV-2, the new study examines for the first time how the presence of these T cells at the time of SARS-CoV-2 exposure influences whether someone becomes infected.\n\nThe researchers also say their findings provide a blueprint for a second-generation, universal vaccine that could prevent infection from current and future SARS-CoV-2 variants, including Omicron.\n\nDr. Rhia Kundu, the first author of the study, from Imperial’s National Heart & Lung Institute, says: “Being exposed to the SARS-CoV-2 virus doesn’t always result in infection, and we’ve been keen to understand why. We found that high levels of pre-existing T cells, created by the body [the immune system] when infected with other human coronaviruses like the common cold, can protect against COVID-19 infection.\"\n\n\"While this is an important discovery, it is only one form of protection, and I would stress that no one should rely on this alone. Instead, the best way to protect yourself against COVID-19 is to be fully vaccinated, including getting your booster dose.”\n\nThe study began in September 2020 when most people in the UK had neither been infected nor vaccinated against SARS-CoV-2. It included 52 people who lived with someone with PCR-confirmed SARS-CoV-2 infection and who had therefore been exposed to the virus. The participants did PCR tests at the outset and 4 and 7 days later, to determine if they developed an infection.\n\nBlood samples from the 52 participants were taken within 1-6 days of them being exposed to the virus. This enabled the researchers to analyze the levels of pre-existing T cells induced by previous common cold coronavirus infections that also cross-recognize proteins of the SARS-CoV-2 virus.\n\nThe researchers found that there were significantly higher levels of these cross-reactive T cells in the 26 people who did not become infected, compared to the 26 people who did become infected. These T cells targeted internal proteins within the SARS-CoV-2 virus, rather than the spike protein on the surface of the virus, to protect against infection.\n\nCurrent vaccines do not induce an immune response to these internal proteins. The researchers say that – alongside our existing effective spike protein-targeting vaccines – these internal proteins offer a new vaccine target that could provide long-lasting protection because T cell responses persist longer than antibody responses which wane within a few months of vaccination.\n\nProfessor Ajit Lalvani, senior author of the study and Director of the NIHR Respiratory Infections Health Protection Research Unit at Imperial, says: “Our study provides the clearest evidence to date that T cells induced by common cold coronaviruses play a protective role against SARS-CoV-2 infection. These T cells provide protection by attacking proteins within the virus, rather than the spike protein on its surface.\n\n\"The spike protein is under intense immune pressure from vaccine-induced antibody which drives evolution of vaccine escape mutants. In contrast, the internal proteins targeted by the protective T cells we identified mutate much less. Consequently, they are highly conserved between the various SARS-CoV-2 variants, including omicron.\n\n\"New vaccines that include these conserved, internal proteins would therefore induce broadly protective T cell responses that should protect against current and future SARS-CoV-2 variants.”\n\nThe researchers note some limitations to their study, including that, because it is small and 88 percent of participants were of white European ethnicity, it is not possible for them to model demographic factors.\n\nThe study was funded by the NIHR Health Protection Research Unit in Respiratory Infections and the Medical Research Council.", "opengraph": {"locale": "en_US", "type": "article", "title": "T cells from common colds cross-protect against infection with SARS-CoV-2", "description": "\n “Being exposed to the SARS-CoV-2 virus doesn’t always result in infection, and we’ve been keen to understand why. We found that high levels of pre-existing T cells, created by the body [the immune system] when infected with other human coronaviruses like the common cold, can protect against COVID-19 infection....\"\nA new study, published in Nature Communications and led by Imperial College London researchers, provides the first evidence of a protective role for these T cells. While previous studies have shown that T cells induced by other coronaviruses can recognize SARS-CoV-2, the new study examines for the first time how the presence of these T cells at the time of SARS-CoV-2 exposure influences whether someone becomes infected.", "url": "https://worldhealth.net/news/t-cells-common-colds-cross-protect-against-infection-sars-cov-2", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_335010211.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.imperial.ac.uk/nhli", "https://www.imperial.ac.uk/people/a.lalvani", "https://www.imperial.ac.uk/medicine/nihr-hpru-respiratory-infections", "https://mrc.ukri.org/"], "authors": [], "publish_date": null}