{"result_id": "348011", "URL": "https://www.worldhealth.net/news/could-there-be-alzheimers-vaccine-future/", "timestamp": "2023-04-25 18:15:53 CEST+0200", "meta": {"description": "Even if onset of this devastating disease could be delayed by 5 years, that would be enormous to patients affected by the disease and their loved ones.", "lang": "en", "keywords": "vaccine, dementia, Alzheimer's disease, brain, neurology", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/could-there-be-alzheimers-vaccine-future", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Could There Be An Alzheimer’s Vaccine In The Future?", "cleaned_text": "University of Texas are developing an experimental vaccine that may hold off Alzheimer’s disease that is showing good results in animal testing, as published in the journal Alzheimer’s Research & Therapy.\n\nFollowing additional research with monkeys and rabbits the team hopes to progress to human trials. If it proves safe and effective in humans it could decrease the number of dementia diagnosis in half, according to the researchers who says their study marks major progress towards a safe and effective vaccine.\n\nPrevious vaccine development attempts have unfortunately failed with approaches having either harmful side effects such as inflammation, or have being proven to be ineffective.\n\nThis vaccine will prompt the body to produce antibodies that will inhibit the buildup of tau and amyloid proteins. This approach is one of several promising treatments aimed at reducing buildup of these proteins before the become deadly plaque and tangles in the brain.\n\nIt is estimated that 5.7 million Americans have Alzheimer’s disease, and that number is projected to double with the oncoming silver tsunami by 2050. Even if onset of this devastating disease could be delayed by 5 years, that would be enormous to patients affected by the disease and their loved ones.", "opengraph": {"locale": "en_US", "type": "article", "title": "Could There Be An Alzheimer’s Vaccine In The Future?", "description": "\nUniversity of Texas are developing an experimental vaccine that may hold off Alzheimer’s disease that is showing good results in animal testing, as published in the journal Alzheimer’s Research &amp; Therapy.", "url": "https://www.worldhealth.net/news/could-there-be-alzheimers-vaccine-future", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_77977417.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}