{"result_id": "348010", "URL": "https://www.worldhealth.net/news/fentanyl-vaccine-potential-game-changer-opioid-epidemic", "timestamp": "2023-04-25 18:15:52 CEST+0200", "meta": {"description": "A recent study suggests new vaccine could prevent deadly opioids from entering the brain", "lang": "en", "keywords": "fentanyl, vaccine, opioid, epidemic, brain, relapse, prevention, overdoses, OUD,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/fentanyl-vaccine-potential-game-changer-opioid-epidemic", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Fentanyl vaccine potential 'game changer' for opioid epidemic", "cleaned_text": "A research team led by the University of Houston has developed a vaccine targeting the dangerous synthetic opioid fentanyl that could block its ability to enter the brain, thus eliminating the drug's \"high.\" The breakthrough discovery could have major implications for the nation's opioid epidemic by becoming a relapse prevention agent for people trying to quit using opioids. While research reveals Opioid Use Disorder (OUD) is treatable, an estimated 80% of those dependent on the drug suffer a relapse.\n\nThe findings, published in the journal Pharmaceutics, could not be timelier or more in demand: Over 150 people die every day from overdoses of synthetic opioids including fentanyl, which is 50 times stronger than heroin and 100 times stronger than morphine. Consumption of about 2 milligrams of fentanyl (the size of two grains of rice) is likely to be fatal depending on a person's size.\n\n\"We believe these findings could have a significant impact on a very serious problem plaguing society for years -- opioid misuse. Our vaccine is able to generate anti-fentanyl antibodies that bind to the consumed fentanyl and prevent it from entering the brain, allowing it to be eliminated out of the body via the kidneys. Thus, the individual will not feel the euphoric effects and can 'get back on the wagon' to sobriety,\" said the study's lead author Colin Haile, a research associate professor of psychology at UH and the Texas Institute for Measurement, Evaluation and Statistics (TIMES), and a founding member of the UH Drug Discovery Institute.\n\nIn another positive finding, the vaccine did not cause any adverse side effects in the immunized rats involved in lab studies. The team plans to start manufacturing clinical-grade vaccine in the coming months with clinical trials in humans planned soon.\n\nFentanyl is an especially dangerous threat because it is often added to street drugs like cocaine, methamphetamine and other opioids, such as oxycodone and hydrocodone/acetaminophen pills, and even to counterfeit benzodiazepines like Xanax. These counterfeit drugs laced with fentanyl add to the amount of fentanyl overdoses in individuals who do not ordinarily consume opioids.\n\n\"The anti-fentanyl antibodies were specific to fentanyl and a fentanyl derivative and did not cross-react with other opioids, such as morphine. That means a vaccinated person would still be able to be treated for pain relief with other opioids,\" said Haile.\n\nThe vaccine tested contains an adjuvant derived from E. coli named dmLT. An adjuvant molecule boosts the immune system's response to vaccines, a critical component for the effectiveness of anti-addiction vaccines. The adjuvant was developed by collaborators at the Tulane University School of Medicine and has proven vital to the efficacy of the vaccine. Also on the team are Greg Cuny, Joseph P. & Shirley Shipman Buckley Endowed Professor of Drug Discovery at the UH College of Pharmacy along with researchers from Baylor College of Medicine and Michael E. DeBakey Veteran's Affairs Medical Center.\n\nCurrent treatments for OUD are methadone, buprenorphine and naltrexone, and their effectiveness depends upon formulation, compliance, access to medications and the specific misused opioid.\n\nTherese Kosten, professor of psychology and director of the Developmental, Cognitive & Behavioral Neuroscience program at UH, calls the new vaccine a potential \"game changer.\"\n\n\"Fentanyl use and overdose is a particular treatment challenge that is not adequately addressed with current medications because of its pharmacodynamics and managing acute overdose with the short-acting naloxone is not appropriately effective as multiple doses of naloxone are often needed to reverse fentanyl's fatal effects,\" said Kosten, senior author of the study.\n\nThe study was funded by the Department of Defense through the Alcohol and Substance Abuse Disorders Program managed by RTI International's Pharmacotherapies for Alcohol and Substance Use Disorders Alliance, which has funded Haile's lab for several years to develop the anti-fentanyl vaccine.", "opengraph": {"locale": "en_US", "type": "article", "title": "Fentanyl vaccine potential 'game changer' for opioid epidemic", "description": "\n\nA research team led by the University of Houston has developed a vaccine targeting the dangerous synthetic opioid fentanyl that could block its ability to enter the brain, thus eliminating the drug's \"high.\" The breakthrough discovery could have major implications for the nation's opioid epidemic by becoming a relapse prevention agent for people trying to quit using opioids. While research reveals Opioid Use Disorder (OUD) is treatable, an estimated 80% of those dependent on the drug suffer a relapse.", "url": "https://www.worldhealth.net/news/fentanyl-vaccine-potential-game-changer-opioid-epidemic", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_197101734.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.mdpi.com/1999-4923/14/11/2290/htm"], "authors": [], "publish_date": null}