{"result_id": "348045", "URL": "https://www.worldhealth.net/news/experimental-mrna-hiv-vaccine-shows-promise-animals/", "timestamp": "2023-04-25 18:16:17 CEST+0200", "meta": {"description": "An experimental HIV vaccine based on mRNA shows promise in mice and non-human primates, according to scientists at  NIAID.", "lang": "en", "keywords": "vaccine, HIV, mRNA, antibodies, immune response,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/experimental-mrna-hiv-vaccine-shows-promise-animals", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Experimental mRNA HIV Vaccine Shows Promise In Animals", "cleaned_text": "An experimental HIV vaccine based on mRNA -- the same platform technology used in two COVID-19 vaccines -- shows promise in mice and non-human primates, according to scientists at the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health. Their results, published in Nature Medicine, suggest that the novel vaccine was safe and prompted desired antibody and cellular immune responses against an HIV-like virus. Rhesus macaques receiving a priming vaccine followed by multiple booster inoculations had a 79% lower per-exposure risk of infection by simian-human immunodeficiency virus (SHIV) compared to unvaccinated animals. The research was led by Paolo Lusso, M.D., Ph.D., of NIAID's Laboratory of Immunoregulation, in collaboration with other NIAID scientists, investigators from Moderna, Inc. and colleagues at other institutions.\n\n\"Despite nearly four decades of effort by the global research community, an effective vaccine to prevent HIV remains an elusive goal,\" said NIAID Director Anthony S. Fauci, M.D., chief of the Laboratory and a paper co-author. \"This experimental mRNA vaccine combines several features that may overcome shortcomings of other experimental HIV vaccines and thus represents a promising approach.\"\n\nThe experimental vaccine works like mRNA COVID-19 vaccines. However, instead of carrying mRNA instructions for the coronavirus spike protein, the vaccine delivers coded instructions for making two key HIV proteins, Env and Gag. Muscle cells in an inoculated animal assemble these two proteins to produce virus-like particles (VLPs) studded with numerous copies of Env on their surface. Although they cannot cause infection or disease because they lack the complete genetic code of HIV, these VLPs match whole, infectious HIV in terms of stimulating suitable immune responses.\n\nIn studies with mice, two injections of the VLP-forming mRNA vaccine-induced neutralizing antibodies in all animals, the investigators report. The Env proteins produced in the mice from the mRNA instructions closely resembled those in the whole virus, an improvement over previous experimental HIV vaccines. \"The display of multiple copies of authentic HIV envelope protein on each VLP is one of the special features of our platform that closely mimics natural infection and may have played a role in eliciting the desired immune responses,\" said Dr. Lusso.\n\nThe team then tested the Env-Gag VLP mRNA vaccine in macaques. The details of the vaccine regimen differed among subgroups of vaccinated animals but involved priming the immune system with a vaccine modified to optimize antibody creation. The prime was followed by multiple booster inoculations delivered over the course of a year. The boost vaccines contained Gag mRNA and Env mRNA from two HIV clades other than the one used in the prime vaccine. The investigators used multiple virus variants to preferentially activate antibodies against the more conserved \"shared\" regions of the Env -- the target of broadly neutralizing antibodies -- rather than the more variable regions that differ in each virus strain.\n\nAlthough the doses of mRNA delivered were high, the vaccine was well-tolerated and produced only mild, temporary adverse effects in the macaques, such as loss of appetite. By week 58, all vaccinated macaques had developed measurable levels of neutralizing antibodies directed against most strains in a test panel of 12 diverse HIV strains. In addition to neutralizing antibodies, the VLP mRNA vaccine also induced a robust helper T-cell response.\n\nBeginning at week 60, immunized animals and a control group of unimmunized macaques were exposed weekly, via the rectal mucosa, to SHIV. Because non-human primates are not susceptible to HIV-1, scientists use a chimeric SHIV in experimental settings because that virus replicates in macaques. After 13 weekly inoculations, two out of seven immunized macaques remained uninfected. The other immunized animals had an overall delay in infection, which occurred, on average, after eight weeks. In contrast, unimmunized animals became infected on average after three weeks.\n\n\"We are now refining our vaccine protocol to improve the quality and quantity of the VLPs produced. This may further increase vaccine efficacy and thus lower the number of prime and boost inoculations needed to produce a robust immune response. If confirmed safe and effective, we plan to conduct a Phase 1 trial of this vaccine platform in healthy adult volunteers,\" said Dr. Lusso.", "opengraph": {"locale": "en_US", "type": "article", "title": "Experimental mRNA HIV Vaccine Shows Promise In Animals", "description": "\nImage: Scanning electromicrograph of an HIV-infected H9 T cell. Image Credit: NIAID\nAn experimental HIV vaccine based on mRNA -- the same platform technology used in two COVID-19 vaccines -- shows promise in mice and non-human primates, according to scientists at the National Institute of Allergy and Infectious Diseases (NIAID), part of the National Institutes of Health. Their results, published in Nature Medicine, suggest that the novel vaccine was safe and prompted desired antibody and cellular immune responses against an HIV-like virus. Rhesus macaques receiving a priming vaccine followed by multiple booster inoculations had a 79% lower per-exposure risk of infection by simian-human immunodeficiency virus (SHIV) compared to unvaccinated animals. The research was led by Paolo Lusso, M.D., Ph.D., of NIAID's Laboratory of Immunoregulation, in collaboration with other NIAID scientists, investigators from Moderna, Inc. and colleagues at other institutions.", "url": "https://www.worldhealth.net/news/experimental-mrna-hiv-vaccine-shows-promise-animals", "image": "https://www.worldhealth.net/media/original_images/HIV_infected_H9_T_cell_credit_NIAID.jpg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}