{"result_id": "348012", "URL": "https://www.worldhealth.net/news/why-everyone-was-wrong/", "timestamp": "2023-04-25 18:15:53 CEST+0200", "meta": {"description": "This is an opinion piece written by Beda M Stadler originally posted in the Swiss magazine Weltwoche.", "lang": "en", "keywords": "COVID-19, testing, immune, vaccine, diagnostics, novel, models, Beda M Stadler", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/why-everyone-was-wrong", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Why Everyone Was Wrong", "cleaned_text": "Note: The original article was published in the Swiss magazine Weltwoche (World Week) on June 10th. The author, Beda M Stadler is the former director of the Institute for Immunology at the University of Bern, a biologist and professor emeritus. Stadler is an important medical professional in Switzerland, he also likes to use provoking language, which should not deter you from the points he makes.\n\nThis article is about Switzerland and it does not suggest that the situation is exactly the same globally. I suggest to read to the end, because Stadler makes crucial points about testing for Sars-CoV-2. This is an opinion piece adopted from Medium.com and it does not necessarily reflect that of WHN, this is merely a look at the current situation via a perspective/outlook different from what is being portrayed in the media. Regardless of whether it is correct or not, it does make some good points, and it is, at the very least, a thought provoking interesting read.\n\nCoronavirus: Why everyone was wrong\n\n~The coronavirus is slowly retreating. What actually happened in the past few weeks? The experts have missed basic connections. The immune response against the virus is much stronger than we thought.\n\nThis is not an accusation, but a ruthless taking stock [of the current situation]. I could slap myself, because I looked at Sars-CoV2- way too long with panic. I am also somewhat annoyed with many of my immunology colleagues who so far have left the discussion about Covid-19 to virologists and epidemiologists. I feel it is time to criticize some of the main and completely wrong public statements about this virus.\n\nFirstly, it was wrong to claim that this virus was novel. Secondly, It was even more wrong to claim that the population would not already have some immunity against this virus. Thirdly, it was the crowning of stupidity to claim that someone could have Covid-19 without any symptoms at all or even to pass the disease along without showing any symptoms whatsoever.\n\nBut let’s look at this one by one.\n\nAt the end of 2019 a coronavirus, which was considered novel, was detected in China. When the gene sequence, i.e. the blueprint of this virus, was identified and was given a similar name to the 2002 identified Sars, i.e. Sars-CoV-2, we should have already asked ourselves then how far [this virus] is related to other coronaviri, which can make human beings sick. But no, instead we discussed from which animal as part of a Chinese menu the virus might have sprung. In the meantime, however, many more people believe the Chinese were so stupid as to release this virus upon themselves in their own country. Now that we’re talking about developing a vaccine against the virus, we suddenly see studies which show that this so-called novel virus is very strongly related to Sars-1 as well as other beta-coronaviri which make us suffer every year in the form of a colds. Apart from the pure homologies in the sequence between the various coronaviri which can make people sick, [scientists] currently work on identifying a number of areas on the virus in the same way as human immune cells identify them. This is no longer about the genetic relationship, but about how our immune system sees this virus, i.e. which parts of other coronaviri could potentially be used in a vaccine.\n\nSo: Sars-Cov-2 isn’t all that new, but merely a seasonal cold virus that mutated and disappears in summer, as all cold viri do — which is what we’re observing globally right now. Flu viri mutate significantly more, by the way, and nobody would ever claim that a new flu virus strain was completely novel. Many veterinary doctors were therefore annoyed by this claim of novelty, as they have been vaccinating cats, dogs, pigs, and cows for years against coronaviri.\n\n2. The fairy tale of no immunity\n\nFrom the World Health Organisation (WHO) to every Facebook-virologist, everyone claimed this virus was particularly dangerous, because there was no immunity against it, because it was a novel virus. Even Anthony Fauci, the most important advisor to the Trump administration noted at the beginning at every public appearance that the danger of the virus lay in the fact that there was no immunity against it. Tony and I often sat next to each other at immunology seminars at the National Institute of Health in Bethesda in the US, because we worked in related fields back then. So for a while I was pretty uncritical of his statements, since he was a respectable colleague of mine. The penny dropped only when I realized that the first commercially available antibody test [for Sars-CoV-2] was put together from an old antibody test that was meant to detect Sars-1. This kind of test evaluates if there are antibodies in someone’s blood and if they came about through an early fight against the virus. [Scientists] even extracted antibodies from a Lama that would detect Sars-1, Sars-CoV-2, and even the Mers virus. It also became known that Sars-CoV-2 had a less significant impact in areas in China where Sars-1 had previously raged. This is clear evidence urgently suggesting that our immune system considers Sars-1 and Sars-Cov-2 at least partially identical and that one virus could probably protect us from the other.\n\nThat’s when I realized that the entire world simply claimed that there was no immunity, but in reality, nobody had a test ready to prove such a statement. That wasn’t science, but pure speculation based on a gut feeling that was then parroted by everyone. To this day there isn’t a single antibody test that can describe all possible immunological situations, such as: if someone is immune, since when, what the neutralizing antibodies are targeting and how many structures exist on other coronaviri that can equally lead to immunity.\n\nIn mid-April work was published by the group of Andreas Thiel at the Charité Berlin. A paper with 30 authors, amongst them the virologist Christian Drosten. It showed that in 34% of people in Berlin who had never been in contact with the Sars-CoV-2 virus showed nonetheless T-cell immunity against it (T-cell immunity is a different kind of immune reaction, see below). This means that our T-cells, i.e. white blood cells, detect common structures appearing on Sars-CoV-2 and regular cold viri and therefore combat both of them.\n\nA study by John P A Ioannidis of Stanford University — according to the Einstein Foundation in Berlin one of the world’s ten most cited scientists — showed that immunity against Sars-Cov-2, measured in the form of antibodies, is much higher than previously thought. Ioannidis is certainly not a conspiracy theorist who just wants to swim against the stream; nonetheless he is now being criticized, because the antibody tests used were not extremely precise. With that, his critics admit that they do not have such tests yet. And aside, John P A Ioannidis is such a scientific heavy-weight that all German virologists combined are light-weight in comparison.\n\nEpidemiologists also fell for the myth that there was no immunity in the population. They also didn’t want to believe that coronaviri were seasonal cold viri that would disappear in summer. Otherwise their curve models would have looked differently. When the initial worst case scenarios didn’t come true anywhere, some now still cling to models predicting a second wave. Let’s leave them their hopes — I’ve never seen a scientific branch that manoeuvred itself so much into the offside. I have also not yet understood why epidemiologists were so much more interested in the number of deaths, rather than in the numbers that could be saved.\n\nAs an immunologist I trust a biological model, namely that of the human organism, which has built a tried and tested, adaptive immune system. At the end of February, driving home from the recording of [a Swiss political TV debate show], I mentioned to Daniel Koch [former head of the Swiss federal section “Communicable Diseases” of the Federal Office of Public Health] that I suspected there was a general immunity in the population against Sars-Cov-2. He argued against my view. I later defended him anyway, when he said that children were not a driving factor in the spread of the pandemic. He suspected that children didn’t have a receptor for the virus, which is of course nonsense. Still, we had to admit that his observations were correct. But the fact that every scientist attacked him afterwards and asked for studies to prove his point, was somewhat ironic. Nobody asked for studies to prove that people in certain at-risk groups were dying. When the first statistics from China and later worldwide data showed the same trend, that is to say that almost no children under ten years old got sick, everyone should have made the argument that children clearly have to be immune. For every other disease that doesn’t afflict a certain group of people, we would come to the conclusion that that group is immune. When people are sadly dying in a retirement home, but in the same place other pensioners with the same risk factors are left entirely unharmed, we should also conclude that they were presumably immune.\n\nBut this common sense seems to have eluded many, let’s call them “immunity deniers” just for fun. This new breed of deniers had to observe that the majority of people who tested positive for this virus, i.e. the virus was present in their throats, did not get sick. The term “silent carriers” was conjured out of a hat and it was claimed that one could be sick without having symptoms. Wouldn’t that be something! If this principle from now on gets naturalized into the realm of medicine, health insurers would really have a problem, but also teachers whose students could now claim to have whatever disease to skip school, if at the end of the day one didn’t need symptoms anymore to be sick.\n\nThe next joke that some virologists shared was the claim that those who were sick without symptoms could still spread the virus to other people. The “healthy” sick would have so much of the virus in their throats that a normal conversation between two people would be enough for the “healthy one” to infect the other healthy one. At this point we have to dissect what is happening here: If a virus is growing anywhere in the body, also in the throat, it means that human cells decease. When [human] cells decease, the immune system is alerted immediately and an infection is caused. One of five cardinal symptoms of an infection is pain. It is understandable that those afflicted by Covid-19 might not remember that initial scratchy throat and then go on to claim that they didn’t have any symptoms just a few days ago. But for doctors and virologists to twist this into a story of “healthy” sick people, which stokes panic and was often given as a reason for stricter lock down measures, just shows how bad the joke really is. At least the WHO didn’t accept the claim of asymptomatic infections and even challenged this claim on its website.\n\nHere is a succinct and brief summary, especially for the immunity deniers, of how humans are attacked by germs and how we react to them: If there are pathogenic viri in our environment, then all humans — whether immune or not — are attacked by this virus. If someone is immune, the battle with the virus begins. First we try to prevent the virus from binding to our own cells with the help of antibodies. This normally works only partially, not all are blocked and some viri will attach to the appropriate cells. That doesn’t need to lead to symptoms, but it’s also not a disease. Because the second guard of the immune system is now called into action. That’s the above mentioned T-cells, white blood cells, which can determine from the outside in which other cells the virus is now hiding to multiply. These cells, which are now incubating the virus, are searched throughout the entire body and killed by the T-cells until the last virus is dead.\n\nSo if we do a PCR corona test on an immune person, it is not a virus that is detected, but a small shattered part of the viral genome. The test comes back positive for as long as there are tiny shattered parts of the virus left. Correct: Even if the infectious viri are long dead, a corona test can come back positive, because the PCR method multiplies even a tiny fraction of the viral genetic material enough [to be detected]. That’s exactly what happened, when there was the global news, even shared by the WHO, that 200 Koreans who already went through Covid-19 were infected a second time and that there was therefore probably no immunity against this virus. The explanation of what really happened and an apology came only later, when it was clear that the immune Koreans were perfectly healthy and only had a short battle with the virus. The crux was that the virus debris registered with the overly sensitive test and therefore came back as “positive”. It is likely that a large number of the daily reported infection numbers are purely due to viral debris.\n\nThe PCR test with its extreme sensitivity was initially perfect to find out where the virus could be. But this test can not identify whether the virus is still alive, i.e. still infectious. Unfortunately, this also led some virologists to equate the strength of a test result with viral load, i.e. the amount of virus someone can breathe out. Luckily, our day care centres stayed open nonetheless. Since German virologists missed that part, because, out of principle, they do not look at what other countries are doing, even if other countries’ case numbers are falling more rapidly.\n\nWhat does this all mean in real life? The extremely long incubation time of two to 14 days — and reports of 22 to 27 days — should wake up any immunologist. As well as the claim that most patients would no longer secrete the virus after five days. Both [claims] in turn actually lead to the conclusion that there is — sort of in the background — a base immunity that contorts the events, compared to an expected cycle [of a viral infection] — i.e. leads to a long incubation period and quick immunity. This immunity also seems to be the problem for patients with a severe course of the disease. Our antibody titre, i.e. the accuracy of our defense system, is reduced the older we get. But also people with a bad diet or who are malnourished may have a weakened immune system, which is why this virus does not only reveal the medical problems of a country, but also social issues.\n\nIf an infected person does not have enough antibodies, i.e. a weak immune response, the virus slowly spreads out across the entire body. Now that there are not enough antibodies, there is only the second, supporting leg of our immune response left: The T-cells begin to attack the virus-infested cells all over the body. This can lead to an exaggerated immune response, basically to a massive slaughter; this is called a Cytokine Storm. Very rarely this can also happen in small children, in that case called Kawasaki Syndrome. This very rare occurrence in children was also used in our country to stoke panic. It’s interesting, however, that this syndrome is very easily cured. The [affected] children get antibodies from healthy blood donors, i.e. people who went through coronavirus colds. This means that the hushed-up [supposedly non-existent] immunity in the population is in fact used therapeutically.\n\nThe virus is gone for now. It will probably come back in winter, but it won’t be a second wave, but just a cold. Those young and healthy people who currently walk around with a mask on their faces would be better off wearing a helmet instead, because the risk of something falling on their head is greater than that of getting a serious case of Covid-19.\n\nIf we observe a significant rise in infections in 14 days [after the Swiss relaxed the lock down], we’d at least know that one of the measures was useful. Other than that I recommend reading John P A Ioannidis’ latest work in which he describes the global situation based on data on May 1st 2020: People below 65 years old make up only 0.6 to 2.6 % of all fatal Covid cases. To get on top of the pandemic, we need a strategy merely concentrating on the protection of at-risk people over 65. If that’s the opinion of a top expert, a second lock down is simply a no-go.\n\nOn our way back to normal, it would be good for us citizens if a few scaremongers apologized. Such as doctors who wanted a triage of over 80 year old Covid patients in order to stop ventilating them. Also the media that kept showing alarmist videos of Italian hospitals to illustrate a situation that as such didn’t exist. All politicians calling for “testing, testing, testing” without even knowing what the test actually measures. And the federal government for an app they’ll never get to work and will warn me if someone near me is positive, even if they’re not infectious.\n\nIn winter, when the flu and other colds make the rounds again, we can then go back to kissing each other a little less, and we should wash our hands even without a virus present. And people who’ll get sick nonetheless can then don their masks to show others what they have learned from this pandemic. And if we still haven’t learned to protect our at-risk groups, we’ll have to wait for a vaccine that will hopefully also be effective in at-risk people.", "opengraph": {"locale": "en_US", "type": "article", "title": "Why Everyone Was Wrong", "description": "\n\nNote: The original article was published in the Swiss magazine Weltwoche (World Week) on June 10th. The author, Beda M Stadler is the former director of the Institute for Immunology at the University of Bern, a biologist and professor emeritus. Stadler is an important medical professional in Switzerland, he also likes to use provoking language, which should not deter you from the points he makes.", "url": "https://www.worldhealth.net/news/why-everyone-was-wrong", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_104809311.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}