{"result_id": "348025", "URL": "https://www.worldhealth.net/news/shingles-associated-increased-risk-stroke-heart-attack", "timestamp": "2023-04-25 18:16:03 CEST+0200", "meta": {"description": "“Our findings suggest there are long-term implications of shingles and highlight the importance of public health efforts for prevention,”", "lang": "en", "keywords": "inflammation, rash, shingles, stroke, heart, attack, cardiovascular, myocardial infarction, postherapetic neuralgia, immunity, chickenpox, varicella zoster, virus, vaccination,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/shingles-associated-increased-risk-stroke-heart-attack", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Shingles Associated with Increased Risk for Stroke, Heart Attack", "cleaned_text": "According to a press release, a new study by investigators from Brigham and Women’s Hospital, a founding member of the Mass General Brigham healthcare system, demonstrated that shingles, also known as herpes zoster, is associated with an almost 30% higher long-term risk of a major cardiovascular event such a stroke or heart attack. Their results are published in the Journal of the American Heart Association.\n\n“Our findings suggest there are long-term implications of shingles and highlight the importance of public health efforts for prevention,” said lead author Sharon Curhan, MD, ScM, a physician and epidemiologist in the Channing Division of Network Medicine at Brigham and Women’s Hospital. “Given the growing number of Americans at risk for this painful and often disabling disease and the availability of an effective vaccine, shingles vaccination could provide a valuable opportunity to reduce the burden of shingles and reduce the risk of subsequent cardiovascular complications.”\n\nShingles often cause a painful rash and can occur anywhere on the head or body. Shingles is caused by the varicella-zoster virus, the same virus that causes chickenpox. After a person has chickenpox, the virus stays in their body for the rest of their life. Years and even decades later, the virus may reactivate as shingles. Almost all individuals aged 50 years and older in the US have been infected with the chicken pox virus and are therefore at risk for shingles.\n\nApproximately 1 in 3 individuals will develop shingles in their lifetime, with more cases projected as the population ages and more people have compromised immunity due to disease or medication use.\n\nThe most common complication from shingles is postherpetic neuralgia. This condition affects nerve fibers and skin, causing burning pain that lasts long after the rash and blisters of shingles disappear. However, a growing body of evidence suggests that reactivation of the virus may have even longer-lasting side effects. The virus may play a role in the development of cardiovascular disorders, including stroke and coronary artery disease. The virus has been detected in large and small blood vessels, which over time can cause inflammation as well as chronic vascular changes. These changes can increase the risk of blockages in the blood vessels, restricted blood flow, and cardiovascular events such as strokes and heart attacks.\n\nThe prospective, longitudinal study followed three large U.S. cohorts of more than 200,000 women and men: the Nurses’ Health Study (~79,000 women), the Nurses’ Health Study II (~94,000 women), and the Health Professionals' Follow-Up Study (~31,000 men). Participants did not have a prior history of stroke or coronary heart disease. The team collected information on shingles, stroke, and coronary heart disease using questionnaires collected every two years and confirmed the diagnoses with a medical record review. The team followed the participants for up to 16 years and evaluated whether those who had developed shingles were at higher risk for stroke or coronary heart disease years after the shingles episode.\n\nThe researchers tracked incidences of stroke and coronary heart disease—defined as having a non-fatal or fatal myocardial infarction (heart attack) or a coronary revascularization procedure (CABG, coronary artery bypass graft or percutaneous transluminal coronary angioplasty). Researchers also evaluated a combined outcome of cardiovascular disease, which included either stroke or coronary heart disease, whichever came first.\n\nThe results showed that people who had previously developed shingles were at 30% higher long-term risk of a major cardiovascular event compared with those who had not had shingles, and the elevated risk may persist for 12 years or more after having shingles.\n\nDue to timing, much of the study took place in the period before the shingles vaccines became widely available. Even after their introduction, the uptake of vaccination has been generally low. Because of these limitations, researchers were not able to evaluate whether vaccination status may influence the association between shingles and the long-term risk of a major cardiovascular event.\n\nAs more people choose to receive the shingles vaccine, future studies could examine whether vaccination influences the relationship between shingles and the risk of cardiovascular disease. Curhan adds, “We are currently collecting vaccination information among our participants and hope to conduct these studies in the future.”\n\nSources of Funding: This study was supported by GlaxoSmithKline Biologicals SA Supported Studies Programme Protocol 216148. The NHS (Nurses' Health Study), NHS II (Nurses' Health Study II), and HPFS (Health Professionals Follow-Up Study) cohorts are supported by the following National Institutes of Health grants: R01 HL35464, UM1 CA186107, R01 HL034594, R01 HL088521, U01 CA176726, and U01 CA167552.", "opengraph": {"locale": "en_US", "type": "article", "title": "Shingles Associated with Increased Risk for Stroke, Heart Attack", "description": "\n\nAccording to a press release, a new study by investigators from Brigham and Women’s Hospital, a founding member of the Mass General Brigham healthcare system, demonstrated that shingles, also known as herpes zoster, is associated with an almost 30% higher long-term risk of a major cardiovascular event such a stroke or heart attack. Their results are published in the Journal of the American Heart Association.", "url": "https://www.worldhealth.net/news/shingles-associated-increased-risk-stroke-heart-attack", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_22369160.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.brighamandwomens.org/research/departments/channing-division-of-network-medicine/overview"], "authors": [], "publish_date": null}