{"result_id": "348003", "URL": "https://worldhealth.net/news/johnson-johnson-vaccine-trial-paused-due-unexplained-illness/", "timestamp": "2023-04-25 18:15:41 CEST+0200", "meta": {"description": "Johnson & Johnson COVID-19 vaccine trials have become the second candidate paused due to the occurrence of an unexplained illness", "lang": "en", "keywords": "vaccine, unexplained illness, autoimmune, COVID-19, transverse myelitis, Johnson & Johnson, trial,", "favicon": "/static/images/favicon.ico", "canonical": "https://worldhealth.net/news/johnson-johnson-vaccine-trial-paused-due-unexplained-illness", "encoding": "UTF-8"}, "image": null, "domain": "worldhealth.net", "title": "Johnson & Johnson Vaccine Trial Paused Due To “Unexplained Illness”", "cleaned_text": "Johnson & Johnson COVID-19 vaccine trials have become the second candidate hopeful being paused due to the occurrence of an unexplained illness during the trials.\n\nThis is the Phase 3, 60,000 participant late-stage trial in multiple countries testing the safety and efficacy of a single dose vs a placebo that has been put on hold and enrollment is also halted citing an unexplained illness in the trial; a two-dose regimen is being tested in a separate trial.\n\nAccording to the company, such pauses are not uncommon in clinical trials, and they said that there would be a careful review of all of the medical information before deciding how to proceed or whether to restart the study.\n\n\"Adverse events — illnesses, accidents, etc. — even those that are serious, are an expected part of any clinical study, especially large studies,\" the company said.\n\n\"We know very little at this point, and it will be a few days at minimum for the right set of information to be gathered and evaluated,\" said Mathai Mammen who leads global research and development at Janssen. Details about the nature of the illness were not provided nor whether it was a placebo or vaccine participant.\n\nWithin America alone there are at least 7 coronavirus drug candidates being tested, with at least 4 moving to late-stage trials. This is not the first time a COVID-19 vaccine trial has been put on hold as recently a vaccine hopeful viral, AstraZeneca, also had to pause their late-stage trials after experiencing an “unexplained illness” (seemingly triggering an autoimmune response: Transverse Myelitis). Since then regulators in the UK, Brazil, India, and South Africa have allowed the trials to resume, however, in America the FDA is keeping the trials on hold while the agency widens its investigation in the best interest of public health and safety.", "opengraph": {"locale": "en_US", "type": "article", "title": "Johnson & Johnson Vaccine Trial Paused Due To “Unexplained Illness”", "description": "\n\nJohnson &amp; Johnson COVID-19 vaccine trials have become the second candidate hopeful being paused due to the occurrence of an unexplained illness during the trials.", "url": "https://worldhealth.net/news/johnson-johnson-vaccine-trial-paused-due-unexplained-illness", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_80034052.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}