{"result_id": "348041", "URL": "https://www.worldhealth.net/news/whooping-cough-recognize-and-prevent-serious-illness", "timestamp": "2023-04-25 18:16:14 CEST+0200", "meta": {"description": "Pertussis is caused by bacteria that infect the lungs and airways. Coughing when infected creates airborne droplets of bacteria that can infect others", "lang": "en", "keywords": "whooping cough, illness, respiratory, pertussis, death, vaccine, lungs, bacteria, infection,", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/whooping-cough-recognize-and-prevent-serious-illness", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Whooping Cough: Recognize and Prevent This Serious Illness", "cleaned_text": "Whooping cough, also known as pertussis, is a serious respiratory disease that easily spreads between people. It can cause rapid and strong coughing fits that may be followed by a “whooping” sound as the person tries to breathe in. Pertussis can affect people of all ages. But babies less than a year old are especially at risk.\n\nPertussis was once a leading cause of childhood death. But a vaccine developed in the 1940s led to a dramatic drop in cases worldwide. Still, outbreaks of pertussis occur in the U.S. That’s because the current vaccine’s protection can gradually wane. So, it’s important to know how to recognize the signs of pertussis, and make sure that you and your loved ones are properly vaccinated.\n\nPertussis is caused by bacteria that infect the lungs and airways. Coughing when infected with pertussis creates airborne droplets of bacteria that can infect others.\n\nThe illness usually begins with mild symptoms, like sneezing and gentle coughs. A week or two later, a severe coughing phase begins. This phase can last for many weeks.\n\n“Pertussis is sometimes called the 100-day cough. The illness can last that long,” says Dr. Kathryn M. Edwards, a pediatrician and vaccine researcher at Vanderbilt University.\n\nCoughing spells in children can be so severe that they’re unable to eat. “They can stop breathing because of the cough, and it can cause strain on the heart and the lungs,” she adds.\n\nThe recovery phase may last weeks or more. And, the severe coughing spells can return if the person gets another respiratory disease, even months later.\n\nInfants under 2 months old are too young to be vaccinated against pertussis. But studies have shown that you can protect newborns by getting the vaccine during pregnancy. The vaccine boosts pertussis-fighting antibodies. These get transferred through the placenta to the baby.\n\n“The vaccine protects the mother against getting whooping cough and also protects the newborn baby,” Edwards says.\n\nToday’s pertussis vaccine is given as part of a combination vaccine. The one given to babies is called DTaP, for diphtheria, tetanus, and pertussis. The booster shot for older children and adults is called Tdap. It has a lower dose of the diphtheria and pertussis components.\n\nSince 1997, all pertussis vaccines in the U.S. are “acellular” vaccines. That means they’re made of pieces of pertussis bacteria. This type of vaccine has fewer side effects than the original vaccine, which was made of the whole, killed bacteria. But researchers have found that the acellular vaccine’s protection fades more quickly than the original whole-cell vaccine.\n\nResearchers are looking for ways to improve the current vaccine. But, Edwards says, “when the current vaccines are given as recommended, they markedly reduced pertussis disease.\"\n\nVaccines are the best way to protect against pertussis (whooping cough). CDC’s vaccine recommendations are based on a person’s age:\n• None Babies and children should get five shots of the DTaP vaccine between ages 2 months and 6 years.\n• None Older children should get one shot of the Tdap booster between ages 11 and 12 years.Pregnant people should get Tdap during the 3rd trimester of each pregnancy. This helps protect newborns before they’re able to get their own vaccinations, starting at the age of 2 months.\n• None All adults who never received Tdap should get one. Adults should also get a booster of diphtheria and tetanus (Td) or Tdap every 10 years.\n• None Ask your health care provider if you have questions about when you or your children should get the DTaP or Tdap vaccine. To learn more, visit the\n\nAdapted from the U.S. Centers for Disease Control and Prevention", "opengraph": {"locale": "en_US", "type": "article", "title": "Whooping Cough: Recognize and Prevent This Serious Illness", "description": "\n\nWhooping cough, also known as pertussis, is a serious respiratory disease that easily spreads between people. It can cause rapid and strong coughing fits that may be followed by a “whooping” sound as the person tries to breathe in. Pertussis can affect people of all ages. But babies less than a year old are especially at risk.\nPertussis was once a leading cause of childhood death. But a vaccine developed in the 1940s led to a dramatic drop in cases worldwide. Still, outbreaks of pertussis occur in the U.S. That’s because the current vaccine’s protection can gradually wane. So, it’s important to know how to recognize the signs of pertussis, and make sure that you and your loved ones are properly vaccinated.", "url": "https://www.worldhealth.net/news/whooping-cough-recognize-and-prevent-serious-illness", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_109196479.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.cdc.gov/vaccines/vpd/dtap-tdap-td/public/"], "authors": [], "publish_date": null}