{"result_id": "348024", "URL": "https://www.worldhealth.net/news/molecular_mechanism_of_a_diabetes_vaccin", "timestamp": "2023-04-25 18:16:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/molecular_mechanism_of_a_diabetes_vaccin", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "Molecular Mechanism Of A Diabetes Vaccine Revealed", "cleaned_text": "A team of researchers led by Prof. Irun Cohen of the Weizmann Institute of Science Immunology Department has revealed the molecular mechanism of a vaccine for Type 1 diabetes. The new findings should help amplify the effectiveness of the vaccine, which is currently in advanced stages of clinical trials.\n\nSeveral years ago, Prof. Cohen and colleagues developed a vaccine that arrests the progression of Type 1 diabetes in laboratory animals. They had discovered that a particular protein called HSP60, or even only a small particular fragment of it – the peptide designated p277 – is able to shut down the autoimmune response causing this disorder. The vaccine is currently being tested in clinical trials in Europe and the United States, but its precise mechanism has until now been unknown.\n\n\"When translating these findings into a practical vaccine, we knew enough about the mechanism to understand that this protein is able to cause a decrease in the immune response, but how it actually works eluded us,\" says Cohen. In a paper published in the Journal of Clinical Investigation, the scientists have managed to identify the exact immune cells that p277 acts upon and its mechanism of action.\n\nAutoimmune diseases occur when certain T cells in the immune system attack the body's own cells and tissues. The scientists discovered that p277 directs the activity of the immune system in two ways. First, the p277 peptide steps up the activities of a different type of T cell that regulates the amount of potentially harmful T cells available. In addition, T cells treated with p277 cause the delinquent T cells to secrete anti-inflammatory substances instead of the inflammation-causing ones that they usually make which lead to autoimmune disease. This double action of the peptide weakens the damaging activities of the immune response further. The scientists also showed that in order to activate this response, p277 must be bound to the receptor TLR-2, which is found on the cell walls of the regulatory T cells.\n\n\"These findings are important, as it means that by identifying the molecular activity of p277 with such precision, we can copy nature's own system in regulating the immune system and therefore, help to boost the immune system in preventing the destruction of insulin-producing pancreatic cells,\" says Cohen.\n\nPostdoctoral fellow Dr. Alexandra Zanin-Zhorov spearheaded the project; the other scientists participating in this study were: the late Prof. Ofer Lider, Dr. Liora Cahalon, postdoctoral fellow Guy Tal, and Raanan Margalit.\n\nProf. Irun Cohen's research is supported by the Minna James Heineman Stiftung; and the Robert Koch Minerva Center for Research in Autoimmune Disease. Prof. Cohen is the incumbent of the Helen and Morris Mauerberger Professorial Chair in Immunology.", "opengraph": {"locale": "en_US", "type": "article", "title": "Molecular Mechanism Of A Diabetes Vaccine Revealed", "description": "A team of researchers led by Prof. Irun Cohen of the Weizmann Institute of Science Immunology Department has revealed the molecular mechanism of a vaccine for Type 1 diabetes. The new findings should help amplify the effectiveness of the vaccine, which is currently in advanced stages of clinical trials.", "url": "https://www.worldhealth.net/news/molecular_mechanism_of_a_diabetes_vaccin", "image": "https://www.worldhealth.net/static/images/whn_logo.png", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.sciencedaily.com/releases/2006/06/060619235743.htm"], "authors": [], "publish_date": null}