{"result_id": "348032", "URL": "https://www.worldhealth.net/news/immune-system-very-complicated-now-its-chip/", "timestamp": "2023-04-25 18:16:08 CEST+0200", "meta": {"description": "Lymphoid follicles formed in a microfluidic Organ Chip replicate human immune functions and vaccine responses in vitro", "lang": "en", "keywords": "immune system, vaccine, plasma, antibodies, lymphoid follicles, organ chip, vitro, cytokine, inflammation, pathogen", "favicon": "/static/images/favicon.ico", "canonical": "https://www.worldhealth.net/news/immune-system-very-complicated-now-its-chip", "encoding": "UTF-8"}, "image": null, "domain": "www.worldhealth.net", "title": "The immune system is very complicated, but now, it's on a chip", "cleaned_text": "To quote veteran science writer Ed Yong's simple yet extremely accurate words in The Atlantic, \"The immune system is very complicated.\" As the COVID-19 pandemic had made abundantly clear, science still doesn't fully understand the sophisticated defense mechanisms that protect us from microbe invaders. Why do some people show no symptoms when infected with SARS-CoV-2 while others suffer from severe fevers and body aches? Why do some succumb to cytokine storms of the body's own making? We still lack exact answers to these questions.\n\nToday's scientists, however, now have a new tool to help them tease out the immune system's mysteries, thanks to a group of researchers at the Wyss Institute for Biologically Inspired Engineering at Harvard University. They cultured human B and T cells inside a microfluidic Organ Chip device and coaxed them to spontaneously form functional lymphoid follicles -- structures that reside in lymph nodes and other parts of the human body which mediate immune responses. They consist of different chambers that harbor \"naïve\" B cells and T cells, which together initiate the cascade of events that leads to a full immune response when they are exposed to a specific antigen.\n\nIn addition to allowing researchers to probe the normal function of the immune system, these lymphoid follicle (LF) Chips can also be used to predict immune responses to various vaccines and help select the best performers, offering significant improvement over existing preclinical models like cells in a dish and non-human primates. The achievement is reported today in Advanced Science.\n\n\"Animals have been the gold-standard research models for developing and testing new vaccines, but their immune systems differ significantly from our own and do not accurately predict how humans will respond to them. Our LF Chip offers a way to model the complex choreography of human immune responses to infection and vaccination, and could significantly speed up the pace and quality of vaccine creation in the future,\" said first author Girija Goyal, Ph.D., a Senior Staff Scientist at the Wyss Institute.\n\nLike many great scientific discoveries, the LF Chip project is the result of serendipity in the lab. Goyal and other Wyss Institute scientists wanted to investigate how B and T cells circulating in the blood would change their behavior once they entered a tissue, so they obtained those cells from human blood samples and cultured them inside a microfluidic Organ Chip device to replicate the physical conditions they would experience when they encountered an organ.\n\nWhen the cells were placed inside one of the two channels within the device, nothing remarkable happened -- but when the researchers started the flow of culture medium through the other channel to feed the cells, they were surprised to see that the B and T cells started to spontaneously self-organize into 3D structures within the Organ Chip that appeared similar to \"germinal centers\" -- structures within LFs where complex immune reactions take place. \"It was so unexpected that we completely pivoted from the original experiment and focused on trying to figure out what they were,\" said Goyal.\n\nWhen the researchers started probing the mysterious structures that had formed inside the Organ Chip under flow conditions, they found that the cells were secreting a chemical called CXCL13. CXCL13 is a hallmark of LF formation, both within lymph nodes and in other parts of the body in response to chronic inflammation, such as in cancer and autoimmune conditions.\n\nThe team also found that B cells within the LFs that self-assembled on-chip also expressed an enzyme called activation-induced cytidine deaminase (AID), which is critical for activating B cells against specific antigens and is not present in B cells that are circulating in the blood.\n\nNeither CXCL13 nor AID were present in cells that were cultured in a standard 2D dish, suggesting that the scientists had indeed successfully created functional LFs from circulating blood cells.\n\nIn LFs in the human body, activated B cells mature and differentiate into multiple types of progeny cells including plasma cells, which secrete large amounts of antibodies against a specific pathogen. The team detected the presence of plasma cells in the LF Chips after they applied several stimuli used in the laboratory to activate B cells, such as the combination of the cytokine IL-4 and an anti-CD40 antibody, or dead bacteria. Remarkably, the plasma cells were concentrated in clusters within the LFs, as they would be in vivo.\n\n\"These findings were especially exciting because they confirmed that we had a functional model that could be used to unravel some of the complexities of the human immune system, including its responses to multiple types of pathogens,\" said Pranav Prabhala, a Technician at the Wyss Institute and second author of the paper.\n\nNow that the scientists had a functional LF model that could initiate an immune response, they explored whether their LF Chip could be used to replicate and study the human immune system's response to vaccines.\n\nIn the human body, vaccination induces special cells called dendritic cells to take up the injected pathogen and migrate to lymph nodes, where they present fragments of them on their surface. There, these antigen-presenting cells activate the B cells with the assistance of local T cells in the LF, causing the B cells to differentiate into plasma cells that produce antibodies against the pathogen. To replicate this process, the researchers added dendritic cells to LF Chips along with B and T cells from four separate human donors. They then inoculated the chips with a vaccine against the H5N1 strain of influenza along with an adjuvant called SWE that is known to boost immune responses to the vaccine.\n\nLF Chips that received the vaccine and the adjuvant produced significantly more plasma cells and anti-influenza antibodies than B and T cells grown in 2D cultures or LF Chips that received the vaccine but not the adjuvant.\n\nThe team then repeated the experiment with cells from eight different donors, this time using the commercially available Fluzone? influenza vaccine, which protects against three different strains of the virus in humans. Once again, plasma cells and anti-influenza antibodies were present in significant numbers in the treated LF Chips. They also measured the levels of four cytokines in the vaccinated LF Chips that are known to be secreted by activated immune cells, and found that the levels of three of them (IFN-?, IL-10, and IL-2) were similar to those found in the serum of humans who had been vaccinated with Fluzone?.\n\nThe Wyss researchers are now using their LF Chips to test various vaccines and adjuvants in collaboration with pharmaceutical companies and the Gates Foundation.\n\n\"The flurry of vaccine development efforts sparked by the COVID-19 pandemic were impressive for their speed, but the increased demand suddenly made traditional animal models scarce resources. The LF Chip offers a cheaper, faster, and more predictive model for studying human immune responses to both infections and vaccines, and we hope it will streamline and improve vaccine development against many diseases in the future,\" said corresponding author Donald Ingber, M.D., Ph.D., who is the Founding Director of the Wyss Institute as well as the Judah Folkman Professor of Vascular Biology at Harvard Medical School (HMS) and Boston Children's Hospital, and Professor of Bioengineering at the Harvard John A. Paulson School of Engineering and Applied Sciences.\n\nAdditional authors of the paper include Yunhao Zhai, Min Sun Kim, Aditya Patil, Danielle Curran, Jaclyn Long, Abidemi Junaid, and Tom Ferrante from the Wyss Institute; Bruce Bausk, Tal Gilboa, Limor Cohen, and David Walt from the Wyss Institute, Brigham and Women's Hospital, and HMS; and former Wyss Institute members Gautam Mahajan, Liangxia Xie, Roey Lazarovits, Adam Mansour, Sanjay Sharma, Oren Levy, and Rachelle Prantil-Baun.\n\nThis research was supported by DARPA under Cooperative Agreement Number W911NF-12-2-0036, the National Institutes of Health under grant UG3HL141797, the Bill and Melinda Gates Foundation, BARDA under contract 75A50121C00075, and the Wyss Institute for Biologically Inspired Engineering.", "opengraph": {"locale": "en_US", "type": "article", "title": "The immune system is very complicated, but now, it's on a chip", "description": "\n\nTo quote veteran science writer Ed Yong's simple yet extremely accurate words in The Atlantic, \"The immune system is very complicated.\" As the COVID-19 pandemic had made abundantly clear, science still doesn't fully understand the sophisticated defense mechanisms that protect us from microbe invaders. Why do some people show no symptoms when infected with SARS-CoV-2 while others suffer from severe fevers and body aches? Why do some succumb to cytokine storms of the body's own making? We still lack exact answers to these questions.", "url": "https://www.worldhealth.net/news/immune-system-very-complicated-now-its-chip", "image": "https://www.worldhealth.net/media/original_images/AdobeStock_86352199.jpeg", "site_name": "WorldHealth"}, "tags": [], "tweets": [], "movies": [], "links": ["https://onlinelibrary.wiley.com/doi/10.1002/advs.202103241"], "authors": [], "publish_date": null}