{"result_id": "349009", "URL": "https://worldlifestyle.com/90s-celebrity-babes-then-and-now/", "timestamp": "2023-04-25 18:16:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/90s-celebrity-babes-then-and-now/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "’90s Celebrity Babes: Then And Now", "cleaned_text": "Remember Jenna Jameson and other celebrities from the 1990s? Some of them have left teen stardom behind for real fame and continue to keep our heads turning, while others have gone from the limelight and are remembered for their work as a teen star. Admit it that you gushed over them and doodled their names in your notebook. But what do they look like now? Click through the gallery here to find out!\n\nSlay, girl. Sarah Michelle Gellar was everywhere in the ’90s — on TV as the titular butt-kicking character on Buffy the Vampire Slayer; in movies ranging from Cruel Intentions to Scooby-Doo; and on the cover of beauty magazines galore.\n\nThese days, Gellar stays largely out of the spotlight, choosing to focus instead on charity works and her food startup, Foodstirs, which sells baking kits for kids.\n\nStacey Dash played Dionne who’s BFF with Cher, constantly fighting with her boyfriend Murray and absolutely petrified of driving on the freeway. And no matter what you’ve heard, she does NOT wear polyester hair, okay? Unlike some people she knows.\n\nStacey married Emmanuel Xuereb in 2007, but later divorced and filed a restraining order against him in 2010. The 48-year-old starred in the TV series ‘Single Ladies’ and famously appeared in Kanye West’s music video, “All Falls Down.” Her hair is still polyester-free.\n\nIf you grew up anywhere near the ’90s and 2000s, you likely remember Carmen Electra for heating up the screen on Baywatch and Singled Out and inspiring your love of low-rise jeans, crop tops, and trucker hats. She was an original member of the Pussycat Dolls dance troupe in LA and had roles in Good Burger, Starsky & Hutch, and the Scary Movie franchise.\n\nThese days, Carmen looks just as hot in a swimsuit now as she did back in her lifeguard days, and she still remains one of the best parts of our MTV Spring break memories. In honor of Carmen’s big milestone, we’re taking a look back at her sexiest snaps from the ’90s to now.\n\nShe looked simple yet summery in blue jeans, green wedges, a white blazer and a lemon yellow shirt as she made her revelation.\n\nThe two tied the knot on April 24, 2004 in front of 50 guests outside Puerto Vallarta, Mexico and annulled the marriage two weeks later.She then sought solace in religion, which led her to second husband Alejandro Monteverde.\n\nLoud-mouthed, unfiltered and always up for some mischievous fun, Jenny McCarthy made a name for herself in the early ’90s as the co-host of Singled Out and star of the sketch comedy show The Jenny McCarthy Show and the scripted series Jenny (1997-1998).\n\nNow a mother to son Evan, McCarthy has turned her attentions to advocating for parents to be aware of the potentially damaging links between vaccines and autism. She also starred as Courtney opposite Charlie Sheen and Jon Cryer on Two and a Half Men and briefly cohosted The View.\n\nLoughlin became a maternal figure on Full House, playing Rebecca Donaldson, later Rebecca Katsopolis after she married Uncle Jesse.\n\nShe got to know the family as Danny’s co-host on Wake Up, San Francisco, later marrying and welcoming twins with Jesse.\n\nKelly Packard is best known for starring on ‘California Dreams,’ which was about a group of teenagers who lived in California (obviously) and enjoyed hanging on the beach and playing in their band. It was like that one dream episode of ‘Saved by the Bell’ where Zack and his friends had that band, Zack Attack. But imagine a whole show like that.\n\nPackard went on to host the show ‘Ripley’s Believe it or Not,’ and in 2008, she hosted the late segment of ‘GSN Live’ on the Game Show Network. Her last acting credit was the 2010 film ‘My Girlfriend’s Boyfriend.’ In her personal life, she’s a Mormon and she and her husband of 15 years have four children together.\n\nThiessen would find her transformative role on the Fox Network, playing bad girl Valerie Malone on the show Beverly Hills, 90210. She joined the cast half way through the series and became a main character for five seasons before guest starring in the 10th and final season of the series.\n\nHer last well-known appearance was in 2015 when she appeared on The Tonight Show with Jimmy Fallon. Thiessen joined the other original members of the Saved by the Bell cast in a sketch taking place in the show, a very nostalgic moment for many viewers. She now hosts her own television cooking show on the Cooking Channel entitled Dinner at Tiffani’s.\n\nKnown as the unofficial anthem for best friends and karaoke lovers alike, “Wannabe” started out as organically as you’d think when five pop-star wannabes – Geri Halliwell (Ginger Spice), Victoria Beckham (Posh Spice), Melanie Brown (Scary Spice), Emma Bunton (Baby Spice) and Melanie Chisholm (Sporty Spice) – came together.\n\nGeri Halliwell After leaving the group in 1998 and pursuing a solo career, the “Look at Me” singer teamed up with her former bandmates in 2007 for a reunion tour. Victoria Adams married soccer player David Beckham, with whom she now has four children: Brooklyn, Romeo, Cruz and Harper.Mel B The pop star – seen here as an ambassador for International Fitness Week in London in March 2012 — welcomed a daughter, Phoenix, with dancer Jimmy Gulzar in 1999. Emma Bunton is mom to sons Beau and Tate with singer Jade Jones. From 2003 to 2012, she had a recurring role on the BBC comedy Absolutely Fabulous.\n\nKnown for her knockout body and trademark mole above her lip. Named the world’s highest-paid model by Forbes in 1995.\n\nMarried with two kids to restaurateur Rande Gerber, the model turned businesswoman oversees Meaningful Beauty, a collection of skincare products. Her children, Kaia and Presley, are also pursuing their own careers in the industry.\n\nIn the mid-nineties, Liv Tyler was a rising star. Se had become a critical darling in a string of independent movies and commercial success by starring in a major summer blockbuster. By 1998, it seemed like Hollywood was hers for the taking.\n\nTyler was supposedly cast in the video based on her appearance in a Pantene commercial. The casting agents claim they had no knowledge of Tyler’s relationship to the band. According to Buell, the original script for the video was even racier:\n\nRussell has worked steadily in TV and film since singing on MMC. She officially became a household name by playing the title role in the series Felicity, and went on to star in movies such as Mission: Impossible III, Waitress and August Rush.\n\nShe now plays Russian spy Elizabeth Jennings in FX’s The Americans.\n\nChristina Applegate has been on TV seemingly forever. She made her debut when she was just three months old, on Days of Our Lives. When she was 15, in 1987, she was cast as Kelly Bundy on Married… With Children, by far her most famous role.\n\nIn 2008, Applegate was diagnosed with breast cancer, and received a double mastectomy. Since then, she has worked to raise awareness of the benefits of early diagnosis.\n\nShannon Elizabeth made every high school boys’ heart race when her unforgettable webcam scene turned her into a reluctant sex symbol. Since, Elizabeth has focused more on her activism than acting.\n\nThe 38-year-old Elizabeth started Animal Avengers, an animal rescue organization, and is an outspoken advocate for animal rights. She’s set to reprise her role as the foreign exchange student Nadia.\n\nJennifer Love Hewitt had some pretty sweet movie and TV gigs in the ’90s. She played Sarah Reeves on Party of Five, starred in I Know What You Did Last Summer, and, who could forget: Can’t Hardly Wait. She had a few slow years between about 1999 and 2005, but then came back to TV with Ghost Whisperer alongside former beau Jamie Kennedy.\n\nShe’s been pretty unlucky in love over the last few years, though is currently dating Alex Beh.\n\nAlicia Silverstone was just 18 years old when she landed the movie role that would shape her career — playing Cher Horowitz in the 1995 classic “Clueless.”\n\nIt’s been 20 years since “Clueless” premiered, and though Silverstone has faded from the limelight, she feels she has made her life “meaningful.”\n\nElizabeth Berkley was all set to make Hollywood waves after achieving teen cult status as 17-year-old Jessie Spano, grappling with amphetamines caffeine pill addiction in Saved by the Bell.\n\nDespite good ratings, the show never returned, but she did don her tap shoes once again for Dancing with the Stars in 2013. Despite good judge scores and a nod to the famous caffeine pill thing (well played, Elizabeth), she was voted out by the public in sixth place.\n\nBleeth skyrocketed to fame in the ’90s after she joined Baywatch in its fourth season. She played Caroline Holden, the striking younger sister of Lt. Stephanie Holden (who was portrayed by Alexandra Paul).\n\nYasmine Bleeth made her first public appearance in more than a decade, showing up at the 55th annual Penguin Plunge on New Year’s Day last week with her husband, Paul Cerrito.\n\nJanet Jackson‘s famous family is sending love after the birth of her first child.\n\nThe 50-year-old entertainer welcomed a son, Eissa Al Mana, with husband, Wissam Al Mana, this week. Janet‘s sister LaToya wrote on Twitter, “How exciting! @JanetJackson, Jan and Wissam just gave birth to a beautiful baby boy!!! Congratulations!!!”\n\nPamela first found fame in 1989 when Playboy used her picture on the cover of one of their editions.In the early nineties, the vegan bagged roles on US shows Home Improvement and Baywatch, the latter of which made her a household name.\n\nIt’s fair to say Pamela did not look anywhere near 49 years of age when sporting this softer look.", "opengraph": {"type": "article", "title": "’90s Celebrity Babes: Then And Now", "url": "https://worldlifestyle.com/90s-celebrity-babes-then-and-now/", "description": "Remember Jenna Jameson and other celebrities from the 1990s? Some of them have left teen stardom behind for real fame and continue to keep our heads turning, while others have gone from the limelig…", "article:published_time": "2023-03-31T10:22:26+00:00", "article:modified_time": "2023-03-31T10:22:26+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/d9e1d9bd-6543-45ff-b1bd-1e66bc1f70f4.jpeg", "image:width": "800", "image:height": "600", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T10:22:26+00:00"}