{"result_id": "349002", "URL": "https://worldlifestyle.com/his-predictions-about-2020-came-true-heres-what-he-says-about-2021/", "timestamp": "2023-04-25 18:16:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/his-predictions-about-2020-came-true-heres-what-he-says-about-2021/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "His Predictions About 2020 Came True. Here’s What He Says About 2021", "cleaned_text": "In 2016, he told us to ‘enjoy 2016’ because ‘it’s as good as it gets for a while’. He warned the world of 2020 and everything he predicted so far has come true.\n\nNow with the success of his previous predictions of Covid and pop culture, he’s asked to announce what he sees so far for the year 2021. Here’s what he says…\n\nIn 2015, a man named Drew Curtis claimed that he was a time traveler from the year 2020. When he warned everyone about the impending doom 2020 would bring, people laughed in his face but now, those same people are turning to him for answers for 2021.\n\nSo who is Drew Curtis? And can we really believe in his predictions?\n\nBefore Drew Curtis published his predictions, he was known as a devoted husband and father to three young children.\n\nHe was also a successful publisher and writer, who founded the news aggregation site, Fark.com which is now one of the most popular link dump sites on the internet. But now it looks as though he’s becoming successful for another reason; fortune telling!\n\nAfter republishing his 2015 prediction earlier this year, as well as another prediction he posted in 2016 when he told the public to ‘enjoy 2016’ because ‘it’s as good as it gets for a while’, Curtis catapulted into headlines.\n\nHe is now recognized as a prophet by some, but others demanded more proof of the accuracy of his predictions. To which, he provided.\n\nWhen asked about the Covid pandemic, Curtis stated that there would be two US quarantines with places closing down again come August/ September due to states opening too soon after the initial lockdown.\n\nHe also stated that things will start to get better in November, which was exactly the time the vaccines started to prove efficient. But that’s not all…\n\nWhen questioned in July 2020 about pop culture, as well as the upcoming election in November, Curtis also claimed that Donald Trump would lose the election and that pop, boy-band group, One Direction “might” get back together again to benefit from the reunion “after one of the members comes out of rehab for the first time”.\n\nAll of which incredibly happened! But even still, his sceptics wanted more.\n\nIt could be argued that much of what Curtis predicted could be calculated by evaluating the state of the US political system but we know that it could’ve been anyone’s guess when it came down to it.\n\nSo, some people believe him, others don’t. But what everyone’s really interested in now, is what he sees for 2021.\n\nCurtis had always been fascinated with the news. He was especially interested in trying to predict what would happen on the world stage just by staying up-to-date with current affairs.\n\nIt was a challenge he liked to set for himself but one he never thought he was too good at until he remembered his 2016 prediction actually came true!\n\nAlthough predicting future events may seem to be all but impossible, everyone still tries to do it. Gathering information to try to predict the future is surprisingly absolutely necessary. Especially for businesses.\n\nThis is part of the reason Curtis gained so much attention for his predictions. Someone who can accurately predict the future is the holy grail in terms of business! But how did he do it?\n\nSo, how did Curtis predict the future? Although he first joked about being a time traveler from 2020, he later told reporters how he actually ended up with his conclusion.\n\nTo predict the future, Curtis analysed the trends he saw in the news over a long period of time and imagined how it might continue into the future using reoccuring patterns. But even if that worked for 2020, could it work for 2021?\n\nWith added confidence from his accurate predictions of 2020, as well as the pressure to make predictions for 2021.\n\nAlthough he claimed to be a time traveller from 2020, he still had some predictions to make for 2021. Here’s what he said about it…\n\nCurtis announced that things will start looking up in 2021 and that ‘the coronavirus will not be the end of humanity as we know it”. His piece of insight comes as a welcome one indeed!\n\nBut he also gave one other piece of advice, “Don’t give guns to robots”, he warned. Although Curtis was joking throughout his predictions, not everyone saw it that way.\n\nMany social media users took to their platforms to voice their disbelief. “Anyone else freaked out by this?” one user wrote while another said, “THIS IS FREAKING ME OUT ABOUT HOW ACCURATE HE IS”.\n\nThere seemed to be a general awe at how much of a coincidence his predication was, which was what attracted his new fond fame.\n\nAlthough conspiracy theorists consider Curtis their savor, he admitted that he isn’t a real-time traveler from 2020 and uses his skills of analyzing news forums on the internet to deduce the future.\n\n“I run a news aggregation website, and reading everything keeps me a step ahead,” Curtis explained.\n\nHowever, his admission wasn’t enough to discourage his conspiracy theory fanatics. But what do you think? Can Curtis really tell the future or is he just well-versed in worldly topics?\n\nWould you listen to what he said about 2021? And do you think he’s been right about everything so far?", "opengraph": {"type": "article", "title": "His Predictions About 2020 Came True. Here’s What He Says About 2021", "url": "https://worldlifestyle.com/his-predictions-about-2020-came-true-heres-what-he-says-about-2021/", "description": "In 2016, he told us to ‘enjoy 2016’ because ‘it’s as good as it gets for a while’. He warned the world of 2020 and everything he predicted so far has come true.&#…", "article:published_time": "2023-03-31T21:16:43+00:00", "article:modified_time": "2023-03-31T21:16:43+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/6727745d-763b-4185-aed1-3a543ca100ce.jpeg", "image:width": "800", "image:height": "530", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T21:16:43+00:00"}