{"result_id": "349007", "URL": "https://www.worldlifestyle.com/hollywood-celebrities-banned-for-life-this-is-why", "timestamp": "2023-04-25 18:16:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/hollywood-celebrities-banned-for-life-this-is-why/", "encoding": "UTF-8"}, "image": null, "domain": "www.worldlifestyle.com", "title": "Hollywood Celebrities Banned For Life, This is Why", "cleaned_text": "Hollywood isn’t an easy place to navigate—just ask these celebrities! With the emergence of a new ‘cancel’ culture, one wrong move can derail a career in the blink of an eye. Here are some popular stars who stopped receiving airtime because of their potty mouths or worse…\n\nThese celebrities all appeared to have bright futures at one point, but now they’ve ended up on Hollywood’s blacklist. To start off the list, we have this oscar award-winning superstar…jaws will drop as you discover what she did!\n\nMo’nique made a name for herself when she starred in the movie Precious. Her career went downhill after she won an Oscar for her role. The former star claims that she was “blacklisted” after she won the Best Supporting Actress award.\n\nWhy is she banned from Hollywood? The actress was banned not only for her lack of engagement but because she’s also challenging to work with. We always knew some stars would be demanding, but we didn’t think they’d actually get fired for it! Well, at least Steven Spielberg didn’t personally ask her to leave like he did to this next actress.\n\nThora Birch was a promising young actress in Hollywood. She was nominated for a Golden Globe in Ghost World and earned rave reviews for her Academy Award-winning picture of American Beauty.\n\nHowever, as soon as her career rose, it ended abruptly because of her problematic behavior. Birch’s father hammered the final nail in the coffin when he reportedly physically threatened one of her co-stars. Speaking of humiliating actions, do you remember what happened to Catwoman star Halle Berry?\n\nHalle Berry was the first black woman to receive an Academy Award for her role in Monster’s Ball in 2002. Following that, she had a run of huge disappointments, but the worst is yet to come for Berry’s career.\n\nBerry dug her own grave when she called out her co-stars at the Golden Raspberry Awards in 2005. It became difficult for her to get acting work after her contentious Razzie victory speech. But it’s not only women that have been outcast from Hollywood. ‘Mad Max’ should never have uttered these comments…\n\nMel Gibson was arrested in 2006 after spewing racial slurs at the police officers who were arresting him. Gibson lost favor with his fans and the business as a result of this.\n\nThe actor became controversial in 2010 once more when he was caught on tape creating racial slurs and threats against his ex-girlfriend. Gibson was effectively driven out of Hollywood after that, although he has been forgiven in recent years. Keep reading for more of Hollywood’s blacklisted celebs, and we reveal why a new Spiderman was needed!\n\nLost Boys and The Goonies made Corey Feldman a star. He was, however, allegedly a victim of Hollywood pedophilia, which was never investigated.\n\nFeldman began taking narcotics to relieve the agony he was experiencing as a result of his inner anguish. As a result of his poor habits, he was virtually ruled out of any acting opportunities.\n\nTara Subkoff was a budding star in the 1990s, appearing in films such as The Last Days of Disco. She was auditioning for a role in one of Harvey Weinstein’s films when he approached her at a premiere after-party, gave her the job, and then hit on her.\n\nSubkoff claims that after she turned down his approaches, she was placed on Hollywood’s blacklist. She was then labeled and became the subject of false gossip that she was challenging to work with.\n\nBill Cosby was a well-known actor who fell out of favor as his dark side surfaced. Cosby was formerly referred to as “America’s Dad.”\n\nHowever, his image was tarnished after numerous women came forward to accuse him of sexual assault. In 2018, Cosby was charged and convicted guilty.\n\nWhen Natalie Maines, lead vocalist of the Dixie Chicks, attacked then-President Bush over the invasion of Iraq in 2003, she didn’t do herself credit. She apologized soon after, but in 2006, she fully retracted the apology.\n\nDespite being blacklisted by several radio stations at the time, the band has since rebounded. Maines, on the other hand, remains a political hot potato.\n\nAmanda Bynes was once a talented young actress with a bright future ahead of her until she decided to ruin it for herself. Bynes first got into legal problems in 2010, when she was engaged in car accidents.\n\nIt was later revealed that Bynes had a substance abuse issue. After a series of public breakdowns, Bynes left the entertainment industry.\n\nKatherine Heigl was a sought-after actress a few years ago, but not any longer. According to Hollywood Insiders, the word on the street is “challenging to work with.” She was regarded as a pain by insiders on the set of Life As We Know It.\n\nThe film industry won’t even cast her for gigs because of her lousy image—she’s not worth it. Let’s just hope that if she does get a lucky break, she doesn’t end up in a provocative movie like this next actor did!\n\nJim Caviezel is most recognized for his performance as Jesus Christ in Mel Gibson’s 2004 blockbuster The Passion of the Christ. The movie was widely mocked for being provocative and excessively violent.\n\nCaviezel feels that it was because of this film that he became an outcast. Caviezel accepted the position despite Gibson warning him that he may be banned by the community.\n\nIsaiah Washington isn’t necessarily on Hollywood’s blacklist. However, at the 2007 Golden Globe Awards, he made homophobic remarks.\n\nHe was already on thin ice since it wasn’t the first time he’d been overtly homophobic—he also attacked T.R. Knight, his Grey’s Anatomy co-star, with a homophobic slur a year before. Following the event, he was dismissed from the franchise.\n\nStacey Dash rose to fame as an adolescent actress after starring in the film Clueless opposite Alicia Silverstone. Since then, Dash has proven to be a controversial figure because of her strong conservative views.\n\nHer opinions resulted in a significant drop in acting opportunities for her. She hammered the final nail when she suggested eliminating Black History Month and openly made derogatory remarks about the transgender community.\n\nShia Labeouf’s big break came in 2007 when he landed the role of Sam Witwicky in Transformers. After that, LaBeouf went on to feature in several other films, including one starring Hollywood legend Brad Pitt.\n\nWe had no idea that the actor had a long history of wrongdoings and a terrible reputation among women, making him too difficult to cast. Unfortunately for those harmed by the actor’s actions, it hasn’t stopped him from rising the ranks of his industry and becoming a celebrity.\n\nLindsay Lohan was a huge success as a child actress, starring in numerous Disney films. However, as she grew older and developed into an adolescent actor, Lohan became a controversial figure.\n\nFurthermore, she is said to have been unprofessional at work. This prompted Hollywood to blacklist Lohan.\n\nAshley Judd was banned in Hollywood after rejecting Harvey Weinstein’s sexual approaches. He had Judd blacklisted, according to filmmaker Peter Jackson, who verified it in December 2017.\n\nDuring casting for the Lord of the Rings trilogy, he was informed by Weinstein that she’s a “disaster” to deal with and should be avoided “at all costs,” so Jackson crossed her off the list. Judd sued Weinstein for defamation in May 2018, claiming that he harmed her career by disseminating falsehoods about her in Hollywood.\n\nBrendan Fraser was a leading “Hollywood Hunk” who starred in the Mummy franchise in the early 2000s. Fraser’s acting prospects dried up after he accused Phillip Berk, the Hollywood Foreign Press Association’s former president, of sexual assault.\n\nWhen Fraser offered to shake Berk’s hand, he was assaulted, according to Fraser. Due to the aftermath, he retreated from the limelight. Ufortunately, this also halted any offers for significant roles from coming his way.\n\nCharlie Sheen was once one of Hollywood’s highest-paid TV performers, but he hasn’t had a steady job since 2014 when he starred in Anger Management. Things went downhill for the actor after filing a request to lower his child support payments to his ex-wives. Sheen claims that he was blacklisted, which made it difficult for him to land into acting gigs.\n\nWhy would they do such a thing? It was due to Sheen’s unpredictable behavior in 2011 when he was fired from Two and a Half Men.\n\nRob Schneider used to be a well-known figure in Hollywood. He was a staunch anti-vaxxer, in addition to receiving poor reviews for his films. Schneider should’ve anticipated being “blacklisted” by Hollywood because of supporting a baseless campaign.\n\nIn 2014, his vocal anti-vaccine stance cost him a job with State Farm. Since then, Schneider’s career has never recovered.\n\nAfter playing as the main character in the 1999 film Fight Club, Edward Norton became a Hollywood superstar. His demanding personality, on the other hand, has made working with him difficult for filmmakers.\n\nWhen he decided to make the sequel film The Incredible Hulk in 2003, he enraged Marvel. It’s no surprise that he was put on the blacklist of celebrities by Hollywood.\n\nCee-Lo Green had achieved mainstream success by the time F**K You was released in 2010. He not only got his own show, but he also became a judge on The Voice. However, he was blacklisted in Hollywood after sending many deafening tweets against homosexuality and rape.\n\nHis program was canceled, he was fired as a judge on The Voice, and the demand for his musical performances was no longer ethical or financially viable.\n\nDuring the early 2000s, Alyson Hannigan rose to prominence as Michelle Flaherty in the American Pie series. Her portrayal as Lily Aldrin in the smash comedy How I Met Your Mother catapulted her back into the spotlight.\n\nDespite the show’s success, Hannigan spoke out against the producers’ decision to terminate the series in this manner. It became difficult for her to obtain an acting job after the needless tea, and she should’ve kept silent instead.\n\nTippi Hedren may have been the leading lady in Alfred Hitchcock’s films Marnie and The Birds, but she despised working on them. During their work, Hedren accused the famous director of multiple sexual assaults.\n\nHitchcock instructed the cast and crew not to engage with her as she continued to reject his overtures. He also prevented her studio, Universal, from submitting her for an Academy Award for her performance in Marnie.\n\nVanessa Marquez had a recurrent role as Nurse Wendy Goldman on the medical drama ER in the 1990s. Marquez’s career came to an abrupt halt, and she chose to blame George Clooney.\n\nShe said that George Clooney assisted in her blacklisting when she came out about harassment on the set of the successful program. Clooney has refuted the claims.\n\n\n\nRose McGowan starred in the films “Scream” and “Jawbreaker” and as one of the “Charmed” ladies. McGowan has made some controversial statements during her career, but there was a specific one that got her blacklisted.\n\nThe former actress spoke up about Harvey Weinstein’s sexual assault against her and was allegedly blacklisted. It took another twenty years and a hundred accusations before everyone believed her.\n\nMira Sorvino’s career was reportedly destroyed after she refused Harvey Weinstein’s sexual approaches. She admitted to Ronan Farrow that she had previously rejected him.\n\nThe actress even reported his harassment to a female Miramax employee, and her career had suffered as a result. In December 2017, filmmaker Peter Jackson confessed that Weinstein had slandered Sorvino to him and advised him to avoid working with her at all costs.\n\nMartin Lawrence is more than just a comedian, he’s also a bad boy. He was asked to host an edition of Saturday Night Live in 1994.\n\nEverything was going well for the actor until he decided to use his “altered” monologue to address feminine hygiene. His whole monologue was deleted, and he was permanently banned from the show.\n\nToby McGuire made a significant breakthrough in the Spiderman franchise. However, McGuire vanished after his career breakthrough.\n\nMcGuire’s disappearance from the spotlight has several causes, one of which being his age. He had to be replaced since he was growing too old for the part—he was approaching 35 years old!\n\nJosh Radnor is no longer being cast in movies, and there are a few reasons for this. Thanks to his role in How I Met Your Mother, he rose to fame on television, but he could not convert his popularity to the big screen.\n\nAfter 2014, his television appearances were largely ineffective. Radnor, on the other hand, shifted his focus to his artistic endeavors.\n\nBella Thorne was only a child when she was featured in Disney Channel’s Shake It Up. She became a worldwide hit by 2010, and was acting alongside Zendaya at the time.\n\nThorne was cast as the lead actress, but the show was canceled after only two seasons. Word got out that Thorne was showing a “diva-like attitude,” and Hollywood doesn’t want that.\n\nMatthew Fox became well-known for his role as Charlie Salinger in the 1990s television program Party of Five. After his significant breakthrough, Salinger was unable to impress the entertainment business.\n\nAside from receiving poor reviews for the films he acted on, his shady personal life has been featured in the media on several occasions. As a result, Hollywood was compelled to add his name to the list.\n\nWhen Dane Cook successfully switched to the big screen in the early 2000s, he was a big-shot stand-up in his own right. However, things began to go sideways for Cook after that, and his critics were brutal as well. Aside from the severe criticism, Cook’s fellow comedians accused him of copying their jokes and attempting to pass them off as his own. After all that harmful exposure, there’s no way back for Dane Cook.\n\nFor most celebrities, Hollywood is neither a bed of roses nor a stroll in the park. Celebrities, like the rest of us, are also human beings. They become weary of working and, for different reasons, find it challenging to show up for work. They also have to deal with their own difficulties, which are often hidden from view.", "opengraph": {"type": "article", "title": "Hollywood Celebrities Banned For Life, This is Why", "url": "https://worldlifestyle.com/hollywood-celebrities-banned-for-life-this-is-why/", "description": "Hollywood isn’t an easy place to navigate—just ask these celebrities! With the emergence of a new ‘cancel’ culture, one wrong move can derail a career in the blink of an ey…", "article:published_time": "2023-03-31T23:08:14+00:00", "article:modified_time": "2023-03-31T23:08:14+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/1b872ddc-503c-40fa-a77a-55d62bffe310.jpeg", "image:width": "641", "image:height": "800", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T23:08:14+00:00"}