{"result_id": "349016", "URL": "https://worldlifestyle.com/tiktoker-told-she-doesnt-exist-following-dna-kit-result", "timestamp": "2023-04-25 18:16:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/tiktoker-told-she-doesnt-exist-following-dna-kit-result/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "TikToker Told She ‘Doesn’t Exist’ Following DNA Kit Result", "cleaned_text": "Lydia looked at her DNA test results and immediately knew something was off.\n\n“This has to be a joke,” she said. “I want to take another test!” Little did she know, this was just the beginning…\n\nLydia Ellen was looking forward to attending the college of her dreams. For the first time in years, she finally felt happy and was excited about her future.\n\nSadly, her happiness would be short-lived.\n\nLydia grew up as an only child and was very close with both of her parents.\n\nShe struggled with depression as a teen and always felt like she didn’t belong in her family.\n\nLydia frequently uploaded videos on her TikTok, in which she talked about her life. She loved to connect with her followers on a personal level and make them smile with her funny videos.\n\nThen, when Lydia arrived at college, she had to provide the nurse with a copy of her medical records.\n\nWhen she received the copy from her mother, she noticed that the date on her vaccination didn’t make any sense.\n\nUsually, babies receive the MMR vaccine at around 18-month old. However, Lydia’s MMR vaccine was administered in July 1997. She was born in 1998.\n\nThe record stated that she was three years older than she actually was, which didn’t make sense.\n\nWhen Lydia’s mother heard about her findings, she appeared to be just as shocked as her. But Lydia sensed that something was wrong.\n\nLydia’s mom told her not to worry about it and that she will inform the hospital about the mistake, but Lydia didn’t fall for it.\n\nThat Christmas, Lydia’s mom got her A DNA test kit to ease her mind.\n\nLydia did the test and sent her swab to the lab. She was excited but also nervous.\n\nThe results revealed that 34% of her genetic makeup was traced back to England, and the rest was traced to a combination of places located in Northwest Europe and Northwest England.\n\nBut it was when she logged onto the website to insert the data and learn more about her roots that she discovered something shocking.\n\nDid her parents lie to her?\n\n“I don’t have a very big family, so I wanted to find out more,” Lydia recalls.\n\n“I obtained my results, saying my origins are mostly from the UK, however, when I went to type my name and date of birth into Ancestry to start off my family tree, it stated there was no one with my name and birthdate on record, only people with my name with a different birth date.”\n\nLydia shared the news with her 60,000 TikTok followers. She was in complete shock. Were her parents lying to her?\n\nShe called her parents and demanded an explanation. “Why don’t I exist? When was I born? Literally, who am I!?” she asked them.\n\nLydia’s parents were just as confused as she was. They asked her to sit down and explain what happened, but Lydia was impatient.\n\n“Of course, you’re not adopted. You’re our only child, Lydia. I gave birth to you in the hospital myself,” her mother responded.\n\nBut how could they explain the DNA test results and vaccine date?\n\nOne of Lydia’s followers suggested contacting the Ancestry company for an explanation.\n\nWhen she called the company, they told her that she had nothing to worry about. It turns out that her data wasn’t recorded publicly on the site because Lydia was still young and hadn’t lived through major events like marriage or death. But what about the vaccine date?\n\nAfter investigating this strange finding, Lydia and her parents concluded that the vaccine date was just a simple mistake.\n\nHowever, her followers weren’t convinced that it was just a mistake. What do you think?", "opengraph": {"type": "article", "title": "TikToker Told She ‘Doesn’t Exist’ Following DNA Kit Result", "url": "https://worldlifestyle.com/tiktoker-told-she-doesnt-exist-following-dna-kit-result/", "description": "Lydia looked at her DNA test results and immediately knew something was off.  “This has to be a joke,” she said. “I want to take another test!” Little did she know, thi…", "article:published_time": "2023-04-01T02:38:35+00:00", "article:modified_time": "2023-04-01T02:38:35+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/732fab53-ab38-44d5-9cfe-31a316c94917.jpeg", "image:width": "800", "image:height": "500", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-04-01T02:38:35+00:00"}