{"result_id": "349003", "URL": "https://worldlifestyle.com/student-told-she-doesnt-exist-by-dna-test/", "timestamp": "2023-04-25 18:16:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/student-told-she-doesnt-exist-by-dna-test/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "Student Told She ‘Doesn’t Exist’ By DNA Test", "cleaned_text": "She didn’t pay much attention when she first noticed it. Her mother’s behavior had changed dramatically. What could she have been hiding?\n\nBut after peeking at the DNA test results she knew it was something huge. Something wasn’t right and now that she had the answer in her hand she’d be plunged in a world that would be hard to get out of.\n\nLydia Ellen couldn’t believe that she was gotten into the college of her dreams. She was incredibly happy and was excited to gain her independence from her parents. She would soon be out of the house and thrown into adulthood.\n\nBut soon she would figure out that she would find out who she really was and it would be much worse than she could have ever imagined.\n\nLydia’s parents loved her as a single daughter and always treated her with the most love they could. Her mom was her best friend and would always try her best to be there for her.\n\nBut sometimes Lydia struggled with problems that her mom couldn’t help her with. They were feelings of identity, but she couldn’t put her finger on why she felt this way.\n\nTikTok was a platform that Lydia found helped her. She would upload videos on the platform. She loved the idea that anything random could become viral.\n\nShe liked to publish entertaining videos and other things that happened in her life. But one such video would end up having her question everything about her identity.\n\nLydia had to give the school nurse a copy of her MMR vaccination form. But she had to get the original from her mom – that’s where she would find something interesting on the document.\n\nThe date written down on her vaccination was peculiar to her, it just didn’t make any sense. This would be the first clue to unraveling what she thought was her life.\n\nYou see, babies get an MMR vaccination when they are one-and-a-half years old. Lydia saw that the date on her certificate was July 1997. But she was born in May 1998.\n\nIf this was correct then she would have been three years older than she thought her entire life. She asked her mom about it but she looked nervous. Something was wrong.\n\nLydia’s mom stammered that there must have been some kind of mistake but Lydia wouldn’t let it go that easily. For Christmas, she got herself a weird gift to herself – a DNA tester.\n\nShe did the test and sent the swab in to be tested. But she could never have suspected what she would find when the results came back. She would need answers.\n\nThe results showed that 34% of her genetic make-up was traced back to England, the rest was traced to a mixture of places centering around Northwest England and Northwest Europe.\n\nBut when she logged onto the website to input her data and learn more about her family tree, she was left completely shocked and confused.\n\n“I don’t have a very big family so wanted to find out more”, she said.\n\n“I obtained my results, saying my origins are mostly from the UK, however, when I went to type my name and date of birth into Ancestry to start off my family tree, it stated there was no one with my name and birthdate on record, only people with my name with a different birth date”. She called her parents.\n\nLydia documented her story live on her TikTok account. Thousands of her 60k + followers tuned in to watch her bizarre story unfold.\n\nLydia showed her parents the results of her search and waited for them to explain what was happening to her. “Why don’t I exist? When was I born? Literally, who am I!?”, she demanded.\n\nLydia’s parents looked at each other before turning to Lydia and gently telling her to sit down and explain what happened. Lydia brought every strange event to the surface, the vaccine date, her DNA result, and the constant feeling they were keeping something from her.\n\nLydia felt like she was going crazy but she had to ask; “Am I adopted or something?”.\n\nLydia’s parents shot down her question immediately. “Of course you’re not adopted. You’re our only child, Lydia. I gave birth to you in the hospital myself”, her mom said.\n\nBut then how could they explain all of these strange findings? Lydia continued to upload her journey on her TikTok page until one follower suggested something.\n\nOne smart follower told her to investigate one weird situation at a time and call the Ancestry company for any possible explanations. This is when everything changed.\n\nWhen Lydia called the Ancestry company and explained her findings, they immediately told her not to worry. Turns out, there was a perfectly good explanation for this.\n\nBecause Lydia was so young and hadn’t lived through any major life events like marriage or death, her data wasn’t recorded publicly on the site. In fact, a lot of people wouldn’t be able to find themselves on the site.\n\nBut what about the vaccine date?\n\nAfter looking into the bizarre matter, Lydia and her parents determined that the date was just a simple mistake.\n\nHowever, although Lydia admits it’s super weird that someone could record a date two full years behind, she confessed that it can sometimes happen. Although her followers weren’t convinced she felt she had resolved the issue.", "opengraph": {"type": "article", "title": "Student Told She ‘Doesn’t Exist’ By DNA Test", "url": "https://worldlifestyle.com/student-told-she-doesnt-exist-by-dna-test/", "description": "She didn’t pay much attention when she first noticed it. Her mother’s behavior had changed dramatically. What could she have been hiding? But after peeking at the DNA test results she k…", "article:published_time": "2023-03-31T23:35:09+00:00", "article:modified_time": "2023-03-31T23:35:09+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/5c615f18-eaf7-443c-bc3a-85d73d90012c.jpeg", "image:width": "800", "image:height": "533", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T23:35:09+00:00"}