{"result_id": "349010", "URL": "https://worldlifestyle.com/good-celebrities-that-really-do-deserve-to-be-famous/", "timestamp": "2023-04-25 18:16:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/good-celebrities-that-really-do-deserve-to-be-famous/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "Good Celebrities That Really Do Deserve To Be Famous", "cleaned_text": "Almost every celebrity is loved for one reason or another. But Redditors have been debating whether or not a lot of them deserve their fame or fortune. Well, we’re sure that all of them worked hard to be where they are today.\n\nBut some celebrities raise the bar with their goodness. Some of them are prime examples of amazing human beings, and they truly do deserve everything good that’s happened to them.\n\n\n\nRick Moranis, he is my entire childhood. He left acting to raise his kids when his wife sadly passed. Good to hear he’s working on some projects, and we’ll see him again soon.\n\nI just hate that he’s coming back for a reboot of the “Honey I Shrunk” franchise. The first movie is the only good one. My favorite is Little Shop. I actually named my kid after Ellen Greene’s character. It’s my favorite movie musical.\n\n\n\nHe cured polio and then gave away the cure to the world for free. That’s the mark of a truly selfless person.\n\nI am old enough to have had friends with polio. I still remember getting the vaccine. I still bear the scar. In 1961, we were all given a further dose (the Sabin Vaccine) on a sugar cube in class at our elementary school.\n\n\n\nIn the same vein, Mr. Dressup. Nothing but wonderful things to say about either of these great people. I was on an overnight field trip when Mr. Dressup died, and my mom, myself, and a number of students, teachers, and volunteers cried over him.\n\nAs a rule, I don’t trust anyone who tries to give off a persona that’s overtly nice because usually, it’s a front for toxic people. Almost nobody is that good. But Fred Rogers was something special.\n\n\n\nI’ve just listened to a podcast where they interview her. Dollywood employees now get their education paid by her. That woman is unstoppable with her kindness. I’ll never forget about Dolly’s imagination library! They literally send you free books from birth till you go to school.\n\nOne of the best childhood memories I had was getting them in the mail all wrapped up and living just a drive from Dollywood too! She was such a big part of my life growing up, and meeting her in person multiple times was the best. She’s so genuine and sweet.\n\n\n\nHe was going through the final movies while battling his cancer. Poor guy. no one could’ve done a better Snape than him.\n\nI always read his name in his voice, which always makes me think of this skit from family guy. He was apparently a really nice guy, too, even though it seems often he played the villain in his movies.\n\n\n\nWeird Al Yankovic. He seems like a great guy with amazing talent and no scandals. Worked with him once on a very tiny project. I can confirm he is as kind and awesome as you hope.\n\nI do remember Weird Al was asked once if anyone had a problem with him parodying any of their songs. As a courtesy, he presents the parody to the original artist. Apparently, only Prince didn’t have a sense of humor about it. Although he did say, Michael Jackson was a big fan.\n\nDavid Tennant. He’s a brilliant actor, and he seems like such a humble, down-to-earth guy. I’ve never heard of any scandals, and I don’t know of anyone who’s had a bad word to say about him.\n\nI saw him in a play before he was a household name. I’d never heard of him myself. He was breathtakingly good. I’ve seen hundreds of plays, and this was a truly memorable performance. We decided we’d watch out for this guy, and soon after, he was in Casanova, then Doctor Who.\n\n\n\nHugh Jackman is an all-around good guy. The video of him recognizing the cameraman on the red carpet always brings a smile to my face.\n\nHugh J has an amazing talent for acting and singing. He has a range of roles he’s played, from serious, funny, rage, and loving. He has stayed clean as far as I can tell and has stayed married to the same woman despite her not being famous. And, of course, he’s ripped and has an awesome accent.\n\n\n\nSean Bean. His characters in movies and television have died a lot to get where he is. Watch his BBC series, Time. Some of the best acting I’ve ever seen also stars Stephen Graham, another exceptional actor.\n\nHe’s from the same neighborhood as me and is my dad’s age, they used to go to the pub together, and he once fell asleep on my dad’s sofa, so I can confirm, an absolute legend.\n\n\n\nBrendan Fraser deserves only the best. He deserves all the love, all the success, and all the Lego the universe can muster. The Mummy with him is one of my favorite movies. #2 is good, and #3 is pretty lame, but he’s not in it much.\n\nI love his attitude and his kindness. He really should get everything that he asks for in life. Thank you, Brendan Fraser!\n\n\n\nChadwick Boseman seemed like a really genuine and cool dude when he was alive. Every time I think of him, I can’t help but feel terrible for the guy. All this suffering is going on behind the scenes, and none of us know until the last second. I admire the hell out of the strength it must’ve taken to live his life, though\n\nThere’s an interview where he talked about befriending two kids with terminal cancer during the filming of Black Panther. Little did we know at this point that he was also fighting cancer.\n\n\n\nThe man with the most desirable curse in all of history. To be loved by all but recognized by none. 3/4 of Tony’s Twitter is people not recognizing him even when they’re holding his credit card, passport, or driver’s license.\n\nHe has innumerable accounts of people saying, “Hey, you kinda look like Tony Hawk!” To him.\n\n\n\nI saw an interview with him once, and honestly, you never know how people truly are, but he said something about a friend getting a part that he wanted (or a friend was having success and he wasn’t), and he found that the right attitude was to be just supportive of your friend’s success and that it just wasn’t the right part at the right time and eventually the right part finds you.\n\nHe may not have meant it in the way he meant it, but I always thought that was very classy. I’ve gotten some breaks and had some near misses, but I know that always being jealous of someone else’s success just causes ulcers.\n\n\n\nOh my God, I thought you meant Mel Gibson for some reason and couldn’t figure out why people agreed with you. Totally 100%. Our last living connection to actual vaudeville.\n\nIt has provided so much to so many but always looked past because of its “low brow.” Inside all of us, we are all low-brow, snooty critics who just deny it.", "opengraph": {"type": "article", "title": "Good Celebrities That Really Do Deserve To Be Famous", "url": "https://worldlifestyle.com/good-celebrities-that-really-do-deserve-to-be-famous/", "description": "Almost every celebrity is loved for one reason or another. But Redditors have been debating whether or not a lot of them deserve their fame or fortune. Well, we’re sure that all of them worke…", "article:published_time": "2023-04-01T03:20:57+00:00", "article:modified_time": "2023-04-01T03:20:57+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/b0dc0682-0972-42f4-bebd-9ab3edd92e22.jpeg", "image:width": "800", "image:height": "437", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-04-01T03:20:57+00:00"}