{"result_id": "349008", "URL": "https://worldlifestyle.com/20-most-controversial-things-you-dont-know-about-historical-presidents/", "timestamp": "2023-04-25 18:16:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/20-most-controversial-things-you-dont-know-about-historical-presidents/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "20 Most Controversial Things You Don’t Know About Historical Presidents", "cleaned_text": "You know their names, but do you know their dirty secrets? These presidents went down in history for many reasons, but it’s the things you don’t know about them that will leave the biggest impression. These controversial presidents had a few skeletons hiding in their closets that they preferred the public— and you— didn’t know.\n\n20. Lyndon B. Johnson Was Known For His Sexual Indiscretions With Numerous Women\n\n\n\n It’s said President Lyndon B. Johnson wanted to top John F. Kennedy’s promiscuity while in office. Not only did Johnson have his share of mistresses, but he was also known to sleep with his secretaries. Rumor has it, Johnson even flirted with women and took them home right in front of his wife, Lady Bird Johnson. By the way, the nickname for his member was “Jumbo,” in case you were wondering.\n\n19. Ronald Reagan Relied On An Astrologer To Make His Schedule\n\n\n\n President Reagan was a firm believer in astrology and even based his schedule around the alignment of the stars and planets. The New York Times confirmed in 1988 the Reagans— Ronald and his wife Nancy— both relied on astrology to plan out speeches, debates, and flight plans for Air Force One. However, Reagan said astrology did not influence his policy decisions.\n\n\n\n18. Richard Nixon Plotted To Murder A Journalist Who Exposed His Corruption\n\n\n\n An article by NBC News confirms Nixon indeed had a vendetta against Jack Anderson, a journalist who exposed the president’s corruption and scandals. It’s said Nixon and his “team” planned on poisoning the writer, but before they could carry out their sinister plan, the Watergate scandal broke out.\n\n\n\n17. Thomas Jefferson Is Said To Have Had A Stutter And Was Terrible At Public Speaking\n\n\n\n Presidents are supposed to be commanding and articulate, right? This wasn’t the case for Thomas Jefferson. As the third president and author of the Declaration of Independence, Jefferson had himself a case of stage fright. Historians have even gone so far as to say it was due to a stuttering problem Jefferson suffered. President Jefferson only delivered two speeches during his term— one at each inauguration.\n\n\n\n\n\n While Washington was a great symbol for the young nation, he simply lacked the skills it took to win battles. It’s said he was good at retreating and getting his men out of danger, but he also lost nearly every major battle he fought. After losing the city of Philadelphia to the British, French troops had to help America win back the city. The French army had to clean up Washington’s mistakes, people, no wonder your history teacher didn’t cover this small detail.\n\n15. Franklin Pierce Is Known As America’s “Drunkest President”\n\n\n\n Pierce was the 14th president from 1853-1857, during which he was known for constantly being intoxicated. He was elected by default, basically, as the Democratic party took almost 50 ballots to nominate a candidate. By that time, it’s said his opponents were “checked out” as Pierce won the presidency in a landslide. Once in office, he had no idea what he was doing. That, in addition to having a bitter wife and having tragically lost three sons caused Pierce to turn to the bottle for comfort.\n\n\n\n\n\n Okay, I don’t know if he “hated” the staff, but he required anyone working in the White House to be “invisible.” Basically, they had to hide in closets and such any time President Hoover or the First Lady entered a room. As president from 1929-1933, Hoover saw the Great Depression take over the country during his term, and thus “Hoovervilles” came to be known. So, maybe it was a combination of his personality and political decisions that made him so unpopular with the people.\n\n\n\n13. Despite His Civil War Victories, Ulysses S. Grant Was Afraid Of Blood And Being Seen Naked\n\n\n\n Ulysses S. Grant lead the Union to many victories during the Civil War, and even demonstrated his brazenness during the Mexican-American war. Despite his background of battle experience, President Grant would get weak at the sight of blood— reportedly even rare steaks “creeped” him out. He was also extremely shy, and would refuse to shower in front of his men while on the battle field. Lastly, it’s said he “holed” up during his daughter’s weeding because he was so hysterical.\n\n\n\n\n\n How dare anyone have something bad to say about our Honest Abe! But despite his political popularity, Abe couldn’t change the fact people hated hearing his voice. It’s said that when he would first begin speaking, his voice was “shrill, squeaking, piping, and unpleasant.” Not something we imagined for this keynote speaker.\n\n\n\n11. President James Madison Was Very Petite At Only 100 Pounds\n\n\n\n Most men would scoff at being referred to as “petite,” but petite is what President Madison was. At 5’ 4” and only 100 pounds, Madison was one of the smallest presidents our country has seen. However, this may not have been such a big deal in 1809 as it would be today.\n\n\n\n10. Dwight Eisenhower Didn’t Know How To Use a Telephone And Relied On Aides To Make His Calls\n\n\n\n It shouldn’t be too surprising that a president known for his smarts on the battle field was completely “baffled” by a dial tone.\n\n\n\n9. John Quincy Adams Was Known For His Progressive Ways, But Also For Funding A Project To Prove The Earth Is Hollow\n\n\n\n John Quincy Adams was America’s sixth president, and was known for his opposition to slavery and support of education advancement. However, it may have been this theory that the earth is hollow that cost him re-election in 1829. President Adams had even approved an expedition using taxpayers’ money to prove his un-founded theory, but it never came to be as he was outed from office before the trip took place.\n\n\n\n\n\n Warren G. Harding served as the 29th president from 1921-1923, so it may not have been so taboo to have a gambling problem in the White House during his presidency. It’s reported he once lost the complete White House china set in a bet.\n\n\n\n7. Doctors Accidentally Killed James Garfield After He Had Been Shot\n\n\n\n The doctors working to save President Garfield’s life attempted to use a metal detector to locate the bullets. However, the instrument continued to pick up the bed springs, prompting the surgeons to cut in the wrong place. Garfield died from a punctured kidney and streptococcus, which were both caused by the doctors.\n\n\n\n\n\n It’s a fact, folks. It’s been confirmed by news outlets that President Clinton did in fact “misplace” the nuclear launch codes during his term in office. It’s a big deal, according to the sources, as Clinton lost the ability to launch our nuclear weapons for months.\n\n\n\n5. Franklin D. Roosevelt Hid His Polio Diagnosis From The Public For Fear Of Being Seen As Incapable As President\n\n\n\n President Franklin D. Roosevelt contracted polio during his time in office, yet the public was none the wiser. Roosevelt learned to walk in leg braces and was careful to never be seen in his wheelchair in public. Despite Roosevelt’s efforts at rehabilitation and physical therapies, he never regained movement in his legs. He went on to establish the March of Dimes in 1938 that eventually help fund a polio vaccine.\n\n\n\n\n\n FDR wore dresses for photographs as a child, however, it was simply the style of the time. It’s not a big deal, but seeing this specific photo of the former president really puts things into perspective.\n\n\n\n3. Gerald Ford Was A Model Before Becoming The 38th President\n\nPresident Ford took over the Oval Office following Richard Nixon’s resignation in 1974. However, before taking over as president, Ford was a male model. He even graced the cover of Cosmopolitan at one point! Perhaps his early modeling days contributed to the public’s inability to take President Ford seriously.\n\n\n\n2. William Howard Taft Was So Overweight, He Didn’t Fit Into The White House Bathtub\n\n\n\n Weighing 330 pounds, President Taft required a custom-made bathtub while in the White House. It’s rumored Taft once was stuck in the bathtub and required several men to help pull him out. However, this may also be one of many unfounded jokes surrounding his weight.\n\n\n\n1. John F. Kennedy Had A Serious Sex Problem Way Beyond His Alleged Affair With Marilyn Monroe", "opengraph": {"type": "article", "title": "20 Most Controversial Things You Don’t Know About Historical Presidents", "url": "https://worldlifestyle.com/20-most-controversial-things-you-dont-know-about-historical-presidents/", "description": "You know their names, but do you know their dirty secrets? These presidents went down in history for many reasons, but it’s the things you don’t know about them that will leave the bi…", "article:published_time": "2023-03-31T10:46:36+00:00", "article:modified_time": "2023-03-31T10:46:36+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/fa850173-b41a-44ac-ab96-5dc26e822318.jpeg", "image:width": "800", "image:height": "533", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T10:46:36+00:00"}