{"result_id": "349012", "URL": "https://worldlifestyle.com/one-day-these-facts-could-save-your-life/", "timestamp": "2023-04-25 18:16:36 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/one-day-these-facts-could-save-your-life/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "One Day These Facts Could Save Your Life", "cleaned_text": "Danger can be in a lot of places. With people potentially being at risk every day, they should learn a few facts that could end up saving their lives one day.\n\nWe’ve compiled a list of facts that Redditors have given through their experiences. Remember these, and if you’re ever in danger, they may end up making the difference.\n\nCar jacks are for lifting, not holding. So true. The amount of people that go under their cars while it’s on a jack is astounding. Jack stands aren’t even that expensive; there is no excuse not to have them.\n\nTo add to this, never fully trust jack stands and put a tire under the car by the stand. Story credit – Reddit/[deleted]\n\nIf you are trying to rescue someone, check for danger first and maintain your own safety! In a lot of situations, it’s easy for untrained first responders to become a casualty themselves in the heat of the moment trying to help others.\n\nSource: I’m a nurse, and I’ve seen this happen a lot, particularly with drownings. Story credit – Reddit/CaffeineYAY\n\nIf you find yourself stranded in a desert, ration sweat, not water. Of course, don’t drink all of your water in one go, but the rate a which you’ll dehydrate and overheat if exerting yourself.\n\nDoing things like walking too fast or climbing over obstacles in the heat of the day) will kill you much quicker. Many people are found deceased carrying water, which is terrifying. Story credit – Reddit/kfnola\n\nIf you’re choking, don’t get embarrassed, don’t go to the bathroom, and don’t walk away from people. I’ve seen a couple of people nearly die because they were panicking and walked away from the dinner table(s) and such while choking.\n\nDo the universal sign for choking with both your hands on your neck, and most people will get the message. Story credit – Reddit/Kat-is-sorry\n\nTake charge and point at someone, and delegate. People freeze up in emergencies or assume someone else will handle a problem. Don’t point at someone and say, “you guy in the blue shirt. Go to the gate and tell the ambulance where we are.” “Ma’am? please go with him.” Don’t ask, “does anyone know CPR.”\n\nPoint at someone and ask if they do. Even if they don’t, people are more likely to step forward in fear of being asked next and judged for not acting sooner than volunteering from the beginning. Story credit – Reddit/Polyfuckery\n\nTeabags stop bleeding. They have an acid called tannic which is a natural clotting agent. This actually works, I had wisdom teeth out a while back, and the extraction didn’t go well. It took over an hour for the dentist to remove one of them.\n\nSent home, and the bleeding wouldn’t stop. I read about the tea bag thing and used a tea bag, or rather a couple of them, to stop the bleeding. Remove the staple first, or you may do more damage than good. Story credit – Reddit/bikesglad\n\nIf the forest suddenly falls silent, stop and listen. More often than not, it means the apex predator is near and hunting. Always be aware of your surroundings.\n\nOr earthquake or some other natural disaster is incoming QUICK. This happened to me before a large earthquake in California. The forest got deathly silent, crept the hell outa me. Story credit – Reddit/SsjAndromeda\n\nMoose cows are just as dangerous when they’re protecting their calves. Both male and female moose can also be extremely hostile if they’re protecting a high-value food source.\n\nSo if you’ve got a fruit tree in your garden and see a moose chowing down on some fruit, stay away! It will likely attack you if you get anywhere close to it. Story credit – Reddit/PM-me-Sonic-OCs\n\nMaybe not to save your own life, but it could help you save someone else’s. When performing CPR, chest compressions need to be continuous, deep, and fairly quick. Call for an ambulance first. If you can get someone to help you, do so because it is exhausting. For an adult, good quality chest compressions should be two per second and 5-6cms deep.\n\nYou should lock your hands together, one on top of the other, get your arms straight, lock your elbows and push with the heel of your bottom hand into the middle of the chest hard. And you do not stop until help arrives. The rumor that chest compressions can crack ribs is true, but trust me, they’d rather have broken ribs than be dead. Story credit – Reddit/[deleted]\n\nLight a fire, and you’ll become the scariest thing to predators. It’ll scare away any creatures and let you cook things and clean water, and it’s just really handy.\n\nEdit: Bugs are also really high in protein, like as high as beef. And roasting them should kill off any bacteria, so now you have a nutritious snake. That might taste either nice and crunchy or absolutely revolting. Story credit – Reddit/yankee_doodle_\n\nWhen you see someone faint, DON’T help him stay up. Gently catch and lay down asap. They’re fainting because the brain needs blood to stay alive. Keeping them upright will prevent this.\n\nIf you feel light-headed, lay down so that no dumbass will try to keep you on your feet. If you suffer from any condition that causes fainting, explain this to people around you. Story credit – Reddit/totally_a_human_rly\n\nSucking out snake venom doesn’t work. If you’ve been bitten by a venomous snake, take a clear picture from a distance and call an ambulance immediately.\n\nThe picture will be used to identify the snake species in order to get the most effective antivenin. Edit: I answer why, despite having CROFAB (universal antivenin), narrowing down the species aids in treatment. Story credit – Reddit/Kooky-Copy4456\n\nIf you get bit by a wild animal, you must get the rabies vaccine. Rabies is not like the flu or mild inconvenience. It’s one of the most lethal diseases on the planet. It has a near 100% fatality once the disease takes hold (and it’s a horrible way to go).\n\nRabies is one of the terrifying illnesses, and there has been a lot of thankless behind-the-scenes type work done to reduce it, so it is no longer as big of a threat as it once was. (Vaccinating wild animals) Story credit – Reddit/[deleted]\n\nIf you crash into an electrical pole, immediately call 911 (or your country’s equivalent) and stay in the car. You could have downed an electrical wire, and the wire will still be live. Assume the entire area around your car is electrified.\n\nOnly get out of the car if there’s an immediate danger, such as a fire. When you exit the car, make sure both feet touch the ground at the same time, only take small, shuffling steps, and make sure both feet are touching the ground at all times. Story credit – Reddit/kaipetica", "opengraph": {"type": "article", "title": "One Day These Facts Could Save Your Life", "url": "https://worldlifestyle.com/one-day-these-facts-could-save-your-life/", "description": "Danger can be in a lot of places. With people potentially being at risk every day, they should learn a few facts that could end up saving their lives one day.  We’ve compiled a list of f…", "article:published_time": "2023-04-01T04:02:34+00:00", "article:modified_time": "2023-04-01T04:02:34+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/094b6f15-5ee5-4f9c-89e8-69ed4d0f69f1.jpeg", "image:width": "800", "image:height": "800", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-04-01T04:02:34+00:00"}