{"result_id": "349001", "URL": "https://worldlifestyle.com/what-you-need-to-know-about-coronavirus/", "timestamp": "2023-04-25 18:16:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/what-you-need-to-know-about-coronavirus/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "What You Need To Know About Coronavirus", "cleaned_text": "You will often hear about Coronavirus as something “novel” or new, as that’s because it is a new strain of a virus that belongs to a family of viruses that we have all heard of before. The World Health Organization has said that coronaviruses are a family of viruses that go from the most common cold to far deadlier diseases.\n\nThis virus can infect animals and humans alike. This particular strain, COVID-19, started in Wuhan, China and is closely related to two other viruses that originated around the same area – SARS and MERS. This time around it is proving to be a lot more challenging to get a handle on by health authorities.\n\nThis coronavirus isn’t as lethal as SARS, which took the lives of 10 percent of those who had it back in 2002. However, doctors in charge of finding the source, behavior, pattern, and cure for this virus say that they aren’t sure yet just how deadly it is.\n\nSo far, 2 percent of the reported cases have resulted in deaths. But experts say that the percentage is probably lower as there were many cases early on that were not reported as they were thought to be just a mild cold. One expert stated that while there were 2,000 reported cases, he estimates that number to actually be over 100,0000.\n\nSince the virus originated in the Far East, the largest amount of cases are on the West Coast of the United States (so far). Here are the states where covid-19 has been confirmed.\n\nThe top states where the virus is seen is Washington, California, and New York leading the way. Metropolitan cities are typically hit harder due to population density.\n\nUnlike SARS, covid-19 spreads easier, which is the main issue with it. It is similar as the symptoms are cold-like. It seems that the virus is highly transmittable and because some cases present like a common cold, spreading it is very likely. There have been reports that there are those who have transmitted the virus before showing any symptoms themselves.\n\nFrom the little we know, the New England Journal of Medicine stated that covid-19 reaches its most infectious state just as people start feeling sick, which means spreading it is very similar to how we spread the flu. There was one woman from Wuhan who was said to have gotten five family members sick yet she never felt any symptoms herself.\n\nJust like many other respiratory diseases, the main risk groups are the elderly, those with autoimmune diseases, diabetes, and high blood pressure. However, there is a large amount of variation between people and how they respond. There are those who are within the risk groups who recover well and there is just no explanation for that so far.\n\nAlison McGreer of theUniversity of Toronto stated that, “It may be a very specific thing about the way your immune system interacts with a particular pathogen. It may also be just about exactly what your exposure is.”\n\nSo far, many similar viruses have affected kids as much as the elderly. However, covid-19 seems to be different. There is nothing showing that kids are more prone to the virus. When kids do get the virus, they show the same kind of symptoms that adults do – fever, cough, congestion.\n\nWhile the risk isn’t higher, kids do tend to spread viruses faster among their group due to their environment in schools. The CDC has asked parents to teach kids about hygiene and positive habits that would help minimize the spread. The number one rule for parents has been to keep a sick child home from school, whether it’s just a regular cold or something more serious.\n\nCoronavirus and the flu are both respiratory diseases. They have similar symptoms, are very contagious, and can be lethal. With so many similarities, why is coronavirus being panicked over but the flu isn’t?\n\nExperts have answered that question by saying that covid-19 is “flashy and new.” The main difference between the two is that while the flu is similar to covid-19, the complications that covid-19 causes are not flu-like and there is no vaccine for it (like the flu).\n\nAs was covered, the flu and covid-19 are very similar, and that extends to their symptoms. The symptoms include fever, body aches, fatigue, cough, congestion, and sometimes vomiting and other digestive discomforts. They both can also vary from being a light case to being the cause of death.\n\nResearchers say that as of right now, around 80 percent of the covid-19 cases are mild ones. Both covid-19 and the flu can cause someone to get pneumonia, a lung infection that can be deadly to children and elderly.\n\nThe pneumonia that someone can get from covid-19 is the deadly element. Those in risk groups – elderly and those who have underlying conditions – are the ones who need watch out. Coronavirus can lead to pneumonia and organ failure as a result, which would be lethal.\n\nCarl Goldman, a California man in his late 60s who had coronavirus from his time on the Diamond Princess cruise ship, said that “it hasn’t been that bad.” He continued by saying that the case of bronchitis that he had once was far worse. “My chest feels tight, and I have coughing spells. If I were at home with similar symptoms, I probably would have gone to work as usual.”\n\nThere is a bit of panic around the world as a result of coronavirus. While it may be new, experts say that you don’t need to buy something special to prepare for it. There are, however, precautions that we can all take in order to try and prevent the spread of the virus.\n\nThese precautions are the same as the ones you would take to try to steer clear of any disease and is important to follow every day as the recommendations are backed by the CDC and World Health Organization.\n\nThe CDC has stated to the public that it officially recommends that washing hands be done with soap and water and be done for at least 20 seconds. They say to do this after using the bathroom, as well as before eating and after sneezing.\n\nThe CDC also recommends not to touch your nose, mouth, and eyes and to clean surfaces and objects that you come into contact with often.", "opengraph": {"type": "article", "title": "What You Need To Know About Coronavirus", "url": "https://worldlifestyle.com/what-you-need-to-know-about-coronavirus/", "description": "You will often hear about Coronavirus as something “novel” or new, as that’s because it is a new strain of a virus that belongs to a family of viruses that we have all heard of be…", "article:published_time": "2023-03-31T16:49:50+00:00", "article:modified_time": "2023-03-31T16:49:50+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/87cdbfa4-460b-4bbf-a38e-28c431e06a15.jpeg", "image:width": "760", "image:height": "428", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T16:49:50+00:00"}