{"result_id": "349014", "URL": "https://worldlifestyle.com/top-before-and-after-body-transformation-actors-had-to-undergo-for-a-role/", "timestamp": "2023-04-25 18:16:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/top-before-and-after-body-transformation-actors-had-to-undergo-for-a-role/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "Top Before-And-After Body Transformation Actors Had To Undergo For A Role", "cleaned_text": "Most people think acting isn’t too hard. But it demands a lot of commitment to a role. They read the script for hours, learning everything about their character. Actors go to the lengths of morphing their physical bodies into what they need it to be.\n\nThis list shows off celebrities in roles so transformative you won’t recognize that it’s them. The top ten are the most severe transformations out there.\n\nDavid Harbour is a beloved actor for portraying Sheriff Hopper in Stranger Things. So fans were surprised when he snagged the role of Hellboy. Harbour had to put on muscle and what he did was amazing.\n\nThe actor says no CGI was used in his portrayal of Hellboy. Harbour said: ”I don’t know why people complain about ‘fake news,’ because fake news works in my favor, in terms of this. That’s all me, 100%.”\n\nCraig Robinson always had a big body. But when he got his role in Ghosted, he changed everything we knew about him. Robinson stopped drinking alcohol and meat. In the end, he lost 50 pounds!\n\nRobinson said: ”I haven’t been drinking since January. I just put down the alcohol. I was going to detox. I had heard—I don’t know how true it is—you can regenerate your liver in six months. I was like, let me see if I can go six months, and I just haven’t gone back, and then [I’ve been] working out and I’ve been trying this vegan lifestyle, too.”\n\nMost people know Brolin as Thanos in the later Avengers films. But before he jumped into those Marvel movies, he was Cable in Deadpool 2. For the role, he gained 20 pounds of pure muscle.\n\nBrolin recalls deciding to get into shape for the role: ”I had this great midlife-crisis idea. Buy a Ferrari? No, I’ll get into shape. And it was just a dumb decision. I worked out three hours a day, and I was off sugar. I’m very happy with the outcome.”\n\nGwyneth Paltrow played a 300-pound woman in Shallow Hal. Paltrow put on a fat suit to achieve this look. Prosthetics were the name of the game here.\n\nPaltrow said: ”I watched people, practiced, and Ivy – my stand-in – was great. I watched how she moved, her attitude. I spoke to a lot of people who are overweight and they were really forthcoming about what it feels like, not wanting your clothes to stick to your body, the physical stuff, the emotional stuff.”\n\nIn Albert Nobbs, Glenn Close portrayed the role perfectly. She portrayed a woman who disguises herself as a butler in a Dublin hotel. She spent many hours every day with makeup artists to achieve the look.\n\nThis isn’t Close’s first transformation into a man on screen. Be sure to take a look at number 63 on the list for another one of her great transformations.\n\nIn Predators, Adrien Brody managed to amass 25 pounds. He didn’t drink or have sex during the making of the film and trained through harsh military exercises.\n\nOn MTV News, Brody said: ”It took a great deal of work on my part, even before I got the role, that I would do what is necessary. I gained 25 pounds for this role. I put on a lot of muscle.”\n\nIn Syriana, George Clooney had to gain 35 pounds. What’s more interesting is that he doesn’t look too different. That’s because Clooney looks good no matter what weight he is.\n\nClooney elaborated: “My job was just to eat as fast as I could, as much as I could. But mostly you just ate until you wanted to throw up, and made sure you didn’t throw up. So that was my job for a month, was eating.”\n\nFor the role of Gandhi, Ben Kingsley had to lose 20 pounds and shave his head. He stuck to the same diet Gandhi actually ate — strictly vegetarian. Furthermore, the actor looked into meditation and yoga.\n\nHe told New York Times: ”When I have totally immersed myself in the mechanical, logical preparation of a part, if I and my craft are totally bonded and fully exploited, something else in me is awakened and begins to inform my work.”\n\nThe actor who has the record for the most weight put on for a role would have to be Vincent D’Onofrio in Full Metal Jacket. He gained more than 70 pounds!\n\nAfter amassing so much weight, the actor ended up hurting his knee badly. He then said that he’d first lose an appropriate amount of weight before acting in another role. He said: ”I went from being a starving actor to a beast.”\n\nAmerican actor and heartthrob Bradley Cooper had to gain 40 pounds of muscle to portray the Navy SEAL Chris Kyle in the action film American Sniper. He gained all this weight in only 10 weeks, which involved an intense training session twice a day.\n\n“When I was hired to train Bradley Cooper for The A-Team, I had weeks to pack 30lb of muscle onto his six-foot-two, 185lb frame. I did this without having him take creatine, steroids, growth hormone or eating a single piece of red meat for the entire four months of shooting. His protein per meal never exceeded 25-30g and his workouts were between 30-45 minutes”, his trainer said.\n\nHillary Swank had to gain nearly 20 pounds of muscle before playing the role of boxer Maggie Smith in the Academy Award-winner Million Dollar Baby. But what’s most impressive is that she pulled off such a physique in only 90 days! Of course, this involved a six-hour daily training and a protein-rich meal every 90 minutes.\n\n“I found more than anything that what I really learned from this movie was the power of the mind and how my mind was my biggest obstacle”, Swank said. If you’re a Hilary Swank fan like I am, then slide to #77 to see another of her most shocking transformations.\n\nHugh Jackman played the role of Wolverine for the first time in the first installment of the X-Men franchise back in 2001. However, he has undergone a dramatic physical transformation ever since. Look how much muscle mass he had gained by the time the 2011 version was released!\n\n“The Wolverine diet is strict. It has about 4000 calories a day, maybe 4 and a half cause I’m bulking up. Always protein, 6 times a day, steam vegetables, and occasion brown rice”, the actor said when asked about his diet. For another of Jackman’s impressive body transformations, slide to #61!\n\nJamie Foxx is the master of biopics, but in the 2009 film The Soloist, he took things to the next level. Playing the role of a homeless musical genius, he had to learn to master the cello, have some dental work done, and lose nearly 20 pounds.\n\n“It was hard on all sorts of levels – I had to learn to play the cello, and I had to let myself go into that world of mental illness – but it was very rewarding, too”, Foxx said.\n\nAustralian actress Nicole Kidman has acted in dozens of successful movies, but she really nailed it in last year’s drama film Destroyer. To play this worn out, grieving and distressed police detective, she had to go through an intense makeover.\n\nMany critics have said that she is barely recognizable in this role. “I just felt her and I felt sadness and I felt pain for her. The way I look and behave in the film is the result of a lot of trauma,” said Kidman.\n\nWinner of two Academy Awards, actress Hilary Swank is a true chameleon. In the drama biopic Boys Don’t Cry, she took on the role of Brandon Teena, a young transexual boy from a small Nebraskan village.\n\nBefore the shooting of the film, Swank spent a month dressed in male clothes in order to prepare for the role. She also lost a bit of weight and strapped down her breasts. “By the third week of filming I had lost every ounce of my femininity. I thought I was never going to be able to find Hilary again. I was totally lost”, she said.\n\nWhen Matt Damon took on the role of a veteran drug-addict in the mystery-drama film Courage Under Fire, he didn’t quite know what he was up for. He lost nearly 40 pounds for the role but had to receive medical treatment for 7 months once the shooting of the film came to an end.\n\n“I think the most challenging role that I’ve ever had, was when I did Courage Under Fire (…) That was the most physically challenging did I’ve ever had to do in my life. I weigh probably 190 pounds right now, and I weighed 139 in that movie, and that is not a natural weight for me”, the actor said. If you wanna see another of Damon’s before-and-after body transformations, slide to #21!\n\nTo achieve that gladiator-worthy physique for the epic war film 300, Gerard Butler had to put up with over four months of harsh training both before and during the shooting of the film. He trained an average of 6 hours per day, which included push-ups, pull-ups, and box jumps.\n\nSure, the training was pretty intense, but the actor claimed he was inspired by the efforts of the rest of the cast members. “It was great having that unity of purpose both as an army and in terms of what we were trying to make in this movie and in terms of fitness, training and that warrior spirit”, he told GQ UK.\n\nJennifer Lawrence has always been open about her refusal to put up with strict diets and weight losses for a role, but she made an exception to the rule when she decided to take the lead role in the 2018 drama film Red Sparrow.\n\nLawrence plays a Russian ballerina, and as such, she had to go through intensive physical training and a strict diet. Luckily, they let her shoot all the dancing scenes first, so she could go back to her normal eating habits as quickly as possible. “Red Sparrow’ was the first time that I was really hungry and disciplined. I can’t be in character as an ex-ballerina and not feel like an ex-ballerina”, Lawrence confessed.\n\nLet’s be honest folks, Christian Bale is such a good-looking guy, that it’s hard to picture him in the role of a chubby 70-year-old. In 2017, Christian Bale surprised the world by playing Dick Cheney, the controversial former vice-president of George Bush.\n\nNot only did he gain 40 pounds for this role, but he also had to shave his head and bleach his eyebrows each day. “I had never before gone to a doctor or a nutritionist about gaining or losing weight for my roles (…) I went to somebody and they managed to get me up a good 40lbs. It’s never healthy to put on that amount of weight in a short amount of time, but I did it in the healthiest manner,” he told Star2.com. For another of Bale’s amazing body transformations, slide to #9 and #2!\n\nCharlize Theron really goes to great lengths to excel in her roles. In 2017, she went through harsh physical training to play a spy in Atomic Blonde, and one year later, she put on 50 pounds to play a wore-down mother in the drama film Tully.\n\nIt took her nearly a year and a half to lose those pounds back. “I gained close to 50 pounds for this film. I just wanted to feel what this woman felt, and I think that was a way for me to get closer to her and get into that mindset”, she told Entertainment Tonight. For another of Theron’s unbelievable physical transformations, slide to #4!\n\nJohn Leguizamo is famous for his versatility as an actor, but he definitely left us in awe after his amazing performance in the horror-drama film Spawn. To play the clown demon Violator, not only did he use body paint, a bodysuit, and prosthetics, but he had to gain some weight too!\n\nSeveral years later, Leguizamo admitted he ate maggots for the role. Yuck! He also claimed that the makeup sessions lasted for hours. “I just tested the other day, and I was like, ‘I remember those days on ‘Spawn.’ Four-hour makeup, two on fat suit, another three-hour makeup …’ It’s rough!”,he told Fandango.\n\nIt’s hard to find a TV character who has gone through such radical physical changes such as Mac in It’s Always Sunny in Philadelphia. While we see him in perfect shape during the first seasons, he suddenly gained over 50 pounds on season 7.\n\n“All you need to do is lift weights six days a week, stop drinking alcohol, don’t eat anything after 7pm, don’t eat any carbs or sugar at all, in fact just don’t eat anything you like, get the personal trainer from Magic Mike, sleep nine hours a night, run three miles a day, and have a studio pay for the whole thing over a six to seven month span”, the actor said sarcastically.\n\nRemember the time when Emma Thompson played Nanny McPhee in the musical film of the same name? You can barely recognize her, as they sure placed a decent amount of makeup on her face, not to mention her monobrow, her frizzy wig, giant front tooth, and enormous nose.\n\nAllegedly, Thompson’s transformation into McPhee only took one hour in make-up. If you ask me, those are some very talented makeup artists!\n\nWay before Russell Crowe underwent extreme body transformations for the boxing epic Cinderella Man, Robert de Niro did the same for Raging Bull. The film narrates the life of professional boxer Jake LaMotta, so he had to get into athlete shape for the first part of the film.\n\nBut De Niro had to put on weight for the second half of the film, as he was meant to play LaMotta during his latest years and by that time the boxer was overweight. Thus, the production halted for a few months and De Niro was sent to Italy, where he ate pasta all day in order to put on as much weight as possible. He gained 30 kilograms and had trouble breathing and came out in rashes as a result.\n\nEver noticed that Hugo Weaving played not one, but two characters in Cloud Atlas? He played both the green and super-creepy devil Old Georgie as well as the cruel nurse Noakes. On each day of shooting, Weaving would have to go through a four-hour makeup process for each of his characters.\n\nDuring an interview, they asked Weaving about his: “The prosthetics came in at a very late stage, so I spent a lot of time in my fat suit just trying to get used to it”.\n\nAre you ready for one of the most unbelievable body transformations ever? The British icon Tilda Swinton played not one, not two, but three roles in this film, including the old man Dr. Kemperer.\n\nA round of applause for the makeup artist Mark Coulier, who performed makeup tests for 18 months in order to achieve such an impressive transformation. During an interview, Coulier said the following when asked about Swinton: “Not all actors enjoy the difficulty of doing prosthetic work. It’s not the most pleasant thing to sit in a chair for five hours and have latex stuck to your skin”.\n\nIn the 2013 drama film Dallas Buyers Club, Matthew McConaughey took on the role of a rodeo cowboy who helps AIDS patients get their medication after being diagnosed with the infection. Since he was meant to play a poverty-stricken man wore down by a terminal disease, he had to lose plenty of weight to achieve a credible performance.\n\nThe actor went through some physical training for a few weeks, but he lost most of his weight mainly by sticking to a strict diet, which consisted of a daily meal of chicken, egg whites, and Diet Coke. “I started off doing a lot of exercise, burning 1,800 calories a day. I had to do that for two weeks. My goal was to lose four pounds a week. And then I had a week where I had an injury and I couldn’t exercise, and I stayed on the same diet but I lost the same amount of weight. I was like oh, well hang on. Let me see if I can do this without exercise! And I lost the same amount of weight”, the actor said.\n\nOK, Cate Blanchett may not have had to undergo significant body transformations for the experimental drama film Manifesto, but how did she even manage to play 13 different characters?\n\nFrom a to a dirty homeless man to an unhappy factory worker, impossible is nothing for this Australian Hollywood star who nailed it in all these roles. When asked about what motivated her to take on these roles, Blanchett said jokingly: “I was attracted to Julian’s work because of the quietness —and then he came up with the polar opposite of a silent film. I was rather distressed, but, you know, I’d already said yes”.\n\nRemember the time Glenn Close nailed it in Hook? Of course, you don’t, cause you probably never realized it was actually her! Add that fake rugged grey beard and tons of makeup to her face, and voilá! Glenn Close is a pirate.\n\nAs you can imagine, Close had to go through two and a half hours of makeup every day before shooting. “I saw Glenn in increments. We’d try out different noses, ears, and wigs. When it was finally complete and she was in costume, it was like she was this odd little man standing next to me on set”, said director Rodrigo Garcia.\n\nTom Hanks has gone through striking body transformations for several roles, but nothing compares to the one in Cast Away. The Oscar-winning actor lost over 50 pounds to play a government employee who is stranded on an inhabited island for a few years after his plane crashes in the ocean.\n\nHanks weighed 225 pounds at the beginning of the film when he played the character in his healthy state. Then, they had to stop the production for a few months, until his weight dropped to 170 pounds. “The only thing I did not give up was coffee. Nope, wasn’t about to! Can’t do it! Excuse me, no, I’m not! Ain’t gonna happen, pal”, Hanks told Entertainment Weekly.\n\nHugh Jackman’s portrayal of Jean Valjean in Les Miserables is something out of this world. He had to lose quite a lot of weight for the role, which involved daily 3-hour workouts. But this is not all! To perform the scene in which he performs manual labor during his imprisonment, he wasn’t allowed to eat or drink for nearly a day!\n\n“I didn’t have anything to drink until late in the day when we did the opening scene with Russell Crowe,” he said. “You lose up to 10 pounds of water weight, mainly from the exterior of the body. But it was really brutal. About 20 hours in, a headache came. Then I wanted to drink water out of the ocean!”, Jackman told The Hollywood Reporter.\n\nIn 2017, Hollywood icon Emma Stone took on the role of professional tennis player Billie Jean King in the sports drama Battle of the Sexes. Stone had to gain some weight and muscle mass, but how did the manage?\n\nStone had to stick to strict gym routines and increase her calorie intake by taking protein shakes twice a day. “She put on 15 pounds, and that was really the goal from the beginning: to put on that kind of weight, to give her the confidence and to keep her healthy. And she nailed it.”, said the celebrity trainer Jason Walsh.\n\nIn 2017, J.K. Simmons played Commissioner Gordon in the adventure-fantasy film Justice League. The 62-year-old actor had to stick to a strict routine with the help of the A-list ex-Marine celebrity trainer, Aaron Williamson.\n\n“He wanted to get into the best shape he had ever been in. J.K.’s goal was to adopt a healthy lifestyle and never have to worry again about health issues”, Williamson said.\n\nEric Bana achieved worldwide fame after his breakthrough role in the crime biopic Chopper, where he played the role of a criminal who spent most of his life behind bars. His performance surprised the audience and critics alike since before this, Bana had mostly starred in comedy films.\n\nDid you know that Bana had to lose over 30 pounds for this role? And guess what? He also spent some time with the real-life “Chopper” Read to mimic his voice and expressions as best as possible. “The more research you do, the strongest your performance gets”, Bana said in an interview.\n\nFrench actor Vincent Cassel played a French gangster in Mesrine: Killer Instinct, and he went to great lengths to fulfill his role. He had to gain nearly 40 pounds for the second part of the film, which involved sticking to a strict high-calory diet for four months.\n\n“I grew up watching ‘Raging Bull. It was kind of a fantasy [to put on weight for a role]. I thought maybe once in my life I would have to do that kind of transformation. And now it’s done”, he said in an interview.\n\nYou probably know Jason Segel for his role in the famous sitcom How I Met Your Mother and he became somewhat of a sex symbol to many. But when he landed a role on the rom-com The Five Year Engagement, he had to gain quite a lot of weight.\n\n“It was fun for a week and then every night feels like Thanksgiving night, you’re just exhausted and you have no vital energy”, Segel claimed. The crazy part is that only one year later, he had to lose all that weight for his role in Letterman, which involved a great deal of exercise!\n\nJonah Hill rose to fame after his roles in comedy films such as Superbad, This Is the End and The Sitter, and you probably remember him for his burly figure. But he’s undergone an impressive body transformation, especially ever since he landed a role on 21 Jump Street in 2014.\n\n“I wanted to get in better shape, so I called Channing Tatum and said, ‘Hey, if I ate less and go to a trainer, will I get in better shape?”, the actor said. 2 years later, he had to gain over 50 pounds for the 2016 crime biopic War Dogs, but in 2017, he put himself on a strict diet all over again. Ever since 2018, he has kept his body in shape and works out every single morning.\n\nMila Kunis is one of the most gorgeous women out there, and that’s a fact, but she really got herself into the best shape of her life when she played a ballet dancer in the drama film Black Swan. However, Kunis confessed that even though she was satisfied with how she looked, reaching that shape involved very rough workouts that she’s not willing to undergo again.\n\n“I trained four hours a day, seven days a week, for seven months. I had one day off on my birthday and half a day off for the Emmys and the Golden Globes. On those days my ballet instructor worked with me from 5 am to 11 am, then I went to hair and make-up and on to the awards shows”, she said in an interview. A round of applause for Kunis, please!\n\nOK, so maybe Lily James’ weight transformation wasn’t as impressive compared to most other cases, but she still deserved a spot on our list. When she took on the role of Cinderella in the homonymous movie, the director told her she had to lose some weight, and this is what she did.\n\nJames went on a liquid diet for several weeks, because that blue corseted dress wouldn’t fit her at first. “When [the corset] was on we would be on continuous days so we wouldn’t stop for lunch or a lovely tea like this — you’d be sort of eating on the move. In that case, I couldn’t untie the corset. So if I ate food, it didn’t really digest properly and I’d be burping all afternoon … and it was just really sort of unpleasant”, James confessed.\n\nTom Cruise is truly unrecognizable in his role in the comedy-war film Tropic Thunder, but while most actors in this list underwent genuine body transformations for their roles, Cruise’s look was achieved with the help of heavy prosthetics.\n\nCruise portrayed Les Grossman, an aggressive, bad-mouthed, bald, and hairy-chested mogul, and wanna hear something funny? Apparently, he asked the director if his character could have fat hands. “I said, ‘This is fun.’ I said, ‘Do you mind Ben? I want to play this character.’ I said, ‘I want to have fat hands (…) So then I did the makeup test and we tested the fat hands and the whole look”.\n\nRocky Horror Picture Show is one of the most bizarre films out there and its characters are just hilarious. British actor Tim Curry played a transvestite alien obsessed with high heels and sexy underwear, so you can imagine that he needed quite a bit of makeup.\n\nThis film proved the power of prosthetics and make-up and their potential for film-making, and we can’t deny that Curry looks like a whole different person. When asked about his role, Curry claimed that wearing high heels onset during winter was no piece of cake: “I remember walking in mesh stockings and five inch-spike heels through the snow trying to find a bathroom”,he said.\n\nEven though Tom Cruise sure drew some attention with his portrayal of Les Grossman in Tropic Thunder, Robert Downey Jr. left us with our mouths wide open too. I bet you never expected Downey Jr. doing blackface, did you?\n\nDowney Jr. plays the role of Kirk Lazarus, an Australian actor who goes through surgery to darken his skin in order to play a black soldier in a movie about the Vietnam War. Don’t you worry, the actor didn’t undergo surgery in real life, it’s all just makeup! However, the director’s decision for him to go blackface sure sparked some controversy. “It’s entertainment that’s set up by people who are high-minded enough to not be racist or offensive”, Downey Jr. commented on the issue.\n\nRemember the time Russel Crowe played the role of the Roman General Maximus in Gladiator? Well, if you see him in the role of CIA boss Ed Hoffman in Body of Lies, you won’t believe it’s the same person. Sure, 20 years have passed since Gladiator, but still!\n\n“Ridley called up and said ‘Now, mate, would you mind putting on a significant amount of weight? I see him (the character) as an ex-athlete who has let himself go’”, Crowe told USA Today. Allegedly, the actor was so disgusted with his appearance, that he said he wasn’t willing to go through such a drastic body transformation for a mere role ever again.\n\nRenee Zellweger is a famous actress and model famous for her role in the rom-com Bridget Jones’ Diary. She had to put on quite a lot of weight for that role, and she went from being a size 4 to a 14!\n\nZellweger put on 30 pounds by eating 4,000 calories worth of snacks each day, twice the recommended amount for women. “I was afraid those pounds would disappear because we worked so much”, she confessed.\n\nThe gorgeous actress Natalie Portman lost 20lbs to play the role of ballerina Nina Sayers. Her excruciating diet was based on carrots and almonds. Her portrayal of the character made Portman win the Oscar, but she confessed there were times she thought she was going to die.\n\nMary Helen Bowers, a professional ballerina, designed the workout routine “Ballet Beautiful”for the actress and it lasted 5 hours a day, 6 days a week. Natalie spent an hour swimming, one-hour doing Ballet Beautiful, and about three hours doing ballet work and dancing. She even dislocated a rib when practicing. “Part of the art is hiding all the pain.” Portman said.\n\nBefore his role in Twilight, Taylor Lautner was 5’10 and a skinny 140-pound teenager. He needed to gain muscles to become a credible and powerful werewolf, and so he did. He bulked up 30 pounds in muscles and now he sports a lean body. Nowadays he is 170-175 pounds.\n\nLautner’s trainer, Jordan Yuam, said that the less muscle one has, the easier and quicker it is to gain muscle mass, thus, encouraging many young boys to work out. Sometimes, Lautner was exercising so hard that he began to lose weight. “If you’re trying to gain lean mass, focus on weight-lifting with the proper technique and the right plan,” Yuam says.\n\nIn order to tackle the role of Lisbeth Salander, the actress had to experience some physical changes, for example, she got her nipple and face pierced, her hair chopped, and her eyebrows dyed. But her appearance wasn’t the only challenge that the actress faced. In fact, she went through emotional and physical challenges to mold her character, such as drinking in excess, starving and even enduring physical violence when recording the movie’s rape scenes.\n\nMara remembers a night when director David Fincher told her “go out and get really, really drunk and come in the next morning so we can take pictures of you.” She had to look hostile, antisocial, alienated, and emaciated, and she nailed it. She threw up all night and look terrible the morning after.\n\nTo play the role of Charles Bronson, Tom Hardy spent 5 weeks gaining muscle. He had to put weight on, so instead of a balanced diet, his personal trainer —and former US Marine— Patrick Monroe (otherwise known as ‘Pnut’) decided to bulk him up with pizza, Häagen-Dazs and Coca-Cola. About Pnut, Hardy said he was using him as a walking gym.\n\n“Initially Charles Bronson was very disappointed when he saw me. He said “This kid will never be able to play me.’ I just told him, “Don’t worry Charlie I’ll fix it.’”When the actor came back two weeks later, Bronson was amazed at the change he saw: Tom had gained about 14lbs. Bronson’s sister revealed that Hardy sounded like her brother and even moved like her brother.\n\nUzo Aduba left her girly style and long hair when she played Crazy Eyes in Orange Is the New Black. Fans of the show have a hard time separating her from her iconic character, not only because of her performance but because she looks so different!\n\nNow that OITNBhas come to an end, Uzo reflects on what the future holds and she is really positive about it: “Anything is possible,” she told NBC Miami. “I know it because I’ve seen it. … The work will come. How fluidly and quickly it comes, I don’t know, and what comes, I really don’t know, but I know it will come.”\n\nAduba wasn’t the only lady on Orange Is the New Black who went through a major makeover. Just take a look at Taryn Manning. Manning is unrecognizable when she’s playing Pennsatucky, especially because of her teeth.\n\nUnluckily, she is not as happy as Uzo Aduba and she claims that upon its ending, the show “hurt her”: “This show hurt me more than anything has in my life and if this is what I have to do to push what I stand for I will,”as told by People. “Not one cast member cares about me (…) I have to speak out before anything happens to me,”the actress posted. However, she later claimed that her account was hacked by an outsider and that she didn’t say those things. Do you believe her?\n\nIn order to play the role of a Californian neo-Nazi named Derek Vinyard, Norton had to develop a lean and muscular physique. His coach, Anthony Krotes, designed a workout routine for him that targeted multiple muscle groups with each repetition, causing a rapid increase in growth. This routine plus a special diet based on chicken, turkey, fish, and protein shakes transformed his body from skinny to skinhead in just three months.\n\n“I knew this guy was going to have to be really physically fearsome and defined by rage, arming himself against his own emotional pain (…) this body is a manifestation of that.” Commented the actor. There were rumors that Arnold Schwarzenegger was so impressed by the speed transformation, that he contacted Norton in order to know if he had used steroids.\n\nWhere to begin? Tatiana plays over 12 different characters on Orphan Black, and has adopted so many looks we can’t keep up. Her different looks and her amazing performance makes viewers forget they’re all being played by the same actress.\n\nIn an issue of Vanity Fair, she explained what it was like to play more than one character at once: “That to me is the most exciting work to do because it’s so layered. It’s uncharted territory. It doesn’t feel like something I’ve ever done before. It’s really engaging to me in terms of the work that goes into it. I am really lucky to be surrounded by actors who are generous and supportive and don’t get bored by the fact that they kind of have to do the same thing over and over again, while I’m figuring this thing out and we’re doing this kind of technical thing over and over again. I think there’s a real team mentality to it, which makes it easy and fun to do.”\n\nThe Irish actor Colin Farrell gained 45 pounds in just two months by eating 4,000 melted calories in meals. He also avoided exercising or even moving at all. In the film, he interprets a man who has been married for 12 years and forgets to pay attention to himself and his appearance. Now, he has 40 days to find a new romantic partner or risk being turned into an animal.\n\n“It slowed my thought patterns down, it slowed my speech patterns down. For a short period of time, I was inhabiting a body that I’d never inhabited before. So I was really, physically, in a different place than I’d ever been before. I couldn’t imagine David any other way now,” Farrell said about his character.\n\nIn order to personify Chris McCandless, the actor had to lose a total amount of 41 pounds, split into 26 pounds for the first part of the journey and 15 pounds for the Alaskan leg of the film. It was two stages of weight loss.\n\n\n\n“So it was a lot of running and being very hungry and dreaming of candy all the time. It’s funny because normally, I’m not a big chocolate bar eater. But, that was really what I wanted more than anything when I was at my most hungry,” Emile confessed.\n\nFor his role as Hannibal King, Reynolds had to gain 25 pounds of muscle. For that purpose, his trainer, Darren Chapman designed a workout routine that lasted three months and entailed working out on a six-day-a-week basis, around 3 hours per day, generally starting off with around 500-1000 sit-ups. “After the first week I was longing for the sweet release of death, but soon enough got really into it.” Commented the actor.\n\nAfter his training for the film, Reynold’s career rocketed and he was offered many roles as a superhero, including Green Lantern and Deadpool in X-Men Origins: Wolverine, and even it helped him to play the leading role in his own film Deadpool. Now, Reynold continues working out hard. Don Saladino, his personal trainer in Deadpool, said that Reynolds really performs many of his stunts in the film. “For him to be able to do that, I need to make sure his body is moving as well as it looks.”\n\nThe actor, known for his portrayal of Jack in Lost, accepted the role of Picasso in the film Alex Cross with the one condition that he wanted a body transformation that would enable him to be a functioning employee, husband, and father. He wanted to build a natural and healthy body, but also menacing and a little psychotic.\n\n\n\nHe needed the energy to work, so he received a very balanced and nutritional diet to help him lose weight in a healthy way. He lost 40 pounds. “My mother hated it,” Fox says with a laugh. “She’s Italian and she’s a fantastic cook and loves to feed her son more than anything. She couldn’t stand it. It really upset her.”\n\nMatthew McConaughey gained 47 pounds for his role in Gold, and it became the first time the actor gained weight instead of muscle. His diet was based mostly on cheeseburgers and beer. He was given green light to eat whatever he wanted, whenever he wanted for a period of six months. He stopped exercising. The actor recognized that he even avoided taking the stairs to the second floor. “I was trying out all these fast food restaurants that I’ve never had.” McConaughey admitted.\n\nIn his house, his family nicknamed him “Captain Fun” during those six months because he would say ‘yes’ to everything. He was like “No, pizza night’s not just Friday night—it’s Tuesday night; it’s Wednesday morning.”The actor believes they love him more as a fat guy. To lose the weight he gained, he felt back to old standards: just diet and exercise.\n\nMargot Robbie not only had to change her appearance but also her voice and mannerisms when playing real-life figure skater Tonya Harding. When she was cast, the public was very skeptical, as she had to go through a major change, but she proved everyone wrong in the end.\n\nTo portray Tonya the right way, Margot not only had to undergo multiple physical transformations but also she had to take skating instruction…a very rigorous training, apparently. This is what she told Rolling Stone: “Every time my alarm would go off at like 5 a.m. I’d be like, ‘I can’t do it again today, I’m still so bruised from yesterday.’”\n\nFor his role in Southpaw, Jake had to prepare both physically and emotionally since there were already many boxing films and the bar was set very high. Regarding his body transformation, he spent around 5-6 months at the gym training 5 hours a day like a real boxer would do. His commitment to the training led his relationship with Alyssa Miller to an end.\n\n“I was just terrified that I would look like an idiot in the ring. I didn’t know how to box when I started. Therefore, I decided to train twice a day so it would give me an advantage.” Gyllenhaal proved himself as a very versatile actor. He can gain or either lose weight for his roles and he is ready to go all the way to personify different characters with different body characteristics. Slide to #16 to see him playing a malnourished creepy-looking cameraman in a 2014 film.\n\nThe most unfortunate body transformation award goes to Ryan Gosling. In Peter Jackson’s film, The Lovely Bones, the protagonist is a grieving father whose daughter was killed. The role was offered to Ryan Gosling and he pictured his character as a fat old man, deteriorated by losing his child. For the portrayal, the actor grew a beard and gained 60 pounds. Unfortunately, he forgot to discuss this with the director.\n\nWhen Gosling appeared in the set two days before the shooting started, Jackson was very dissatisfied with the actor’s look and fired him and hired Mark Wahlberg instead. Jackson said he had to fire Ryan because they had different ideas about the character’s appearance. As Gosling put it: “Then I was fat and unemployed.”\n\nMaisie Williams looks nothing like her character Arya on Game of Thrones. Unlike Arya, Maisie goes for longer hair and wears dresses mostly. And she’s not the only Game of Thrones actress on our list.\n\nBut it wasn’t all peaches and cream. The actor complained about having her chest constantly strapped during shooting: “But Arya was still very much like trying to be disguised as a boy and I had really short hair and they constantly covered me in dirt and shaded my nose so it looked really broad and I look like, really manly,” she told Yahoo. “And they would also put this strap across my chest to flatten any growth that had started, and I don’t know, that just felt horrible for six months of the year.”\n\nHannah Murray has dark hair when she’s playing Gilly on Game of Thrones. In real life, however, Murray has long, blond hair, and, obviously…she doesn’t dress like a peasant.\n\nIn an interview with Schon! Magazine, she shared the details about the set and what it was like to play Gilly: “The best part of getting to play Gilly has been the fact that she is constantly surprised and thrilled by the world around her — there is so much wonder for her because everything is new. That’s been really enjoyable to play and has also taught me so much about gratitude and joy. It’s taught me not to take anything, even the smallest things, for granted.”\n\nCurtis Jackson, otherwise known as 50 Cent, interpreted a football player diagnosed with cancer. The rapper’s normal weight is around 214 pounds. For the film of Director Mario Van Peebles, he lost nearly 60 pounds by starting a liquid diet and walking three hours a day on the treadmill. This punishing workout regime lasted nine long weeks.\n\nThe rapper even underwent an arm tattoo removal to help him in his burgeoning acting career. He decided to do it because he was tired of having to arrive at the set around 4 hours earlier than the other actors to have his tattoos covered up with makeup. He seems to be setting aside ’50 Cent’, the rapperand becoming more and more just ‘Curtis’, the actor. But, don’t worry, his iconic “50-cent tattoo” is still in his back… for now.\n\nFor the role of Fantine in Les Miserables, Anne Hathaway lost 25 pounds. There were rumors that she was on a starvation diet, eating less than 500 calories a day. According to her representative, she was eating the calories she needed and in no way less than 500 a day. The actress refused to reveal what her grueling diet was based on.\n\n“I kind of lost my mind doing that movie and it hadn’t come back yet (…) You win an Oscar, and you’re supposed to be happy. I didn’t feel that way. I felt wrong that I was standing there in a gown that costs more than some people are going to see in their lifetime.,” she confessed. She opined that it was wrong winning an Oscar for portraying pain.\n\nIn Dan Gilroy’s film, the actor personifies a creepy-looking paparazzo named Lou Bloom who crawls the night to find candid news to capture with his camera. About his character, Gyllenhaal said he saw Lou as a “Human coyote”, always hungry. Gilroy explained that it was mostly Jake’s idea to lose 25-30 pounds in order to portray this hunger and ambition, both, physically and figuratively.\n\n“Jake intuitively understood and I think it comes through on the screen when you watch it, there’s a very strange energy that emanates I would say from him, but it seems to come from his eyes. Where he’s not just hungry for food because every frame that you watch Jake Gyllenhaal in this film, he’s literally starving. Literally,” the director commented.\n\nIn the series Fargo, the Scottish actor had to put a sheer effort in order to bring into life the two Stussy brothers, Ray (center) and Emmit (right). They couldn’t be more different: Emmit is successful and very wealthy, while Ray is a parole officer who is broken. In performing them, Mcgregor had to make different voices and move in different manners.\n\n“‘Ewan, you need to put on weight.’ So at that point, I ordered a massive dessert. I started putting on weight from that second onwards.” Commented the actor about the conversation with Showrunner Noah Hawley when talking about Ray’s character. The actor does not know how much weight he piled up in three months, but he had to buy three new pairs of jeans with a waistband three inches larger than his usual pant size to wear from October to January.\n\nIt’s hard to recognize Lena Headey when she’s not playing Cersei on Game of Thrones. In real life, Lena sports short, wavy black hair and dark clothes. Both looks suit her well anyway!\n\nIn an interview with Vogue, she described her experience working on the TV show as “Surprising, life-changing, and unforgettable.”However, when asked about the qualities she admired the most about Cersei, this is what she told them: “(…)I’ve always said that she loves her children beyond all reason – and she never, ever gives up. If she was in a fight with a tiger she would just stay there until it gave up. So, I admire that. Her tenacity.”\n\nMayim Bialik has a nerdy look when playing the beloved Amy Farrah Fowler on The Big Bang Theory. In real life, Bialik goes for a chic, stylish look and doesn’t wear glasses. And she’s not the only comedy actress on our list…\n\nThe actor is now going through a difficult “breakup” now that the show is also over, so she’s turned to writing: “I’ve always been a writer; I’ve always had an interest in writing,” she told USA TODAY. “ I started my own site because I wanted to write about things other than just Jewish parenting, and also I really wanted to have more ownership over the brand that my writing seemed to fall into,” she added.\n\nEden Sher looks nothing like her character Sue from The Middle (though she looks a lot like Mayim Bialik, from the previous slide). The biggest difference, aside from the obvious fake braces, is that Eden has natural blond hair.\n\nWhen asked in which ways she could relate to her character, Sue, this is what she said: “This is such a hard question to answer because I feel like the lines have blurred in the past seven years. Oh my gosh, I am so sorry, I just found out my dog peed in my room! See! That’s how I relate. (laughs) It’s like wherever her attention is taking her at that moment,(…) Maybe it’s because of Sue, but I feel like I’ve become light-hearted with things that would usually make me upset.\n\nFor his role as Star-Lord in Guardians of the Galaxy, Pratt dropped more than 60 pounds in six months by working out 5 days a week for 4 hours a day, and by eating 4,000 calories a day. “He isn’t the client you have to push; he’s the type of client you have to pull down. If you were to walk into the gym when he was training, you would have thought for sure you’ve got a guy getting ready for the NFL Combine.”Said his personal trainer Duffy Gaver. Duffy Gaver has trained many other actors to land their roles. Continue to the TOP 10 and you will find out.\n\nAccording to Gaver, Pratt spent the first two months doing bodybuilding. Once he had gained enough muscle mass, he added cardio workouts and conditioning circuit routines, like swimming, mountain biking, and weightlifting. The actor wanted more muscle, to be much leaner and fit. His selfie went viral almost immediately: As he was generally a rather chubby boy, his six-pack abs and developed pectorals came as a surprise and became trending topic within hours.\n\nFor his role in Steven Soderbergh-directed film The Informant!, Damon had to pile on 30 pounds. He gained all the weight needed for the role with a strict diet of junk food. The actor recognized that it was very easy and very fun undergoing this eating binge because he just dropped the gym and ate everything that caught his eye.\n\n“I definitely got doughy. I started eating like crazy and drinking dark beer. Between meals on set, I’d eat a No. 1 Value Meal at McDonald’s and then Doritos on top of it. It was absolute heaven.” Confessed the actor with a bit of nostalgia. However, Damon said that he had to struggle when it came to getting rid of those extra pounds. He was forced to take up boxing to burn extra calories.\n\nIn order to portray the story of real-life adventurer Yosseph “Yossi” Ghinsberg who was left stranded in the Amazon rainforest, the star of the Harry Potter series, Daniel Radcliffe, had to starve himself for two months. The British actor lost about 14 pounds over the course of the shooting since he wanted to recreate the scrawny body of Yossi’s ordeal, in which he lost 35 pounds due to hunger and infection.\n\n“He was starving himself. He didn’t have to. He was pretty thin to begin. But he wanted to feel what I did. He could not be there with a full tummy, eating steak and pretending he was starving in the jungle. He wanted to feel hungry. It was quite admirable to see him starving on one hard-boiled egg when there was a chef on-site and nice food.,” Yossi said, who helped on set, about Radcliffe.\n\nTo interpret the Asgardian God of Thunder, Hemsworth, like many other actors, resorted to former Navy SEAL Duffy Gaver for the first movie of Thor, and for the rest of the movies, the actor trained with Luke Zocchi. Chris, unlike most of the actors, took this training with such enthusiasm, energy and effort, and with such good results that when you punch his name into Google, “Chris Hemsworth Workout” is the top search suggestion.\n\n“We train six days a week for about an hour, but never much over an hour, but we go hard during that time frame. I do train when I’m not playing Thor, but I’m less bulky because I eat less and my workouts are more rounded and less centered around being muscular. I usually put on about 20lb of muscle to play Thor,”\n\nKate McKinnon is not afraid to change her looks drastically, all for the sake of comedy. The glamorous star looks completely different from her characters on Saturday Night Live, right?\n\nIn the second picture, McKinnon is in the middle of her performance during “Close Encounters”, which is probably the funniest sketch in SNL history. During this skit, several actors are breaking character and laughing at the hilarious McKinnon as she recalls her experience during an alien abduction. Make sure you check it on YouTube, Ryan Gosling’s cry is something you can’t miss!\n\nFor her transformation into Lieutenant Jordan O’Neil, the first female Navy SEAL, Moore would get up very early in the morning to start exercising at 4 a.m. so she could complete her workout routine before filming started, which included Navy SEAL training such as underwater running, cardio, and martial arts. She was trained by the celebrity trainer Gregory Joujon-Roche and by Navy SEAL instructor Stephen Helvenston to help her thinking and behaving like a real SEAL.\n\nThe actress said she enjoyed having her head shaved but the weirdest thing about it was that many people wanted to touch it. “The funniest responses came from my children, who would say to friends, ‘Hey, do you want to come look at my mom’s head?’ as if I were a show-and-tell item.” Demi Moore attempted to contact President Bill Clinton to request assistance from the US Department of Defense in helping with G.I. Jane’s production.\n\nFitness trainer Patrick Murphy was in charge of transforming Efron’s body for the film in only three months. In order to gain muscles, the actor had to give up junk food and start eating healthier. Of course, he also had to train five or six days a week and, sometimes, twice a day. Murphy trained the actor and he never went through the same exact workout twice, so as to avoid fitness plateaus. Efron was put on a serious weight-training workout, undertook lifeguard training, and had to bike for about 30 miles.\n\nZac stayed away from all highly refined, processed foods. No flour products whatsoever. So he could have quinoa, but not quinoa crackers. He could have brown rice, but not brown-rice pasta. Same with fruit. He could have an apple, but not apple juice. Once a week he was allowed a cheat meal, but mostly it was just veggies, nuts and seeds, and lean proteins. “The most important thing that I have learned in terms of diet is to keep away from processed foods, and stick to organics as long as I can. I have a firm belief of no eating chemicals and really, really trying to isolate where my food is coming from.”, said the actor.\n\nIt’s not easy for a girl to give up her locks for a role, but 12-year-old Millie Bobby Brown said goodbye to her long her to play Eleven in Stranger Things. After filming, Millie let her hair grow back again, although she looks good with a shaved head too.\n\nDespite the fact that she’s only 15 years old, she has a very mature and professional attitude towards her work. The English actress is also a Unicef ambassador and when asked about how she deals with all this sudden fame, this is what she had to say: “(…) the word fame isn’t really something I live by. I have one job—and that’s to act. It isn’t to be famous. (…) With fame comes a lot of negative and positive aspects. But one of its good aspects was my becoming a goodwill ambassador for Unicef. (…) Now, I can support children’s rights and help young boys and girls fulfill their dreams and get what they deserve—like education, clean water, vaccines, home for their families and a safe place to be.”\n\nShannon Purser, who also appears on Stranger Things looks very different off-camera. When playing Barb, she cut her hair short and wore glasses. However, in real life, she usually goes for a more chic look and longer locks.\n\nAfter her character got brutally and suddenly…annihilated in the series, people started a movement represented with the hashtag #JusticeForBarb. The actress reckoned the public’s interest in defending the underdog: “There’s definitely this relatability about Barb. She’s kind of awkward and misunderstood and lonely in high school (…) I think she just resonated with a lot of people and she reminded them of their high school experience. All of us weren’t the popular kids—some of us were just different or the third wheel.”\n\nTo interpret the role of Bobby Sanders, the real-life prisoner who headed the Second Provisional IRA hunger strike in 1981 and died after 66 days without food, Fassbender underwent a fast of his own that lasted 10 weeks altogether with daily walks, yoga and skiing. For a while, he only ingested a small can of sardines, water, coffee, berries and nuts -around 900 calories a day.\n\nThe actor confessed that the nights were hard. He had difficulty sleeping, if he could sleep at all. He described his experience as a “psychological prison because he had to calorie-count and became obsessed with numbers”. He was lonely because seeing friends was a distraction and a temptation, he was cranky and hungry. So, when the film wrapped, the first thing he ate was sushi. “It was interesting because my body wasn’t used to handling food. But the weight went on really quickly. After two weeks, I was only around 6 pounds behind my normal weight.” Said Michael\n\nAmerica Ferrera had a major makeover when starring in Ugly Betty. As the title of the show hints, she had to de-beautify herself for the typical geeky look. “The only reason someone like me could step in and play characters who are more than just the maid was because of actors like Lupe who came before me, whose careers were very limited by stereotypes,” the actress told Independent\n\n“Physically we don’t look alike but I totally relate to Astrid in the sense that I’m very competitive too. I love relaying that message to girls that its OK to be ambitious and set your sights high,” she added.\n\nSince we mentioned Margot Robbie, let’s talk about her lookalike, Jamie Pressly. Pressly got extensions and a complete wardrobe makeover to play Joy on My Name Is Earl, along with an extra-thick southern accent.\n\n“Part of what makes someone a good actor or actress is someone who can take a character and personalize it in some way. When you’ve been through something that the character you’re playing has been through also, you can kind of start to understand them,”she revealed.\n\nIn Chapter 27, Leto plays Mark David Chapman, the deranged fan who assassinated John Lennon. For this role, the actor had to pile up 67 pounds since Chapman’s appearance had so much to do with who he was. As a consequence of his weight gain, Jared was affected by the ‘gout’ disease and his cholesterol went up very rapidly. Doctors wanted to put him on Lipitor —which is meant for much older people. However, he said that if he was to personify Chapman, he had to experience first hand how it was to be in his skin.\n\n“The script didn’t say, ‘Page 1: You gain 67 pounds, and you’re miserable for two months’ but in the end, I wanted to explore a specimen embodying the total failure of humanity.” Explained the actor. Even if he didn’t spend a long time recovering his previous weight, mostly by going on tour with his band 30 Seconds to Mars, Leto vowed he would not pack any more calories for a movie again because he does not want to put his health in jeopardy.\n\nBale has undergone many body transformations throughout his career, and David O’ Russell’s film wasn’t the exception. The actor had to grow a massive belly to play the role of a con man, but it wasn’t the only change that the Dark Knight had to endure. He also had to cut off all his hair in order to interpret a balding man who glues and hairsprays a toupee onto his head. Don’t worry! His wife still fancies him and his daughter finds it amusing slapping her dad in his bald head and belly and teasing him about it.\n\n“I thought I was going to lose the weight I gained for American Hustle. I said, two months, flat, that’ll do it, I was 185, and I went up to 228 for it and I’m still working that off! It’s almost six months later. Now, I know that when I was in my early 20s, it would have been two months and that’s it,” the actor explained when promoting the film.\n\nModern Family’s Alex is a nerdy, not-so-fashionable girl. But in real life, Ariel Winter looks completely different. Off-camera, Ariel goes for tight dresses and high heels. Gorgeous!\n\nAfter having grown up on the sitcom, the actress reckons it will be hard to say goodbye to her “Modern Family”. Bear in mind that she’s been Alex Dunphy since 2009 (she was only 11 at that time!) This is why she is now excited to play people her ow age: “Alex is a great character, but Alex doesn’t change a ton” I was a kid as Alex on the show and now I’m an adult as Alex, so it’s a little different than the roles I want to play. I don’t want to play kid to adult. I want to just play my age now,” she admitted.\n\nChris is known for his well-developed muscles, but in the Ron Howard-directed film inspired by Moby Dick, he had to shed 15 pounds to depict Owen Chase, a starving seaman who had to survive in the Heart of the Sea after a whale hits his boat. Previously to this role, the actor had been already losing pounds for his part in Black Hat, so he had to undergo two consecutive diets that left him with protruding collarbones and visible ribs through his skin, and awarded him the #3 in this podium.\n\n“A day’s rations were a boiled egg, a couple of crackers and a celery stick. I was skinnier than ever before, but at least we were losing weight together — the bond we formed was incredible. It reminded me of being on a football team, growing up, where you’d do anything for each other. You don’t often get that on set,” the actor commented about his co-stars Cillian Murphy and Ben Whishaw.\n\nThe actor and frontman of 30 Seconds to Mars lost nearly 40 pounds to pull off the role of Rayon, a transsexual woman living with AIDS. Such a weight drop had taken a toll on his health: it affected the way he normally moves, sits and even thinks, but also the way people look at him. Some relatives of the actor weren’t aware of the role and thought he was sick when they saw him so gaunt.\n\n“I stopped eating, it wasn’t an easy thing to do. It was 30 or 40 pounds I lost. After a while, I stopped counting. I was drinking a lot of tea, it takes a while for your body to understand that it has to feed off of itself and that you’re not going to give it something else from the outside.”Explained Leto.\n\nMadeline Brewer took on many roles that required a makeover. The biggest change came with her role in The Handmaid’s Tale, where she’s missing an eye. Not only that, but she was also on —yup, you guessed it— Orange Is the New Black, sporting blond cornrows.\n\nIn an interview with Harper’s Bazaar she discussed the horrors her character, Janine, has to go through in The Handmaid’s Tale: “I really wanted to do her justice. She’s not just someone who has been taken out of her world and thrown into this new world where she’s been completely stripped of her rights. For any woman, that would make you lose your mind. (…) Janine’s outlook on the world after she gets her eyeball popped out and she spent almost two years in Gilead—her version of crazy is a very smart and calculated one. She is doing what she has to do to survive, and for some people that is just playing pretend.”\n\nThe beautiful actress underwent a big transformation to portray Aileen Wuornos, a real-life serial killer and former prostitute who lived in the street on bad weather. Theron was committed to the role and consequently, she did not only gain 30 pounds but also wore contact lenses and prosthetic dentures, shaved off her eyebrows and bleached them out, colored her hair —which was repeatedly thinned and fried— and used a lot of makeup to make her skin look aged, blotchy and sun-damaged.\n\nFar beyond being impressed with the makeup and the weight, many people were mesmerized by the physical posturing of the actress —the swagger— that was a clear representation of a tough exterior masking Wuornos’s wounded and conflicted interior. Theron’s depiction of Wuornos earned her the Academy Award and Golden Globe Award. “There’s not enough fat or prosthetics in the world to hide a bad performance, and she is incredible in the movie.”Theron’s co-star, Christina Ricci, told reporters.\n\nJonah Hill has undergone many body transformations, but his most dramatic change is undoubtedly for his role in Maniac. He is now a shadow of his former self. The actor used to be overweight since he had to pile up over 40 pounds for his role in War Dogs but now he has a svelte figure thanks to the advice of his 21 Jump Street co-star Channing Tatum.\n\nJonah now wants to be slim as well as healthy. The desire of being healthy came along with the age. “It’s hard because a lot of people want you to be the guy you were when they met you. I want to mature, literally, in how I treat myself”. Hill could change his image by correcting his eating habits and exercising. As he put it: “I started physically running instead of emotionally running and also began doing 10 push-ups a day and eventually managed to worked my way up to doing 100 push-ups a day.”\n\nWhile preparing for his role as an emaciated insomniac in the film, Bale was on a very strict diet based on one apple, one spring water can of tuna, 2-3 cups of black coffee per day and a lot of water which allowed him to lose around a staggering 63 pounds in 4 months. He also had to take multivitamins to compensate for all the nutrients he was missing. He developed a skeletal body that shocked everybody, even Bale himself.\n\nThe actor said that during those months he could barely move and that he spent 10 hours a day reading books. He described that period as a time with “no rollercoaster of emotions”. Before the diet began, Bale made sure to indulge himself with all the food he was going to miss. “Bye bye those lovely home made pies and cupcakes … and steaks and french fries … I will miss you all very very much!”\n\nNaomi Grossman takes the cake when we’re talking about shocking transformations. When playing Peeper in American Horror Story: Asylum, Grossman had to go through extensive hours of makeup, and her look actually didn’t involve any CGI. Impressive!\n\n“I find the makeup really informs the character. You get those big ears and nose and brow on, and boom! It’s Pepper-time!” the actress wrote in a note for Entertainment Weekly. “Come to think of it, the only thing that’s truly mine is the hair (or what little they left of it). (…) I remember that first big shave so clearly: I was cackling hysterically, the hair/makeup crew was chanting my name, and later went on and on, calling me the bravest actress in the world.”", "opengraph": {"type": "article", "title": "Top Before-And-After Body Transformation Actors Had To Undergo For A Role", "url": "https://worldlifestyle.com/top-before-and-after-body-transformation-actors-had-to-undergo-for-a-role/", "description": "Most people think acting isn’t too hard. But it demands a lot of commitment to a role. They read the script for hours, learning everything about their character. Actors go to the lengths of m…", "article:published_time": "2023-03-31T16:13:16+00:00", "article:modified_time": "2023-03-31T16:13:16+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/1d17beae-a1fd-428f-9f6f-aa87972b7c2e.jpeg", "image:width": "800", "image:height": "521", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-03-31T16:13:16+00:00"}