{"result_id": "349015", "URL": "https://worldlifestyle.com/this-lawyer-is-one-of-the-last-people-alive-who-still-uses-an-iron-lung/", "timestamp": "2023-04-25 18:16:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://worldlifestyle.com/this-lawyer-is-one-of-the-last-people-alive-who-still-uses-an-iron-lung/", "encoding": "UTF-8"}, "image": null, "domain": "worldlifestyle.com", "title": "This Lawyer Is One Of The Last People Alive Who Still Uses An Iron Lung", "cleaned_text": "Paul Alexander is one of the only people alive that still uses an iron lung to breathe. One of only ten people in the world that still uses this almost obsolete machine, maintaining it gets harder and harder. However, this 71-year-old has never let his iron lung deter him from doing what he wants to do; he’s taken it to law school, traveled around the world, and even retaught himself how to breathe. Simply put, he’s amazing.\n\nWhen Paul Alexander was only six years old, he suffered from polio, which left him unable to breathe on his own. When he woke up in his iron lung for the first time, he was in utter shock, “I didn’t know what had happened. I had all kinds of imaginings, like I’d died. I kept asking myself: Is this what death is? Is this a coffin? Or have I gone to some undesirable place?”\n\nAlexander remembers the fear his mother had when polio was attacking children in their area, “I remember walking into my mom’s kitchen one day and her turning around and saying, ‘Oh no,’ and I was like, ‘Mom, I know I’m muddy and dripping on the floor. She said, ‘Paul go get a bath. Right now,’” The poliovirus is spread when the fecal matter of an infected person is ingested either by food or water, and mud was just about the last thing his mother wanted to see on her child.\n\n“After I got the mud off, she put me up in her bed and she knew instantly. Every parent in Dallas, and everywhere else, was so afraid that the polio epidemic was going to come see their child. So, she knew right away.” This was just the beginning of Alexander’s hell.\n\nDuring the first few days of the polio infection, Paul Alexander remembers the effects on his body, “Every day, I could do a little bit less,” he said, “Every day it was harder to hold onto the crayons. It was like the devil going through my body, shooting all the lights out.” When his parents took him to the hospital, the doctors made a grave mistake.\n\nBy the end of the first week of his illness, he had stopped breathing and doctors pronounced him dead. The only thing was, he wasn’t dead. They wrongfully pronounced him dead, laying him next to other children that didn’t make it until luckily, one doctor reexamined him. When he noticed he still had a fighting chance, he rushed him into an iron lung.\n\nFor weeks, the child lay unconscious, barely hanging onto life. Speaking about the man who saved his life, Alexander had a grateful yet sad tone in his voice, “Nobody ever knew what happened or why he picked me up, and unfortunately, I never got to ask him. But he picked me up in both arms and ran upstairs with me, and performed the tracheotomy, so they could get all the congestion out and so I could breathe.” His new iron lung would prove challenging, as the young child was now encased in a strange world.\n\nIt was a miracle that he was saved, as he was assumed to be one of the many lost to polio. Upon reflecting on the circumstances, Paul said, “He did all that, and I don’t know what he saw – could’ve been nothing, could’ve been something – but for whatever reason, he was motivated to save this one child.” This child would grow up to truly be one of a kind.\n\nAn iron lung is essentially a massive mechanical respirator. It uses negative pressure to allow air to be pushed into the patient’s lungs, allowing them to breathe on their own while in it. Although his life changed forever, the young boy soon turned into a man and with that, he learned how to make his environment work for him.\n\nHe wasn’t going to give up on his dreams, so he even went to college with it,” The way I looked at it initially is that I could adapt myself to the iron lung or I could make the iron lung adapt to my desires [and] lifestyle. So I decided, how about the latter? I have travelled with it — put it in a truck, took it with me. I’ve gone to college with it, lived in a dorm. That freaked everybody out.” But over the years, maintenance has proved difficult.\n\nDue to the limited number of iron lung’s in existence, finding parts to keep his machine running hasn’t always been easy, “A lot of people who had polio and they’re dead. What did they do with the iron lung? I’ve found them in barns. I found them in garages. I’ve found them in junk shops. Not much, but enough to scrounge [for] parts,” he said. As if finding parts wasn’t hard enough, finding someone who knew how to repair the almost ancient machine also proved challenging.\n\nLuckily, modern technology actually helped Alexander in his quest to find a mechanic. Using YouTube to post a video, Alexander was able to locate a man by the name of Brady Richards, who had an old iron lung in his garage. Richards runs a lab which tests equipment to ensure they meet environmental standards, so he was the perfect man to help with up-keep on the iron lung. You may be wondering why he doesn’t use something more modern than the iron lung with his medical challenges…\n\nAlexander says it’s all about simplicity, “It’s a rather simple machine,” he said. “Give me electricity and I’m OK.” He says newer technology just doesn’t cut it for him like his trusty iron lung. But what may surprise you, even more, is the fact that he can live outside the lung, and he does, most of the day. Here’s how.\n\nAlthough he has now taught himself how to breathe in a totally different way than you or I do, he couldn’t always get out of his iron lung, “It was years and years and years before I developed another way of breathing. It’s a task that requires a lot of energy. But I was challenged to do it, I did it, and it took me a year to get it up to three minutes.”\n\nHe shared how he learned how to breathe without the machine and without the use of his respiratory muscles on a Canadian talk show, called As It Happens, “What I do is I use my throat to gulp,” he said. “I gulp in breaths and swallow them into my lungs.” Only after a long day of this exasperating type of breathing does he climb in the iron lung to sleep. He doesn’t live alone, however, because there are still a few things he still needs help with.\n\nHe lives with a caretaker, who helps him turn the machine on and off, which he can’t do by himself. He also needs help shaving, but considering how much he can and has done on his own, his story is inspiring. Which is why, in part, he has decided to write a memoir highlighting his experience surviving polio. The other reason he decided to write his own memoir is terrifying.\n\nAs there is no known cure for polio, only a preventative vaccine, recent surges in the disease have caused concern for many. Alexander, believing his experience might educate those who support the anti-vaccination movement, decided to share the challenges he has faced after polio ravaged his body.\n\n“It’s their decision. But I gave them facts about polio. It’s been a hard life. It’s been tough. I’ve been abandoned by attendants. I’ve been very sick on occasions. I’ve had the government deny me care,” he said in the talk show interview. He’s about to tell us all just how hard his life has been.\n\nAlthough he is adamant that he would never write a book telling people how to raise their children, it’s important for them to know how he has struggled. His memoir should be out by this coming spring, and many hope his story will bring more attention to the resurfacing of the poliovirus. Another message Paul Alexander has for the world is to be more compassionate, like the people who have so eagerly helped him. Recently, he’s received a gift that made his life a whole lot easier.\n\nAs a part of the Texas Ramp Project, the Waxahachie Rotary Club builds wheelchair ramps for people in need in the area and they recently heard about Paul’s situation, they wanted to see if they could help. In exchange for a ramp in front of his house, he agreed to become a spokesperson to end polio. He eagerly agreed.", "opengraph": {"type": "article", "title": "This Lawyer Is One Of The Last People Alive Who Still Uses An Iron Lung", "url": "https://worldlifestyle.com/this-lawyer-is-one-of-the-last-people-alive-who-still-uses-an-iron-lung/", "description": "Paul Alexander is one of the only people alive that still uses an iron lung to breathe. One of only ten people in the world that still uses this almost obsolete machine, maintaining it gets harder …", "article:published_time": "2023-04-01T01:43:31+00:00", "article:modified_time": "2023-04-01T01:43:31+00:00", "site_name": "Worldlifestyle", "image": "https://worldlifestyle.com/wp-content/uploads/2023/03/2f4b6428-b9a4-47e9-976c-7a37a96cddfa.jpeg", "image:width": "800", "image:height": "526", "locale": "en_US"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [""], "publish_date": "2023-04-01T01:43:31+00:00"}