{"result_id": "350043", "URL": "https://worldtruth.tv/you-want-to-vaccinate-my-child-no-problem-just-sign-this-form/", "timestamp": "2023-04-25 18:18:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/you-want-to-vaccinate-my-child-no-problem-just-sign-this-form/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "You Want To Vaccinate My Child? No Problem, Just Sign This Form", "cleaned_text": "I have yet to meet a Physician that will sign this form now downloaded by hundreds of parents. The reason they won’t sign is two-fold: First, they do not want to place themselves in a vulnerable position of being negligent for not providing informed consent to thousands of other parents; and second, many of them realize after their own extensive research that the risks far outweigh any benefits when it comes to vaccination.\n\nIt’s been over a year since hundreds of parents have downloaded this form and there are still no reports of any signatures. Many physicians won’t even look at the form while they dismiss a parent’s anti-vaccination stance as ridiculous. The behavior is a clear indication of a very misinformed Physician who does not have his or her patient’s best interests at heart. They are not willing to inform their patients of the risks, only the benefits they feel are acceptable. They are not open-minded to any other side of the debate except their own biased view passed down through the medical system.\n\nThen are those Physicians who have questioned the vaccination schedules and will pursue their own research. Many of them are now awakening themselves thanks to ongoing research and pressure from parents and even other colleagues to look at other perspectives besides their own indoctrination. If you are pressured by any Physician to vaccinate, please download and print this form (and send us a Physician signed copy if possible). Assertively state to your Doctor that it is the only way you will fully informed to consider vaccination, and that an analyses of the risks and benefits will better allow you evaluate the decision.\n\n100% of Physicians approached with this form have so far declined to sign it.\n\nThe following form was adapted from Ken Anderson’s original.\n\n\n\n PHYSICIAN’S WARRANTY OF VACCINE SAFETYI (Physician’s name, degree)_______________, _____ am a physician licensed to practice medicine in the State/Province of _________. My State/Provincial license number is ___________ , and my DEA number is ____________. My medical specialty is _______________I have a thorough understanding of the risks and benefits of all the medications that I prescribe for or administer to my patients. In the case of (Patient’s name) ______________ , age _____ , whom I have examined, I find that certain risk factors exist that justify the recommended vaccinations. The following is a list of said risk factors and the vaccinations that will protect against them:\n\n Risk Factor __________________________\n\n Vaccination __________________________\n\n Risk Factor __________________________\n\n Vaccination __________________________\n\n Risk Factor __________________________\n\n Vaccination __________________________I am aware that vaccines may contain many of the following chemicals, excipients, preservatives and fillers:* aluminum hydroxide\n\n * aluminum phosphate\n\n * ammonium sulfate\n\n * amphotericin B\n\n * animal tissues: pig blood, horse blood, rabbit brain,\n\n * arginine hydrochloride\n\n * dog kidney, monkey kidney,\n\n * dibasic potassium phosphate\n\n * chick embryo, chicken egg, duck egg\n\n * calf (bovine) serum\n\n * betapropiolactone\n\n * fetal bovine serum\n\n * formaldehyde\n\n * formalin\n\n * gelatin\n\n * gentamicin sulfate\n\n * glycerol\n\n * human diploid cells (originating from human aborted fetal tissue)\n\n * hydrocortisone\n\n * hydrolized gelatin\n\n * mercury thimerosol (thimerosal, Merthiolate(r))\n\n * monosodium glutamate (MSG)\n\n * monobasic potassium phosphate\n\n * neomycin\n\n * neomycin sulfate\n\n * nonylphenol ethoxylate\n\n * octylphenol ethoxylate\n\n * octoxynol 10\n\n * phenol red indicator\n\n * phenoxyethanol (antifreeze)\n\n * potassium chloride\n\n * potassium diphosphate\n\n * potassium monophosphate\n\n * polymyxin B\n\n * polysorbate 20\n\n * polysorbate 80\n\n * porcine (pig) pancreatic hydrolysate of casein\n\n * residual MRC5 proteins\n\n * sodium deoxycholate\n\n * sorbitol\n\n * thimerosal\n\n * tri(n)butylphosphate,\n\n * VERO cells, a continuous line of monkey kidney cells, and\n\n * washed sheep red bloodand, hereby, warrant that these ingredients are safe for injection into the body of my patient. I have researched reports to the contrary, such as reports that mercury thimerosal causes severe neurological and immunological damage, and find that they are not credible.I am aware that some vaccines have been found to have been contaminated with Simian Virus 40 (SV 40) and that SV 40 is causally linked by some researchers to non-Hodgkin’s lymphoma and mesotheliomas in humans as well as in experimental animals. I hereby warrant that the vaccines I employ in my practice do not contain SV 40 or any other live viruses. (Alternately, I hereby warrant that said SV-40 virus or other viruses pose no substantive risk to my patient.)I hereby warrant that the vaccines I am recommending for the care of (Patient’s name) _______________ do not contain any tissue from aborted human babies (also known as “fetuses”).\n\nIn order to protect my patient’s well being, I have taken the following steps to guarantee that the vaccines I will use will contain no damaging contaminants.\n\nI have personally investigated the reports made to the VAERS (Vaccine Adverse Event Reporting System) and state that it is my professional opinion that the vaccines I am recommending are safe for administration to a child under the age of 5 years.\n\nThe bases for my opinion are itemized on Exhibit A, attached hereto, — “Physician’s Bases for Professional Opinion of Vaccine Safety.” (Please itemize each recommended vaccine separately along with the bases for arriving at the conclusion that the vaccine is safe for administration to a child under the age of 5 years.)\n\nThe professional journal articles I have relied upon in the issuance of this Physician’s Warranty of Vaccine Safety are itemized on Exhibit B , attached hereto, — “Scientific Articles in Support of Physician’s Warranty of Vaccine Safety.”\n\nThe professional journal articles that I have read which contain opinions adverse to my opinion are itemized on Exhibit C , attached hereto, — “Scientific Articles Contrary to Physician’s Opinion of Vaccine Safety”\n\nThe reasons for my determining that the articles in Exhibit C were invalid are delineated in Attachment D , attached hereto, — “Physician’s Reasons for Determining the Invalidity of Adverse Scientific Opinions.”\n\nI understand that 60 percent of patients who are vaccinated for Hepatitis B will lose detectable antibodies to Hepatitis B within 12 years. I understand that in 1996 only 54 cases of Hepatitis B were reported to the CDC in the 0-1 year age group. I understand that in the VAERS, there were 1,080 total reports of adverse reactions from Hepatitis B vaccine in 1996 in the 0-1 year age group, with 47 deaths reported.\n\nI understand that 50 percent of patients who contract Hepatitis B develop no symptoms after exposure. I understand that 30 percent will develop only flu-like symptoms and will have lifetime immunity. I understand that 20 percent will develop the symptoms of the disease, but that 95 percent will fully recover and have lifetime immunity.\n\nI understand that 5 percent of the patients who are exposed to Hepatitis B will become chronic carriers of the disease. I understand that 75 percent of the chronic carriers will live with an asymptomatic infection and that only 25 percent of the chronic carriers will develop chronic liver disease or liver cancer, 10-30 years after the acute infection. The following scientific studies have been performed to demonstrate the safety of the Hepatitis B vaccine in children under the age of 5 years.\n\n ____________________________________\n\n ____________________________________ _____________________________________\n\nIn addition to the recommended vaccinations as protections against the above cited risk factors, I have recommended other non-vaccine measures to protect the health of my patient and have enumerated said non-vaccine measures on Exhibit D , attached hereto, “Non-vaccine Measures to Protect Against Risk Factors” I am issuing this Physician’s Warranty of Vaccine Safety in my professional capacity as the attending physician to (Patient’s name) ________________________________. Regardless of the legal entity under which I normally practice medicine, I am issuing this statement in both my business and individual capacities and hereby waive any statutory, Common Law, Constitutional, UCC, international treaty, and any other legal immunities from liability lawsuits in the instant case. I issue this document of my own free will after consultation with competent legal counsel whose name is _____________________________, an attorney admitted to the Bar in the State of __________________ .\n\n _________________________ (Name of Attending Physician)\n\n ______________________ L.S. (Signature of Attending Physician)\n\n Signed on this _______ day of ______________ A.D. ________\n\n Witness: _________________ Date: _____________________\n\n Notary Public: _____________Date: ______________________\n\nI’m really anxious to hear back from any readers whose doctor decides to sign this document in an effort to satisfy your peace of mind. I also have a lengthy list of legal professionals who are very curious as well.", "opengraph": {"description": "I have yet to meet a Physician that will sign this form now downloaded by hundreds of parents. The reason they won't sign is two-fold: First, they do not want to place themselves in a vulnerable position of being negligent for not providing informed consent to thousands of other parents; and second, many of them realize after their own extensive research that the risks far outweigh any benefits when it comes to vaccination. It's been over a year since hundreds of parents have downloaded this form and there are still no reports of any signatures. Many physicians won't even look", "title": "You Want To Vaccinate My Child? No Problem, Just Sign This Form", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/you-want-to-vaccinate-my-child-no-problem-just-sign-this-form/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-06-16T12:39:03-04:00", "article:modified_time": "2019-06-16T16:09:36-04:00", "updated_time": "2019-06-16T16:09:36-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fyou-want-to-vaccinate-my-child-no-problem-just-sign-this-form%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fyou-want-to-vaccinate-my-child-no-problem-just-sign-this-form%2F&text=You+Want+To+Vaccinate+My+Child%3F+No+Problem%2C+Just+Sign+This+Form", "#", "/cdn-cgi/l/email-protection#516e2224333b3432256c083e2474636106303f25746361053e74636107303232383f3025347463611c287463611239383d357462177463611f3e74636101233e333d343c7463127463611b2422257463610238363f74636105393822746361173e233c77333e35286c1874636139302734746361283425746361253e7463613c3434257463613074636101392822383238303f7463612539302574636126383d3d7463612238363f74636125393822746361373e233c7463613f3e26746361353e263f3d3e30353435746361332874636139243f35233435227463613e37746361213023343f25227f746361053934746361233430223e3f74636125393428746361263e3f746366257463612238363f746361382274636125263e7c373e3d35746210746361173823222574631274636125393428746361353e7463613f3e2574636126303f25746361253e746361213d3032347463612539343c22343d273422746361383f7463613074636127243d3f342330333d34746361213e223825383e3f7463613e377463613334383f367463613f34363d3836343f25746361373e237463613f3e2574636121233e273835383f36746361383f373e233c3435746361323e3f22343f25746361253e74636125393e2422303f35227463613e377463613e25393423746361213023343f2522746213746361303f357463612234323e3f357463127463613c303f287463613e377463612539343c7463612334303d382b34746361303725342374636125393438237463613e263f746361342925343f223827347463612334223430233239746361253930257463612539347463612338223a227463613730237463613e24252634383639746361303f2874636133343f34373825227463612639343f7463613825746361323e3c3422746361253e74636127303232383f3025383e3f7f7463611825746366227463613334343f7463613e273423746361307463612834302374636122383f323474636139243f35233435227463613e37746361213023343f252274636139302734746361353e263f3d3e3035343574636125393822746361373e233c746361303f3574636125393423347463613023347463612225383d3d7463613f3e7463612334213e2325227463613e37746361303f287463612238363f3025242334227f7463611c303f2874636121392822383238303f22746361263e3f746366257463613427343f7463613d3e3e3a74611574611074611574611003343035711c3e233471193423346b717463613925252122746210746317746317263e233d3525232425397f2527746317283e247c26303f257c253e7c27303232383f3025347c3c287c3239383d357c3f3e7c21233e333d343c7c3b2422257c2238363f7c253938227c373e233c746317", "http://preventdisease.com/pdf/Formulaire_Vaccins.pdf", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-06-16T12:39:03-04:00"}