{"result_id": "350031", "URL": "https://worldtruth.tv/author-exposes-the-vaccine-deep-state-a-massive-criminal-fraud-and-embezzlement-ring-inside-the-cdc/", "timestamp": "2023-04-25 18:18:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/author-exposes-the-vaccine-deep-state-a-massive-criminal-fraud-and-embezzlement-ring-inside-the-cdc/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Author Exposes The Vaccine Deep State A Massive Criminal Fraud & Embezzlement Ring Inside The CDC", "cleaned_text": "One of the most explosive books you’ll ever read that documents the shocking criminal enterprise known as the CDC — including details of fraud, cover-ups and embezzlement — is called Master Manipulator – The Explosive True Story of Fraud Embezzlement and Government Betrayal at the CDC by James Ottar Grundvig. You can find the book at this Barnes & Noble link.\n\nThe book is published by Skyhorse Publishing, which I consistently find to be the single most courageous publisher of truth books in America. Time and time again, so many of the best titles exposing fraud, corruption and criminality inside the “status quo” are published by Skyhorse.\n\nThe foreward for Master Manipulator is written by none other than Sharyl Attkisson, and the introduction is penned by Robert F. Kennedy, Jr. who states:\n\nThis is a story of how CDC used a con man to gull the public and ended up getting conned itself! Poul Thorsen is a world-class villain whose manipulation of health data gave CDC and big pharma what they wanted: a report clearing thimerosal of any possible role in the autism crisis. His story merits a book length expose because the fraud he casually helped orchestrate has had a monumental impact on the health of millions of children globally.\n\nMaster Manipulator is a must-read for anyone hoping to be truly informed about the depths of criminality and fraud inside the CDC, “science” and the vaccine industry. One section in particular is especially noteworthy. It’s called the “Vaccine Deep State.” I’m reprinting part of that section of the book below. Buy the book yourself at Barnes & Noble to read more.\n\nThe monolith of the CDC-FDA-NIH is supposed to be separated by a divide with the big pharma vaccine producers. But since the NIH rejected the Swedish scientist’s brief that all thimerosal should be removed from vaccines in 1992, there has been little to no separation of powers, policies, messaging, or enforcement between government oversight and industry manufacturers.\n\nThe separation of church and state doesn’t exist anymore in the vaccine industry, not with Vaccine Court squashing all comers, the Dick Armey “Lilly Rider” slipped into the 2002 Homeland Security Act, and the FDA’s approval to double the doses of aluminum adjuvants in several vaccines.\n\nVaccines today are part of a program rife with ROT and deception.\n\nIn a September 2007 hearing by the Committee on Health, Education, Labor and Pensions for “Thimerosal and Autism Spectrum Disorders: Alleged Misconduct by Government Agencies and Private Entities,” the executive summary naturally found no misconduct on behalf of the CDC—this was a case of one hand washing the other. It read: While the five studies in question may have varying connections to the CDC and/or vaccine manufacturers, their value to consideration of an alleged link between vaccines and autism is a matter for the experts of the ISR Committee, and not for Congress.\n\nWhat the findings got wrong by one half of the government to keep Congress in its place, since they were not qualified to review scientific data, as good as the “experts” that false assertion was nothing more than a ruse, a smokescreen. What Congress needs to do is evaluate the human side of this tragedy and ongoing fraud. It has nothing to do with science—no scientific expertise is required, just the nose to follow the money.\n\nIt has everything to do with corruption, cover-up, relentless greed, pulling the ripcords on golden parachutes, shielding vaccine makers from harm, all while exposing millions of babies, children, and people around the world to great harm.\n\nCongress needs only to examine agendas, follow the email trails, and begin to pull the weeds that have infested the CDC, FDA, and NIH lawn, removing all of the ROT as they should have done in 1990 with the Agent Orange finding. Had they done that, then maybe Coleen Boyle would have become a librarian instead of the director of NCBDDD, and Diana Schendel would have done good collaborative studies instead of the studies that had a fixed objective to show no association, and maybe Poul Thorsen wouldn’t have been invited to come to the CDC as a visiting professor or been able to secure funding for the cooperative agreements because the “hunt for good data” never would have taken place.\n\n…Why is it so hard for mainstream media, independent journalists, and government officials on both sides of the aisle to grasp the dangers of micro small toxins? If they believe that the unseen greenhouse gas particulates and molecules can superheat the world and change climate, why is it so hard to believe that traces of mercury and aluminum in vaccines have harmed so many once promising, healthy children for the past two decades?\n\nIf a grown man can die from a tiny amount of venom in a bee sting, then why is it so hard to believe that trace amounts of metals in babies who weight from seven to twenty-five pounds can have adverse reactions to being injected with toxins, especially when all of their bodies—from the central nervous and immune systems to the brain and lungs—are under development?\n\n“Less is more” is a motto that our politicians need to take up with the Vaccine Deep State and rein it in. If they cannot do it, don’t have the will to do it, don’t have the balls to do it, or won’t expend the political capital to do it, a tipping point will soon one day force there hand.\n\nWhen will that occur? When 1 in 40 babies are born on the spectrum? One in 25 babies born? How about 1 in 10? Will the rate of autism incidence in the United States have to soar to that sky high number for our government to react and belatedly realize that the autism epidemic has been real all along, and its long-over due to do something about it?\n\nThe next generation of Americans, who will be born over the next decade, is awaiting your call to action. Will you act?", "opengraph": {"description": "One of the most explosive books you’ll ever read that documents the shocking criminal enterprise known as the CDC — including details of fraud, cover-ups and embezzlement — is called Master Manipulator – The Explosive True Story of Fraud Embezzlement and Government Betrayal at the CDC by James Ottar Grundvig. You can find the book at this Barnes & Noble link. The book is published by Skyhorse Publishing, which I consistently find to be the single most courageous publisher of truth books in America. Time and time again, so many of the best titles exposing fraud, corruption and criminality inside", "title": "Author Exposes The Vaccine Deep State A Massive Criminal Fraud & Embezzlement Ring Inside The CDC", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/author-exposes-the-vaccine-deep-state-a-massive-criminal-fraud-and-embezzlement-ring-inside-the-cdc/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-01-03T07:50:12-04:00", "article:modified_time": "2020-01-04T20:06:25-04:00", "updated_time": "2020-01-04T20:06:25-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fauthor-exposes-the-vaccine-deep-state-a-massive-criminal-fraud-and-embezzlement-ring-inside-the-cdc%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fauthor-exposes-the-vaccine-deep-state-a-massive-criminal-fraud-and-embezzlement-ring-inside-the-cdc%2F&text=Author+Exposes+The+Vaccine+Deep+State+A+Massive+Criminal+Fraud+%26+Embezzlement+Ring+Inside+The+CDC", "#", "/cdn-cgi/l/email-protection#af90dcdacdc5caccdb92eedadbc7c0dd8a9d9fead7dfc0dccadc8a9d9ffbc7ca8a9d9ff9ceccccc6c1ca8a9d9febcacadf8a9d9ffcdbcedbca8a9d9fee8a9d9fe2cedcdcc6d9ca8a9d9fecddc6c2c6c1cec38a9d9fe9ddcedacb8a9d9f8a9d998a9d9feac2cdcad5d5c3cac2cac1db8a9d9ffdc6c1c88a9d9fe6c1dcc6cbca8a9d9ffbc7ca8a9d9fecebec89cdc0cbd692e0c1ca8a9d9fc0c98a9d9fdbc7ca8a9d9fc2c0dcdb8a9d9fcad7dfc3c0dcc6d9ca8a9d9fcdc0c0c4dc8a9d9fd6c0da8aea9d8a979f8a9696c3c38a9d9fcad9cadd8a9d9fddcacecb8a9d9fdbc7cedb8a9d9fcbc0ccdac2cac1dbdc8a9d9fdbc7ca8a9d9fdcc7c0ccc4c6c1c88a9d9fccddc6c2c6c1cec38a9d9fcac1dbcadddfddc6dcca8a9d9fc4c1c0d8c18a9d9fcedc8a9d9fdbc7ca8a9d9fecebec8a9d9f8aea9d8a979f8a969b8a9d9fc6c1ccc3dacbc6c1c88a9d9fcbcadbcec6c3dc8a9d9fc0c98a9d9fc9ddcedacb8a9dec8a9d9fccc0d9cadd82dadfdc8a9d9fcec1cb8a9d9fcac2cdcad5d5c3cac2cac1db8a9d9f8aea9d8a979f8a969b8a9d9fc6dc8a9d9fcccec3c3cacb8a9d9fe2cedcdbcadd8a9d9fe2cec1c6dfdac3cedbc0dd8a9d9f8aea9d8a979f8a969c8a9d9ffbc7ca8a9d9fead7dfc3c0dcc6d9ca8a9d9ffbdddaca8a9d9ffcdbc0ddd68a9d9fc0c98a9d9fe9ddcedacb8a9d9feac2cdcad5d5c3cac2cac1db8a9d9fcec1cb8a9d9fe8c0d9caddc1c2cac1db8a9d9fedcadbddced6cec38a9d9fcedb8a9d9fdbc7ca8a9d9fecebec8a9d9fcdd68a9d9fe5cec2cadc8a9d9fe0dbdbcedd8a9d9fe8dddac1cbd9c6c8818a9d9ff6c0da8a9d9fcccec18a9d9fc9c6c1cb8a9d9fdbc7ca8a9d9fcdc0c0c48a9d9fcedb8a9d9fdbc7c6dc8a9d9fedceddc1cadc8a9d9f8a9d99cec2df8a9ced8a9d9fe1c0cdc3ca8a9d9fc3c6c1c4818a9d9ffbc7ca8a9d9fcdc0c0c48a9d9fc6dc8a9d9fdfdacdc3c6dcc7cacb8a9d9fcdd68a9d9ffcc4d6c7c0dddcca8a9d9fffdacdc3c6dcc7c6c1c88a9dec8a9d9fd8c7c6ccc78a9d9fe68a9d9fccc0c1dcc6dcdbcac1dbc3d68a9d9fc9c6c1cb8a9d9fdbc08a9d9fcdca8a9d9fdbc7ca8a9d9fdcc6c1c8c3ca8a9d9fc2c0dcdb8a9d9fccc0daddcec8cac0dadc8a9d9fdfdacdc3c6dcc7cadd8a9d9fc0c98a9d9fdbdddadbc78a9d9fcdc0c0c4dc8a9d9fc6c18a9d9feec2caddc6ccce818a9d9ffbc6c2ca8a9d9fcec1cb8a9d9fdbc6c2ca8a9d9fcec8cec6c18a9dec8a9d9fdcc08a9d9fc2cec1d68a9d9fc0c98a9d9fdbc7ca8a9d9fcdcadcdb8a9d9fdbc6dbc3cadc8a9d9fcad7dfc0dcc6c1c88a9d9fc9ddcedacb8a9dec8a9d9fccc0dddddadfdbc6c0c18a9d9fcec1cb8a9d9fccddc6c2c6c1cec3c6dbd68a9d9fc6c1dcc6cbca8a9feb8a9fee8a9feb8a9feefdcacecb8fe2c0ddca8fe7caddca958f8a9d9fc7dbdbdfdc8a9cee8a9de98a9de9d8c0ddc3cbdbdddadbc781dbd98a9de9cedadbc7c0dd82cad7dfc0dccadc82dbc7ca82d9ceccccc6c1ca82cbcacadf82dcdbcedbca82ce82c2cedcdcc6d9ca82ccddc6c2c6c1cec382c9ddcedacb82cec1cb82cac2cdcad5d5c3cac2cac1db82ddc6c1c882c6c1dcc6cbca82dbc7ca82cccbcc8a9de9", "http://www.barnesandnoble.com/w/master-manipulator-james-ottar-grundvig/1123880475", "http://www.barnesandnoble.com/w/master-manipulator-james-ottar-grundvig/1123880475", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-01-03T07:50:12-04:00"}