{"result_id": "350035", "URL": "https://worldtruth.tv/abortion-drugs-discovered-in-bill-gates-vaccines/", "timestamp": "2023-04-25 18:18:34 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/abortion-drugs-discovered-in-bill-gates-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "‘A Mass Sterilization Exercise’: Kenyan Doctors Find Anti-Fertility Agent In UN Tetanus Vaccine", "cleaned_text": "Kenya’s Catholic bishops are charging two United Nations organizations with sterilizing millions of girls and women under cover of an anti-tetanus inoculation program sponsored by the Kenyan government.\n\nAccording to a statement released Tuesday by the Kenya Catholic Doctors Association, the organization has found an antigen that causes miscarriages in a vaccine being administered to 2.3 million girls and women by the World Health Organization and UNICEF. Priests throughout Kenya reportedly are advising their congregations to refuse the vaccine.\n\n“We sent six samples from around Kenya to laboratories in South Africa. They tested positive for the HCG antigen,” Dr. Muhame Ngare of the Mercy Medical Centre in Nairobi told LifeSiteNews. “They were all laced with HCG.”\n\nDr. Ngare, spokesman for the Kenya Catholic Doctors Association, stated in a bulletin released November 4, “This proved right our worst fears; that this WHO campaign is not about eradicating neonatal tetanus but a well-coordinated forceful population control mass sterilization exercise using a proven fertility regulating vaccine. This evidence was presented to the Ministry of Health before the third round of immunization but was ignored.”\n\nBut the government says the vaccine is safe. Health Minister James Macharia even told the BBC, “I would recommend my own daughter and wife to take it because I entirely 100% agree with it and have confidence it has no adverse health effects.”\n\nAnd Dr. Collins Tabu, head of the Health Ministry’s immunization branch, told the KenyanNation, that “there is no other additive in the vaccine other than the tetanus antigen.”\n\nTabu said the same vaccine has been used for 30 years in Kenya. Moreover, “there are women who were vaccinated in October 2013 and March this year who are expectant. Therefore we deny that the vaccines are laced with contraceptives.”\n\nNewspaper stories also report women getting pregnant after being vaccinated.\n\nResponds Dr. Ngare: “Either we are lying or the government is lying. But ask yourself, ‘What reason do the Catholic doctors have for lying?’” Dr. Ngare added: “The Catholic Church has been here in Kenya providing health care and vaccinating for 100 years for longer than Kenya has existed as a country.”\n\nDr. Ngare told LifeSiteNews that several things alerted doctors in the Church’s far-flung medical system of 54 hospitals, 83 health centres, and 17 medical and nursing schools to the possibility the anti-tetanus campaign was secretly an anti-fertility campaign.\n\nWhy, they ask does it involve an unprecedented five shots (or “jabs” as they are known, in Kenya) over more than two years and why is it applied only to women of child-bearing years, and why is it not being conducted without the usual fanfare of government publicity?\n\n“Usually we give a series three shots over two to three years, we give it anyone who comes into the clinic with an open wound, men, women or children.” said Dr. Ngare. “If this is intended to inoculate children in the womb, why give it to girls starting at 15 years? You cannot get married till you are 18.” The usual way to vaccinate children is to wait till they are six weeks old.”\n\nBut it is the five-vaccination regime that is most alarming. “The only time tetanus vaccine has been given in five doses is when it is used as a carrier in fertility regulating vaccines laced with the pregnancy hormone, Human Chorionic Gonadotropin (HCG) developed by WHO in 1992.”\n\nIt is HCG that has been found in all six samples sent to the University of Nairobi medical laboratory and another in South Africa. The bishops and doctors warn that injecting women with HCG , which mimics a natural hormone produced by pregnant women, causes them to develop antibodies against it. When they do get pregnant, and produce their own version of HCG, it triggers the production of antibodies that cause a miscarriage.\n\n“We knew that the last time this vaccination with five injections has been used was in Mexico in 1993 and Nicaragua and the Philippines in 1994,” said Dr. Ngare. “It didn’t cause miscarriages till three years later,” which is why, he added, the counterclaims that women who got the vaccination recently and then got pregnant are meaningless.\n\nNgare said WHO tried to bring the same anti-fertility program into Kenya in the 1990s. “We alerted the government and it stopped the vaccination. But this time they haven’t done so.”\n\nNgare also contrasted the secrecy of this campaign with the usual fanfare accompanying national vaccination efforts. “They usually bring all the stakeholders together three months before the campaign, like they did with polio a little while ago. And they use staff in all the centres to give out the vaccine.” But with this anti-tetanus campaign, “only a few operatives from the government are allowed to give it out. They come with a police escort. They take it away with them when they are finished. Why not leave it with the local medical staff to administer?”\n\nBrian Clowes of Human Life International in Virginia told LifeSite News that WHO was not involved in the Nicaragua, Mexican and Philippines campaigns. “They try to maintain a spotless record. They let organizations like United Nations Population Fund and USAID do the dirty work.”\n\nIn the previous cases, said Clowes, the vaccinators insisted their product was pure until it was shown not to be. Then they claimed the positive tests for HCG were isolated, accidental contaminations in the manufacturing process.\n\nLifeSiteNews has obtained a UN report on an August 1992 meeting at its world headquarters in Geneva of 10 scientists from “Australia, Europe, India and the U.S.A” and 10 “women’s health advocates” from around the world, to discuss the use of “fertility regulating vaccines.” It describes the “anti-Human Chorionic Gonadotropin vaccine” as the most advanced.\n\nOne million Kenyan women and girls have been vaccinated so far with another 1.3 million to go. The vaccination is targeting women, according to the government, in order to inoculate their children in the womb against tetanus as well. The government says 550 children die of tetanus yearly.\n\nIn covering the contest of words the pro-government Nation found plenty of women who had been vaccinated and were now pregnant, even one who was the wife of a former Catholic priest who left the Church to marry. The paper ignored Kenya’s reliance on the Catholic medical system, while setting the bishops’ stand in a questionable historical context of irrational responses “largely based on religious beliefs,” the more recent murder of vaccination teams in Nigeria, and even of CIA conspiracy theories.\n\nWhy would the UN want to suppress the population in developing countries? “Racism,” is Brian Clowes’ first explanation. “Also, the developed countries want to get hold of their natural resources. And lately, there is the whole bogus global warming thing.”\n\nDr. Ngare said it was the Catholic Church’s hope that the government could have resolved the matter quietly by testing the vaccine. “But the government has chosen to be combative,” forcing Kenya’s bishops and Catholic doctors to go public.\n\nWHO’s Kenyan office and several WHO media contacts in Washington, D.C. failed to respond to LifeSiteNews enquiries over a 24-hour period.", "opengraph": {"description": "Kenya’s Catholic bishops are charging two United Nations organizations with sterilizing millions of girls and women under cover of an anti-tetanus inoculation program sponsored by the Kenyan government. According to a statement released Tuesday by the Kenya Catholic Doctors Association, the organization has found an antigen that causes miscarriages in a vaccine being administered to 2.3 million girls and women by the World Health Organization and UNICEF. Priests throughout Kenya reportedly are advising their congregations to refuse the vaccine. “We sent six samples from around Kenya to laboratories in South Africa. They tested positive for the HCG antigen,” Dr. Muhame", "title": "‘A Mass Sterilization Exercise’: Kenyan Doctors Find Anti-Fertility Agent In UN Tetanus Vaccine", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/abortion-drugs-discovered-in-bill-gates-vaccines/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-07-02T07:47:07-04:00", "article:modified_time": "2019-07-17T14:07:36-04:00", "updated_time": "2019-07-17T14:07:36-04:00"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/-pJaDpq-DUI\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/-pJaDpq-DUI"}], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fabortion-drugs-discovered-in-bill-gates-vaccines%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fabortion-drugs-discovered-in-bill-gates-vaccines%2F&text=%E2%80%98A+Mass+Sterilization+Exercise%E2%80%99%3A+Kenyan+Doctors+Find+Anti-Fertility+Agent+In+UN+Tetanus+Vaccine", "#", "/cdn-cgi/l/email-protection#2b14585e49414e485f160e6e190e131b0e12136a0e191b664a58580e191b785f4e59424742514a5f4244450e191b6e534e594842584e0e6e190e131b0e12120e186a0e191b604e45524a450e191b6f44485f4459580e191b6d42454f0e191b6a455f42066d4e595f4247425f520e191b6a4c4e455f0e191b62450e191b7e650e191b7f4e5f4a455e580e191b7d4a484842454e0d49444f5216604e45524a0e6e190e131b0e1212580e191b684a5f43444742480e191b49425843445b580e191b4a594e0e191b48434a594c42454c0e191b5f5c440e191b7e45425f4e4f0e191b654a5f424445580e191b44594c4a4542514a5f424445580e191b5c425f430e191b585f4e594247425142454c0e191b46424747424445580e191b444d0e191b4c425947580e191b4a454f0e191b5c44464e450e191b5e454f4e590e191b48445d4e590e191b444d0e191b4a450e191b4a455f42065f4e5f4a455e580e191b424544485e474a5f4244450e191b5b59444c594a460e191b585b44455844594e4f0e191b49520e191b5f434e0e191b604e45524a450e191b4c445d4e5945464e455f050e191b6a484844594f42454c0e191b5f440e191b4a0e191b585f4a5f4e464e455f0e191b594e474e4a584e4f0e191b7f5e4e584f4a520e191b49520e191b5f434e0e191b604e45524a0e191b684a5f43444742480e191b6f44485f4459580e191b6a58584448424a5f4244450e19680e191b5f434e0e191b44594c4a4542514a5f4244450e191b434a580e191b4d445e454f0e191b4a450e191b4a455f424c4e450e191b5f434a5f0e191b484a5e584e580e191b464258484a5959424a4c4e580e191b42450e191b4a0e191b5d4a484842454e0e191b494e42454c0e191b4a4f46424542585f4e594e4f0e191b5f440e191b1905180e191b464247474244450e191b4c425947580e191b4a454f0e191b5c44464e450e191b49520e191b5f434e0e191b7c4459474f0e191b634e4a475f430e191b64594c4a4542514a5f4244450e191b4a454f0e191b7e6562686e6d050e191b7b59424e585f580e191b5f4359445e4c43445e5f0e191b604e45524a0e191b594e5b44595f4e4f47520e191b4a594e0e191b4a4f5d425842454c0e191b5f434e42590e191b4844454c594e4c4a5f424445580e191b5f440e191b594e4d5e584e0e191b5f434e0e191b5d4a484842454e050e191b0e6e190e131b0e12687c4e0e191b584e455f0e191b5842530e191b584a465b474e580e191b4d5944460e191b4a59445e454f0e191b604e45524a0e191b5f440e191b474a4944594a5f4459424e580e191b42450e191b78445e5f430e191b6a4d5942484a050e191b7f434e520e191b5f4e585f4e4f0e191b5b4458425f425d4e0e191b4d44590e191b5f434e0e191b63686c0e191b4a455f424c4e450e19680e6e190e131b0e126f0e191b6f59050e191b665e434a464e0e1b6f0e1b6a0e1b6f0e1b6a794e4a4f0b6644594e0b634e594e110b0e191b435f5f5b580e186a0e196d0e196d5c4459474f5f595e5f43055f5d0e196d4a4944595f424445064f595e4c58064f425848445d4e594e4f0642450649424747064c4a5f4e58065d4a484842454e580e196d", "https://www.lifesitenews.com/news/a-mass-sterilization-exercise-kenyan-doctors-find-anti-fertility-agent-in-u", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-07-02T07:47:07-04:00"}