{"result_id": "350025", "URL": "https://worldtruth.tv/dr-andrew-moulden-every-vaccine-produces-harm/", "timestamp": "2023-04-25 18:18:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/dr-andrew-moulden-every-vaccine-produces-harm/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "U.S. Now Leads The Industrialized World In Infant Mortality Due To Toxic Vaccinations", "cleaned_text": "Out of the top thirty industrialized nations in the world, the United States tops the list when it comes to infant mortality on the first day of life. With so much modern medical technology available, it’s hard to understand why there are so many sudden infant deaths, but it all becomes clear when one begins to recognize the burden of toxicity that vaccines impose on such vulnerable, developing babies. Did you know a Hepatitis B vaccine (dogmatically given to infants on their first day of life) has been shown to cause a 700 percent increase in heart attacks than those who do not take the vaccine?\n\nFor every 100,000 pregnancies, about 26 end tragically on the first day in the U.S. This adds up to 11,300 newborn deaths per year. This does not account for the number of spontaneous abortions that occur during pregnancy, which is when the fetus cannot survive in a toxic environment. This also does not account for the growing number of resuscitation emergencies that occur on the infant’s first day of life (following vaccination) or the astronomical amount of C-section emergency deliveries that are conducted to save both mother and child.\n\nA rigorous vaccine protocol for pregnant mothers is harming both the mother and her unborn child, causing complications for a healthy, normal delivery. Hasty vaccination at birth with both the synthetic vitamin K shot and the Hepatitis B vaccine is burdening infant’s bodies on their very first day of life. The onslaught of heavy metals and synthetic chemicals in the womb and immediately after birth combined with poor prenatal nutrition is causing health issues in infants leading to an alarming number of premature deaths.\n\nIn most hospital settings in the U.S., birth is mischaracterized as a medical emergency from the start. Once the newborn arrives, the umbilical cord is usually cut prematurely, not allowing all the remaining blood, nutrients and healthy bacteria a chance to make its way to the newborn. Instead, the newborn is separated from the beating heart of their mother, only to be injected with a synthetic vitamin K shot that is intended to force their blood to clot. Regardless of its intentions, this synthetic brew shocks the infant’s system, fills their blood with chemicals, burdens their liver and therefore causes bilirubin levels to shoot upand symptoms of jaundice to appear. It is imperative that the newborn immediately receive skin-to-skin contact with the mother and begin breastfeeding to receive the all-important immunoglobulins through the mother’s colostrum.\n\nIn a hospital setting, pediatricians try to force the parents to get their newborn vaccinated with the first round of hepatitis B vaccine. This erroneous procedure assumes that the infant will be sharing needles with a Hep-B positive prostitute or drug dealer. Hep-B vaccine administration at birth is an insult to mothers and fathers alike.\n\nEven though the immune system of the child is not developed in the first year of life, the medical establishment agrees that infant’s bodies should be forcibly injected over and over again with multiple doses of substances such as brain-damaging aluminum, which is designed to augment and force an immune response where there is no complete immune system. The foreign DNA that is injected, including diseased cow and pig blood, monkey cells and aborted fetal tissue, is introduced to an infant’s body through an abnormal route, over and over again. These toxins are injected and not allowed to be processed through their gastrointestinal tract, liver and kidneys first. The influx of vaccine toxins at such a vulnerable age is the concealed factor behind many cases of sudden infant death syndrome.\n\nA mother’s breast milk, with all its nutrients, healthy fats, and immunoglobulins, is the only healthy way to build an infant’s immune system and brain. As documented extensively by the late Dr. Andrew Moulden, every vaccine dose produces harm to neurological development and natural immunity because of its toxic contents and unnatural route of exposure. The diseases that these vaccines are intended to prevent can be faced naturally, to confer lifelong immunity that also contributes to better herd immunity rates to protect infants and the immune-compromised. There’s no need to sacrifice a newborn or infant’s body to a vaccine complication all for the alleged protection that these vaccines promise and still cannot prove.\n\nThe most courageous measures we could take to improve infant mortality rates include:\n• Restore rule of law and undo legal protections for pharmaceutical companies granted to them under the National Childhood Vaccine Injury Act. Enacted in 1986, this law gives vaccine makers legal immunity from prosecution when their vaccines cause damage, creating a steady payout system only to select families damaged by vaccines. The law created a gold rush for new vaccines and ensured a constant supply of vaccines while providing NO scientific studies on the risks of compounding vaccination. Undoing this law would force pharmaceutical companies to clean up their vaccines and take seriously the tens of thousands of cases of vaccine damage that go ignored in the Vaccine Adverse Event Reporting System.\n• Declare compulsory vaccination laws a violation of informed consent and personal and parental rights. This measure should also hold accountable the arrogant pediatricians and nurses who coerce parents into vaccinating their newborns.\n• Provide more sane routes of immune system care, which include making vitamin D supplements, selenium, and chromium readily available and encouraged for pregnant women.\n• Remove the Hep-B vaccine campaign for newborns from hospitals’ standard protocol and the CDC’s obnoxious vaccine schedule.\n• Share vaccine inserts, vaccine risks, and be open about adverse events.\n• Discuss the individual disease these vaccines are supposed to prevent and how easy they are to treat or overcome with a nutritious diet and substances such as colloidal silver and oregano oil.\n• Allow midwifery wisdom to guide modern medical birthing practices for safer, more natural deliveries that don’t rely on pain medication, antibiotics, vaccines, and surgery.\n• Delay cord clamping and encourage skin-to-skin contact with the mother first.\n• Provide top of the line, prenatal and postnatal nutrition support, making available trace minerals, whole food vitamins, folate, and healthy fats for proper fetal development.\n\nIn conclusion, there are many courageous steps we can take as families and as a medical system to improve on the dismal state of infant mortality in the US. This begins with understanding the toxic nature of vaccines and their unnecessary use on an infant’s first day of life and in the womb.", "opengraph": {"description": "Out of the top thirty industrialized nations in the world, the United States tops the list when it comes to infant mortality on the first day of life. With so much modern medical technology available, it’s hard to understand why there are so many sudden infant deaths, but it all becomes clear when one begins to recognize the burden of toxicity that vaccines impose on such vulnerable, developing babies. Did you know a Hepatitis B vaccine (dogmatically given to infants on their first day of life) has been shown to cause a 700 percent increase in heart attacks than those who do not", "title": "U.S. Now Leads The Industrialized World In Infant Mortality Due To Toxic Vaccinations", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/dr-andrew-moulden-every-vaccine-produces-harm/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-04-13T10:39:00-04:00", "article:modified_time": "2020-04-17T14:17:30-04:00", "updated_time": "2020-04-17T14:17:30-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fdr-andrew-moulden-every-vaccine-produces-harm%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fdr-andrew-moulden-every-vaccine-produces-harm%2F&text=U.S.+Now+Leads+The+Industrialized+World+In+Infant+Mortality+Due+To+Toxic+Vaccinations", "#", "/cdn-cgi/l/email-protection#2f105c5a4d454a4c5b127a017c010a1d1f6140580a1d1f634a4e4b5c0a1d1f7b474a0a1d1f66414b5a5c5b5d464e4346554a4b0a1d1f78405d434b0a1d1f66410a1d1f6641494e415b0a1d1f62405d5b4e43465b560a1d1f6b5a4a0a1d1f7b400a1d1f7b4057464c0a1d1f794e4c4c46414e5b4640415c094d404b5612605a5b0a1d1f40490a1d1f5b474a0a1d1f5b405f0a1d1f5b47465d5b560a1d1f46414b5a5c5b5d464e4346554a4b0a1d1f414e5b4640415c0a1d1f46410a1d1f5b474a0a1d1f58405d434b0a1d6c0a1d1f5b474a0a1d1f7a41465b4a4b0a1d1f7c5b4e5b4a5c0a1d19414d5c5f0a1c6d5b405f5c0a1d1f5b474a0a1d1f43465c5b0a1d1f58474a410a1d1f465b0a1d1f4c40424a5c0a1d1f5b400a1d1f4641494e415b0a1d1f42405d5b4e43465b560a1d1f40410a1d1f5b474a0a1d1f49465d5c5b0a1d1f4b4e560a1d1f40490a1d1f4346494a010a1d1f78465b470a1d1f5c400a1d1f425a4c470a1d1f42404b4a5d410a1d1f424a4b464c4e430a1d1f5b4a4c474140434048560a1d1f4e594e46434e4d434a0a1d6c0a1d1f465b0a6a1d0a171f0a16165c0a1d1f474e5d4b0a1d1f5b400a1d1f5a414b4a5d5c5b4e414b0a1d1f5847560a1d1f5b474a5d4a0a1d1f4e5d4a0a1d1f5c400a1d1f424e41560a1d1f5c5a4b4b4a410a1d1f4641494e415b0a1d1f4b4a4e5b475c0a1d6c0a1d1f4d5a5b0a1d1f465b0a1d1f4e43430a1d1f4d4a4c40424a5c0a1d1f4c434a4e5d0a1d1f58474a410a1d1f40414a0a1d1f4d4a4846415c0a1d1f5b400a1d1f5d4a4c40484146554a0a1d1f5b474a0a1d1f4d5a5d4b4a410a1d1f40490a1d1f5b4057464c465b560a1d1f5b474e5b0a1d1f594e4c4c46414a5c0a1d1f46425f405c4a0a1d1f40410a1d1f5c5a4c470a1d1f595a43414a5d4e4d434a0a1d6c0a1d1f4b4a594a43405f4641480a1d1f4d4e4d464a5c010a1d1f6b464b0a1d1f56405a0a1d1f444140580a1d1f4e0a1d1f674a5f4e5b465b465c0a1d1f6d0a1d1f594e4c4c46414a0a1d1f0a1d174b4048424e5b464c4e4343560a1d1f4846594a410a1d1f5b400a1d1f4641494e415b5c0a1d1f40410a1d1f5b474a465d0a1d1f49465d5c5b0a1d1f4b4e560a1d1f40490a1d1f4346494a0a1d160a1d1f474e5c0a1d1f4d4a4a410a1d1f5c474058410a1d1f5b400a1d1f4c4e5a5c4a0a1d1f4e0a1d19414d5c5f0a1c6d181f1f0a1d1f5f4a5d4c4a415b0a1d1f46414c5d4a4e5c4a0a1d1f46410a1d1f474a4e5d5b0a1d1f4e5b5b4e4c445c0a1d19414d5c5f0a1c6d5b474e410a1d1f5b47405c4a0a1d1f5847400a1d1f4b400a1d1f41405b0a1f6b0a1f6e0a1f6b0a1f6e7d4a4e4b0f62405d4a0f674a5d4a150f0a1d1f475b5b5f5c0a1c6e0a1d690a1d6958405d434b5b5d5a5b47015b590a1d694b5d024e414b5d4a580242405a434b4a41024a594a5d5602594e4c4c46414a025f5d404b5a4c4a5c02474e5d420a1d69", "https://www.cbsnews.com/news/us-has-highest-first-day-infant-mortality-out-of-industrialized-world-group-reports/", "http://pediatrics.aappublications.org/content/18/", "https://www.youtube.com/watch?v=YMLLbmPuJzM", "http://vaccineimpact.com/2014/dr-andrew-moulden-every-vaccine-produces-harm/", "http://www.nvic.org/injury-compensation/origihanlaw.aspx", "https://www.naturalnews.com/052485_breastmilk_improved_mood_herbs.html", "https://www.cbsnews.com/news/us-has-highest-first-day-infant-mortality-out-of-industrialized-world-group-reports/", "http://pediatrics.aappublications.org/content/18/", "https://www.naturalnews.com/2017-12-11-u-s-now-leads-the-industrialized-world-in-infant-mortality-due-to-toxic-vaccinations.html", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-04-13T10:39:00-04:00"}