{"result_id": "350041", "URL": "https://worldtruth.tv/list-of-vaccine-ingredients-their-known-side-effects/", "timestamp": "2023-04-25 18:18:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/list-of-vaccine-ingredients-their-known-side-effects/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "List of Vaccine Ingredients & Their Known Side Effects", "cleaned_text": "There has been much recent concern regarding vaccines given to children, and their possible side effects. Particularly highlighted is the link between early childhood vaccines and autism. This article provides a list of known ingredients inside vaccines, and their documented side effects. It will aid you in making informed decisions, which is something the industry is against. The corporations involved have attempted to suppress this information for decades. Readers are advised that there are extra chemicals and toxins which are not mentioned, because we based this list upon the ingredients which are public knowledge. If you know of anything we have missed, please contact us. It seems that the more we research this topic: the more sinister it becomes.\n\nThe connection to autism has already been repeatedly and scientifically established, and there are many other conditions caused by vaccines which are yet to be proven. Vaccines are said to prevent certain diseases. However, the chances of catching these diseases are incredibly remote, and the horrid side effects from vaccines are so common that vaccines cause much more harm than good. The chance that a particular vaccine will actually offer effective protection varies between 35% and 90%, and almost all of them expire. In some cases, vaccines will infect the patient with the very disease it is meant to offer protection from. Do you think they would do the right thing, and treat you for free.\n\nDid you ever wonder where aborted babies really went? Now you know. From a health perspective, the tissues from another human (not just animals) are still foreign, and therefore toxic to the body. One industry ­friendly web site matter-­of­-factly boasted, “The cells reproduce themselves, so there is no need to abort additional fetuses to sustain the culture supply. Viruses are collected from the diploid cell cultures and then processed further to produce the vaccine itself”. The Liberty Counsel reported, “You may be surprised to learn that some vaccinations are derived from aborted fetal tissue. Vaccines for chicken pox, Hepatitis­A, and Rubella were produced solely from aborted fetal tissue”.\n\nThis is used in vaccines as a tissue fixative, and a preservative. Formaldehyde is oxidized to become formic acid. Formic acid is the main ingredient of bee and ant venom. Concentrated, it is corrosive and an irritant. While absorbing the oxygen of the body, it may lead to acidosis, nerve, liver, and kidney damage.\n\nAccording to the National Research Council, fewer than 20% but perhaps more than 10% of the general population may be susceptible to extreme formaldehyde toxicity, and may react to exposure at any level. Formaldehyde is ranked as one of the most hazardous compounds on ecosystems and human health, according to the Environmental Defense Fund. These findings are for environmental exposure, and therefore, the dangers are much greater for the formaldehyde included in vaccines, since it is injected directly into the blood.\n\nThe known side effects of formaldehyde are:\n• Eye, nasal, throat and pulmonary irritation\n• Acute sense of smell due to altered tissue proteins\n• Anaemia\n• Apathy\n• Blindness\n• Blood in urine\n• Blurred vision\n• Pain\n• Bronchial spasms\n• Bronchitis\n• Burns in sinus area and throat\n• Cardiac impairment\n• Palpitations and arrhythmias\n• Central nervous system depression\n• Changes in higher cognitive functions\n• Chemical sensitivity\n• Chest pains and tightness\n• Chronic vaginitis; colds\n• Coma\n• Conjunctivitis\n• Constipation\n• Convulsions\n• Corneal erosion\n• Death\n• Destruction of red blood cells\n• Depression\n• Dermatitis\n• Diarrhoea\n• Difficulty concentrating\n• Disorientation and dizziness\n• Ear aches\n• Eczema\n• Emotional upsets\n• Ethmoid polyps\n• Fatigue\n• Fecula bleeding\n• Foetal asphyxiation\n• Flu­like or ‘common cold’ illness\n• Frequent urination with pain\n• Gastritis\n• Astrointestinal inflammation\n• Headaches\n• Haemolytic anaemia\n• Haemolytic haematuria\n• Hoarseness\n• Hyperactive airway disease\n• Hyperactivity\n• Hypomenstrual syndrome\n• Immune system (allergen) sensitizer\n• Impaired (short) attention span\n• Impaired capacity to attain attention\n• Inability or difficulty swallowing\n• Inability to recall words and names\n• Inconsistent IQ profiles\n• Inflammatory diseases of the reproductive organs\n• Intestinal pain\n• Intrinsic asthma\n• Irritability\n• Jaundice\n• Joint pain\n• Joint swelling\n• Kidney pain\n• Laryngeal spasm\n• Loss of memory\n• Loss of sense of smell\n• Loss of taste\n• Malaise\n• Menstrual and testicular pain\n• Menstrual irregularities\n• Metallic taste\n• Muscle spasms and cramps\n• Nasal congestion\n• Crusting and mucosa inflammation\n• Nausea\n• Nosebleeds\n• Numbness and tingling ofthe forearms and finger tips\n• Partial laryngeal paralysis\n• Pneumonia,and Pulmonary Oedema\n• Reduced bodytemperature\n• Retarded speech pattern\n• Ringing or tingling in the ear\n• Schizophrenic­ type symptoms\n• Sensitivity to sound\n• Shock\n• Short term memory loss\n• Shortness of breath\n• Skin lesions\n• Sneezing\n• Sore throat\n• Spacey feeling\n• Speaking difficulty\n• Sterility\n• Swollen glands\n• Tearing\n• Excessive Thirst\n• Tracheitis\n• Tracheobronchitis\n• Vertigo\n• Vomiting blood\n• Vomiting\n• Wheezing and Lung Complication\n\nMercury compounds are used in vaccines as preservatives. The toxicity of mercury has been repeatedly ignored in the area of vaccines by the medical establishment and oversight agencies. Mercury is the second most poisonous element known to mankind (second only to uranium and its derivatives). Brain neurons rapidly and permanently disintegrate in the presence of mercury within 30 minutes of exposure. Mercury is also known to change a body’s chromosomes, so I especially worry about those who have had mercury ­based dental fillings (which are the standard ‘silver’ type), for these people are constantly being filled with this cumulative poison from the mercury’s vapors as well as direct contact inside the mouth.\n\nThe U.S. has known about the potential problems of Thimerosal (the preservative in vaccines that contains mercury) for many years. The World Health Organization voiced concerns about it in 1990.\n\nMercury is a cumulative poison, which means a body has difficultly removing it, and that levels of it in the body will grow significantly over time. Enormous amounts of mercury can accumulate over a lifetime. During a typical day of routine vaccines, infants sometimes receive the same amount of mercury as the absolute maximum set by the World Health Organization for 3 months of adult exposure.\n\nThe following was taken from a website affiliated with the National Institutes for Health detailing the effects of mercury exposure: “Symptoms of high exposure to this class of mercury based compounds include: aphthous, stomatitis, satarrhal gingivitis, nausea, liquid stools, pain, liver disorders, injuries to the cardiovascular system and hematopoietic system, deafness and ataxia, death, headache, paresthesia of the tongue, lips, fingers and toes, other non­specific dysfunctions, metallic taste, slight gastrointestinal disturbances, excessive flatus and diarrhea may occur. Acute poisoning may cause gastrointestinal irritation and renal failure. Early signs of severe poisoning include fine tremors of extended hands, loss of side vision, slight loss of coordination in the eyes, speech, writing and gait, inability to stand or carry out voluntary movements, occasional muscle atrophy and flexure contractures, generalized myoclonic movements, difficulty understanding ordinary speech, irritability and bad temper progressing to mania, stupor, coma, mental retardation in children, skin irritation, blisters and dermatitis. Other symptoms include chorea, athetosis, tremors, convulsions, pain and numbness in the extremities, nephritis, salivation, loosening of the teeth, blue line on the gums, anxiety, mental depression, insomnia, hallucinations and central nervous system effects. Exposure may also cause irritation of the eyes, mucous membranes and upper respiratory tract.”\n\nComplete intolerance to Thimerosal, the mercury containing preservative, is known to develop from previous vaccines. The vaccines stimulate the immune system and cause sensitization. The effects of mercury differ between inorganic, organic, and metallic mercury compounds. The neurologic toxicity symptoms caused by mercury compounds have a delayed onset after exposure, so few, if any of these symptoms will be noticed at the time of exposure. This explains the suspected long-term neurological symptoms of learning disabilities and behavior disorders associated with vaccines, which did not exist in previous generations.\n\nAntifreeze (ethylene glycol) is an ingredient of the polio vaccine. It is classified as a “very toxic material”. It would take less than a tablespoonful to kill a 20­pound dog with this substance. Pet owners are generally very wary around this dangerous substance, knowing that only a small amount is fatal. I can only imagine the effects that this has on the human body when directly injected into the blood stream.\n\nAntifreeze can eventually lead to kidney, liver, blood and central nervous system (CNS) disorders. It is quite harmful and likely fatal if swallowed. Effects include behavioral disorders, drowsiness, vomiting, diarrhoea, visual disturbances, thirst, convulsions, cyanosis, rapid heart rate, CNS stimulation, depression, cardiopulmonary effects, kidney disorders. It can also lead to liver and blood disorders. It produces reproductive and developmental effects in experimental animals.\n\nAluminum is a suspected carcinogen. It is a cardiovascular or blood toxicant, neurotoxicant, and respiratory toxicant. It has been implicated as a cause of brain damage, and is a suspected factor in Alzheimer’s Disease, dementia, convulsions, and comas. It has been placed on at least 2 federal regulatory lists.\n\nThis is a suspected carcinogen. A developmental and reproductive toxicant. It is also a metabolic poison, which means that it interferes with the metabolism of all cells. This is the primary factor in the formation of cancer cells. It is capable of disabling the immune system’s primary response. It also contains phenol (see below for explanation).\n\nThis is a suspected carcinogen, and a cardiovascular and blood toxicant. Also known as carbolic acid; this is a developmental toxicant, gastrointestinal or liver toxicant, kidne toxicant, neurotoxicant, respiratory toxicant, skin and sense organ toxicant. It has been placed on at least 8 federal regulatory lists.\n\nThis is a volatile, flammable, poisonous liquid alcohol. In industry, it is used as a solvent, and an antifreeze compound in fuel. In the body it is metabolized into formaldehyde (as described earlier). Whilst it can be found naturally in the pectin that is present in some common fruits, the naturally occurring version is only in minute quantities, and the natural form is not known to cause harmful effects.\n\nTraditionally used as a pesticide and ant killer. It is suspected to be a cardiovascular or blood toxicant, endocrin toxicant, gastrointestinal or liver toxicant, and neurological toxicant. It was found to cause reproductive damage and reduced fertility rates in studies on rats. It is already banned in foods in the United States, but astonishingly, it is still allowed for direct injection into the blood through vaccines. It is toxic to all cells, and has a slow excretion rate through the kidneys. Kidney retention and toxicity are the greatest. It has a cascading effect, causing liver degeneration, cerebral edema, and gastroenteritis.\n\n“A single vaccine given to a 6 pound infant is the equivalent of giving a 180 lb. adult 30 vaccines in one day.”\n\n ― Dr. Boyd Haley\n\nGlutaraldehyde is always toxic, causing severe eye, nose, throat and lung irritations, along with headaches, drowsiness, and dizziness. The effects mirror the chemical warfare agent known as nerve gas. It is poisonous if ingested, and known to cause birth defects in experimental animals. The effects of direct injection into the blood to bypass the process of ingestion are unknown. It is often used to clean medical equipment. In hospital accidents involving environmental exposure, it has been known to cause the following symptoms:\n• Throat and lung irritation\n• Asthma, asthma­like symptoms, and breathing difficulty\n• Nose irritation, sneezing, and wheezing\n• Nosebleed\n• Burning eyes and conjunctivitis\n• Rash­contact and/or allergic dermatitis\n• Staining of the hands (brownish or tan)\n• Hives\n• Headaches\n• Nausea\n\nMonosodium Glutamate is a synthetic flavor enhancer. In a 1995 report by the Federation of American Societies for Experimental Biology, two groups of people were defined as intolerant of MSG. This includes those who eat large quantitie of MSG (it is used in lots of processed foods as a flavor enhancer), and those with “poorly controlled asthma”. Our research indicates that anyone can suffer after consuming Monosodium Glutamate. In the 1995 report, which was contracted by the FDA, there was public admission that MSG yields the following symptoms:\n• Burning sensations in the back of the neck, forearms and chest\n• Numbness in the back of the neck, radiating to the arms and back\n• Tingling, warmth, and weakness in the face, temples, upper back, neck and arms\n• Facial pressure or tightness\n• Chest pain\n• Headache\n• Nausea\n• Rapid heartbeat\n• Bronchospasm (difficulty breathing) in MSG ­intolerant people with asthma\n• Drowsiness\n• Weakness\n\nNote that this is the short­list (the one with side effects the FDA actually admits), and it does not consider the highe toxicity of direct injection into the blood. The long list, which is about 15 times longer, includes heart attacks, especially in young people with magnesium deficiencies. Injections of glutamate in laboratory animals have resulted in rapid damage to nerve cells in the brain. MSG is in a special class of chemicals called excitotoxins, which are known to directly attack brain cells. In 1978, MSG was banned from baby foods and other baby products for infants who were less than one year of age, because the American Academy of Pediatrics and the National Academy of Sciences expressed concerns. It is now being used in these products again, along with vaccines.\n\nThese can trigger severe allergies in children which may last throughout their lives to permanently impair their immune systems.\n\nThis is another carcinogen. Ammonium sulfate is prepared by mixing ammonia with sulfuric acid. It is used as a chemical fertilizer for alkaline soils to lower the pH of the soil. In the body, it stresses the immune system by causing acidosis.\n\nAmmonium sulfate is also a gastrointestinal (liver) toxicant, neurotoxicant, and respiratory toxicant.\n\nThis is a strong antibiotic, which is often used for life­ threatening illnesses (eg. pneumonia).\n\nWhen researching this, we discovered the neurotoxicity of neomycin sulfate following oral use as an antibiotic. I can only wonder about what damage this causes when injected directly into the blood of infants. It interferes with vitamin B6 absorption, which is the cause of a rare form of epilepsy, and mental retardation. Adult patients given neomycin as an antibiotic are typically placed under close clinical observation (ie. hospitalized), so that intensive care intervention is immediately available. Neurotoxicity has been reported, along with nephrotoxicity, and permanent bilateral auditory ototoxicity. Sometimes vestibular toxicity is present in patients with normal renal function when treated with higher or longer doses than recommended.\n\nThis is yet another carcinogen. This is a kidney toxicant and a neurotoxicant. It is more hazardous than most chemicals in 2 out of 3 ranking systems, on at least 1 federal regulatory list.\n\nThis is another antibiotic. Injection of this is generally avoided by doctors (except in the case of vaccines), due to severe pain at injection sites, particularly in infants and children.\n• Albuminuria\n• Cylindruria\n• Azotemia\n• Rising blood levels without any increase in dosage.\n• Facial flushing\n• Dizziness progressing to ataxia\n• Drowsiness\n• Peripheral paresthesias: circumoral and stocking­glove\n• Apnea\n• Signs of meningeal irritation with intrathecal administration\n\nThis is a suspected carcinogen. It is a known skin and sense organ toxicant. It is verified as a cancer agent in animals.\n\nDiabetic retinopathy and neuropathy may be related to excess sorbitol in the cells of the eyes and nerves; leading to blindness. This is another suspected carcinogen. Sorbitol is a gastrointestinal and liver toxicant.\n\nThis is an experimental artificial sweetener. Actually the experimentation is ongoing ― in children that is, without the knowledge or consent of their parents.\n\nDocumented as a verified carcinogen. It is a gastrointestinal (liver) toxicant, respiratory toxicant, skin toxicant, and sense organ toxicant. More hazardous than most chemicals; earning a 3 out of 3 in ranking systems. It appears on at least 5 federal regulatory lists. It is ranked as one of the most hazardous compounds to humans.\n\nThis can cause irreversible kidney damage, and mild liver failure. It has been known to produce severe histamine (allergic) reactions. There are several reports of anemia and cardiac failure. According to the MME definition it is, “a drug used to treat fungus infections. Known allergy to this drug prohibits use. Side effects include blood clots, blood defects, kidney problems, nausea and fever. When used on the skin, allergic reactions can occur”.\n\nAnimal cell lines are used to culture the viruses in vaccines, so animal tissues and impurities are included in the formulation that is injected. These tissues are unusable and toxic to the body except for when their protein materials are digested to form amino acids through normal food consumption. There is no digestion process for injections.\n\nInjections may also contain many types of animal viruses (see the Animal Viruses section). Animals used include monkey (kidney), cow (heart), calf (serum), chicken (embryo and egg), duck (egg), pig (blood), sheep (blood), dog (kidney), horse (blood), rabbit (brain), guinea pig, etc.\n\nIn addition to the animal tissue impurities, there are large proteins that are deliberately included, and used for such purposes as adjuvants (substances that aggravate an immune response using their inherent toxicity). Egg album and gelatin (or gelatine, obtained from selected pieces of calf and cattle skins, de­mineralized cattle bones and pork skin) are in several vaccines. Casein (milk protein) is in the triple antigen (DPT vaccine). When injected, these normally harmless proteins are toxic to the body. Hence the immune system “response”. The immune system is intentionally stressed by this invasion to produce an unnatural sensitization to all the ingredients. The body will become further sensitive to these substances in the future, rather than becoming immune to them. So, the basic premise of vaccinations which the public has been sold is false. This explains why bizarre allergies such as lactose intolerance, egg, and nut allergies have suddenly become common in recent history.\n\nThis is included in the hepatitis B vaccine which is given routinely to health workers. The high occurrence of the latex allergies among nurses is due to their sensitization to latex through the large amounts of chemical rubber which is injected into them. These vaccines produce a panicked immune response. These nurses will suffer with this allergy permanently. Such allergic reactions can be life ­threatening.\n\nThis vaccine is now routinely given to newborn babies in many countries, including Australia, and the United States.\n\nSome of these can be particularly alien to the human body. The most frequently documented and publicised example is the monkey virus SV40. The virus is harmless in monkeys, but it stimulates rare cancers when injected into humans producing brain (tumors), bone (e.g. multiple myeloma), lungs (mesothelioma), and lymphoid tissue (lymphoma). Monkey Virus SV40 has only appeared in people born in the last 20 years (The Journal of Infectious Diseases, Sept. 1999), long after the manufacturer claimed to have “cleaned up” the polio vaccines where it was found. Such cases include the late Alexander Horwin, both of whose parents tested negative for SV40. Therefore, recent cases cannot just be blamed on inheritance from parents who received the vaccine. This proves that manufacturers are secretly including it again.\n\nThe viruses against which the vaccine is supposed to protect are frequently said to be “killed”, “inactivated”, or “attenuated”. This is a myth. The main method used to inactivate viruses is treatment with formaldehyde, whose effectiveness is limited, and even then only temporary. Once the brew is injected into the body, the formaldehyde is broke down by the body potentially releasing the virus in its original state. This is intentional. It is documented in orthodox medical literature that these living “crippled” viruses can revert to their former virulence.\n\nPlease remember that the included viruses, and bacteria, which the vaccine is supposed to protect against are claimed to be in “very small doses”. These small doses are not small to the body, and these quantities are quite high enough for the diseases to occur. When they do occur, the cases are always severe, and sometimes fatal. Several deaths were reported in the British medical journal, Lancet, from vaccine ­induced yellow fever. A susceptible person may succumb to infection when exposed to only a minute doses, especially when it is injected directly into the bloodstream. Likewise, there are other cases in which a healthy person will not succumb, even when exposed to large doses environmentally. It is not the pathogens, but the interaction methods between pathogens and hosts which causes diseases to appear, and the level of their severity.\n\nVaccines may not manifest obvious injury, especially not immediately, but are still likely to cause long term harm to internal organs and the immune system given their ingredients, and their known effects.\n\nMost disease symptoms are the visible signs of a body’s attempts to defend itself against the infection. With disease injections, many important defences in the digestion path and mucous membranes are bypassed.\n\nThese are microscopic organisms lacking rigid cell walls and considered to be the smallest free­living organisms. Many are pathogenic, and one species is the cause of mycoplasma pneumonia; which interestingly, is noted to occur only “in children and young adults”, according to Mosby’s Medical Dictionary. This is not simply in vaccines by accident. It is deliberately added as an adjuvant (to increase the immune system’s allergic “response”) to the vaccine. The ingredients must be either poisonous, or slightly biologically infectious to trigger immune system responses, in other words.\n\nThis is in the Hepatitis B Vaccine. Given the controversy over the ingestion of genetically modified foods, how much more dangerous do you think the direct injection of them is? What are the future consequences of this genetic experimentation against our children? Normal yeast that grows throughout the tissues is already known to be the root cause of countless ailments which can last for years, and in the rare cases when it is proper diagnosed, these are called yeast infections. Yeast overgrowth directly attacks the immune system, and cripples the body’s ability to remove wastes, toxins, and absorb nutrients categorically. The standard treatment for it with antibiotics often actually strengthens these infections in the long­ term by killing more of the beneficial flora which normally keeps yeast overgrowth in check.\n\nDNA is used from such organisms as animals, viruses, fungi, and bacteria. It has been documented that injecting foreign DNA can cause it, or a portion of it, to be incorporated into the recipient’s DNA. The horrendous long­term multi­ generational implications defy the imagination. Although, some people might actually find it beneficial to have their grandchildren born with three arms, or horns from the head. These possibilities may seem far­fetched, but with the rate at which these type of ingredients are being incorporated into vaccines, it is a matter of when they happen ― not if. Describing it as insane is being too gracious.\n\nThe human body has never experienced such a direct invasion as this before. We hope that you consider this list, and the side effects of vaccines before giving your child vaccinations. We have strong reasons to believe that overall, and in general, that the risks of horrible and long­ term side effects far outweighs the risks of the diseases which vaccines are supposed to prevent.\n\nHuman blood is supposed to be, and traditionally was, remarkably sterile. There were virtually no bacteria or organisms present in the bloodstream. With vaccines now being so prevalent, this is no longer the case. Contrary to what we have been told, they weaken the immune system dramatically instead of strengthening it. In the United States, the Hepatitis B Vaccine is given to a child on the day of his birth, often weakening his immune system for his lifetime. His small body is just becoming accustomed to the germs around him for the first time, and it needs the strong immune system that he was given to be intact.\n\nAlthough vaccines are mandatory in the U.S., all states currently offer religious exemptions, and some states offer philosophical exemptions. You may wish to consider these as options in order to protect your children. Religious exemptions are quite appropriate for this, because you can tell them honestly, and with a straight­ face, that you are doing it because it is the Christian thing to do.”", "opengraph": {"description": "  'Vaccine Side ­Effects' There has been much recent concern regarding vaccines given to children, and their possible side effects. Particularly highlighted is the link between early childhood vaccines and autism. This article provides a list of known ingredients inside vaccines, and their documented side effects. It will aid you in making informed decisions, which is something the industry is against. The corporations involved have attempted to suppress this information for decades. Readers are advised that there are extra chemicals and toxins which are not mentioned, because we based this list upon the ingredients which are public knowledge. If you", "title": "List of Vaccine Ingredients & Their Known Side Effects", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/list-of-vaccine-ingredients-their-known-side-effects/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-07-02T15:10:02-04:00", "article:modified_time": "2019-07-09T07:40:18-04:00", "updated_time": "2019-07-09T07:40:18-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Flist-of-vaccine-ingredients-their-known-side-effects%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Flist-of-vaccine-ingredients-their-known-side-effects%2F&text=List+of+Vaccine+Ingredients+%26+Their+Known+Side+Effects", "#", "/cdn-cgi/l/email-protection#714e0204131b1412054c3d1802055443411e1754434127101212181f14544341381f1603141518141f050254434154434754434125191418035443413a1f1e061f544341221815145443413417171412050257131e15084c54324354304154434154434327101212181f14544341221815145443415432435430353417171412050254434354434125191403145443411910025443411314141f5443411c041219544341031412141f05544341121e1f1214031f544341031416100315181f1654434107101212181f1402544341161807141f544341051e5443411219181d1503141f544332544341101f155443410519141803544341011e020218131d1454434102181514544341141717141205025f544341211003051812041d10031d08544341191816191d18161905141554434118025443410519145443411d181f1a5443411314050614141f5443411410031d085443411219181d15191e1e1554434107101212181f1402544341101f1554434110040518021c5f5443412519180254434110030518121d1454434101031e0718151402544341105443411d1802055443411e175443411a1f1e061f544341181f1603141518141f0502544341181f0218151454434107101212181f1402544332544341101f155443410519141803544341151e12041c141f05141554434102181514544341141717141205025f544341380554434106181d1d544341101815544341081e04544341181f5443411c101a181f16544341181f171e031c14155443411514121802181e1f0254433254434106191812195443411802544341021e1c140519181f16544341051914544341181f1504020503085443411802544341101610181f02055f544341251914544341121e03011e031005181e1f02544341181f071e1d07141554434119100714544341100505141c01051415544341051e544341020401010314020254434105191802544341181f171e031c1005181e1f544341171e03544341151412101514025f544341231410151403025443411003145443411015071802141554434105191005544341051914031454434110031454434114090503105443411219141c1812101d02544341101f15544341051e09181f0254434106191812195443411003145443411f1e055443411c141f05181e1f14155443325443411314121004021454434106145443411310021415544341051918025443411d18020554434104011e1f544341051914544341181f1603141518141f050254434106191812195443411003145443410104131d18125443411a1f1e061d141516145f5443413817544341081e0454413554413054413554413023141015513c1e031451391403144b515443411905050102544230544337544337061e031d1505030405195f05075443371d1802055c1e175c07101212181f145c181f1603141518141f05025c05191418035c1a1f1e061f5c021815145c14171714120502544337", "https://worldtruth.tv/wp-content/uploads/2012/06/vaccine-4-29-2.jpg", "https://worldtruth.tv/wp-content/uploads/2012/06/vaccine4.jpg", "https://worldtruth.tv/wp-content/uploads/2012/06/prestone_super_radiator_anti_rust.png", "https://worldtruth.tv/wp-content/uploads/2012/06/Vaccine_scam_DeesIllustration-2.jpg", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-07-02T15:10:02-04:00"}