{"result_id": "350036", "URL": "https://worldtruth.tv/30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines/", "timestamp": "2023-04-25 18:18:37 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "30 Stunning Facts They Don't Want You To Know About Gardasil & HPV Vaccines", "cleaned_text": "Guarantees. Insurance. Promises. Concerns over safety, security, and health make most people apprehensive about the future on some level. Guarding against future unknowns has become a big part of the American economy. You can get a warranty on almost anything with a battery, take out insurance on many more things than your grandparents would have dreamed of, and the medical industry is working around the clock to develop new drugs and vaccines to ‘protect’ us from whatever trending epidemic is in the news.\n\nOne fairly recent, major medical controversy that seemed, strangely, to have no trending epidemic, is the HPV vaccine for cervical cancer. The blatant profit-mongering behind the development of the premiere vaccine, Gardasil, was transparent enough that it served to further inflame the ongoing vaccination controversies to a point that the media could no longer fail to report on it.\n\nThe politics and profits involved in the medical industry, the pharmaceutical industry, and the media industry become more obvious and prevalent every day. Before taking any pharmaceutical product, you should take ownership of your own health. Conduct your own research on the ingredients and side-effects. Find out where your doctor gets his information. Many of them are paid to promote specific pharmaceutical products. Others simply get their information from sources they trust such as the Centers for Disease Control and Prevention (CDC) or the American Academy of Pediatrics (AAP). Still, others are told by their legal departments not to speak out.\n\nIn August, the Health Ranger interviewed neurosurgeon Dr. Russell Blaylock, M.D. on tv.naturalnews.com. Dr. Blaylock shared some little known facts about the human papillomavirus (HPV) and the quick development of a vaccine to address it. Dr. Blaylock says the vaccine is “predicated on an absolute lie.”\n\nSome empowering facts you may not know about the human papillomavirus and Gardasil:\n\n1. First, the basis is wrong. HPV by itself does not cause cervical cancer. Evidence shows it takes a combination, or co-infections – multiple viruses or virus/bacteria combinations to cause cervical cancer. Examples include Epstein Bar virus, HIV, and Chlamydia, along with HPV.\n\n2. Birth control pills and other hormonal drugs also increase the risk of HPV.\n\n3. It has never been proven that the HPV vaccine prevents cervical cancer. There is no scientific evidence of any kind.\n\n4. There are over 100 strains of HPV, only about 15 of which can contribute to cervical cancer.\n\n5. HPV vaccines only include two to four strains, leaving you open to more than two-thirds of the dangerous strains. You will still need to get routine screenings for cervical cancer.\n\n6. You don’t change or reduce the incidence of cancer by receiving the vaccine. Studies show that the human immune system develops resistance to the strains given in the vaccine, allowing others to become predominant.\n\n7. The CDC website states that the human body’s immune system clears HPV within two years, 90 percent of the time (70 percent in one year). Without the vaccine.\n\n8. One of the most powerful connections proven to increase the risk of cervical cancer is smoking. Women who smoke have 2.3 times higher incidence of the precancerous lesions that lead to cervical cancer.\n\n9. Diet is key. A poor diet increases risk while a diet that includes high amounts of vitamin B12 and folic acid have a 79 percent reduction in HPV infections and cervical cancer. Vitamin C, curcumin, quercetin, and other flavonoids are powerful inhibitors against cervical cancer.\n\n10. Dietary combinations have been proven to have far greater effect against HPV than any vaccine.\n\n11. All the marketing assertions are false. It is one of the largest, most harmful medical hoaxes of our time.\n\n12. Officially, the vaccine has been associated with approximately 100 deaths, and 500 have been left permanently disabled.\n\n13. Those numbers are based on voluntary reporting, which historically means only two to ten percent of cases are represented. The vast majority of cases are never reported. So, conservatively, 5,000 young girls and women have been harmed by the vaccine.\n\n14. Cervical cancer is one of the rarest cancers in the U. S., with 12,000 cases reported per year and 4,000 deaths.\n\n15. The number of girls and women that experience serious complications from the vaccine meets or exceeds the number of deaths.\n\n16. Side-effects include: Multiple sclerosis, encephalitis, blindness, pericarditis, coma, and death among many others.\n\n17. The vaccine Gardasil was “fast tracked.” This was illegal. The FDA requires new vaccines to undergo testing and a waiting period of 4 years. Gardasil was developed and on the market in 6 months, with FDA approval.\n\n18. Texas governor Rick Perry tried to force all girls in Texas entering the sixth grade to receive the vaccine in 2007, despite the fact that the incubation period for HPV averages 20 years with the median age of sufferers being 48. He mandated it over the legislature’s objections.\n\n19. People thought they were required to receive the vaccine, but that too was untrue as it wasn’t an actual law.\n\n20. Perry received huge amounts of money from the manufacturer.\n\n21. Perry’s former chief of staff became a hired lobbyist for Merck, the maker of Gardasil in 2009, exposing the connection to the pharmaceutical giant, and the motivation for pushing the vaccine.\n\n22. The Texas Legislature overturned Perry’s executive order requiring girls to get the vaccine due to the huge backlash from the public. However, the precedent had been set, and other states and countries began to follow suit.\n\n23. Pap smears alone prevent over 80 percent of cervical cancer. A yearly pap smear reduces your chance of getting cervical cancer to .002 percent.\n\n24. HPV vaccines have been illegally administered to millions without informed consent as the risks are rarely disclosed.\n\n25. What people don’t know is that there are Informed Consent laws that are there to protect patients. They provide a legal strategy for people who have experienced vaccine damage.\n\n26. Vaccine manufacturers do not want doctors to discuss and disclose the risks associated with vaccines because they don’t want people to realize they can opt out. This has been documented in multiple medical journals. Yet it is illegal for doctors NOT to disclose the risks.\n\n27. The vaccine was only tested on 21,000 girls and women before being pushed on millions of children, teens, and adults worldwide, according to the FDA website.\n\n28. The FDA website has no mention that the vaccine was ever tested on males, yet the CDC says the vaccine is “recommended for all teen boys and men through age 21.”\n\n29. The Informed Consent laws also address questions about the efficacy of vaccines. Meaning you have a right to ask questions and receive answers about how well it works, why you should allow it to be administered, as well as the risks.\n\n30. Vaccine manufacturers have gone to the legislature(s) to get a law passed that you cannot sue over vaccine complications. But, you can sue.\n\nAfter learning the ins and out of the underhanded and unethical practices involved in bringing this vaccine to market, people should wonder why and how medical professionals and legislators continue to go along with promoting it unquestioningly. If this were a financial situation, there would be enough evidence to bring charges against manufacturers, the legislators, and the CDC. The vaccine industry regularly operates in criminal practices. They violate marketing laws with false statements and exaggerated extrapolations/over simplification of the facts; they doctor their statistical numbers, and present their marketing as science. Gardasil was being tested before it was licensed. They have yet to offer a plausible explanation as to why girls aged 9-12 need a vaccine for a sexually transmitted disease, much less one that only offers two years of “protection.”\n\nYou have to question who is making the decisions to allow the shortcuts that have resulted in so many deaths and disabilities. Are these the same “powers that be” that are disseminating the information to your doctor that it is safe and recommended for your daughter?\n\n \n\n Sources for this article include:", "opengraph": {"description": "Guarantees. Insurance. Promises. Concerns over safety, security, and health make most people apprehensive about the future on some level. Guarding against future unknowns has become a big part of the American economy. You can get a warranty on almost anything with a battery, take out insurance on many more things than your grandparents would have dreamed of, and the medical industry is working around the clock to develop new drugs and vaccines to 'protect' us from whatever trending epidemic is in the news. One fairly recent, major medical  controversy that seemed, strangely, to have no trending epidemic, is the HPV", "title": "30 Stunning Facts They Don't Want You To Know About Gardasil & HPV Vaccines", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-05-26T09:36:00-04:00", "article:modified_time": "2020-05-28T11:25:40-04:00", "updated_time": "2020-05-28T11:25:40-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2F30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2F30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines%2F&text=30+Stunning+Facts+They+Don%27t+Want+You+To+Know+About+Gardasil+%26+HPV+Vaccines", "#", "/cdn-cgi/l/email-protection#340b4741565e5157400907041106046740415a5a5d5a531106047255574047110604605c514d110604705b5a1106034011060463555a401106046d5b41110604605b1106047f5a5b4311060475565b41401106047355465055475d581106041106021106047c6462110604625557575d5a514712565b504d0973415546555a405151471a1106047d5a474146555a57511a11060464465b595d4751471a110604775b5a5751465a471106045b42514611060447555251404d11067711060447515741465d404d110677110604555a501106045c515558405c11060459555f51110604595b474011060444515b44585111060455444446515c515a475d425111060455565b4140110604405c511106045241404146511106045b5a110604475b595111060458514251581a11060473415546505d5a531106045553555d5a4740110604524140414651110604415a5f5a5b435a471106045c55471106045651575b595111060455110604565d53110604445546401106045b52110604405c51110604755951465d57555a11060451575b5a5b594d1a1106046d5b4111060457555a1106045351401106045511060443554646555a404d1106045b5a1106045558595b4740110604555a4d405c5d5a53110604435d405c110604551106045655404051464d11067711060440555f511106045b41401106045d5a474146555a57511106045b5a11060459555a4d110604595b4651110604405c5d5a5347110604405c555a1106044d5b41461106045346555a50445546515a4047110604435b4158501106045c554251110604504651555951501106045b52110677110604555a50110604405c511106045951505d5755581106045d5a50414740464d1106045d47110604435b465f5d5a5311060455465b415a50110604405c5111060457585b575f110604405b11060450514251585b441106045a51431106045046415347110604555a50110604425557575d5a5147110604405b11060411060344465b40515740110603110604414711060452465b59110604435c5540514251461106044046515a505d5a5311060451445d5051595d571106045d471106045d5a110604405c511106045a5143471a1106047b5a5111060452555d46584d110604465157515a4011067711060459555e5b461106045951505d575558110604117706117504575b5a40465b425146474d110604405c5540110604475151595150110677110604474046555a5351584d110677110604405b1106045c5542511106045a5b1106044046515a505d5a5311060451445d5051595d571106771106045d47110604405c511106047c64621104701104751104701104756651555014795b4651147c5146510e141106045c40404447110775110672110672435b465850404641405c1a40421106720704194740415a5a5d5a5319525557404719405c514d19505b5a401943555a40194d5b4119405b195f5a5b431955565b4140195355465055475d5819555a50195c444219425557575d5a5147110672", "https://worldtruth.tv/30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines/gardasil-a-human-papillomavirus-vaccine-is-displayed-at-the-girls-to-women-health-and-wellness-clinic-in-dallas/", "https://worldtruth.tv/30-stunning-facts-they-dont-want-you-to-know-about-gardasil-and-hpv-vaccines/gardasil-1-3/", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-05-26T09:36:00-04:00"}