{"result_id": "350034", "URL": "https://worldtruth.tv/white-house-admits-staging-fake-vaccination-operation-to-gather-dna-from-the-public-3/", "timestamp": "2023-04-25 18:18:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/white-house-admits-staging-fake-vaccination-operation-to-gather-dna-from-the-public-3/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "White House Admits Staging Fake Vaccination Operation To Gather DNA From The Public", "cleaned_text": "The White House has officially admitted that fake vaccination programs have been used by the United States as a cover for covertly stealing DNA samples from the public as part of the so-called “war on terror.” The aim of the scheme, carried out in the Middle East, was to use DNA analysis to identify suspected terrorists who would then be targeted to be killed by the United States.\n\nAs the New York Times reported in 2011, “In the months before Osama bin Laden was killed, the Central Intelligence Agency ran a phony vaccination program in Abbottabad, Pakistan, as a ruse to obtain DNA evidence from members of Bin Laden’s family thought to be holed up in an expansive compound there.” (1)\n\n“CIA agents recruited a senior Pakistani doctor to organize the vaccine drive in Abbottabad, even starting the “project” in a poorer part of town to make it look more authentic,” reports The Guardian (2).\n\nThis scheme, first unveiled in 2011, is the first time in history that the U.S. government has been forced to admit using a “public health” activity to secretly and illegally harvest DNA from the public in an attempt to assassinate one individual.\n\nHow exactly could a vaccination program harvest DNA from people? It’s a simple matter, really. As The Guardian explains, “nurses could have been trained to withdraw some blood in the needle after administrating the drug.”\n\nWhite House says it will stop using fake vaccination programs to gather DNA and kill people\n\nNow the White House says it will no longer use fake vaccination campaigns as a tactic in the “war on terror.” And the people of the world are supposed to automatically trust this promise even though it comes from the exact same regime that ran the deceptive vaccination operation in the first place.\n\n\n\nIt’s almost as if the White House is saying, “Yeah, we ran a fake vaccination op; we harvested the DNA of your children; we lied to your people under the cover of public health and we got caught… but NOW you can trust us! We promise!”\n\n\n\nThis seemingly ludicrous promise just surfaced this week as part of a White House announcement that the United States would “not use vaccination programs as cover for spy operations,” according to Yahoo News. (3)\n\n\n\nThe White House is concerned that because of the CIA’s use of fake vaccination programs in the past, people in the Middle East no longer trust vaccines. (Gasp! Imagine that!) This has nearly the entire medical establishment freaked out, terrified that somebody somewhere might say “No!” to vaccines and thereby destroy the entire human civilization with polio.\n\nhref=”http://www.naturalnews.com/045219_polio_pandemic_global_health_emergency_scare_stories.html” target=”_blank”>Click here to read my recent story on W.H.O. fear mongering and hysterics surrounding the fabricated polio “global health emergency.”\n\n\n\nAccording to Yahoo News, White House anti-terrorism advisor Lisa Monaco has now relayed this new claim to the deans of 13 public health schools in the United States. She reportedly added, “the agency will not seek to obtain or exploit DNA or other genetic material acquired through such programs,” once again confirming the CIA had been using fake vaccination programs to acquire DNA samples in order to track down human targets for termination.\n\n\n\nAll this validates the true description that vaccines have been used as weapons of war against individuals the United States considers to be its enemies.\n\n\n\nI remember reporting on this several years ago and being called a “conspiracy theorist” for doing so. Yet once again, the facts have emerged that proved us correct in being intelligent conspiracy analysts who investigate deception in the world.\n\n\n\nAs I’ve since written, anyone who believes there are no such thing as conspiracies is mentally retarded. The White House, in fact, is openly admitted it ran a “vaccine conspiracy” as a tactic of warfare. (A “conspiracy” merely consists of two or more people plotting to deceive others. This fake vaccination scheme was, by definition, an elaborate conspiracy.)\n\nBut now the backlash against the fake immunization scheme has U.S. officials in a panic. They now realize they’ve discredited all trust in western vaccines. After all, if the White House now admits using fake vaccination ops to coverly gather DNA evidence, what’s to stop the U.S. from using fake vaccination programs to accomplish other nefarious things like injecting people with stealth cancer viruses?\n\n\n\nOops, that already happened. It happened right here in the United States, in fact, when 98 million Americans were found to have been injected with polio vaccines contaminated with cancer-causing viruses. In order to make sure no one learned about this deadly vaccine snafu, the CDC quietly removed all accounts of this history from its website.\n\n\n\nTo anyone with half a brain still functioning, however, it’s crystal clear that vaccines have already been used as weapons of war by the United States. This is openly admitted now by the White House along with a promise that “we won’t do it again.”\n\n\n\nThis is the same White House that promised nationwide GMO labeling, closing down secret military prisons and balancing the federal budget, by the way. In the category of “promises kept,” the present-day White House has achieved virtually nothing.\n\nCould U.S. vaccination scheme be used to gather DNA on Americans?\n\nIt’s no longer an outlandish question. This is precisely what the White House has already admitted to doing on foreign soil. Could the same thing now be conducted on U.S. soil and aimed at Americans?\n\n\n\nOf course it could. What better way to get millions of people to line up and voluntarily give up DNA samples than to invent a fictitious “pandemic” and offer a “lifesaving treatment” in the form of a vaccine?\n\n\n\nMost of the masses have already been trained to accept any and all injections the government wants them to endure, so as long as a DNA harvesting campaign is framed in the language of “public health,” resistance will be virtually nonexistent.\n\n\n\nMost of the vaccines Americans already take are utterly useless to begin with. For example, Americans are still being vaccinated against polio even though there hasn’t been a single case of polio in the USA for 35 years. To help make sure more people get injected with medically unnecessary polio vaccines, the W.H.O. recently fabricated an hysterical tabloid-style “global health emergency” that inferred we would all die miserable deaths if we didn’t immediately rush out to get injected with more polio vaccines.\n\n\n\nFlu shots, similarly, have almost zero efficacy and have been scientifically proven to accomplish nothing in nearly 99 out of 100 people who receive them. At the same time, the CDC openly admits flu shots still contain toxic mercury, a documented neurotoxic heavy metal that destroys brain tissue.\n\nFive amazing uses for vaccines (as proven by recent history)\n\nVaccines do have their uses, ultimately. They’re really great at these five things:\n\n\n\n1) Administering mercury to the population\n\n2) Covertly harvesting DNA from the public\n\n3) Providing a cover story for CIA operations\n\n4) Injecting millions of people with stealth cancer viruses\n\n5) Training the population to practice “medical obedience”\n\n\n\nBut vaccines are really, really terrible at doing the thing the one thing they claim to be all about: preventing infectious disease.\n\n\n\nIt turns out the best defenses against infectious disease are:\n\n\n\n* Excellent nutrient intake from a wide variety of fresh plants\n\n* Good public hygeine and public sanitation systems\n\n* Healthy levels of vitamin D across the population\n\n* Regular hand washing by medical staff and patients\n\n* Deliberate exposure to friendly microbes in soils and even farm animals\n\n* Avoidance of exposure to immunosuppressive substances such as tobacco smoke or heavy metals\n\n\n\nIf you’d really like to learn the historical truth about vaccines vs. infectious disease, read this outstanding book by Dr. Suzanne Humphries entitled Dissolving Illusions: Disease, Vaccines, and The Forgotten History.\n\n\n\nHer website also features a huge collection of eye-opening graphs citing scientific evidence that completely contradicts the false vaccination narrative currently being pushed by the U.S. government.\n\n\n\nExample: This graph shows how measles was already virtually eradicated even before the introduction of the measles vaccine. Today, medical institutions falsely claim that vaccines alone are responsible for eradicating diseases like measles, smallpox and polio. But if vaccines alone caused the decline, then why did nearly all the decline in measles happen BEFORE the introduction of the measles vaccine? (Can vaccines travel through time?)", "opengraph": {"description": "The White House has officially admitted that fake vaccination programs have been used by the United States as a cover for covertly stealing DNA samples from the public as part of the so-called 'war on terror.' The aim of the scheme, carried out in the Middle East, was to use DNA analysis to identify suspected terrorists who would then be targeted to be killed by the United States. As the New York Times reported in 2011, 'In the months before Osama bin Laden was killed, the Central Intelligence Agency ran a phony vaccination program in Abbottabad, Pakistan, as a ruse", "title": "White House Admits Staging Fake Vaccination Operation To Gather DNA From The Public", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/white-house-admits-staging-fake-vaccination-operation-to-gather-dna-from-the-public-3/", "site_name": "WorldTruth.Tv", "article:published_time": "2018-03-02T02:12:28-04:00", "article:modified_time": "2020-09-29T22:09:04-04:00", "updated_time": "2020-09-29T22:09:04-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fwhite-house-admits-staging-fake-vaccination-operation-to-gather-dna-from-the-public-3%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fwhite-house-admits-staging-fake-vaccination-operation-to-gather-dna-from-the-public-3%2F&text=White+House+Admits+Staging+Fake+Vaccination+Operation+To+Gather+DNA+From+The+Public", "#", "/cdn-cgi/l/email-protection#57682422353d3234236a003f3e23327265671f3822243272656716333a3e2324726567042336303e393072656711363c32726567013634343e3936233e38397265671827322536233e383972656703387265671036233f32257265671319167265671125383a726567033f327265670722353b3e34713538332e6a033f32726567003f3e23327265671f382224327265673f36247265673831313e343e363b3b2e72656736333a3e23233233726567233f362372656731363c32726567213634343e3936233e38397265672725383025363a247265673f3621327265673532323972656722243233726567352e726567233f3272656702393e23323372656704233623322472656736247265673672656734382132257265673138257265673438213225233b2e726567242332363b3e393072656713191672656724363a273b32247265673125383a726567233f327265672722353b3e347265673624726567273625237265673831726567233f3272656724387a34363b3b3233726567726565203625726567383972656723322525382579726565726567033f32726567363e3a7265673831726567233f3272656724343f323a32726514726567343625253e32337265673822237265673e39726567233f327265671a3e33333b327265671236242372651472656720362472656723387265672224327265671319167265673639363b2e243e2472656723387265673e333239233e312e7265672422242732342332337265672332252538253e242324726567203f387265672038223b33726567233f323972656735327265672336253032233233726567233872656735327265673c3e3b3b3233726567352e726567233f3272656702393e233233726567042336233224797265671624726567233f327265671932207265670e38253c726567033e3a322472656725322738252332337265673e39726567656766667265147265677265651e39726567233f327265673a3839233f247265673532313825327265671824363a36726567353e397265671b363332397265672036247265673c3e3b3b3233726514726567233f327265671432392325363b7265671e3923323b3b3e303239343272656716303239342e72656725363972656736726567273f38392e726567213634343e3936233e38397265672725383025363a7265673e397265671635353823233635363372651472656707363c3e242336397265147265673624726567367265672522243272671372671672671372671605323633771a382532771f3225326d777265673f232327247264167265117265112038253b33232522233f792321726511203f3e23327a3f382224327a36333a3e23247a242336303e39307a31363c327a213634343e3936233e38397a3827322536233e38397a23387a3036233f32257a3339367a3125383a7a233f327a2722353b3e347a64726511", "https://worldtruth.tv/wp-content/uploads/2014/05/ps008902_lzn2.jpg", "http://www.naturalnews.com/045172_conspiracy_theories_rational_thought_corporate_collusion.html", "http://www.naturalnews.com/041345_cdc_polio_vaccine_sv40.html", "http://www.naturalnews.com/041593_CDC_polio_vaccine_SV40_cancer_virus.html", "http://www.naturalnews.com/045219_polio_pandemic_global_health_emergency_scare_stories.html", "http://www.naturalnews.com/029641_vaccines_junk_science.html", "http://www.naturalnews.com/037653_vaccine_additives_thimerosal_formaldehyde.html", "https://worldtruth.tv/wp-content/uploads/2014/05/ad_130270655.jpg", "http://www.dissolvingillusions.com/graphs/", "https://worldtruth.tv/wp-content/uploads/2014/05/Measles-Decline-Vaccines1.jpg", "http://www.naturalnews.com/045318_fake_vaccines_DNA_harvesting_White_House.html", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2018-03-02T02:12:28-04:00"}