{"result_id": "350005", "URL": "https://worldtruth.tv/vaccine-researcher-charged-with-felony-crimes-for-research-fraud-may-spend-20-years-in-prison-over-faked-aids-vaccine/?amp=1", "timestamp": "2023-04-25 18:17:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/vaccine-researcher-charged-with-felony-crimes-for-research-fraud-may-spend-20-years-in-prison-over-faked-aids-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Vaccine Researcher Charged With Felony Crimes For Research Fraud; May Spend 20 Years In Prison Over Faked AIDS Vaccine", "cleaned_text": "Scientific fraud is so common in the vaccine industry, it’s practically the default business model. The truth is that most vaccines don’t work, so in order to make them appear to work, researchers routinely spike blood samples of vaccinated test subjects with antibodies, making it appear the vaccine caused the body to produce those antibodies.\n\nThis is exactly what Merck does with MMR vaccines, according to the company’s own former virologists who filed a False Claims Act with the federal government. It’s also why up to 97% of children who contract measles or mumps were already vaccinated against measles and mumps.\n\nNow, a National Institutes of Health-funded vaccine scientist who was celebrated as achieving a breakthrough vaccine against HIV has confessed to spiking the test subject blood samples with antibodies. Dong-Pyou Han had taken $5 million in NIH grant money to further his “research” at Iowa State University. The mainstream media and vaccine advocates hailed his research as groundbreaking, “game-changing” advancements in the search for an AIDS vaccine.\n\nBut now, it turns out Han committed outrageous scientific fraud that wasted taxpayer money and diverted resources away from other important research projects. So federal prosecutors have taken the extraordinary step of charging Han with making false statements to the government. He now faces four felony counts, each of which carries a maximum prison sentence of five years. (Yes, lying to the government is a federal crime. But the government lying to us, well… that’s another matter altogether.)\n\n“It’s an important case because it is extremely rare for scientists found to have committed fraud to be held accountable by the actual criminal justice system,” said Retraction Watch co-founder Ivan Oransky in an ABC News article.\n\nThe vaccine industry routinely gets away with fraud: Why aren’t more criminal charges filed?\n\nAll this brings up the question of why more fraudulent vaccine researchers aren’t charged with felony crimes. It also begs the question of why companies like GlaxoSmithKline, which openly admit to committing multiple felony crimes in the routine bribing of doctors, are still allowed to conduct business with the government at all.\n\n\n\nThe vaccine industry, you see, is run like a criminal mafia that has blanket legal immunity thanks to the U.S. Congress. Vaccines are the only product sold in the USA which can be defectively manufactured and kill people, yet still face zero legal liability in the courts.\n\n\n\nThis is true even when vaccines have been found to contain tiny shards of glass, high levels of toxic mercury, a brain-damaging heavy metal, or even live viruses that literally infect people with the very disease the vaccine claims to prevent.\n\n\n\nIn the United States, a vaccine manufacturer could spike their vaccines with motor oil, cancer viruses, live bacteria, hexavalent chromium, Agent Orange or any other chemical they wanted, and the manufacturer would still have total immunity from all lawsuits. Because of this immunity, vaccine manufacturing has zero quality control pressure in the real world, because vaccine manufacturers are not liable for defective products. So what’s the difference if a few batches a year accidentally contain SV40 cancer viruses, or shards of glass, or too much mercury?\n\n\n\nThat’s why Dr. Maurice Hilleman, former Merck vaccine developer, openly said, “I think that vaccines have to be considered the bargain basement technology for the 20th century.”\n\n\n\nVaccine and drug researchers who commit fraud are also routinely given a slap on the wrist rather than being charged with felony crimes. Remember the psychiatric doctor named Charles Nemeroff who held a chairman position at Emory University? Even after being caught secretly taking $800,000 from GlaxoSmithKline and stripped of his chairmanship, Emory University — a dubious institution steeped in drug money influence — failed to fire Nemeroff and kept him on staff. According to the WSJ, 14 other Emory University doctors also received money from the Depression and Anxiety journal to write articles about Effector. At Emory, it seems, selling out to the drug industry is just a routine way of participating in academia.\n\nVaccine researchers in particular have long enjoyed a presumed legal immunity, even when they commit outrageous scientific fraud. The public has been hoodwinked into thinking vaccines always work and drug companies are engaged in “evidence-based medicine” even when it’s all being faked.\n\n\n\nIn truth, most vaccines don’t work on most people. This is readily admitted on the vaccine inserts themselves, believe it or not. For example, I have in my possession a Flulaval Influenza Virus Vaccine made by GlaxoSmithKline. This insert says, word for word, all the following astonishing things:\n\n\n\n“There have been no controlled trials adequately demonstrating a decrease in influenza disease after vaccination with Flulaval.” (The vaccine insert openly admits the vaccine is backed by zero evidence? So much for so-called “evidence-based medicine.” Now you’re taking a flu shot on pure faith. Perhaps they should be called Evangelical Vaccines…)\n\n\n\nBecause some readers were skeptical that a vaccine insert would openly admit the vaccine doesn’t work, I have taken a photo of this insert as shown here. This is the photo the vaccine industry desperately hopes you never see:\n\n\n\n \n\n\n\nOther astonishing statements made on the vaccine insert include:\n\n\n\n“Safety and effectiveness of Flulaval have not been established in pregnant women, nursing mothers or children.” (And yet this vaccine is routinely administered to pregnant women.)\n\n\n\n“Safety and effectiveness of Flulaval in pediatric patients have not been established.” (Yet the vaccine is also routinely given to children.)\n\n\n\n“Flulaval has not been evaluated for carcinogenic or mutagenic potential, or for impairment of fertility.” (It might cause cancer and spontaneous abortions, in other words, but they don’t really know.)\n\n\n\n“Do not administer Flulaval to anyone… following previous administration of any influenza vaccine.” (No one who has already had a flu shot in any previous year should take this flu shot. Yet flu shots are routinely given year after year to the very same people who often end up getting the flu anyway because their immune systems are so compromised.)\n\nWhat’s interesting to note about flu vaccines in particular is that they also enjoy complete immunity from the FTC even while making blatantly false claims in their marketing.\n\n\n\nThe FTC, you see, routinely goes after scammy weight loss supplement companies for making false claims. They even threw Kevin Trudeau in prison for making false statements in a weight loss book.\n\n\n\nBut when influenza vaccines are aggressively marketed with blatantly false claims — both literal claims and implied claims — the FTC utterly ignores them. Think about it: what other product can get away with being marketed to the public as working even though its own safety sheet openly admits there’s no evidence the product works at all?\n\n\n\nCan you imagine an oil company selling gasoline that didn’t combust? Or a soap company selling a liquid that didn’t contain any soap? How about a wine maker selling a beverage that turned out to be grape juice instead of wine? In all these cases, people would get angry and the FTC would investigate. But when flu shots are sold without any scientific evidence that they really work, the federal government looks the other way and pretends no marketing fraud is taking place.\n\n\n\nThank goodness at least one branch of the feds is charging Dong-Pyou Han with crimes related to the massive vaccine fraud he committed. This is at least a start. If all fraudulent vaccine researchers were similarly charged with felony crimes, we’d have a court system full of such cases and we’d probably have to build a whole new prison just for the vaccine criminals, where they could all practice exposing each other to Anthrax by using CDC-approved research protocols.\n\n\n\nSources for this article include:", "opengraph": {"description": "Scientific fraud is so common in the vaccine industry, it's practically the default business model. The truth is that most vaccines don't work, so in order to make them appear to work, researchers routinely spike blood samples of vaccinated test subjects with antibodies, making it appear the vaccine caused the body to produce those antibodies. This is exactly what Merck does with MMR vaccines, according to the company's own former virologists who filed a False Claims Act with the federal government. It's also why up to 97% of children who contract measles or mumps were already vaccinated against measles and mumps. Now, a National Institutes of", "title": "Vaccine Researcher Charged With Felony Crimes For Research Fraud; May Spend 20 Years In Prison Over Faked AIDS Vaccine", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/vaccine-researcher-charged-with-felony-crimes-for-research-fraud-may-spend-20-years-in-prison-over-faked-aids-vaccine/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-09-06T08:43:00-04:00", "article:modified_time": "2020-09-07T10:23:58-04:00", "updated_time": "2020-09-07T10:23:58-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fvaccine-researcher-charged-with-felony-crimes-for-research-fraud-may-spend-20-years-in-prison-over-faked-aids-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fvaccine-researcher-charged-with-felony-crimes-for-research-fraud-may-spend-20-years-in-prison-over-faked-aids-vaccine%2F&text=Vaccine+Researcher+Charged+With+Felony+Crimes+For+Research+Fraud%3B+May+Spend+20+Years+In+Prison+Over+Faked+AIDS+Vaccine", "mailto:?subject=Vaccine%20Researcher%20Charged%20With%20Felony%20Crimes%20For%20Research%20Fraud%3B%20May%20Spend%2020%20Years%20In%20Prison%20Over%20Faked%20AIDS%20Vaccine&body=Scientific%20fraud%20is%20so%20common%20in%20the%20vaccine%20industry%2C%20it%27s%20practically%20the%20default%20business%20model.%20The%20truth%20is%20that%26nbsp%3Bmost%20vaccines%20don%27t%20work%2C%20so%20in%20order%20to%20make%20them%20appear%20to%20work%2C%20researchers%26nbsp%3Broutinely%20spike%20blood%20samples%26nbsp%3Bof%20vaccinated%20test%20subjects%20with%20antibodies%2C%20making%20it%20appear%20the%20vaccine%20caused%20the%20body%20to%20produce%20those%20antibodies.%20This%20is%20exactly%20what%20Merck%20does%20with%20MMR%20vaccines%2C%26nbsp%3Baccording%20to%20the%20company%27s%20own%20former%20virologists%26nbsp%3Bwho%20filed%20a%20False%20Claims%20Act%20with%20the%20federal%20government.%20It%27s%20also%20why%20up%20to%2097%25%20of%20children%20who%20contract%20measles%20or%20mumps%26nbsp%3Bwere%20already%20vaccinated%20against%20measles%20and%20mumps.%20Now%2C%20a%20National%20Institutes%20of%0D%0A%0D%0ARead%20More%20Here:%20%20https%3A%2F%2Fworldtruth.tv%2Fvaccine-researcher-charged-with-felony-crimes-for-research-fraud-may-spend-20-years-in-prison-over-faked-aids-vaccine%2F", "https://worldtruth.tv/wp-content/uploads/2014/06/doctors-arrested.jpg", "http://www.naturalnews.com/036328_Merck_mumps_vaccine_False_Claims_Act.html", "http://www.naturalnews.com/038554_mumps_outbreaks_vaccinations_children.html", "https://worldtruth.tv/wp-content/uploads/2014/06/Flulaval-Influenza-Virus-Vaccine-2012-2014-Formula-No-Controlled-Trials-600.jpg", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/?amp=1", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/?amp=1", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/?amp=1", "#", "#"], "authors": [""], "publish_date": "2020-09-06T08:43:00-04:00"}