{"result_id": "350013", "URL": "https://worldtruth.tv/california-government-buried-the-truth-about-cell-phone-radiation-causing-brain-cancer-full-text-of-once-secret-document-reveals-how-emfs-penetrate-deeper-into-a-childs-brai/?amp=1", "timestamp": "2023-04-25 18:17:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/california-government-buried-the-truth-about-cell-phone-radiation-causing-brain-cancer-full-text-of-once-secret-document-reveals-how-emfs-penetrate-deeper-into-a-childs-brai/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "California Government Buried The Truth About Cell Phone Radiation Causing Brain Cancer: Full Text Once Secret Document Reveals How EMFs Penetrate Deeper Into A Child’s Brain", "cleaned_text": "A once-secret document detailing links between cell phones and brain cancer has been released by order of a California court. Entitled, “Cell Phones and Health,” the document was demanded in a lawsuit filed by Joel Moskowitz, Ph.D., director of the Center for Family and Community Health at UC Berkeley’s School of Public Health.\n\nClick here to read the full document.\n\n“I would like this document to see the light of day because it will inform the public that there is concern within the California Department of Public Health that cellphone radiation is a risk, and it will provide them with some information about how to reduce those risks,”Moskowitz told a local CBS affiliate.\n\nThe document says that “long-term cell phone use may increase the risk of brain cancer and other health problems” and admits that “cell phone EMFs can affect nearby cells and tissues.” In a special warning section about children, it also explains that “EMFs can pass deeper into a child’s brain than an adult’s.”\n\nEMF stands for ElectroMagnetic Field. According to the document, there’s no evidence that EMF blocking devices for cell phones actually work, by the way. (I haven’t personally tested any in my lab, so I can’t say whether this is true or false, but from a commonsense scientific point of view, if they really blocked EMF signals from the phone, the phone would no longer be able to make calls because it couldn’t communicate with cell towers.)\n\nCalifornia government deliberately hid this information from the public\n\nThe California government actively hid this document from the public for at least seven years, likely under pressure from industry lobbyists who have long sought to conceal the evidence of harm caused by cell phone radiation. In the same way that biotech companies seek to conceal the harm of GMOs… and pesticides manufacturers conceal the harm of pesticides… and vaccine promoters conceal the harm of mercury in vaccines, the cell phone industry doesn’t want any evidence linking EMFs and brain cancer to see the light of day.\n\nIn truth, your brain is under a massive chemical, electromagnetic and propaganda assault on a daily basis. Some of the many attacks on your brain include:\n\nRead the full text of the once-secret California document on cell phones and EMFs\n\nHere’s the full text of the California document:\n\nDivision of Environmental and Occupational Disease Control / California Department of Public Health\n\nCell phones, like other electronic devices, emit a kind of energy called radiofrequency EMFs (electromagnetic fields). Health officials are concerned about possible health effects from cell phone EMFs because some recent studies suggest that long-term cell phone use may increase the risk of brain cancer and other health problems. For those concerned about possible health problems, this fact sheet provides information about how to lower exposure to EMFs from cell phones.\n\nWhat do we know about cell phones and health?\n\nSeveral studies have found that people with certain kinds of brain cancer were more likely to have used cell phones for 10 years or more. Most of the cancers were on the same side of the head that people usually held their phones. Although the chance of developing brain cancer is very small, these studies suggest that regular cell phone use increases the risk of developing some kinds of brain cancer. Some studies have also linked exposure to EMFs from cell phones to fertility problems. As more studies are done and we learn more about possible risks for cancer and other health problems linked to cell phone use, the recommendations on this fact sheet may change.\n\nEMFs are types of radiation. They are created by all electronic devices. Some devices, such as watches, create weak EMFs that are considered harmless. Others, like X-ray machines, generate very strong EMFs that can damage cells and tissues, and cause cancer and other health effects. This is why we try to only use X-rays when necessary. Cell phones make relatively weak EMFs, somewhat less than those from microwave ovens, but because they are used frequently and kept close to the head and body, cell phone EMFs can affect nearby cells and tissues.\n\nYour exposure to cell phone EMFs depends mostly on your distance from the phone, the strength of the EMF, and how long and how often you use the phone. The farther away the phone is from your body, the lower the exposure. Your cell phone produces stronger EMFs at the start of a call, when it is trying to connect to a cell tower, and also when only one or two bars are showing. Your phone also emits stronger EMFs when used in a moving car, bus, or train, as the phone switches connections from one cell tower to another. Finally, some phones produce stronger EMFs than others.\n\nWhat can I do to reduce my exposures to EMFs from cell phones?\n\nTo lower your exposure to EMFs from cell phones:\n\nIncrease the distance between you and your phone by:\n• Use a headset and carry your phone away from your body. EMFs from wireless (Bluetooth) and wired headsets are usually weaker than those from a cell phone.\n• Keep your phone away from your body. A cell phone that is on can emit EMFs even when it is not being used. Do not sleep with your cell phone near you or carry it in a pocket or directly on your body unless the phone is turned off.\n\nLimit your cell phone use when reception is weak or increase the distance between you and the phone. When your phone shows only one or two bars, it is emitting stronger EMFs than when three, four, or five bars are showing.\n\nReduce the amount of time spent talking on a cell phone.\n• Keep cell phone calls short, even when using a wireless or wired headset.\n• Use speaker phone mode or a corded phone for longer conversations.\n\nTake off your headset when you’re not on a call. Wireless and wired headsets emit EMFs even when you are not using your phone.\n\nDo not rely on devices that claim to shield or neutralize EMFs from cell phones. These devices have not been shown to reduce exposures.\n\nWhat about cell phone EMFs and children?\n\nEMFs can pass deeper into a child’s brain than an adult’s. Also, the brain is still developing through the teen years, which may make children and teens more sensitive to EMF exposures. For these reasons, parents may want to limit their child’s cell phone use to texting, important calls, and emergencies. Pregnant women, children, and teens can also follow the tips for reducing exposure listed above.\n\nWhere can I get more information?\n\nFor more information about EMF exposures and cell phones, please send an email to: cellinfo@cdph.ca.gov", "opengraph": {"description": "A once-secret document detailing links between cell phones and brain cancer has been released by order of a California court. Entitled, “Cell Phones and Health,” the document was demanded in a lawsuit filed by Joel Moskowitz, Ph.D., director of the Center for Family and Community Health at UC Berkeley’s School of Public Health. Click here to read the full document. “I would like this document to see the light of day because it will inform the public that there is concern within the California Department of Public Health that cellphone radiation is a risk, and it will provide them with", "title": "California Government Buried The Truth About Cell Phone Radiation Causing Brain Cancer: Full Text Once Secret Document Reveals How EMFs Penetrate Deeper Into A Child’s Brain", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/california-government-buried-the-truth-about-cell-phone-radiation-causing-brain-cancer-full-text-of-once-secret-document-reveals-how-emfs-penetrate-deeper-into-a-childs-brai/", "site_name": "WorldTruth.Tv", "article:published_time": "2018-05-03T15:31:04-04:00", "article:modified_time": "2018-05-10T18:17:27-04:00", "updated_time": "2018-05-10T18:17:27-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fcalifornia-government-buried-the-truth-about-cell-phone-radiation-causing-brain-cancer-full-text-of-once-secret-document-reveals-how-emfs-penetrate-deeper-into-a-childs-brai%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fcalifornia-government-buried-the-truth-about-cell-phone-radiation-causing-brain-cancer-full-text-of-once-secret-document-reveals-how-emfs-penetrate-deeper-into-a-childs-brai%2F&text=California+Government+Buried+The+Truth+About+Cell+Phone+Radiation+Causing+Brain+Cancer%3A+Full+Text+Once+Secret+Document+Reveals+How+EMFs+Penetrate+Deeper+Into+A+Child%E2%80%99s+Brain", "mailto:?subject=California%20Government%20Buried%20The%20Truth%20About%20Cell%20Phone%20Radiation%20Causing%20Brain%20Cancer%3A%20Full%20Text%20Once%20Secret%20Document%20Reveals%20How%20EMFs%20Penetrate%20Deeper%20Into%20A%20Child%E2%80%99s%20Brain&body=A%20once-secret%20document%20detailing%20links%20between%20cell%20phones%20and%20brain%20cancer%20has%20been%20released%20by%20order%20of%20a%20California%20court.%20Entitled%2C%20%E2%80%9CCell%20Phones%20and%20Health%2C%E2%80%9D%20the%20document%20was%20demanded%20in%20a%20lawsuit%20filed%20by%20Joel%20Moskowitz%2C%20Ph.D.%2C%20director%20of%20the%20Center%20for%20Family%20and%20Community%20Health%20at%20UC%20Berkeley%E2%80%99s%20School%20of%20Public%20Health.%20Click%20here%20to%20read%20the%20full%20document.%20%E2%80%9CI%20would%20like%20this%20document%20to%20see%20the%20light%20of%20day%20because%20it%20will%20inform%20the%20public%20that%20there%20is%20concern%20within%20the%20California%20Department%20of%20Public%20Health%20that%20cellphone%20radiation%20is%20a%20risk%2C%20and%20it%20will%20provide%20them%20with%0D%0A%0D%0ARead%20More%20Here:%20%20https%3A%2F%2Fworldtruth.tv%2Fcalifornia-government-buried-the-truth-about-cell-phone-radiation-causing-brain-cancer-full-text-of-once-secret-document-reveals-how-emfs-penetrate-deeper-into-a-childs-brai%2F", "http://www.naturalnews.com/files/CDPH-Cell-Phone-April-2014.pdf", "http://sanfrancisco.cbslocal.com/2017/03/02/cellphone-radiation-exposure-fact-sheet-draft-released-by-california-health-officials/", "https://www.youtube.com/watch?v=hqafAzugooY", "https://www.youtube.com/watch?v=ii82I1IzFRY", "http://www.naturalnews.com/files/CDPH-Cell-Phone-April-2014.pdf", "https://www.youtube.com/watch?v=WnY7utiMwG0", "http://www.naturalnews.com/", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/?amp=1", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/?amp=1", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/?amp=1", "#", "#"], "authors": [""], "publish_date": "2018-05-03T15:31:04-04:00"}