{"result_id": "350004", "URL": "https://worldtruth.tv/abortion-drugs-found-in-bill-gates-tetanus-vaccine/?amp=1", "timestamp": "2023-04-25 18:16:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/abortion-drugs-found-in-bill-gates-tetanus-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Abortion Drugs Found In Bill Gates’ Tetanus Vaccine", "cleaned_text": "Doctors in Kenya have accused UNICEF, the World Health Organization and the Bill and Melinda Gates Foundation of secretly trying to sterilize millions of women in Africa via a tetanus vaccine program.\n\nAccording to LifeSiteNews, the Kenya Catholic Doctors Association say that doctors have uncovered evidence of a mass sterilisation program sponsored by the Kenyan government and funded by Bill Gates.\n\nThe Kenyan government denies there is anything wrong with the vaccine, and says it is perfectly safe.\n\nThe Kenya Catholic Doctors Association, however, saw evidence to the contrary, and had six different samples of the tetanus vaccine from various locations around Kenya sent to an independent laboratory in South Africa for testing.\n\nThe results confirmed their worst fears: all six samples tested positive for the HCG antigen. The HCG antigen is used in anti-fertility vaccines, but was found present in tetanus vaccines targeted to young girls and women of childbearing age. Dr. Ngare, spokesman for the Kenya Catholic Doctors Association, stated in a bulletin released November 4:\n\n“This proved right our worst fears; that this WHO campaign is not about eradicating neonatal tetanus but a well-coordinated forceful population control mass sterilization exercise using a proven fertility regulating vaccine. This evidence was presented to the Ministry of Health before the third round of immunization but was ignored.” (Source)\n\nDr. Ngare brought up several points about the mass tetanus vaccination program in Kenya that caused the Catholic doctors to become suspicious:\n\nDr. Ngare told LifeSiteNews that several things alerted doctors in the Church’s far-flung medical system of 54 hospitals, 83 health centers, and 17 medical and nursing schools to the possibility the anti-tetanus campaign was secretly an anti-fertility campaign.\n\nWhy, they ask does it involve an unprecedented five shots (or “jabs” as they are known, in Kenya) over more than two years and why is it applied only to women of childbearing years, and why is it being conducted without the usual fanfare of government publicity?\n\n“Usually we give a series three shots over two to three years, we give it anyone who comes into the clinic with an open wound, men, women or children.” said Dr. Ngare.\n\nBut it is the five vaccination regime that is most alarming. “The only time tetanus vaccine has been given in five doses is when it is used as a carrier in fertility regulating vaccines laced with the pregnancy hormone, Human Chorionic Gonadotropin (HCG) developed by WHO in 1992.”\n\nUNICEF: A History of Taking Advantage of Disasters to Mass Vaccinate\n\nIt should be noted that UNICEF and WHO distribute these vaccines for free, and that there are financial incentives for the Kenyan government to participate in these programs. When funds from the UN are not enough to purchase yearly allotments of vaccines, an organization started and funded by the Bill and Melinda Gates Foundation, GAVI, provides extra funding for many of these vaccination programs in poor countries.\n\nAlso, there was no outbreak of tetanus in Kenya, only the perceived “threat” of tetanus due to local flood conditions.\n\nThese local disasters are a common reason UNICEF goes into poorer countries with free vaccines to begin mass vaccination programs.\n\nHealth Impact News reported last year that UNICEF began a similar mass vaccination program with 500,000 doses of live oral polio vaccine in the Philippines after a Super Typhoon devastated Tacolban and surrounding areas. This was in spite of the fact there were no reported cases of polio in the Philippines since 1993, and people who have had the live polio vaccine can “shed” the virus into sewage systems, thereby causing the actual disease it is supposed to be preventing.\n\nA very similar mass vaccination with the live oral polio vaccine occurred among Syrian refugees in 2013, when 1.7 million doses of polio vaccine were purchased by UNICEF, in spite of the fact that no cases of polio had been seen since 1999. After the mass vaccination program started, cases of polio began to reappear in Syria.\n\nIt seems quite apparent that UNICEF and WHO use these local disasters to mass vaccinate people, mainly children and young women. Massive education and propaganda efforts are also necessary to convince the local populations that they need these vaccines. Here is a video UNICEF produced for the tetanus vaccine in Kenya. Notice how they use school teachers and local doctors to do the educating, even though the vaccines are produced by western countries.", "opengraph": {"description": "Doctors in Kenya have accused UNICEF, the World Health Organization and the Bill and Melinda Gates Foundation of secretly trying to sterilize millions of women in Africa via a tetanus vaccine program.  According to LifeSiteNews, the Kenya Catholic Doctors Association say that doctors have uncovered evidence of a mass sterilisation program sponsored by the Kenyan government and funded by Bill Gates. Healthimpactnews.com reports: The Kenyan government denies there is anything wrong with the vaccine, and says it is perfectly safe. The Kenya Catholic Doctors Association, however, saw evidence to the contrary, and had six different samples of the tetanus vaccine from various locations around", "title": "Abortion Drugs Found In Bill Gates’ Tetanus Vaccine", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/abortion-drugs-found-in-bill-gates-tetanus-vaccine/", "site_name": "WorldTruth.Tv", "article:published_time": "2018-07-02T15:19:49-04:00", "article:modified_time": "2018-07-06T10:57:27-04:00", "updated_time": "2018-07-06T10:57:27-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fabortion-drugs-found-in-bill-gates-tetanus-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fabortion-drugs-found-in-bill-gates-tetanus-vaccine%2F&text=Abortion+Drugs+Found+In+Bill+Gates%E2%80%99+Tetanus+Vaccine", "mailto:?subject=Abortion%20Drugs%20Found%20In%20Bill%20Gates%E2%80%99%20Tetanus%20Vaccine&body=Doctors%20in%20Kenya%20have%20accused%20UNICEF%2C%20the%20World%20Health%20Organization%20and%20the%20Bill%20and%20Melinda%20Gates%20Foundation%20of%20secretly%20trying%20to%C2%A0sterilize%C2%A0millions%20of%20women%20in%20Africa%20via%20a%20tetanus%20vaccine%20program.%C2%A0%20According%20to%20LifeSiteNews%2C%20the%C2%A0Kenya%20Catholic%20Doctors%20Association%20say%20that%20doctors%20have%20uncovered%20evidence%20of%20a%20mass%20sterilisation%20program%20sponsored%20by%20the%20Kenyan%20government%20and%20funded%20by%20Bill%20Gates.%20Healthimpactnews.com%20reports%3A%20The%20Kenyan%20government%20denies%20there%20is%20anything%20wrong%20with%20the%20vaccine%2C%20and%20says%C2%A0it%20is%20perfectly%20safe.%20The%20Kenya%20Catholic%20Doctors%20Association%2C%20however%2C%20saw%20evidence%20to%20the%20contrary%2C%20and%20had%20six%20different%20samples%20of%20the%20tetanus%20vaccine%20from%20various%20locations%20around%0D%0A%0D%0ARead%20More%20Here:%20%20https%3A%2F%2Fworldtruth.tv%2Fabortion-drugs-found-in-bill-gates-tetanus-vaccine%2F", "https://www.lifesitenews.com/news/a-mass-sterilization-exercise-kenyan-doctors-find-anti-fertility-agent-in-u", "http://healthimpactnews.com/2014/mass-sterilization-kenyan-doctors-find-anti-fertility-agent-in-un-tetanus-vaccine/", "http://www.ncbi.nlm.nih.gov/pubmed/2665354", "https://www.lifesitenews.com/news/a-mass-sterilization-exercise-kenyan-doctors-find-anti-fertility-agent-in-u", "https://www.youtube.com/watch?v=-pJaDpq-DUI", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/?amp=1", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/?amp=1", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/?amp=1", "#", "#"], "authors": [""], "publish_date": "2018-07-02T15:19:49-04:00"}