{"result_id": "350008", "URL": "https://worldtruth.tv/cdc-admits-98-million-americans-received-polio-vaccine-contaminated-with-cancer-virus/", "timestamp": "2023-04-25 18:17:19 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/cdc-admits-98-million-americans-received-polio-vaccine-contaminated-with-cancer-virus/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "CDC Admits 98 Million Americans Received Polio Vaccine Contaminated With Cancer Virus", "cleaned_text": "The CDC has quickly removed a page from their website, which is now cached, ( but now has been removed) admitting that more than 98 million Americans received one or more doses of polio vaccine within an 8-year span when a proportion of the vaccine was contaminated with a cancer causing polyomavirus called SV40. It has been estimated that 10-30 million Americans could have received an SV40 contaminated dose of the vaccine.\n\nV40 is an abbreviation for Simian vacuolating virus 40 or Simian virus 40, a polyomavirus that is found in both monkeys and humans. Like other polyomaviruses, SV40 is a DNA virus that has been found to cause tumors and cancer.\n\nSV40 is believed to suppress the transcriptional properties of the tumor-suppressing genes in humans through the SV40 Large T-antigen and SV40 Small T-antigen. Mutated genes may contribute to uncontrolled cellular proliferation, leading to cancer.\n\n \n\n Michele Carbone, Assistant Professor of Pathology at Loyola University in Chicago, has recently isolated fragments of the SV-40 virus in human bone cancers and in a lethal form of lung cancer called mesothelioma. He found SV-40 in 33% of the osteosarcoma bone cancers studied, in 40% of other bone cancers, and in 60% of the mesotheliomas lung cancers, writes Geraldo Fuentes.\n\nDr. Michele Carbone openly acknowledged HIV/AIDS was spread by the hepatitis B vaccine produced by Merck & Co. during the early 1970s. It was the first time since the initial transmissions took place in 1972-74, that a leading expert in the field of vaccine manufacturing and testing has openly admitted the Merck & Co. liability for AIDS. \n\n\n\nThe matter-of-fact disclosure came during discussions of polio vaccines contaminated with SV40 virus which caused cancer in nearly every species infected by injection. Many authorities now admit much, possibly most, of the world’s cancers came from the Salk and Sabin polio vaccines, and hepatitis B vaccines, produced in monkeys and chimps.\n\nIt is said mesothelioma is a result of asbestos exposure, but research reveals that 50% of the current mesotheliomas being treated no longer occurs due to asbestos but rather the SV-40 virus contained in the polio vaccination. In addition, according to researchers from the Institute of Histology and General Embryology of the University of Ferrara, SV-40 has turned up in a variety other tumors. By the end of 1996, dozens of scientists reported finding SV40 in a variety of bone cancers and a wide range of brain cancers, which had risen 30 percent over the previous 20 years.\n\nThe SV-40 virus is now being detected in tumors removed from people never inoculated with the contaminated vaccine, leading some to conclude that those infected by the vaccine might be spreading SV40.\n\nSoon after its discovery, SV40 was identified in the oral form of the polio vaccine produced between 1955 and 1961 produced by American Home Products (dba Lederle).\n\nBoth the oral, live virus and injectable inactive virus were affected. It was found later that the technique used to inactivate the polio virus in the injectable vaccine, by means of formaldehyde, did not reliably kill SV40.\n\nJust two years ago, the U.S. government finally added formaldehyde to a list of known carcinogens and and admitted that the chemical styrene might cause cancer. Yet, the substance is still found in almost every vaccine.\n\n \n\n According to the Australian National Research Council, fewer than 20% but perhaps more than 10% of the general population may be susceptible to formaldehyde and may react acutely at any exposure level. More hazardous than most chemicals in 5 out of 12 ranking systems, on at least 8 federal regulatory lists, it is ranked as one of the most hazardous compounds (worst 10%) to ecosystems and human health (Environmental Defense Fund).\n\nIn the body, formaldehyde can cause proteins to irreversibly bind to DNA. Laboratory animals exposed to doses of inhaled formaldehyde over their lifetimes have developed more cancers of the nose and throat than are usual.\n\nFacts Listed on The CDC Website about SV40\n\n-SV40 is a virus found in some species of monkey.\n\n-SV40 was discovered in 1960. Soon afterward, the virus was found in polio vaccine.\n\n-SV40 virus has been found in certain types of cancer in humans.\n\n-In the 1950s, rhesus monkey kidney cells, which contain SV40 if the animal is infected, were used in preparing polio vaccines.\n\n-Not all doses of IPV were contaminated. It has been estimated that 10-30 million people actually received a vaccine that contained SV40.\n\n-Some evidence suggests that receipt of SV40-contaminated polio vaccine may increase risk of cancer.\n\nThe Defense Sciences Office of the Pathogen Countermeasures Program, in September 23, 1998 funded the University of Michigan’s principal investigator, Dr. James Baker, Jr. Dr. Baker, Director of Michigan Nanotechnology Institute for Medicine and Biological Sciences under several DARPA grants. Dr. Baker developed and focused on preventing pathogens from entering the human body, which is a major goal in the development of counter measures to Biological Warfare. This research project sought to develop a composite material that will serve as a pathogen avoidance barrier and post-exposure therapeutic agent to be applied in a topical manner to the skin and mucous membranes. The composite is modeled after the immune system in that it involves redundant, non-specific and specific forms of pathogen defense and inactivation. This composite material is now utilized in many nasal vaccines and vector control through the use of hydro-gel, nanosilicon gels and actuator materials in vaccines.\n\nThrough Dr. Baker’s research at the University of Michigan; he developed dendritic polymers and their application to medical and biological science. He co-developed a new vector system for gene transfer using synthetic polymers. These studies have produced striking results and have the potential to change the basis of gene transfer therapy. Dendrimers are nanometer-sized water soluble polymers that can conjugate to peptides or arbohydrates to act as decoy molecules to inhibit the binding of toxins and viruses to cells. They can act also as complex and stabilize genetic material for prolonged periods of time, as in a “time released or delayed gene transfer”. Through Dr. Baker’s ground breaking research many pharmaceutical and biological pesticide manufacturers can use these principles in DNA vaccines specific applications that incorporate the Simian Monkey Virus SV40.\n\nIn 2006 Michael Greenwood wrote an article for the Yale School of Public Health entitled, “Aerial Spraying Effectively Reduces Incidence of West Nile Virus (WNV) in Humans.” The article stated that the incidence of human West Nile virus cases can be significantly reduced through large scale aerial spraying that targets adult mosquitoes, according to research by the Yale School of Public Health and the California Department of Public Health.\n\nUnder the mandate for aerial spraying for specific vectors that pose a threat to human health, aerial vaccines known as DNA Vaccine Enhancements and Recombinant Vaccine against WNV may be tested or used to “protect” the people from vector infection exposures. DNA vaccine enhancements specifically use Epstein-Barr viral capside’s with multi human complement class II activators to neutralize antibodies. The recombinant vaccines against WNV use Rabbit Beta-globulin or the poly (A) signal of the SV40 virus. In early studies of DNA vaccines it was found that the negative result studies would go into the category of future developmental research projects in gene therapy. During the studies of poly (A) signaling of the SV40 for WNV vaccines, it was observed that WNV will lie dormant in individuals who were exposed to chicken pox, thus upon exposure to WNV aerial vaccines the potential for the release of chicken pox virus would cause a greater risk to having adult onset Shingles.\n\nIn February 2009 to present date, aerial spraying for the WNV occurred in major cities within the State of California. During spraying of Anaheim, CA a Caucasian female (age 50) was exposed to heavy spraying, while doing her daily exercise of walking several miles. Heavy helicopter activity occurred for several days in this area. After spraying, she experienced light headedness, nausea, muscle aches and increased low back pain. She was evaluated for toxicological mechanisms that were associated with pesticide exposure due to aerial spraying utilizing advanced biological monitoring testing. The test results which included protein band testing utilizing Protein Coupled Response (PCR) methods were positive for KD-45. KD-45 is the protein band for SV-40 Simian Green Monkey virus. Additional tests were performed for Epstein-Barr virus capside and Cytomeglia virus which are used in bio-engineering for gene delivery systems through viral protein envelope and adenoviral protein envelope technology. The individual was positive for both; indicating a highly probable exposure to a DNA vaccination delivery system through nasal inhalation.\n\nThe question of the century is how many other viruses and toxins are within current day vaccines that we’ll only find out about in a few decades?\n\nDave Mihalovic is a Naturopathic Doctor who specializes in vaccine research, cancer prevention and a natural approach to treatment.", "opengraph": {"description": "The CDC has quickly removed a page from their website, which is now cached, ( but now has been removed) admitting that more than 98 million Americans received one or more doses of polio vaccine within an 8-year span when a proportion of the vaccine was contaminated with a cancer causing polyomavirus called SV40. It has been estimated that 10-30 million Americans could have received an SV40 contaminated dose of the vaccine. V40 is an abbreviation for Simian vacuolating virus 40 or Simian virus 40, a polyomavirus that is found in both monkeys and humans. Like other polyomaviruses, SV40 is a DNA virus that has", "title": "CDC Admits 98 Million Americans Received Polio Vaccine Contaminated With Cancer Virus", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/cdc-admits-98-million-americans-received-polio-vaccine-contaminated-with-cancer-virus/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-02-08T10:56:01-04:00", "article:modified_time": "2019-02-18T11:39:23-04:00", "updated_time": "2019-02-18T11:39:23-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fcdc-admits-98-million-americans-received-polio-vaccine-contaminated-with-cancer-virus%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fcdc-admits-98-million-americans-received-polio-vaccine-contaminated-with-cancer-virus%2F&text=CDC+Admits+98+Million+Americans+Received+Polio+Vaccine+Contaminated+With+Cancer+Virus", "#", "/cdn-cgi/l/email-protection#201f5355424a4543541d63646305121061444d49545305121019180512106d494c4c494f4e051210614d45524943414e530512107245434549564544051210704f4c494f05121076414343494e45051210634f4e54414d494e415445440512107749544805121063414e434552051210764952555306424f44591d744845051210636463051210484153051210515549434b4c5905121052454d4f564544051210410512105041474505121046524f4d051210544845495205121057454253495445051263051210574849434805121049530512104e4f570563120561104341434845440512630512100512180512104255540512104e4f570512104841530512104245454e05121052454d4f56454405121905631205611041444d495454494e47051210544841540512104d4f52450512105448414e05121019180512104d494c4c494f4e051210614d45524943414e5305121052454345495645440512104f4e450512104f520512104d4f5245051210444f5345530512104f46051210504f4c494f05121056414343494e4505121057495448494e051210414e051210180d594541520512105350414e0512105748454e0512104105121050524f504f5254494f4e0512104f4605121054484505121056414343494e45051210574153051210434f4e54414d494e41544544051210574954480512104105121043414e43455205121043415553494e47051210504f4c594f4d41564952555305121043414c4c4544051210737614100e05121069540512104841530512104245454e051210455354494d415445440512105448415405121011100d13100512104d494c4c494f4e051210614d45524943414e53051210434f554c44051210484156450512105245434549564544051210414e05121073761410051210434f4e54414d494e41544544051210444f53450512104f4605121054484505121056414343494e450e0512107614100512104953051210414e051210414242524556494154494f4e051210464f5205121073494d49414e051210564143554f4c4154494e47051210564952555305121014100512104f5205631205611073494d49414e0512105649525553051210141005126305121041056312056110504f4c594f4d415649525553056312056110544841540512104953051210464f554e44051210494e051210424f54480512104d4f4e4b455953051210414e4405121048554d414e530e0512106c494b450512104f54484552051210504f4c594f4d415649525553455305126305121073761410051210495305121041051210646e6105121056495255530512105448415405121048415305106405106105106405106172454144006d4f524500684552451a000512104854545053051361051266051266574f524c4454525554480e54560512664344430d41444d4954530d19180d4d494c4c494f4e0d414d45524943414e530d52454345495645440d504f4c494f0d56414343494e450d434f4e54414d494e415445440d574954480d43414e4345520d5649525553051266", "https://worldtruth.tv/wp-content/uploads/2013/07/Vaccine.jpg", "https://en.wikipedia.org/wiki/Polyomavirus", "https://en.wikipedia.org/wiki/SV40_Large_T-antigen", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-02-08T10:56:01-04:00"}