{"result_id": "350010", "URL": "https://worldtruth.tv/depopulation-test-run-75-of-children-who-received-vaccines-in-mexican-town-now-dead-or-hospitalized/", "timestamp": "2023-04-25 18:17:24 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/depopulation-test-run-75-of-children-who-received-vaccines-in-mexican-town-now-dead-or-hospitalized/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Depopulation Test Run? 75% of Children Who Received Vaccines In Mexican Town Now Dead", "cleaned_text": "Despite the insidious attempts of the corporate-controlled U.S. media to censor the stories about the deadly side effects of vaccines, the truth keeps surfacing. The latest vaccine tragedy to strike has killed two babies in La Pimienta, Mexico and sent 37 more to the hospital with serious reactions to toxic vaccine additives. (Tweet this story)\n\n“…14 children are in serious condition, 22 are stable and one is in critical condition,” the Chiapas Health Secretariat said in a statement via Latino.FoxNews.com.\n\nWhat’s especially alarming is that only 52 children were vaccinated in all, meaning that 75% of those receiving the vaccines are now either dead or hospitalized.\n\nThe vaccines were administered by the Mexican Social Security Institute, known as IMSS. The IMSS confirmed the deadly reactions occurred after children received injections of vaccines for tuberculosis, rotavirus and hepatitis B — the same viral strains targeted by vaccines routinely administered to children in the United States.\n\nAccording to Fox News Latino, the IMSS has suspended the vaccines pending the outcome of an investigation into why so many children have been killed and hospitalized.\n\nAccording to the entire mainstream media in the United States — which is 100% controlled by corporate interests — vaccines never harm anyone and are perfectly safe to inject into children in unlimited quantities. This dangerous, inhumane “Vaccine Injury Denialism” is rampant across the corporate-controlled media, which contributes to the deaths of innocent babies and children by refusing to acknowledge the truth that vaccines kill and injure children on a regular basis.\n\nJust recently, in fact, the UK government agreed to pay $90 million to victims of the swine flu vaccine. That vaccine caused permanent brain damage to over 800 children across Europe. The truth is that vaccines regularly harm and even kill innocent children, most likely because of the toxic chemical adjuvants and preservatives they still contain.\n\nAs the CDC openly admits, vaccines are still intentionally formulated with mercury, aluminum, MSG and formaldehyde. Some vaccines even use ingredients derived from aborted human fetal tissue. Last year, a CDC scientist blew the whistle on the CDC committing scientific fraud to cover up links between vaccines and autism in young African-American males.\n\nAs globalists now fully realize, vaccines are by far the best way to cull the human population because most people can be tricked into lining up and asking for them. Thus, there’s no need to resort to all the difficulties used by the Nazis to commit genocide in World War II, involving complex logistics of railroad cars, gas chambers, construction of mass graves, prisoner tracking via IBM computing technology, and so on. Yes, Nazi genocide and prisoner tracking was powered by early IBM computers.\n\nAs the vaccine industry has now come to realize, it’s so much easier to kill people when they voluntarily comply with the injections. Hence the aggressive media propaganda push to achieve absolute blind obedience to vaccines so that no one will ask questions when sterilization or euthanasia chemicals are used. That’s no doubt why vaccines have been routinely tested for depopulation programs via two primary methods:\n\n# 1) Achieve covert sterilizations of targeted populations by combining sterilization chemicals with vaccines. (The “slow kill.”)\n\n# 2) Directly kill vaccine recipients by intentionally lacing vaccines with euthanasia chemicals that cause death. (The “fast kill.”)\n\nMethod #1 has been repeatedly used throughout Africa, Mexico and South America to inflict sterilization upon targeted groups via immunization and vaccination programs. Just last year, in fact, I reported on the discovery of a covert depopulation vaccine program being run in Kenya:\n\nTetanus vaccines given to millions of young women in Kenya have been confirmed by laboratories to contain a sterilization chemical that causes miscarriages, reports the Kenya Catholic Doctors Association, a pro-vaccine organization.\n\nA whopping 2.3 million young girls and women are in the process of being given the vaccine, pushed by UNICEF and the World Health Organization.\n\n“We sent six samples from around Kenya to laboratories in South Africa. They tested positive for the HCG antigen,” Dr. Muhame Ngare of the Mercy Medical Centre in Nairobi told LifeSiteNews. “They were all laced with HCG.”\n\nMethod #2 now appears to be under way in Mexico as 75% of those children injected with vaccines are now either dead or hospitalized.\n\nVaccine-induced depopulation was attempted in Mexico in 1974\n\nAs Truth Stream Media exhaustively documented, a depopulation exercise was run in Mexico in 1974, using vaccines as the cover story.\n\nThe scheme was dreamed up after the release of the National Security Study Memorandum 200 which highlighted the global population problem and urged governments to find ways to reduce the global population.\n\nConcentration on this “problem” of how to reduce the population was planned for 13 key countries, including India, Bangladesh, Pakistan, Nigeria, Mexico, Indonesia, Brazil, the Philippines, Thailand, Egypt, Turkey, Ethiopia and Colombia. Of those, the document singled out Mexico as having one of the highest (and therefore, most worrisome) growth rates of all. The document read, “Perhaps the most significant population trend from the viewpoint of the United States is the prospect that Mexico’s population will increase from 50 million in 1970 to over 130 million by the year 2000.”\n\nTo combat this problem, “medical spooks” — who were almost certainly U.S.-funded depopulation vaccine crews — began injecting women all across Mexico with anti-fertility drugs disguised as vaccines. If you doubt this, read your history. The U.S. government’s National Institutes of Health was caught red-handed running human medical experiments on prisoners in Guatemala. President Obama was even forced to publicly apologize in 2011 after the cover-up collapsed! There is nothing the Nazis did in the 1930s and 40s that the pharmaceutical industry wouldn’t be willing to repeat today under the label of “science.”\n\nBut getting back to Mexico, as the covert depopulation vaccination program spread across Mexico City in 1974, locals began to catch on to the deception, and public resistance grew. As these newspaper clippings reveal, parents began hiding their children in their own homes to avoid them being injected with sterilization chemicals at the public schools. (California, by the way, also targets children at schools in order to avoid parents having the opportunity to say “No!”)\n\nMexico City – Associated Press – Rumors that persons disguised as inoculation teams were giving school children shots that sterilized them forced health authorities to suspend all vaccination drives today and to post police outside Mexico City schools. Thousands of parents stormed various schools in the Mexico City area Tuesday and took their children home.\n\nIt’s also important to note that these sterilization vaccines were being administered essentially at gunpoint, as police were accompanying the vaccine crews:\n\nCallers told newspapers and TV stations that the sterilization crews were protected by police escorts and that they included white-robed men and women “who looked like foreigners.”\n\nThis same scenario is now about to be replicated in California, by the way, where SB 277 would criminalize parents of children who are not vaccinated, essentially at gunpoint.\n\nWhat’s even more interesting is that the exact same arguments we hear today about vaccine skeptics — they’re punitively labeled “anti-vaxxers” or “anti-science” — were also being used in Mexico in 1974. As the following newspaper clipping shows:\n\nThe Mexican Medical Association issued statements denying that any kind of inoculation could cause sterility… Officials said superstition and ignorance of preventive health [i.e. “anti-science”] were responsible for the widespread belief that the rumors were true.\n\nIn other words, even though sterilization teams were running around Mexico, injecting people with chemicals as part of a depopulation agenda, any person who pointed this out was immediately labeled “anti-science” and derided as “ignorant.”\n\nVery little has changed in four decades, it seems: the same tactic is still used today, even while children are being killed or injured every single day due to the toxic ingredients used in vaccines.\n\nThe “science bullying” behind vaccines also allows governments of the world to run sterilization and depopulation programs disguised as public health. Once the population is bullied into accepting vaccines without question — blind obedience is now demanded almost everywhere — governments can add any chemicals they want to those vaccines, including chemicals that cause permanent sterilization or even death.\n\nThe fact that all vaccine injuries are systematically denied to exist also means that any person harmed or killed by vaccines is immediately wiped from the national memory. Like a criminal mafia, the vaccine industry works hard to hide the bodies and thereby maintain its monopolistic racket on the utterly false premise that vaccines are 100% safe. To further drive home this extraordinary medical propaganda, the CDC uses intelligence operatives like Nurse Hickox who spread disinfo through the mainstream media, which is always happy to comply with the destructive agendas of the vaccine industry.\n\nAs Natural News uncovered during the Ebola scare of 2014:\n\nNurse Kaci Hickox, who has made headlines over the last few days by refusing to quarantine herself after returning from the Ebola front lines in Africa, turns out to have been trained as an “intelligence officer” under a two-year CDC program modeled after the U.S. military.\n\nAs you can see from the document below, Hickox graduated from a two-year CDC intelligence officer training program in 2012. This is the same nurse whose LinkedIn page was recently scrubbed to hide her ties to the CDC…\n\nThe official intelligence designation granted to Nurse Hickox by the CDC was “Epidemic Intelligence Service Officer,” and she is a graduate of the 2012 EIS program according to this CDC document (PDF). (See page 138 – 139 for her name and photo, or view photo below.)\n\nThat same year, the CDC graduated 81 such “intelligence officers” whose names and photos are also listed in the public document.\n\nWhat’s the takeaway realization from all this? Vaccines have been and will continue to be used as a cover for forced depopulation programs involving sterilization or euthanasia chemicals.\n\nObedience to vaccines allows depopulation teams accompanied by armed police to intimidate people into accepting any liquid they want to put in a syringe. That liquid might be a vaccine, or it might be a sterilization chemical or even a euthanasia chemical.\n\nAny population that is indoctrinated into trusting the vaccine industry — an industry steeped in repeated criminal activity combined with a total disregard for human life — is ripe for being targeted for depopulation.\n\nAfter all, why go through the trouble of building gas chambers and rounding people up for mass extermination when you can achieve the same result without any resistance at all if you simply label the chemicals “vaccines”?", "opengraph": {"description": "Despite the insidious attempts of the corporate-controlled U.S. media to censor the stories about the deadly side effects of vaccines, the truth keeps surfacing. The latest vaccine tragedy to strike has killed two babies in La Pimienta, Mexico and sent 37 more to the hospital with serious reactions to toxic vaccine additives. (Tweet this story) '...14 children are in serious condition, 22 are stable and one is in critical condition,' the Chiapas Health Secretariat said in a statement via Latino.FoxNews.com. What's especially alarming is that only 52 children were vaccinated in all, meaning that 75% of those receiving the vaccines", "title": "Depopulation Test Run? 75% of Children Who Received Vaccines In Mexican Town Now Dead", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/depopulation-test-run-75-of-children-who-received-vaccines-in-mexican-town-now-dead-or-hospitalized/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-06-15T09:17:00-04:00", "article:modified_time": "2020-06-28T11:12:49-04:00", "updated_time": "2020-06-28T11:12:49-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fdepopulation-test-run-75-of-children-who-received-vaccines-in-mexican-town-now-dead-or-hospitalized%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fdepopulation-test-run-75-of-children-who-received-vaccines-in-mexican-town-now-dead-or-hospitalized%2F&text=Depopulation+Test+Run%3F+75%25+of+Children+Who+Received+Vaccines+In+Mexican+Town+Now+Dead", "#", "/cdn-cgi/l/email-protection#754a0600171f101601483110051a05001914011c1a1b5047452110060150474527001b50463350474542405047405047451a13504745361d1c191107101b504745221d1a504745271016101c031011504745231416161c1b10065047453c1b50474538100d1c16141b504745211a021b5047453b1a025047453110141153171a110c48311006051c0110504745011d105047451c1b061c111c1a000650474514010110180501065047451a13504745011d10504745161a07051a0714011058161a1b01071a19191011504745205b265b5047451810111c14504745011a50474516101b061a07504745011d1050474506011a071c100650474514171a0001504745011d1050474511101411190c504745061c1110504745101313101601065047451a13504745031416161c1b1006504736504745011d10504745010700011d5047451e101005065047450600071314161c1b125b504745211d10504745191401100601504745031416161c1b105047450107141210110c504745011a5047450601071c1e105047451d14065047451e1c1919101150474501021a5047451714171c10065047451c1b5047453914504745251c181c101b011450473650474538100d1c161a504745141b1150474506101b015047454642504745181a0710504745011a504745011d105047451d1a06051c011419504745021c011d5047450610071c1a000650474507101416011c1a1b06504745011a504745011a0d1c16504745031416161c1b105047451411111c011c0310065b50474550474d2102101001504745011d1c0650474506011a070c50474c5047455047475b5b5b4441504745161d1c191107101b5047451407105047451c1b5047450610071c1a0006504745161a1b111c011c1a1b5047365047454747504745140710504745060114171910504745141b115047451a1b105047451c065047451c1b50474516071c011c161419504745161a1b111c011c1a1b504736504747504745011d10504745361d1c140514065047453d101419011d50474526101607100114071c140150474506141c115047451c1b50474514504745060114011018101b01504745031c145047453914011c1b1a5b331a0d3b1002065b161a185b504745221d14015047420650474510060510161c1419190c50474514191407181c1b125047451c06504745011d14015047451a1b190c5047454047504745161d1c191107101b50474502100710504745031416161c1b140110115047451c1b5047451419195047365047451810141b1c1b12504745011d140150474542405047405047451a13504745011d1a0610504745071016101c031c1b12504745011d10504745031416161c1b10065045315045345045315045342710141155381a0710553d1007104f555047451d01010506504634504733504733021a071911010700011d5b01035047331110051a05001914011c1a1b58011006015807001b584240581a1358161d1c191107101b58021d1a58071016101c03101158031416161c1b1006581c1b5818100d1c16141b58011a021b581b1a025811101411581a07581d1a06051c0114191c0f1011504733", "https://twitter.com/intent/tweet?original_referer=http%3A%2F%2Fwww.naturalnews.com%2F049669_vaccine_injury_depopulation_agenda_deadly_side_effects.html&text=75%25%20of%20children%20who%20received%20%23vaccines%20in%20Mexican%20town%20now%20dead%20or%20hospitalized&tw_p=tweetbutton&url=http%3A%2F%2Fwww.naturalnews.com%2F049669_vaccine_injury_depopulation_agenda_deadly_side_effects.html&via=HealthRanger", "http://www.naturalnews.com/049423_swine_flu_vaccine_brain_damage_financial_compensation.html", "http://www.lifesitenews.com/news/a-mass-sterilization-exercise-kenyan-doctors-find-anti-fertility-agent-in-u", "https://worldtruth.tv/wp-content/uploads/2015/05/CUT-Santa-Cruz-Sentinel-Wed-Dec-11-1974.jpg", "https://worldtruth.tv/wp-content/uploads/2015/05/CUT-Las-Vegas-Optic-Fri-Dec-13-1974.jpg", "http://www.naturalnews.com/files/PDF-2013-EIS-Conference.pdf", "https://worldtruth.tv/wp-content/uploads/2015/05/EIS-Officers-Class-of-2012-600.jpg", "http://www.naturalnews.com/Infographics/Infographic-The-Vaccine-Racket-1280.jpg", "http://www.naturalnews.com/049669_vaccine_injury_depopulation_agenda_deadly_side_effects.html", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-06-15T09:17:00-04:00"}