{"result_id": "350037", "URL": "https://worldtruth.tv/50-reasons-not-to-vaccinate-your-children/", "timestamp": "2023-04-25 18:18:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/50-reasons-not-to-vaccinate-your-children/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "50 Reasons NOT To Vaccinate Your Children", "cleaned_text": "1. There is no scientific study to determine whether vaccines have really prevented diseases. Rather disease graphs show vaccines have been introduced at the end of epidemics when the disease was already in its last stages. In case of Small Pox the vaccine actually caused a great spurt in the incidence of disease before public outcry led to its withdrawal.\n\n2. There are no long-term studies on vaccine safety. Very short-term tests are carried out where the vaccinated subjects are checked against another group who are given another vaccine. Technically the tests should be carried out against a non-vaccinated group. No one really knows what protocols are followed at such industry based or industry sponsored trials.\n\n3. There has never been any official attempt to compare a vaccinated population against a non vaccinated population to know what vaccines are doing to the children and the society. Independent private studies (Dutch & German and the most recent KIGGS (Aug 2011) study involving 7724 children worlwide) have revealed that vaccinated children suffer much more than their un-vaccinated counterparts.\n\n4. The child receives not one but many vaccines. There are practically no tests to determine the effects of multiple vaccines.\n\n5. There is no scientific basis for vaccinating infants. As per senior doctors quoted by the Times of India, “Children suffer from less that 2% of vaccine preventable illnesses but 98% of the vaccines are targeted towards them.” The vaccine pioneers who have recommended abundant caution before vaccinating the population have never advocated regular mass vaccinations without any threat in sight.\n\n6. Children are vaccinated simply because parents can be frightened to forcefully vaccinate their children. Vaccinating infants is the most profitable business both for the manufacturers as well as the doctors.This makes vaccine makers lobby for all vaccines to be included in the childhood vaccination schedule. Schools are also instigated to require their wards to be “fully vaccinated”. Very recently in the National Vaccine Policy draft the Govt of India has fallen into the trap and decided to legitimize all vaccines available in the market brushing aside recommendations by very senior doctors and medical scientists who have said that the policy is “irrational”.\n\n7. Infants, who are advised ONLY mothers milk till the age of six months and beyond because their fragile system will not tolerate anything else are given 36 extremely toxic vaccine shots, including booster doses, an act that defies both logic and science.\n\n8. The Government of India has come out with a quarter page advertisement in The Hindu warning parents not to vaccinate beyond the Government approved vaccines. Parents have been advised against vaccinating in private clinics and hospitals.\n\n9. The Orissa Chapter of the Indian Association of Pediatricians has admitted in a letter to the CM, Orissa, that private clinic and hospitals are ill equipped to store vaccines and warned parents not to vaccinate upon the advice of private practitioners and hospitals. In a recent private survey in India 94% of the doctors surveyed expressed concerns about the maintainence of the cold chain in India, 54% of the doctors have said they are afraid of vaccinating their own children and 88% fear that vaccines are unsafe.\n\n11. Vaccines contain highly toxic metals, cancer causing substances, toxic chemicals, live and genetically modified viruses, bacteria and toxoids, contaminated serum containing animal viruses and foreign genetic material, extremely toxic de-contaminants and adjuvants, untested antibiotics, none of which can be injected without causing any harm.\n\n12. The mercury, aluminum and live viruses in vaccines may be behind the huge epidemic of autism (1 in 110 in the USA, 1 in 10 worldwide as per doctors in the USA, 1 in 38 in South Korea, 1 in 37 as per a private study by doctors in New Delhi), a fact that (vaccines cause autism) has been admitted by the US Vaccine Court. About 83 suspected cases of vaccines causing autism have been awarded compensation.\n\n13. The CDC of USA, the vaccine watchdog, has publicly admitted that its much-publicized 2003 study denying any link between vaccines and autism is flawed. The Chief of CDC Dr Julie Gerberding (now head of the Vaccine Division of Merck) has confessed to the media (CNN) that vaccines can cause “autism like symptoms”. The Autism epidemic is found in all countries that have allowed mass vaccinations.\n\n14. In the year 1999, the US Government instructed vaccine manufacturers in the USA to remove mercury from vaccines “with immediate effect”. But mercury still remains a part of many vaccines. The vaccines with mercury were never recalled and were given to children up to the year 2006. “Mercury free” vaccines contain 0.05mcg to 0.1mcg of mercury, still posing a danger to the infant considering that mercury tends to accumulate in the body and that there are today many sources of mercury exposure. As per an American Academy of Pediatricians study: “Mercury in all of its forms is toxic to the fetus and children and efforts should be made to reduce exposure to the extent possible to pregnant women and children as well as the general population.”\n\n15. IN INDIA NO ATTEMPT HAS BEEN MADE TO ENSURE THAT MERCURY AND OTHER METALS ARE REMOVED FROM VACCINES SIMPLY BECAUSE IT WOULD MAKE VACCINES COSTLIER.\n\n16. In a reply to then President Sri Abdul Kalam, the Health Ministry informed, “mercury is required to make the vaccines safe”. To the author’s query that “what are these vaccines that it requires the second most dangerous neurotoxin, mercury, to make them safe?” there was no reply.\n\n17. Mercury used in vaccines is second in toxicity only to the radioactive substance, Uranium. Mercury is 1000 times more toxic than lead. It is a neurotoxin that can damage the entire nervous system of the infant. According to a study by Dr Teresa Binstock et al, more than 200 symptoms of autism match completely with symptoms of mercury poisoning. This study created a furor in the US political establishment and angry Congressmen demanded a ban on mercury in vaccines. The US Government responded by recommending that mercury not be used in vaccines. The industry did reduce the quantum of mercury in some single use vaccine vials but certain vaccines in the USA continue to have mercury in large quantities as an ingredient. In spite of pressure mounted by advocacy groups the vaccine manufacturers have refused to make available vaccines available to the developing world. Eli Lily, the manufacturer of the controversial mercury containing compound Thimerosal has considerable influence in the political circles and many prominent international politicians have shares in this company.\n\n18. Mercury accumulates in fat. The brain being made mostly of fat cells, most of the mercury accumulates there and may be contributing to the peculiar symptoms of the autistic children. Interestingly the ethyl mercury that is used in vaccines can cross the blood brain barrier and has a greater tendency to accumulate in the brain. It has also the tendency to remain there for a long time, in many cases permanently. This presence is devastating to both the neurons and the brain cells.\n\n19. The mercury used in vaccines is ethyl mercury. According to Indian doctors this is an industrial toxin and is 1000 times more toxic than the usual methyl mercury. Ethyl mercury is absorbed into the body faster than methyl mercury and converts into inorganic mercury which tends to become a permanent fixture in the brain.\n\n20. The aluminum present in vaccines makes the mercury, in any form, 100 times more toxic through a process called synergistic toxicity. Aluminum is used in very large doses in vaccines ostensibly to cause an immune reaction. According to a very recent study, “it causes cells to give up their DNA”.\n\n21. As per an independent study aluminum and formaldehyde present in vaccines can increase the toxicity of mercury, in any form, by 1000 times.\n\n22. As per a Tehelka article on Autism, if one considers the WHO limit for mercury in water, they are receiving 50,000 times the limit. The limits set, incidentally, are for adults and not infants.\n\n23. Autism in India has emerged as the most rapidly growing epidemic amongst children, more than the growth of infantile diabetes, AIDS and cancer combined. As per a private study done by doctors in New Delhi, from 1 in 500 it has steadily climbed to 1 in 37 today. As per Indian doctors, “You can go to any class of any school today and find an autistic child.” Sonia Gandhi, the Chairperson of the Autism Society of India, has on 25th July 2011 declared in an International Autism Conference in Dhaka, Bangladesh that 8 million children in India suffer from this debilitating spectrum disorder, the growth of which has baffled medical scientists.\n\n24. Autism is a permanent disability that affects the child physically, mentally and emotionally. It makes the child loose social contact. It impedes both the physical and mental growth of the child. It destroys the brain causing severe memory and attention problems. It also destroys the immune system and causes very severe damage to the guts. The majority of symptoms displayed by autistic children match symptoms of vaccine strain virus insult and heavy metal poisoning.\n\n25. According to vaccine researcher Dr Harris Coulter, vaccines cause children to become pervert and criminal, traced to the encephalopathy (a brain disorder) caused by the toxins in vaccines. Majority of the school shootings by the children in the USA have been committed by autistic children. Vaccines can cause more harm that even the medical community privately acknowledges.\n\n26. Autistic children also suffer from severe bowel disorders. As per Dr Andrew Wakefield, a reputed gastroenterologist of the UK, this is due to the vaccine strain live measles virus in the MMR vaccine. Many children become fully autistic after the MMR shot, as reported by the parents and the doctors treating the children. Dr Wakefield found the vaccine strain measles virus in the blood, guts, tissue and the Cerebro-Spinal Fluid (CSF) of autistic children. This finding has been confirmed by many other studies published since then (Dr Timothy Buie, Dr V K Singh, Kawashima et al, Dr James Walker Smith et al). However in a politically motivated move Dr Wakefield was pulled up for his finding and disgraced by the UK Government which had introduced the MMR vaccine, his licence to practice in the UK was cancelled and his case study pulled out of the Lancet. He now practices in The Thoughtful House in the USA where he treats autistic children. As per a recent study the MMR vaccine has an adverse effect on the vital mucosal immune system. The very basis of trying to prevent childhood Mumps and Measles has been questioned in this study.\n\n27. The DPT also causes children to regress giving rise to fears that multiple bacteria/toxoids/ live virus vaccines are an important cause behind autism. If three live viruses can cause so much harm we can well imagine what today’s Pentavalent, septavalent and 10 valent vaccines will do to children.\n\n28. Before the autism epidemic, it was already well known that vaccines have caused the cancer epidemic in today’s society. Both the Small Pox and the Oral Polio Vaccine are made from monkey serum. This serum has helped many monkey viruses to enter the human blood stream. Out of these the only researched virus, SV 40, has been found to be cancerous. As per recent revelations these viruses continue to be in the vaccines. The presence of SV 40 in various human cancers has been demonstrated. Today it is known that the virus is being passed on to future generations as its presence in the mother’s milk and human sperms has been established.\n\n29. It is also known that it is the use of green monkey serum in vaccines that has led to the transfer of the Simian Immune deficiency Virus (SIV) from monkeys into humans. As per Dr Robert Gallo, the discoverer of the Human Immune deficiency Virus, the SIV and the HIV that causes AIDS are indistinguishable.\n\n30. Not only AIDS, a blood cancer in infants (Acute Lymphoblastic Leukemia) that is affecting children in thousands may also be primarily due to the extremely toxic nature of vaccine ingredients injected directly into the blood stream. This concern has been voiced to the author by a reputed oncologist of a hospital in Mumbai that treats children with the disorder.\n\n31. Infantile jaundice and also infantile diabetes is also scientifically connected to the toxic vaccines.\n\n32. The live polio viruses used in the Oral Polio Vaccine has caused Vaccine Attributed Paralytic Polio (500 to 600 cases a year in India as per investigating doctors) and Acute Flaccid Paralysis (symptoms indistinguishable from polio) in more than 1,25,000 children (up to the year 2006) as per doctors of the Indian Medical Association and the Jana Swasthya Abhiyan. The OPV has also let loose a new strain of polio in both India and Africa. The OPV has been discontinued in the USA & European countries. A monovalent OPV has been experimentally administered to Indian children in gross violation of clinical trial protocols. This caused cases of AFP to double in areas where this vaccine was administered.\n\n33. Vaccines contain serum from not only chimpanzees and monkeys but also from cows, pigs, chickens, eggs, horses, and even human tissues (cell lines) extracted from aborted fetuses.\n\n34. Deaths and permanent disability from vaccines is common and known by the medical community. They are instructed by the Government to keep quiet and not to associate such cases with vaccines as disclosed by the doctors of the IMA while unfolding the OPV scandal. The public comes to know only when the cases are highlighted by the media.\n\n35. Many doctors argue that diseases during childhood are due to the body exercising its immune system. Suppressing these diseases causes the immune system to remain undeveloped causing the various autoimmune disorders in adults like diabetes and arthritis that have become epidemics today.\n\n36. Vaccines suppress the natural immunity and the body does not have natural antibodies anymore. The mother’s milk therefore does not contain natural antibodies and can no longer protect the child against illnesses.\n\n37. By stimulating humoral (blood related) immunity alone vaccines have caused an imbalance in the whole immune set up (referred to as the TH1-TH2 imbalance and a resultant shift to TH2) leading to an alarming increase in auto immune disorders. This is acknowledged by the immunologists themselves.\n\n38. In the USA vaccine adverse effects are recorded and the Government offers compensation of millions of dollars to victims (the most recent case in its Vaccine Court may have received upto $200 million in damages). The courts in the USA have paid nearly $ 2 billion in damages so far. The Indian Government simply refuses to acknowledge that vaccines can cause deaths and permanent disability, let alone compensate, treat and rehabilitate the unfortunate victims.\n\n39. It has been scientifically proven that vaccines cannot prevent disease. Vaccines try to create humoral (blood related immunity) whereas it has been found that immunity is developed at various levels, humoral, cellular, and organ specific. We still do not know enough about the human immune system and therefore should not interfere with it. According to concerned immunologists the “sailnt like immune system can convert into a massive negative force that can put the devil into shame” if interfered with unnecessarily.\n\n40. In the USA parents are informed about vaccine after effects and their consent has to be taken before vaccinating their children. Parents in the USA can also opt out of the vaccination process by submitting various exemption forms.In India the Government assures the population through massive advertising campaigns that vaccines are extremely safe. Parents refusing to vaccinate are threatened by the administration.\n\n41. THERE IS NO SYSTEM OF TREATMENT TO TREAT A VACCINE DAMAGED CHILD. The parents have to run from one hospital to another. The Government turns a blind eye and refuses to even acknowledge the vaccine connection. Attempts by highly qualified doctors worldwide to treat autistic children through biomedical interventions like supplying essential nutrients, diet correction, hyperbaric oxygen therapy, and flushing out heavy metals and toxins from the body etc have been frowned upon and discouraged. Doctors have even been persecuted for treating autistic children mainly because these doctors tend to find out that the vaccines have caused the damage and raise their voices against them.\n\n42. Senior medical doctors of India and senior medical scientists have challenged even the vaccines recommended by the Government of India. According to Dr P M Bhargava, the BCG vaccine for tuberculosis has been extensively tested in India as long back as 1961 and found to be totally ineffective (in fact tuberculosis in the vaccinated group was found to be more than in the control group!). The OPV is causing polio in tens of thousands of Indian children. The Hep-B vaccine introduced into the UPI recently is not meant for children at all, it is a vaccine for a sexually transmitted disease that should be targeted only at promiscuous adults. The tetanus vaccine contains both aluminum and mercury besides the tetanus toxoid. The doctors themselves avoid giving the DPT to their children and relatives as per a survey amongst US health care professionals. The measles vaccine is one that regularly causes severe adverse effects and the health workers I have interviewed want it out. Recently Dr T Jacob John has called for screening children for inherent illnesses and the presence of a doctor while administering the measles vaccine. RTI activists have sourced data showing that deaths from vaccines are highest in case of the measles vaccine. Dr Ajay Gambhir, a very senior member of the IAP, too supports extensive screening of children before administering any vaccine. According to him children suffering from any illness, with any family history of autoimmune illnesses, any past reactions from vaccines, should not be administered vaccines. According to him the parents of children need to be told that they have the choice not to vaccinate.\n\n43. The pediatricians are introducing dubious vaccines in India, which are being opposed by the doctors, politicians, and public in American and European countries. The Rotavirus vaccine, Hib vaccine, HPV vaccine (involved in a scam in India), the Pentavalent vaccine and the various multi virus vaccines being introduced without any kind of testing and without any need is only because the vaccine manufacturers and the doctors administering them want to ensure a good income from them. They care two hoots about medical ethics and the fate of the children who will receive these vaccines. Vaccines containing nano particles and viruses and also plant based or otherwise genetically modified vaccines are being opposed by independent doctors worldwide.\n\n44. Various independent studies, notably the Dutch and the more recent German study, (also the recent KIGGS study involving 7724 children) comparing vaccinated with unvaccinated children has found that vaccinated children are more prone to asthma, dermatitis, allergies, development delayes, attention deficit disorders, hyperactivity etc. According to the German study, the death rate amongst vaccinated children is much more than the unvaccinated ones.\n\n45. Vaccination, being a mass medical program which is accepted without question, becomes the perfect launching pad for bioterrorism. The powerful countries can spread lethal epidemics by just polluting the vaccines with bio warfare agents. The USA has handed over vaccine research to a bioterrorism research unit called the BARDA which functions under the Pentagon. A warning to this effect has been sounded by the Vice President IAP in a letter to the Director General Health Services in India.\n\n46. Besides “investigating” doing the same with the small pox virus, it is reported that a “weapons grade” bird flu vaccine has already been devised by the Pentagon to be used as a biowarfare agent.\n\n47. Vaccines have also been used to ensure population control. A batch of the tetanus vaccine has been used in many Asian countries to make the female population sterile. This was done by introducing a hormone that by inducing antibodies would abort the foetus when it is formed. In India, Saheli, a NGO fighting for the rights of women filed a PIL against this when the fact surfaced.\n\n48. Mercury, a part of vaccines, is known to interfere with the endocrine system and induce sterility in both males and females. Polysorbate 80, another ingredient of vaccines, and also Squalene is known to cause sterility.\n\n49. Through a new Public Health Bill that is being drafted the Government of India is planning to introduce forced vaccinations and threaten anti-vaccination activists with steep fines and jail terms. This is obviously at the instance of foreign (read US) vaccine giants who are shifting base to India reeling at the tremendous opposition to vaccines in US and European countries. The Govt of India is planning a “vaccine park” at Chennai where these vaccine MNCs will set up base. This itself is an act of bioterrorism which ironically the proposed bill seeks to oppose.\n\n50. As per the Institute Of Medicine, USA, vaccine research for a probable link between vaccines and autism should not be conducted. The Institute of Medicine in its last report on vaccines and autism in 2004 said that more research on the vaccine question is counterproductive: Finding a susceptibility to this risk in some infants would call into question the universal vaccination strategy that is a bedrock of immunization programs and could lead to widespread rejection of vaccines. The IOM concluded that efforts to find a link between vaccines and autism “must be balanced against the broader benefit of the current vaccine program for all children”. However inherently biased studies that try to disprove a link between vaccines and autism have been allowed and funded by the CDC. The Principal Coordinator of many of these studies (referred to as The Danish Studies) Dr Paul Thorsen, has recently been in the news for money laundering and fraudulently misappropriating a huge chunk of research funds channeled towards these studies calling into question the veracity of the conclusion reached in these studies. The CDC study done by Dr Thomas Verstraeten manipulated data as revealed by RTI activists. Dr Verstraeten later joined a vaccine MNC. (Early in his study, the lead author, CDC’s Dr. Thomas Verstraeten, found statistically significant associations between the amount of mercury (thimerosal) exposure children got from their childhood vaccines, and a wide range of brain disorders. However, the published version of the study (the one the authors say is accurate) found no evidence of a link to autism. Not disclosed was that Dr. Verstraeten had left CDC midstream during the study and had gone to work for Glaxo, a vaccine manufacturer).\n\nWhat does this all add up to? Infants should be sacrificed in order to perpetuate an unscientific procedure?", "opengraph": {"description": "1. There is no scientific study to determine whether vaccines have really prevented diseases. Rather disease graphs show vaccines have been introduced at the end of epidemics when the disease was already in its last stages. In case of Small Pox the vaccine actually caused a great spurt in the incidence of disease before public outcry led to its withdrawal. 2. There are no long-term studies on vaccine safety. Very short-term tests are carried out where the vaccinated subjects are checked against another group who are given another vaccine. Technically the tests should be carried out against a non-vaccinated group. No one", "title": "50 Reasons NOT To Vaccinate Your Children", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/50-reasons-not-to-vaccinate-your-children/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-11-27T23:27:54-04:00", "article:modified_time": "2019-11-29T11:29:01-04:00", "updated_time": "2019-11-29T11:29:01-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2F50-reasons-not-to-vaccinate-your-children%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2F50-reasons-not-to-vaccinate-your-children%2F&text=50+Reasons+NOT+To+Vaccinate+Your+Children", "#", "/cdn-cgi/l/email-protection#99a6eaecfbf3fcfaeda4aca9bcaba9cbfcf8eaf6f7eabcaba9d7d6cdbcaba9cdf6bcaba9cff8fafaf0f7f8edfcbcaba9c0f6ecebbcaba9daf1f0f5fdebfcf7bffbf6fde0a4a8b7bcdaabbcd8a9cdf1fcebfcbcaba9f0eabcaba9f7f6bcaba9eafaf0fcf7edf0fff0fabcaba9eaedecfde0bcaba9edf6bcaba9fdfcedfcebf4f0f7fcbcaba9eef1fcedf1fcebbcaba9eff8fafaf0f7fceabcaba9f1f8effcbcaba9ebfcf8f5f5e0bcaba9e9ebfceffcf7edfcfdbcaba9fdf0eafcf8eafceab7bcaba9cbf8edf1fcebbcaba9fdf0eafcf8eafcbcaba9feebf8e9f1eabcaba9eaf1f6eebcaba9eff8fafaf0f7fceabcaba9f1f8effcbcaba9fbfcfcf7bcaba9f0f7edebf6fdecfafcfdbcaba9f8edbcaba9edf1fcbcaba9fcf7fdbcaba9f6ffbcaba9fce9f0fdfcf4f0faeabcaba9eef1fcf7bcaba9edf1fcbcaba9fdf0eafcf8eafcbcaba9eef8eabcaba9f8f5ebfcf8fde0bcaba9f0f7bcaba9f0edeabcaba9f5f8eaedbcaba9eaedf8fefceab7bcaba9d0f7bcaba9faf8eafcbcaba9f6ffbcaba9caf4f8f5f5bcaba9c9f6e1bcaba9edf1fcbcaba9eff8fafaf0f7fcbcaba9f8faedecf8f5f5e0bcaba9faf8eceafcfdbcaba9f8bcaba9feebfcf8edbcaba9eae9ecebedbcaba9f0f7bcaba9edf1fcbcaba9f0f7faf0fdfcf7fafcbcaba9f6ffbcaba9fdf0eafcf8eafcbcaba9fbfcfff6ebfcbcaba9e9ecfbf5f0fabcaba9f6ecedfaebe0bcaba9f5fcfdbcaba9edf6bcaba9f0edeabcaba9eef0edf1fdebf8eef8f5b7bcaba9abb7bcdaabbcd8a9cdf1fcebfcbcaba9f8ebfcbcaba9f7f6bcaba9f5f6f7feb4edfcebf4bcaba9eaedecfdf0fceabcaba9f6f7bcaba9eff8fafaf0f7fcbcaba9eaf8fffcede0b7bcaba9cffcebe0bcaba9eaf1f6ebedb4edfcebf4bcaba9edfceaedeabcaba9f8ebfcbcaba9faf8ebebf0fcfdbcaba9f6ecedbcaba9eef1fcebfcbcaba9edf1fcbcaba9eff8fafaf0f7f8edfcfdbcaba9eaecfbf3fcfaedeabcaba9f8ebfcbcaba9faf1fcfaf2fcfdbcaba9f8fef8f0f7eaedbcaba9f8f7f6edf1fcebbcaba9feebf6ece9bcaba9eef1f6bcaba9f8ebfcbcaba9fef0effcf7bcaba9f8f7f6edf1fcebbcaba9eff8fafaf0f7fcb7bcaba9cdfcfaf1f7f0faf8f5f5e0bcaba9edf1fcbcaba9edfceaedeabcaba9eaf1f6ecf5fdbcaba9fbfcbcaba9faf8ebebf0fcfdbcaba9f6ecedbcaba9f8fef8f0f7eaedbcaba9f8bcaba9f7f6f7b4eff8fafaf0f7f8edfcfdbcaba9feebf6ece9b7bcaba9d7f6bcaba9f6f7fcbca9ddbca9d8bca9ddbca9d8cbfcf8fdb9d4f6ebfcb9d1fcebfca3b9bcaba9f1edede9eabcaad8bcabdfbcabdfeef6ebf5fdedebecedf1b7edefbcabdfaca9b4ebfcf8eaf6f7eab4f7f6edb4edf6b4eff8fafaf0f7f8edfcb4e0f6ecebb4faf1f0f5fdebfcf7bcabdf", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-11-27T23:27:54-04:00"}