{"result_id": "350023", "URL": "https://worldtruth.tv/11-most-toxic-vaccine/", "timestamp": "2023-04-25 18:18:02 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/11-most-toxic-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "11 Most Toxic Vaccine", "cleaned_text": "It’s been only 70 years since World War II, and the mad scientists from companies like I.G. Farben, BASF, Hoechst, Dow and Bayer, who created the gas chambers and tested dangerous vaccines on innocent Jews, didn’t just go away. In fact, they went to work for U.S. corporations and pharmaceutical companies that run the vaccine industry today. At least a dozen of these cold blooded killers were hired fresh out of prison, just 4 to 7 years after the Nuremberg trials found them guilty of mass murder and enslavement.\n\nIn fact, at the close of WWII, the IG Farben building in Frankfort was protected from allied bombings by the highest levels of military command. Why? IG Farben was the FDA/CDC type of “pharmaceutical arm” of Hitler’s 4th Reich, and the Rockefellers had a financial interest in maintaining and controlling this pharmaceutical empire, which would soon be catapulted on U.S. soil. Research reveals that Hitler also invested heavily in Merck and other pharmaceutical companies.\n\nNazi convicted mass murderers became executives for major U.S. chemical and pharmaceutical companies\n\nFritz ter Meer, found guilty of slavery and mass murder at Auschwitz, served only seven years in prison and became Chairman of the Board at Bayer in 1956. Still trust U.S. vaccines?\n\nThis is the same vaccine industry today which protected and employed Nazi war criminals. The very industry that produced the Nazi gas chambers was purchased by Bayer. So, exactly whom are you trusting with your children’s health and welfare?\n\nCurrently, the U.S. Government and the CDC rely solely on the manufacturers of vaccines to report problems, injuries and deaths. This atrocity is like letting murderers be their own judges in court! Where are the checks and balances this country was founded upon? Vaccines have economic and political agendas now, and the FDA does absolutely no testing of their own before making decisions to release vaccines to the masses.\n\nWant more research before you or your child get injected with a new concocted disease for which there is no cure? Listen to stunning admissions by vaccine industry experts, including Dr. Maurice Hilleman (formerly w/Merck), who admitted to the deadly nature of the most trusted vaccines.\n\nToday’s vaccines not only contain live versions of the diseases you DO NOT WANT, but also contain GMOs, hormones from infected cows, pigs, chickens and monkeys, untested virus combinations (like H1N1), aluminum, mercury, emulsifiers, and crossbred bacteria from animals, mosquitoes, and diseased humans:\n\nMeasles Live Virus Vaccine: (Attenuvax) Made by Merck. Two injections are given; one at 1 year and another at 4 years old. Contains gelatin, sorbitol, sodium chloride, bovine cow serum, egg protein and human albumin.\n\nMeasles and Mumps Live Virus Vaccine: (M-M-Rvax) Made by Merck. Injected into one year old babies. Contains gelatin, sorbitol, sodium chloride, bovine cow serum, and human albumin.\n\nDiptheria, Tetanus and Polio Vaccine: Five injections given between 2 and 6 years of age, plus boosters “recommended” every 10 years. Contains formaldehyde, phenoxyethanol and aluminum phosphate.\n\nDTaP, IPV, HBV and Hib*: (Diphtheria, tetanus, polio, hepatitis B and Haemophilus influenza type B) Given to infants 2 to 12 months with boosters less than a year later. Contains aluminum hydroxide, formaldehyde, and bovine cow serum.\n\nGardasil HPV: Human Papillomavirus Vaccine Made by Merck. “Recommended” 3 intramuscular injections; given at birth, 2 and 6 months of age. Re-administered to children as young as 9 years of age for a rare sexually transmitted disease. Contains polysorbate 80, sodium chloride, aluminum, and a “denatured” (fragmented and weakened) form of the virus.\n•Bovine cow serum: Extracted from cow skin. When injected causes connective tissue disorders, arthritis and lupus; also shortness of breath, low blood pressure, chest pain and skin reactions.\n•Sorbitol: Synthetic sweetener which metabolizes very slowly and aggravates IBS and gastrointestinal issues.\n•Gelatin: Derived from the collagen inside animals’ skin and bones. Injecting gelatin poses the risk of infection from synthetic growth hormones and BSE infectivity (mad cow disease).\n•Egg protein: Vaccines are prepared in eggs (certainly not organic). May contain growth hormones, antibiotics, and salmonella bacteria.\n•Thimerosal: A neurotoxic mercury which causes autism: There are 25 mcg in one average flu vaccine, and the EPA safety limit is 5 micrograms, so children who are vaccinated simultaneously with multiple* vaccines receive over 10 times the safety limit of mercury in one day.\n•Human albumin: The protein portion of blood frompooled human venous plasma; when injected causes fever, chills, hives, rash, headache, nausea, breathing difficulty, and rapid heart rate. Injecting “pooled blood” can result in a loss of body cell mass and cause immunodeficiency virus infection, or contain SV40, AIDS, cancer or Hepatitis B from drug addicts.\n•Formaldehyde: Highly carcinogenic fluid used to embalm corpses. Ranked one of the most hazardous compounds to human health; can cause liver damage, gastrointestinal issues, reproductive deformation, respiratory distress and cancer. Plus, formaldehyde has been known to fail todeactivate the virusthe vaccine is intended to cure, thus enabling a live virus to enter your blood and infect your system.\n•Phenoxyethanol: A glycol ether/chemical; highly toxic to the nervous system, kidneys, and liver. The FDA warns “can cause shut down of the central nervous system (CNS), vomiting and contact dermatitis” in cosmetics; imagine when injected into your blood.\n•Aluminum phosphate: Greatly increases toxicity of mercury, so caution aboutminimum mercury toleranceis therefore severely underestimated. CDC scientists and all doctors are well aware of this.\n•MSG(monosodium glutamate): When injected becomes a neurotoxin, causing CNS disorders and brain damage in children.\n\nIf you especially enjoy being lied to, visit vaccinateyourbaby.org, where they tell you formaldehyde is safe because it is “present in the environment and is a byproduct of metabolism, so it is already present in the human body.” They also inform you that aluminum is good for you, because “[a]luminum is also commonly found in food, water, infant formula and even breast milk.” Hey, if it’s in the environment, it must be safe to inject into your veins (so why not use snake venom, bleach, and plutonium?).\n\nWant the ultimate alternative to vaccines that prevents disease? Buy organic vitamins, minerals, antioxidants, amino acids, and enzymes!", "opengraph": {"description": "  It's been only 70 years since World War II, and the mad scientists from companies like I.G. Farben, BASF, Hoechst, Dow and Bayer, who created the gas chambers and tested dangerous vaccines on innocent Jews, didn't just go away. In fact, they went to work for U.S. corporations and pharmaceutical companies that run the vaccine industry today. At least a dozen of these cold blooded killers were hired fresh out of prison, just 4 to 7 years after the Nuremberg trials found them guilty of mass murder and enslavement. In fact, at the close of WWII, the IG Farben building in Frankfort", "title": "11 Most Toxic Vaccine", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/11-most-toxic-vaccine/", "site_name": "WorldTruth.Tv", "article:published_time": "2018-07-03T03:39:46-04:00", "article:modified_time": "2020-05-28T20:38:21-04:00", "updated_time": "2020-05-28T20:38:21-04:00"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"//www.youtube.com/embed/Ja_7rsLfzzE?rel=0\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/Ja_7rsLfzzE?rel=0"}], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2F11-most-toxic-vaccine%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2F11-most-toxic-vaccine%2F&text=11+Most+Toxic+Vaccine", "#", "/cdn-cgi/l/email-protection#0b34787e69616e687f363a3a2e393b4664787f2e393b5f647362682e393b5d6a686862656e2d69646f72362e48392e4a3b2e393b427f2e393c782e393b696e6e652e393b646567722e393b3c3b2e393b726e6a79782e393b786265686e2e393b5c6479676f2e393b5c6a792e393b42422e39482e393b6a656f2e393b7f636e2e48392e4a3b666a6f2e393b7868626e657f62787f782e48392e4a3b6d7964662e393b6864667b6a65626e782e393b6762606e2e393b42254c252e393b4d6a79696e652e39482e393b494a584d2e39482e393b43646e6863787f2e39482e393b4f647c2e393b6a656f2e393b496a726e792e39482e393b7c63642e393b68796e6a7f6e6f2e393b7f636e2e393b6c6a782e393b68636a66696e79782e393b6a656f2e393b7f6e787f6e6f2e393b6f6a656c6e79647e782e393b7d6a686862656e782e393b64652e393b62656564686e657f2e393b416e7c782e39482e393b6f626f652e393c7f2e393b617e787f2e393b6c642e393b6a7c6a72252e393b42652e393b6d6a687f2e39482e393b7f636e722e393b7c6e657f2e393b7f642e393b7c6479602e393b6d64792e393b5e2558252e393b6864797b64796a7f626465782e393b6a656f2e393b7b636a79666a686e7e7f62686a672e393b6864667b6a65626e782e393b7f636a7f2e393b797e652e393b7f636e2e393b7d6a686862656e2e393b62656f7e787f79722e393b7f646f6a72252e393b4a7f2e393b676e6a787f2e393b6a2e393b6f64716e652e393b646d2e393b7f636e786e2e393b6864676f2e393b696764646f6e6f2e393b606267676e79782e393b7c6e796e2e393b6362796e6f2e393b6d796e78632e393b647e7f2e393b646d2e393b7b79627864652e39482e393b617e787f2e393b3f2e393b7f642e393b3c2e393b726e6a79782e393b6a6d7f6e792e393b7f636e2e393b457e796e66696e796c2e393b7f79626a67782e393b6d647e656f2e393b7f636e662e48392e4a3b6c7e62677f722e393b646d2e393b666a78782e393b667e796f6e792e393b6a656f2e393b6e6578676a7d6e666e657f252e393b42652e393b6d6a687f2e39482e393b6a7f2e393b7f636e2e393b686764786e2e393b646d2e393b5c5c42422e39482e393b7f636e2e393b424c2e393b4d6a79696e652e393b697e62676f62656c2e393b62652e393b4d796a65606d64797f2e3b4f2e3b4a2e3b4f2e3b4a596e6a6f2b4664796e2b436e796e312b2e393b637f7f7b782e384a2e394d2e394d7c6479676f7f797e7f63257f7d2e394d3a3a266664787f267f64736268267d6a686862656e2e394d", "https://worldtruth.tv/wp-content/uploads/2012/04/vaccination1.jpg", "https://worldtruth.tv/wp-content/uploads/2012/04/vaccine-cocooning2.jpg", "http://www.naturalnews.com/035431_vaccine_ingredients_side_effects_MSG.html", "http://vaxtruth.org/2011/08/vaccine-ingredients-children-as-guinea-pigs-religious-exemptions/", "http://www.supernutrient.com/articles/fibromyalgia/taf.html", "http://heinonline.org/HOL/LandingPage?collection=journals&handle=hein.journals/hastlj37&div=41&id=&page=", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2018-07-03T03:39:46-04:00"}