{"result_id": "350022", "URL": "https://worldtruth.tv/four-month-old-baby-fies-after-being-jabbed-with-7-vaccines-autopsy-report-censors-vaccine-info/", "timestamp": "2023-04-25 18:18:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/four-month-old-baby-fies-after-being-jabbed-with-7-vaccines-autopsy-report-censors-vaccine-info/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Four Month Old Baby Dies After Being Jabbed With 7 Vaccines; Autopsy Report Censors Vaccine Info", "cleaned_text": "After receiving a total of 14 vaccines within just a few months — the first seven after her birth in November 2013, and another seven in April 2014 — a baby girl in Tennessee died. In fact, her death came just days after the second series of shots — DTaP, polio, Hib, PCV and the oral rotavirus vaccine.(1)\n\nThe story about baby Ja’Liyah Cortize Turner was reported on VacTruth.com where it’s explained that her mother, Quavia, felt bullied by doctors to have the second round of vaccines given to her baby. Although her child experienced side effects such as fever and knots in her leg at the injection site, doctors said not to worry. Flash forward to April 18, 2014, when her precious baby passed away four days after receiving seven vaccines, months after having already received seven when she was born. Her mother found Ja’Liyah unresponsive that April day, discovering that blood and thick fluids were coming out of her ears, mouth and nose.\n\n“I thought I was doing the right thing,” Quavia says in the Vactruth.com article. “Where we live in Tennessee, if you don’t vaccinate, they try to deem you unfit. You are made to feel you have no choice what vaccines your child gets and when they get them. They will say you are unfit and try to take your kid away if you decline them.”(1)\n\nDCS enters the picture, omission of vaccines on autopsy report reinforce evils and cover-ups\n\nInterestingly, the family was indeed made to feel unfit, but not because of any vaccine situation. Tennessee’s Department of Children’s Services (DCS) assigned a case worker to the family in order to ensure that they were coping well. However, Quavia says that their initial outreach alluded to the possibility that the parents may have had something to do with Ja’Liyah’s death. She says that they even asked if their son had been hurt and went so far as to take pictures. Ultimately, such interrogation stopped there; DCS did not go any further. Still, a grieving family has enough to deal with; the measures taken by DCS undoubtedly added stress to the situation.\n\nPerhaps most disturbing of all in this case is the fact that the baby’s autopsy report made zero mention of the fact that she was given vaccines. She received a total of 14 from November through April, yet the report did not note this. In fact, it states that there is “no known significant medical history,” according to Quavia. Rightfully so, the young mother is angry about this. “Vaccines she was just given were not mentioned on the autopsy report, her recent emergency room visit was not listed on the report, and her reactions to the vaccines were not listed on the report,” Quavia said. “Yet Ja’Liyah’s report stated there was no known significant medical history. All of this information was significant but intentionally ignored.”(1)\n\nAdditionally bothersome is the fact that some ethic groups have a higher probability of carrying certain genes that are associated with an increased risk of vaccine injury. African-American — which Ja’Liyah was — is one such ethnicity. However, her parents were not informed about this risk.(1)\n\nVaccine injury and death will continue unless medical professionals step up to the plate\n\nAs we are well aware, situations like this are all too common. Perfectly healthy children are dying, mere days or just months after receiving vaccinations. All evidence points to the harms of the vaccines, their cocktails and chemicals and, in many cases, their being given to children whose immune systems aren’t even fully developed. All the while, medical professionals turn the other way, following what money-hungry Big Pharma and the journal articles often funded by them dictate.\n\nTake the case of Jodie Marchant, also reported on at VacTruth.com. Jodie, now in her 20s, received an illegal, untested 8-in-1 vaccine when she was about one year old. As a result, she’s brain-damaged and often unable to recognize even family members. Legal action, missing medical records and the firing of a medical expert who furnished them are all part of the complex web of cover-ups which the family remains involved in.(2)\n\nAs VacTruth.com states in their article about Ja’Liyah, “Medical professionals need to question what they are taught in medical school. When the material provided is funded from large pharmaceutical companies that have a vested interest for these students to sell their products, further research outside of what is taught in school must be done, if they want to learn the truth. … Vaccine injuries are not rare.”(1)", "opengraph": {"description": "After receiving a total of 14 vaccines within just a few months -- the first seven after her birth in November 2013, and another seven in April 2014 -- a baby girl in Tennessee died. In fact, her death came just days after the second series of shots -- DTaP, polio, Hib, PCV and the oral rotavirus vaccine.(1) The story about baby Ja'Liyah Cortize Turner was reported on VacTruth.com where it's explained that her mother, Quavia, felt bullied by doctors to have the second round of vaccines given to her baby. Although her child experienced side effects such as fever", "title": "Four Month Old Baby Dies After Being Jabbed With 7 Vaccines; Autopsy Report Censors Vaccine Info", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/four-month-old-baby-fies-after-being-jabbed-with-7-vaccines-autopsy-report-censors-vaccine-info/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-03-06T22:12:28-04:00", "article:modified_time": "2019-03-07T14:45:48-04:00", "updated_time": "2019-03-07T14:45:48-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Ffour-month-old-baby-fies-after-being-jabbed-with-7-vaccines-autopsy-report-censors-vaccine-info%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Ffour-month-old-baby-fies-after-being-jabbed-with-7-vaccines-autopsy-report-censors-vaccine-info%2F&text=Four+Month+Old+Baby+Dies+After+Being+Jabbed+With+7+Vaccines%3B+Autopsy+Report+Censors+Vaccine+Info", "#", "/cdn-cgi/l/email-protection#09367a7c6b636c6a7d344f667c7b2c3b394466677d612c3b3946656d2c3b394b686b702c3b394d606c7a2c3b39486f7d6c7b2c3b394b6c60676e2c3b3943686b6b6c6d2c3b395e607d612c3b393e2c3b395f686a6a60676c7a2c3a4b2c3b39487c7d66797a702c3b395b6c79667b7d2c3b394a6c677a667b7a2c3b395f686a6a60676c2c3b3940676f662f6b666d7034486f7d6c7b2c3b397b6c6a6c607f60676e2c3b39682c3b397d667d68652c3b39666f2c3b39383d2c3b397f686a6a60676c7a2c3b397e607d6160672c3b39637c7a7d2c3b39682c3b396f6c7e2c3b396466677d617a2c3b3924242c3b397d616c2c3b396f607b7a7d2c3b397a6c7f6c672c3b39686f7d6c7b2c3b39616c7b2c3b396b607b7d612c3b3960672c3b3947667f6c646b6c7b2c3b393b39383a2c3b4a2c3b3968676d2c3b396867667d616c7b2c3b397a6c7f6c672c3b3960672c3b3948797b60652c3b393b39383d2c3b3924242c3b39682c3b396b686b702c3b396e607b652c3b3960672c3b395d6c67676c7a7a6c6c2c3b396d606c6d272c3b3940672c3b396f686a7d2c3b4a2c3b39616c7b2c3b396d6c687d612c3b396a68646c2c3b39637c7a7d2c3b396d68707a2c3b39686f7d6c7b2c3b397d616c2c3b397a6c6a66676d2c3b397a6c7b606c7a2c3b39666f2c3b397a61667d7a2c3b3924242c3b394d5d68592c3b4a2c3b3979666560662c3b4a2c3b3941606b2c3b4a2c3b39594a5f2c3b3968676d2c3b397d616c2c3b39667b68652c3b397b667d687f607b7c7a2c3b397f686a6a60676c272c3b31382c3b302c3b395d616c2c3b397a7d667b702c3b39686b667c7d2c3b396b686b702c3b3943682c3b3e45607068612c3b394a667b7d60736c2c3b395d7c7b676c7b2c3b397e687a2c3b397b6c79667b7d6c6d2c3b3966672c3b395f686a5d7b7c7d61276a66642c3b397e616c7b6c2c3b39607d2c3b3e7a2c3b396c7179656860676c6d2c3b397d61687d2c3b39616c7b2c3b3964667d616c7b2c3b4a2c3b39587c687f60682c3b4a2c3b396f6c657d2c3b396b7c6565606c6d2c3b396b702c3b396d666a7d667b7a2c3b397d662c3b3961687f6c2c3b397d616c2c3b397a6c6a66676d2c3b397b667c676d2c3b39666f2c3b397f686a6a60676c7a2c3b396e607f6c672c3b397d662c3b39616c7b2c3b396b686b70272c3b3948657d61667c6e612c3b39616c7b2c3b396a6160656d2c3b396c71796c7b606c676a6c6d2c3b397a606d6c2c3b396c6f6f6c6a7d7a2c3b397a7c6a612c3b39687a2c3b396f6c7f6c7b2c394d2c39482c394d2c39485b6c686d2944667b6c29416c7b6c33292c3b39617d7d797a2c3a482c3b4f2c3b4f7e667b656d7d7b7c7d61277d7f2c3b4f6f667c7b246466677d612466656d246b686b70246f606c7a24686f7d6c7b246b6c60676e2463686b6b6c6d247e607d61243e247f686a6a60676c7a24687c7d66797a70247b6c79667b7d246a6c677a667b7a247f686a6a60676c2460676f662c3b4f", "https://worldtruth.tv/wp-content/uploads/2015/06/Needles-for-vaccination-post-Dec-10-2014-e1433815885647.jpg", "http://vactruth.com/2015/06/03/infant-dies-after-7-vaccines/", "http://vactruth.com/2015/03/14/illegally-given-8-in-1-vaccine/", "http://truthwiki.org/Vaccine_Fanaticism/", "http://truthwiki.org/Medical_Fascism/", "http://www.naturalnews.com/049996_vaccine_death_infant_mortality_coverup.html#ixzz3cWjGsSjs", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-03-06T22:12:28-04:00"}