{"result_id": "350007", "URL": "https://worldtruth.tv/7-suppressed-inventions-that-would-have-changed-the-world/", "timestamp": "2023-04-25 18:17:16 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/7-suppressed-inventions-that-would-have-changed-the-world/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "7 Suppressed Inventions That Would Have Changed The World", "cleaned_text": "The world is steeped in poverty with precious little in the way of humanitarian advancement because the ruling elite have suppressed a number of technologies that could have changed the world and created a utopia.\n\nAttempting to bring their innovations to the world at large the brilliant inventors of these technologies were given a hard time by the big boys of the ruling elite’s establishment. Some were murdered for profit…\n\nSo without further ado here are some of those technologies. Here are 7 suppressed inventions that would have changed the world, and the circumstances surrounding the inventors.\n\n“Electric power is everywhere, present in unlimited quantities and can drive the world’s machinery without the need of coal, oil, gas or any other fuels.” – Nikola Tesla (1856-1943)\n\nMulti-talented Tesla cut across many disciplinary boundaries. His genius gave rise to a number of world-changing inventions.\n\nHowever, Tesla’s funding was stopped. His equipment and lab was burned down together with the related intellectual property because it posed a threat to undercutting the cost of the conventional electricity grid system. If Tesla’s Wardenclyffe Tower Project had been allowed to flourish and not be destroyed then today we could well be living in a utopia.\n\nTesla died a poverty-stricken lonely and forgotten man in New York City.\n\n2. Raymond Rife (1888-1971) and his Universal Microscope for curing cancer.\n\nAfter successfully curing a number of cancer patients the Rockefeller-owned American Medical Association (AMA) later had this work laid to rest by closing down Rife’s set ups and seizing his equipment: Essentially Rife refused to hand over the rights of his work to the AMA because he saw moneyed interests as hidden ulterior motives. That the cancer machine would not be allowed to the world at large because the AMA and the medical/pharmaceutical establishment don’t want patients’ cured:\n\nThat would mean customers lost and no more revenue… so they have to keep coming up with treatment that only takes care of the symptoms, guaranteeing the cancer returns and thus repeat business…\n\nAfter years of ensuing court cases with the big boys of the cancer establishment, having had little money, exiled in Mexico to avoid imprisonment in the USA, Rife died of alcoholism.\n\nThe pressures of harassment related to the legal battles and constant threat of imprisonment had been too much for him…\n\nWilhelm Reich built an instrument he called the cloudbuster which successfully induced weather change. It has been used to break many droughts by producing clouds that make rain.\n\nThis workable mechanism for making rainclouds for crop irrigation in drought areas was stopped by those ever watchful lackeys for the ruling elite.\n\nConsequentially, Wilhelm Reich was hounded by the likes of the FDA (Food and Drug Administration) having accused him of fraud and deception with his cloudbuster instrument… His equipment was seized and destroyed.\n\nHis last days were spent in prison where it was claimed that he died of a heart attack.\n\nPauling had worked with Matthias Rath and they came up with a unified approach to curing heart disease.\n\nEssentially, they found that heart disease is the result of a long-term vitamin C deficiency. The solution is to treat patients with frequent high doses (e.g. 6g/day) of vitamin C while using the amino acids lysine and proline to remove the atherosclerotic plaque lining the inner walls of the blood vessels that cause a narrowing or blocking of the lumen (space) of the blood vessels which is responsible for restricting blood flow and cardiovascular disease.\n\nHowever, due to greater interests in corporate profitability and perceived financial threat, this highly successful cheap alternative therapy has not been allowed that much attention.\n\n5. Stanley Meyer (1940-1998) and the car that runs on water.\n\nMeyer invented a car that ran on water instead of the conventional fossil fuel gasoline. The car was able to travel from New York to Los Angeles on 22 gallons of water!\n\nThe engine system was fitted with a fuel cell that was able to split water into its components hydrogen and oxygen. The burnt hydrogen was the fuel source used to generate the necessary energy to power the car… For a detailed account on how the car works see the video below.\n\nWith such energetic sustainability Meyer’s invention could have made a revolutionary contribution to our planet’s environment and economy: If the full specifications of his work had been allowed to be published we’d all be using his technology today.\n\nDeveloped and handed down from successive generations, Harry Hoxey was able to use a herbal remedy and an externally applied paste to successfully treat cancer. The herbal formula detoxified the body and boosted the immune system, while the external paste got rid of tumours on the outside. From this, 17 private cancer clinics had been established throughout the USA.\n\nIn the mid 1950s, a number of doctors reviewed Hoxey’s work and came to the conclusion:\n\nThis clinic now has under treatment or observation between four and five thousand cancer patients. It handles approximately ninety patients per day. Approximately 100 new patients per week come to the clinic seeking relief, and the evidence we have seen indicates that approximately 90 percent of these are terminal cases.\n\nOver the years the clinic has accumulated more than 10,000 case histories, photographic studies and X-ray studies from all over the United States, Canada, Alaska, Mexico, Hawaii, the Central Zone and elsewhere. We find as a fact that the Hoxey Cancer Clinic in Dallas, Texas, is successfully treating pathologically proven cases of cancer, both internal and external, without the use of surgery, radium or X-ray…\n\nSome of those presented before us have been free of symptoms as long as twenty four years, and the physical evidence indicates that they are all enjoying exceptional health at this time…We are willing to assist this Clinic in any way possible in bringing this treatment to the American public. We are willing to use it…on our own patients.\n\nThe above statement represents the unanimous findings of this Committee. In testimony thereof we hereby attach our signatures.\n\nHaving got the news the AMA tried to buy the treatment. Hoxey refused on the grounds that they would not give it to poor people free of charge.\n\nA long legal and political battle enraged with much media interest. Several thousand people testified they had been cured using Hoxey’s work while the AMA refused third party evaluations. In spite of these circumstances favouring Hoxey, and winning his case, the medical fraternity soon branded him a quack or charlatan. He continued his treatment over the years and was arrested about a 100 times! Each arrest he was able make bail and continue.\n\nThe fact that no patient would testify against him and the acting District Attorney’s brother was cured by his methods may well have been the reasons for his continual reprieve. Eventually, however, the FDA managed to seize the remedies from the patients’ homes and shut down the clinics. Ironically, Hoxey contracted bladder cancer and had to be operated on since his methods did not work on him.\n\nThis story, however, does have a good ending. A former nurse in one of the clinics, Mildred Nelson, took the treatment to Mexico. The clinic, under a different name, still exists to this day and by all accounts is deemed to be a compassionate, caring and most of all successful (80% cure rate, with medical records to prove it) institution. The authorities, the NCI have deliberately looked the other way.\n\nThe Nazis had developed antigravity flying saucer technology during World War 2. It has been said that a secret base was made in the Antarctic which housed them. Then in the latter part of 1945 these super weapons moved to another military base – the Schwarze Sonne – Black Sun on the dark side of the moon.\n\nUsing the saucers on the dark side of the moon when the time was right an Earth invasion was planned but didn’t materialize. During the wartime a number of eyewitness accounts in London, New York and Prague reported these strange looking bell-shaped flying objects having the German military iron cross insignia… travelling at very high speeds.\n\nAn engineer named Joseph Andreas Epp claimed he had been involved in the development of the technology during the wartime and that the Schriever-Habermohl project involved some 15 different prototypes.\n\nFor details and a fuller account including the Nazi occult connections, an ancient past, ET channelling of the saucer’s anti-gravity technology and the related science see the fascinating video below.\n\n“No problem of human destiny is beyond human beings. Man’s reason and spirit have often solved the seemingly unsolvable – and we believe they can do it again.” – John F. Kennedy, 1963\n\nWe have seen an all-too-familiar pattern as in the above inventions 1-6. The inventors are approached by representatives of the ruling elite’s establishments who highly praise their innovations and offer to buy their patents.\n\nHowever, the inventors feel that something’s not right. That the establishment have ulterior motives usually related to moneyed interests, so they refuse to sell their work and the patents. Then the establishment threatens the inventors with defamation of character, court action or even death… should they refuse to sell their work and hand over the patents.\n\nThe answers to the many so-called incurable diseases do exist.\n\nAlso there is an infinite abundance of energy for all of us to tap in to.\n\nWhile we need to take necessary and just actions, instead of giving too much attention to materialism we need to shift our focus on how our thoughts can manifest reality. The kind of reality that we really want that takes us from scarcity to abundance, divided and ruled to united, from war to peace…\n\nThese suppressions and others need be known to the world. Please share this or other similar pieces far and wide.", "opengraph": {"description": "The world is steeped in poverty with precious little in the way of humanitarian advancement because the ruling elite have suppressed a number of technologies that could have changed the world and created a utopia. Attempting to bring their innovations to the world at large the brilliant inventors of these technologies were given a hard time by the big boys of the ruling elite’s establishment. Some were murdered for profit… So without further ado here are some of those technologies. Here are 7 suppressed inventions that would have changed the world, and the circumstances surrounding the inventors. 1. Nikola Tesla (1856-1943)", "title": "7 Suppressed Inventions That Would Have Changed The World", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/7-suppressed-inventions-that-would-have-changed-the-world/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-12-20T23:27:00-04:00", "article:modified_time": "2020-12-29T20:32:29-04:00", "updated_time": "2020-12-29T20:32:29-04:00"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/jxWsc7y1olg\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/jxWsc7y1olg"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/ABZxbMaUMGw\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/ABZxbMaUMGw"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/xGVpr_Hk0iI\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/xGVpr_Hk0iI"}, {"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/MwUpPwyyvLw\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/MwUpPwyyvLw"}], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2F7-suppressed-inventions-that-would-have-changed-the-world%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2F7-suppressed-inventions-that-would-have-changed-the-world%2F&text=7+Suppressed+Inventions+That+Would+Have+Changed+The+World", "#", "/cdn-cgi/l/email-protection#5a65292f38303f392e676d7f686a092f2a2a283f29293f3e7f686a13342c3f342e333534297f686a0e323b2e7f686a0d352f363e7f686a123b2c3f7f686a19323b343d3f3e7f686a0e323f7f686a0d3528363e7c38353e23670e323f7f686a2d3528363e7f686a33297f686a292e3f3f2a3f3e7f686a33347f686a2a352c3f282e237f686a2d332e327f686a2a283f3933352f297f686a36332e2e363f7f686a33347f686a2e323f7f686a2d3b237f686a353c7f686a322f373b34332e3b28333b347f686a3b3e2c3b34393f373f342e7f686a383f393b2f293f7f686a2e323f7f686a282f3633343d7f686a3f36332e3f7f686a323b2c3f7f686a292f2a2a283f29293f3e7f686a3b7f686a342f37383f287f686a353c7f686a2e3f3932343536353d333f297f686a2e323b2e7f686a39352f363e7f686a323b2c3f7f686a39323b343d3f3e7f686a2e323f7f686a2d3528363e7f686a3b343e7f686a39283f3b2e3f3e7f686a3b7f686a2f2e352a333b747f686a1b2e2e3f372a2e33343d7f686a2e357f686a382833343d7f686a2e323f33287f686a333434352c3b2e333534297f686a2e357f686a2e323f7f686a2d3528363e7f686a3b2e7f686a363b283d3f7f686a2e323f7f686a3828333636333b342e7f686a33342c3f342e3528297f686a353c7f686a2e323f293f7f686a2e3f3932343536353d333f297f686a2d3f283f7f686a3d332c3f347f686a3b7f686a323b283e7f686a2e33373f7f686a38237f686a2e323f7f686a38333d7f686a383523297f686a353c7f686a2e323f7f686a282f3633343d7f686a3f36332e3f7f1f687f626a7f6363297f686a3f292e3b3836332932373f342e747f686a0935373f7f686a2d3f283f7f686a372f283e3f283f3e7f686a3c35287f686a2a28353c332e7f1f687f626a7f1b6c7f686a09357f686a2d332e32352f2e7f686a3c2f282e323f287f686a3b3e357f686a323f283f7f686a3b283f7f686a2935373f7f686a353c7f686a2e3235293f7f686a2e3f3932343536353d333f29747f686a123f283f7f686a3b283f7f686a6d7f686a292f2a2a283f29293f3e7f686a33342c3f342e333534297f686a2e323b2e7f686a2d352f363e7f686a323b2c3f7f686a39323b343d3f3e7f686a2e323f7f686a2d3528363e7f68197f686a3b343e7f686a2e323f7f686a393328392f37292e3b34393f297f686a292f2828352f343e33343d7f686a2e323f7f686a33342c3f342e352829747f686a6b747f19687f1b6a14333135363b7f686a0e3f29363b7f686a7f68626b626f6c776b636e697f68637f6a1e7f6a1b7f6a1e7f6a1b083f3b3e7a1735283f7a123f283f607a7f686a322e2e2a297f691b7f681c7f681c2d3528363e2e282f2e32742e2c7f681c6d77292f2a2a283f29293f3e7733342c3f342e33353429772e323b2e772d352f363e77323b2c3f7739323b343d3f3e772e323f772d3528363e7f681c", "http://www.activistpost.com/product/B00CATSONE/US/permacultucom-20/?cart=y", "http://www.activistpost.com/2012/01/10-inventions-of-nikola-tesla-that.html", "http://www.naturalnews.com/027104_cancer_WHO_Chi.html", "http://www.bibliotecapleyades.net/ufo_aleman/rfz/chapter3a.htm", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-12-20T23:27:00-04:00"}