{"result_id": "350024", "URL": "https://worldtruth.tv/cdc-forced-to-release-documents-showing-they-knew-vaccine-preservative-causes-autism-3/", "timestamp": "2023-04-25 18:18:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/cdc-forced-to-release-documents-showing-they-knew-vaccine-preservative-causes-autism-3/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "CDC Forced To Release Documents Showing They Knew Vaccine Preservative Causes Autism", "cleaned_text": "For nearly ten years, Brian Hooker has been requesting documents that are kept under tight wraps by the Centers for Disease Control and Prevention (CDC). His more than 100 Freedom of Information Act (FOIA) requests have resulted in copious evidence that the vaccine preservative Thimerosal, which is still used in the flu shot that is administered to pregnant women and infants, can cause autism and other neurodevelopmental disorders.\n\nDr. Hooker, a PhD scientist, worked with two members of Congress to craft the letter to the CDC that recently resulted in his obtaining long-awaited data from the CDC, the significance of which is historic. According to Hooker, the data on over 400,000 infants born between 1991 and 1997, which was analyzed by CDC epidemiologist Thomas Verstraeten, MD, “proves unequivocally that in 2000, CDC officials were informed internally of the very high risk of autism, non-organic sleep disorder and speech disorder associated with Thimerosal exposure.”\n\nFactually, thimerosal is a mercury-containing compound that is a known human carcinogen, mutagen, teratogen and immune-system disruptor at levels below 1 part-per-million, and a compound to which some humans can have an anaphylactic shock reaction. It is also a recognized reproductive and fetal toxin with no established toxicologically safe level of exposure for humans.\n\nIn November, 1997, the U.S. Congress passed the Food and Drug Administration Modernization Act, requiring the study of mercury content in FDA-approved products. The review disclosed the hitherto-unrecognized levels of ethylmercury in vaccines.\n\nIn July 1999, public-health officials announced that thimerosal would be phased out of vaccines. The CDC, American Academy of Pediatrics, and FDA insisted that the measure was purely precautionary. They requested of all vaccine manufacturers to eliminate mercury from vaccines.\n\nThe requests were denied by vaccine manufacturers and continued every year thereafter.\n\nThe FDA does not require ingredients that comprise less than 1 percent of a product to be divulged on the label, so a lot more products may have thimerosal and consumers will never know.\n\nWhen the results of the Verstraeten study were first reported outside the CDC in 2005, there was no evidence that anyone but Dr. Verstraeten within the CDC had known of the very high 7.6-fold elevated relative risk of autism from exposure to Thimerosal during infancy. But now, clear evidence exists. A newly-acquired abstract from 1999 titled, “Increased risk of developmental neurologic impairment after high exposure to Thimerosal containing vaccine in first month of life” required the approval of top CDC officials prior to its presentation at the Epidemic Intelligence Service (EIS) conference. Thimerosal, which is 50% mercury by weight, was used in most childhood vaccines and in the RhoGAM shot for pregnant women prior to the early 2000s.\n\nThe CDC maintains there is “no relationship between Thimerosal-containing vaccines and autism rates in children,” even though the data from the CDC’s own Vaccine Safety Datalink (VSD) database shows a very high risk. There are a number of public records to back this up, including this Congressional Record from May 1, 2003. The CDC’s refusal to acknowledge thimerosal’s risks is exemplified by a leaked statement from Dr. Marie McCormick, chair of the CDC/NIH-sponsored Immunization Safety Review at IOM. Regarding vaccination, she said in 2001, “…we are not ever going to come down that it [autism] is a true side effect…” Also of note, the former director of the CDC, which purchases $4 billion worth of vaccines annually, is now president of Merck’s vaccine division.\n\nToxic Effects of Thimerosal No Longer Disputed by Scientific Study\n\nThimerosal-Derived Ethylmercury in vaccines is now well established as a mitochondrial toxin in human brain cells.\n\nThere are dozens of scientific inquiries and studies on the adverse effects of thimerosal, including gastrointestinal abnormalities and immune system irregularities.\n\nThimerosal, is metabolized (converted) into the toxic and “harmful” methylmercury. And then in turn, the harmful methylmercury is metabolized (converted) into the most harmful, long-term-toxic, “inorganic” mercury that is retained in bodily tissue.\n\n“Inorganic” mercury is the end product of mercury metabolism. Methylmercury subject groups confirm that the metabolic pathway for mercury in the human and animal body consists in the reduction/conversion of the harmful methylmercury into a more harmful “inorganic” mercury which is tissue-bound, and long-term-toxic. Hence, both the originating substance (methylmercury) and its conversion/reduction, inorganic mercury are found.\n\nBased on published findings by Dr. Paul King, the metabolic pathway for organic mercury involves the conversion of Ethylmercury (Thimerosal) into “methylmercury” and then the further reduction of “methylmercury” into inorganic mercury.\n\nDr. Hooker’s fervent hope for the future: “We must ensure that this and other evidence of CDC malfeasance are presented to Congress and the public as quickly as possible. Time is of the essence. Children’s futures are at stake.” A divide within the autism community has led to some activists demanding that compensation to those with vaccine-injury claims be the top priority before Congress. Dr. Hooker maintains that prevention, “protecting our most precious resource — children’s minds,” must come first. “Our elected officials must be informed about government corruption that keeps doctors and patients in the dark about vaccine risks.”\n\nReferring to an organization that has seen its share of controversy this past year, Dr. Hooker remarked, “It is unfortunate that SafeMinds issued a press release on my information, is accepting credit for my work and has not supported a worldwide ban on Thimerosal.”\n\nBrian Hooker, PhD, PE, has 15 years experience in the field of bioengineering and is an associate professor at Simpson University where he specializes in biology and chemistry. His over 50 science and engineering papers have been published in internationally recognized, peer-reviewed journals. Dr. Hooker has a son, aged 16, who developed normally but then regressed into autism after receiving Thimerosal-containing vaccines.", "opengraph": {"description": "PhD Scientist and Biochemist Reveals Hidden CDC Documents Showing Thimerosal In Vaccines Increase Neurologic Disorders. The CDC has been shunning the correlations between thimerosal and neurological disorders for a very long time. Although the FDA gave a two year deadline to remove the mercury based preservative from vaccines after the neurotoxin was banned in 1999, it still remains to this day in 60 percent of flu vaccines. A vaccine industry watchdog has now obtained CDC documents that show statistically significant risks of autism associated with the vaccine preservative, something the CDC denies even when confronted with their own data. For nearly", "title": "CDC Forced To Release Documents Showing They Knew Vaccine Preservative Causes Autism", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/cdc-forced-to-release-documents-showing-they-knew-vaccine-preservative-causes-autism-3/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-01-01T02:35:05-04:00", "article:modified_time": "2020-11-25T22:08:13-04:00", "updated_time": "2020-11-25T22:08:13-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://worldtruth.tv/wp-content/uploads/2014/02/thimerosal_bottle-1.jpg", "https://www.gpo.gov/fdsys/pkg/CREC-2003-05-21/pdf/CREC-2003-05-21-pt1-PgE1011-3.pdf", "http://www.hindawi.com/journals/jt/2012/373678/", "http://preventdisease.com/news/pdf/Thimerosal_Immune_System_Abnormalities.pdf", "https://worldtruth.tv/wp-content/uploads/2014/02/Caduceus-Entwining-Hypodermic-on-Mercury-Background.jpg", "http://www.prweb.com/releases/asot/thimerosal/prweb11598819.htm"], "authors": [""], "publish_date": "2019-01-01T02:35:05-04:00"}