{"result_id": "350011", "URL": "https://worldtruth.tv/merck-vaccine-fraud-exposed/", "timestamp": "2023-04-25 18:17:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/merck-vaccine-fraud-exposed/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Merck Vaccine Fraud Exposed", "cleaned_text": "According to two Merck scientists who filed a False Claims Act complaint in 2010 — a complaint which has just now been unsealed — vaccine manufacturer Merck knowingly falsified its mumps vaccine test data, spiked blood samples with animal antibodies, sold a vaccine that actually promoted mumps and measles outbreaks, and ripped off governments and consumers who bought the vaccine thinking it was “95% effective.”\n\nAccording to Stephen Krahling and Joan Wlochowski, both former Merck virologists, the Merck company engaged in all the following behavior:\n• In order to do this, Merck spiked the blood test with animal antibodies in order to artificially inflate the appearance of immune system antibodies. As reported in CourthouseNews.com:\n\nMerck also added animal antibodies to blood samples to achieve more favorable test results, though it knew that the human immune system would never produce such antibodies, and that the antibodies created a laboratory testing scenario that “did not in any way correspond to, correlate with, or represent real life … virus neutralization in vaccinated people,” according to the complaint. (www.courthousenews.com)\n• Merck then used the falsified trial results to swindle the U.S. government out of “hundreds of millions of dollars for a vaccine that does not provide adequate immunization.”\n• Merck’s vaccine fraud has actually contributed to the continuation of mumps across America, causing more children to become infected with mumps. (Gee, really? This is what NaturalNews has been reporting for years… vaccines are actually formulated to keep the outbreaks going because it’s great for repeat business!)\n• Merck used its false claims of “95 percent effectiveness” to monopolize the vaccine market and eliminate possible competitors.\n• The Merck vaccine fraud has been going on since the late 1990’s, say the Merck virologists.\n• Testing of Merck’s vaccine was never done against “real-world” mumps viruses in the wild. Instead, test results were simply falsified to achieve the desired outcome.\n• This entire fraud took place “with the knowledge, authority and approval of Merck’s senior management.”\n• Merck scientists “witnessed firsthand the improper testing and data falsification in which Merck engaged to artificially inflate the vaccine’s efficacy findings,” according to court documents (see below).\n\nUS government chose to ignore the 2010 False Claims Act!\n\nRather than taking action on this false claims act, the U.S. government simply ignored it, thereby protecting Merck’s market monopoly instead of properly serving justice. This demonstrates the conspiracy of fraud between the U.S. government, FDA regulators and the vaccine industry.\n\nChatom Primary Care sues Merck for Sherman Act monopolization, breach of warranty, violation of consumer protection laws\n\nFollowing the unsealing of this 2010 False Claims Act, Chatom Primary Care, based in Alabama, smelled something rotten. Three days ago, Chatom filed a lawsuit against Merck. That lawsuit record is available here:\n\n www.naturalnews.com\n\nIt alleges, among other shocking things:\n\n[Merck engaged in] …a decade-long scheme to falsify and misrepresent the true efficacy of its vaccine.\n\nMerck fraudulently represented and continues to falsely represent in its labeling and elsewhere that its Mumps Vaccine has an efficacy rate of 95 percent of higher.\n\nIn reality, Merck knows and has taken affirmative steps to conceal — by using improper testing techniques and falsifying test data — that its Mumps Vaccine is, and has been since at least 1999, far less than 95 percent effective.\n\nMerck designed a testing methodology that evaluated its vaccine against a less virulent strain of the mumps virus. After the results failed to yield Merck’s desired efficacy, Merck abandoned the methodology and concealed the study’s findings.\n\n…incorporating the use of animal antibodies to artificially inflate the results…\n\n…destroying evidence of the falsified data and then lying to an FDA investigator…\n\n…threatened a virologist in Merck’s vaccine division with jail if he reported the fraud to the FDA…\n\n…the ultimate victims here are the millions of children who every year are being injected with a mumps vaccine that is not providing them with an adequate level of protection. And while this is a disease that, according to the Centers for Disease Control (‘CDC’), was supposed to be eradicated by now, the failure in Merck’s vaccine has allowed this disease to linger, with significant outbreaks continuing to occur.\n\nChatom Primary Care also alleges that the fraudulent Merck vaccine contributed to the 2006 mumps outbreak in the Midwest, and a 2009 outbreak elsewhere. It says, “there has remained a significant risk of a resurgence of mumps outbreaks…”\n\nThis investigation is only beginning\n\nNaturalNews has only begun to investigate this incredible breaking news about Merck and the vaccine industry. We are pouring through the court documents to identify additional information that may be relevant to this case, and we plan to bring you that information soon.\n\nFor the record, Merck denies all allegations. Is anyone surprised?\n\n2010 False Claims Act against Merck, by two Merck virologists\n\n www.naturalnews.com", "opengraph": {"description": "Merck vaccine fraud exposed by two Merck virologists; company faked mumps vaccine efficacy results for over a decade, says lawsuit. According to two Merck scientists who filed a False Claims Act complaint in 2010 -- a complaint which has just now been unsealed -- vaccine manufacturer Merck knowingly falsified its mumps vaccine test data, spiked blood samples with animal antibodies, sold a vaccine that actually promoted mumps and measles outbreaks, and ripped off governments and consumers who bought the vaccine thinking it was '95% effective.' See that False Claims Act document at: www.naturalnews.com According to Stephen Krahling and Joan Wlochowski, both former", "title": "Merck Vaccine Fraud Exposed", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/merck-vaccine-fraud-exposed/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-05-22T15:02:00-04:00", "article:modified_time": "2020-06-05T05:43:26-04:00", "updated_time": "2020-06-05T05:43:26-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fmerck-vaccine-fraud-exposed%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fmerck-vaccine-fraud-exposed%2F&text=Merck+Vaccine+Fraud+Exposed", "#", "/cdn-cgi/l/email-protection#58672b2d3a323d3b2c65153d2a3b337d6a680e393b3b31363d7d6a681e2a392d3c7d6a681d2028372b3d3c7e3a373c2165153d2a3b337d6a682e393b3b31363d7d6a683e2a392d3c7d6a683d2028372b3d3c7d6a683a217d6a682c2f377d6a68153d2a3b337d6a682e312a3734373f312b2c2b7d6b1a7d6a683b3735283936217d6a683e39333d3c7d6a68352d35282b7d6a682e393b3b31363d7d6a683d3e3e313b393b217d6a682a3d2b2d342c2b7d6a683e372a7d6a68372e3d2a7d6a68397d6a683c3d3b393c3d7d6a1b7d6a682b39212b7d6a6834392f2b2d312c767d6a68193b3b372a3c31363f7d6a682c377d6a682c2f377d6a68153d2a3b337d6a682b3b313d362c312b2c2b7d6a682f30377d6a683e31343d3c7d6a68397d6a681e39342b3d7d6a681b343931352b7d6a68193b2c7d6a683b373528343931362c7d6a6831367d6a686a6869687d6a6875757d6a68397d6a683b373528343931362c7d6a682f30313b307d6a6830392b7d6a68322d2b2c7d6a6836372f7d6a683a3d3d367d6a682d362b3d39343d3c7d6a6875757d6a682e393b3b31363d7d6a683539362d3e393b2c2d2a3d2a7d6a68153d2a3b337d6a683336372f31363f34217d6a683e39342b313e313d3c7d6a68312c2b7d6a68352d35282b7d6a682e393b3b31363d7d6a682c3d2b2c7d6a683c392c397d6a1b7d6a682b2831333d3c7d6a683a3437373c7d6a682b393528343d2b7d6a682f312c307d6a683936313539347d6a6839362c313a373c313d2b7d6a1b7d6a682b37343c7d6a68397d6a682e393b3b31363d7d6a682c30392c7d6a68393b2c2d393434217d1b6a7d1968282a3735372c3d3c7d1b6a7d1968352d35282b7d6a6839363c7d6a68353d392b343d2b7d6a68372d2c3a2a3d39332b7d6a1b7d6a6839363c7d6a682a3128283d3c7d6a68373e3e7d6a683f372e3d2a36353d362c2b7d6a6839363c7d6a683b37362b2d353d2a2b7d6a682f30377d6a683a372d3f302c7d6a682c303d7d6a682e393b3b31363d7d6a682c3031363331363f7d6a68312c7d6a682f392b7d6a687d6a6a616d7d6a6d7d6a683d3e3e3d3b2c312e3d767d6a6a7d6a680b3d3d7d6a682c30392c7d6a681e39342b3d7d6a681b343931352b7d6a68193b2c7d6a683c373b2d353d362c7d6a68392c7d6b197d6a682f2f2f7636392c2d2a3934363d2f2b763b37357d6a68193b3b372a3c31363f7d6a682c377d6a680b2c3d28303d367d6a68132a39303431363f7d6a6839363c7d6a68123739367d6a680f34373b30372f2b33317d6a1b7d6a683a372c307d6a683e372a353d2a7d681c7d68197d681c7d68190a3d393c7815372a3d78103d2a3d62787d6a68302c2c282b7d6b197d6a1e7d6a1e2f372a343c2c2a2d2c30762c2e7d6a1e353d2a3b33752e393b3b31363d753e2a392d3c753d2028372b3d3c7d6a1e", "https://worldtruth.tv/wp-content/uploads/2012/06/9285704-large.jpg", "http://www.naturalnews.com/gallery/documents/Merck-False-Claims-Act.pdf", "http://www.courthousenews.com/2012/06/27/47851.htm", "https://worldtruth.tv/wp-content/uploads/2012/06/Nimg_11112416430C46D2-2.jpg", "http://www.naturalnews.com/gallery/documents/Chatom-Lawsuit-Merck-Mumps.pdf", "http://www.naturalnews.com/gallery/documents/Chatom-Lawsuit-Merck-Mumps.pdf", "http://www.naturalnews.com/gallery/documents/Merck-False-Claims-Act.pdf", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-05-22T15:02:00-04:00"}