{"result_id": "350020", "URL": "https://worldtruth.tv/science-paper-documents-the-depopulation-chemical-covertly-spiked-into-vaccines/", "timestamp": "2023-04-25 18:17:55 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/science-paper-documents-the-depopulation-chemical-covertly-spiked-into-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Science Paper Documents The Depopulation Chemical Covertly Spiked Into Vaccines", "cleaned_text": "Just days after the release of a jaw-dropping video lecture called the Science Agenda to Exterminate Blacks, a bombshell science paper has emerged that confirms the use of covert sterilization chemicals in World Health Organization vaccines deployed in Africa. Entitled, “HCG Found in WHO Tetanus Vaccine in Kenya Raises Concern in the Developing World,” the paper documents the covert deployment of an infertility chemical in vaccines that are administered to young black women in Kenya:\n\nOller, J.W., Shaw, C.A., Tomljenovic, L., Karanja, S.K., Ngare, W., Clement, F.M. and Pillette, J.R. (2017), HCG Found in WHO Tetanus Vaccine in Kenya Raises Concern in the Developing World. Open Access Library Journal, 4: e3937. doi.org/10.4236/oalib.1103937\n\nThe paper confirms exactly what Natural News reported earlier in the week: That a covert depopulation program is being run by the World Health Organization, targeting Africans for extermination via infertility chemicals administered under the guise of “vaccines.” These vaccines, notably, contain chemicals that are administered without the informed consent of the women being injected. In fact, the women are deliberately lied to and told the injections are meant to “protect your health.” But the real reason for the shots is to exterminate blacks in the name of “science” and “medicine.”\n\nI’ve detailed all this in this powerful one-hour lecture that’s already getting rave reviews across the ‘net. Watch the full lecture below for more coverage of race-targeted extermination efforts being waged today under the banners of “science” and “medicine.”\n\nGreenMedInfo nails it in story by Jafferey Jaxen\n\nA solid analysis of all this comes from Jafferey Jaxen writing for GreenMedInfo. That story, republished here with credit, is entitled, “CAUGHT: WHO’s Anti-fertility Vaccination Program Chronicled In New Paper.”\n\nHas the World Health Organization (WHO) been purposely misleading women in developing countries into thinking they are protecting them and their future children from tetanus while in fact robbing women of their fertility and the very children they wanted to protect?\n\nA highly concerning new paper has been published in The Open Access Library Journal titled, “HCG Found in WHO Tetanus Vaccine in Kenya Raises Concern in the Developing World.” The implications of the information contained within this paper, if true, have the potential to shift paradigms and threaten the hegemony of global organizations who are ostensibly concerned about the health and welfare of the world’s populations. What findings can threaten to do such a thing?\n\nTo understand the full breadth of the findings, it is first important to know some key historical facts. The World Health Organization was established in 1945 and immediately embraced the tenet of family planning, which was later referred to as “planned parenthood as a necessity for world health.”\n\nAround 1972, the WHO research program for developing a birth-control vaccine commenced. The WHO birth-control vaccine involved linking the tetanus toxoid (TT) with the beta portion of the human pregnancy hormone chorionic gonadotropin (hCG). This combination directs the immune system to produce antibodies not only against TT but also against hCG, causing miscarriages in already pregnant recipients and infertility in those not yet pregnant. The results were announced and celebrated by WHO researchers as the first “anti-fertility” vaccine in 1976 during a meeting of the US National Academy of Sciences.\n\nAround the same time, the US National Security Study Memorandum 200, also known as the Kissinger Report, became official US policy in 1975, calling for reducing the population grown in “less developed countries” to near zero by means of “reducing fertility.”\n\nFast forward to 2010 when Bill Gates, whose father headed up Planned Parenthood after WWII, and the Bill and Melinda Gates Foundation officially announced they would be committing $10 billion to help accomplish the WHO population reduction goals in part with “new vaccines.” One month later, Gates appeared in his now infamous Innovating to Zero TED talk where he made the statement:\n\n“The world today has 6.8 billion people. That’s headed up to about 9 billion. Now, if we do a really great job on new vaccines, healthcare, reproductive health services, we could lower that by, perhaps, 10 or 15 percent.”\n\nFast forward again to 2014 when the Kenya Conference of Bishops (KCCB) issued a press release that made mainstream news, alleging that the WHO was secretly using its birth-control vaccine during its anti-tetanus vaccination campaign in Kenya from 2013 to 2015. Was there proof, beyond the long history of questionable policies, statements, and actions by the WHO and its financier?\n\nThe new paper in The Open Access Library Journal by authors from the US, Canada, and Kenya lays out multiple smoking guns to back up the KCCB’s accusations from 2014.\n\nThe first of many smoking guns implicating the WHO in a mass sterilization program was found by conscientious health professionals working in conjunction with independent labs. The paper’s authors write:\n\n“Three independent Nairobi accredited biochemistry laboratories tested samples from vials of the WHO tetanus vaccine being used in March 2014 and found hCG where not should be present. In October 2014, 6 additional vials were obtained by Catholic doctors and were tested in 6 accredited laboratories. Again, hCG was found in half the samples.”\n\nAnother smoking gun was that the Kenya Ministry of Health and officials speaking on behalf of the WHO were to “eliminate maternal and neonatal tetanus” only. No males were vaccinated within the WHO’s campaign, and the target was only females between the ages of 12 to 49 years. Yet there is no good reason to attempt to prevent tetanus only in females of childbearing age, because males and older females can also develop tetanus from contaminated puncture wounds. Furthermore, maternal and neonatal tetanus following childbirth can be prevented by hygienic obstetric practices.\n\nThen the paper’s authors chronicle the third smoking gun: “Interestingly, the dosing schedule for the “tetanus” campaign in Kenya 2013-2015 was exactly the one set for the WHO birth-control conjugate containing TT/βhCG.” A typical vaccination schedule for neonatal tetanus prevention would have been different.\n\nWhistleblowers associated with the Catholic Church and pro-life groups have raised multiple suspicions since at least the early 1990s that the WHO was conducting anti-fertility campaigns under the guise of their worldwide projects to “eliminate maternal and neonatal tetanus.” If all these previous suspicions are also true, has the WHO been committing the same fraud many times over? Has the WHO been purposely misleading women in developing countries into thinking they are protecting them and their future children from tetanus while in fact robbing women of their fertility and the very children they wanted to protect? And what will stop them from doing so in the future?", "opengraph": {"description": "Just days after the release of a jaw-dropping video lecture called the Science Agenda to Exterminate Blacks, a bombshell science paper has emerged that confirms the use of covert sterilization chemicals in World Health Organization vaccines deployed in Africa. Entitled, “HCG Found in WHO Tetanus Vaccine in Kenya Raises Concern in the Developing World,” the paper documents the covert deployment of an infertility chemical in vaccines that are administered to young black women in Kenya: Oller, J.W., Shaw, C.A., Tomljenovic, L., Karanja, S.K., Ngare, W., Clement, F.M. and Pillette, J.R. (2017), HCG Found in WHO Tetanus Vaccine in Kenya Raises Concern", "title": "Science Paper Documents The Depopulation Chemical Covertly Spiked Into Vaccines", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/science-paper-documents-the-depopulation-chemical-covertly-spiked-into-vaccines/", "site_name": "WorldTruth.Tv", "article:published_time": "2020-04-11T12:56:00-04:00", "article:modified_time": "2020-04-22T08:43:34-04:00", "updated_time": "2020-04-22T08:43:34-04:00"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "640", "height": "360", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube.com/embed/JaF-fq2Zn7I\" width=\"640\" height=\"360\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "https://www.youtube.com/embed/JaF-fq2Zn7I"}], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fscience-paper-documents-the-depopulation-chemical-covertly-spiked-into-vaccines%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fscience-paper-documents-the-depopulation-chemical-covertly-spiked-into-vaccines%2F&text=Science+Paper+Documents+The+Depopulation+Chemical+Covertly+Spiked+Into+Vaccines", "#", "/cdn-cgi/l/email-protection#251a5650474f4046511876464c404b46400017157544554057001715614a465048404b5156001715714d400017156140554a55504944514c4a4b001715664d40484c464449001715664a53405751495c00171576554c4e40410017156c4b514a001715734446464c4b405603474a415c186f50565100171541445c560017154443514057001715514d40001715574049404456400017154a43001715440017154f44520841574a55554c4b42001715534c41404a00171549404651505740001715464449494041001715514d4000661700641576464c404b46400017156442404b4144001715514a001715605d514057484c4b445140001715674944464e5600176600171544001715474a4847564d40494900171556464c404b464000171555445540570017154d445600171540484057424041001715514d4451001715464a4b434c574856001715514d400017155056400017154a43001715464a53405751001715565140574c494c5f44514c4a4b001715464d40484c464449560017154c4b001715724a5749410017156d404449514d0017156a5742444b4c5f44514c4a4b001715534446464c4b4056001715414055494a5c40410017154c4b0017156443574c46440b001715604b514c51494041001766001715006017001d15001c666d6662001715634a504b410017154c4b001715726d6a001715714051444b5056001715734446464c4b400017154c4b0017156e404b5c4400171577444c564056001715664a4b4640574b0017154c4b001715514d4000171561405340494a554c4b42001715724a574941001766006017001d15001c61001715514d400017155544554057001715414a465048404b5156001715514d40001715464a53405751001715414055494a5c48404b510017154a43001715444b0017154c4b434057514c494c515c001715464d40484c4644490017154c4b001715534446464c4b4056001715514d44510017154457400017154441484c4b4c565140574041001715514a0017155c4a504b42001715474944464e001715524a48404b0017154c4b0017156e404b5c440016640017156a494940570017660017156f0b720b001766001715764d4452001766001715660b640b001766001715714a48494f404b4a534c46001766001715690b0017660017156e4457444b4f44001766001715760b6e0b0017660017156b42445740001766001715720b00176600171566494048404b51001766001715630b680b001715444b41001715754c4949405151400017660017156f0b770b00171500171d1715141200171c0017660017156d6662001715634a504b410017154c4b001715726d6a001715714051444b5056001715734446464c4b400017154c4b0017156e404b5c4400171577444c564056001715664a4b4640574b0015610015640015610015647740444105684a5740056d4057401f050017154d51515556001664001763001763524a574941515750514d0b515300176356464c404b464008554455405708414a465048404b515608514d40084140554a55504944514c4a4b08464d40484c46444908464a53405751495c0856554c4e4041084c4b514a08534446464c4b4056001763", "http://www.oalib.com/paper/pdf/5290033", "https://doi.org/10.4236/oalib.1103937", "http://www.greenmedinfo.com/blog/caught-whos-anti-fertility-vaccination-program-chronicled-new-paper", "http://www.oalib.com/paper/pdf/5290033", "http://www.pnas.org/content/73/1/218", "https://www.reuters.com/article/us-davos-vaccines/bill-gates-promises-10-billion-for-vaccines-idUSTRE60S3K420100129", "http://www.greenmedinfo.com/blog/tetanus-vaccines-sterilizing-women-kenya-catholic-church-there-raises-suspicions", "http://www.oalib.com/paper/pdf/5290033", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2020-04-11T12:56:00-04:00"}