{"result_id": "350021", "URL": "https://worldtruth.tv/gardasil-hpv-vaccines-found-contaminated-with-recombinant-dna-2/", "timestamp": "2023-04-25 18:17:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/gardasil-hpv-vaccines-found-contaminated-with-recombinant-dna-2/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Gardasil HPV Vaccines Found Contaminated With Recombinant DNA", "cleaned_text": "Gardasil HPV vaccines found contaminated with recombinant DNA that persists in human blood.\n\nIn seeking answers to why adolescent girls are suffering devastating health damage after being injected with HPV vaccines, SANE Vax, Inc decided to have vials of Gardasil tested in a laboratory. There, they found over a dozen Gardasil vaccine vials to be contaminated with rDNA of the Human Papillomavirus (HPV). The vials were purchased in the United States, Australia, New Zealand, Spain, Poland and France, indicating Gardasil contamination is a global phenomenon.\n\nThis means that adolescents who are injected with these vials are being contaminated with a biohazard — the rDNA of HPV. In conducting the tests, Dr. Sin Hang Lee found rDNA from both HPV-11 and HPV-18, which were described as “firmly attached to the aluminum adjuvant.”\n\nThat aluminum is also found in vaccines should be frightening all by itself, given that aluminum shouldneverbe injected into the human body (it’s toxic when ingested, and it specifically damages the nervous system). With the added discovery that the aluminum adjuvant also carries rDNA fragments of two different strains of Human Papillomavirus, this now reaches the level of a dangerous biohazard— something more like abiological weaponrather than anything resembling medicine.\n\nAs SANE Vax explains in its announcement, these tests were conducted after an adolescent girl experienced “acute onset Juvenile Rheumatoid Arthritis within 24 hours” of being injected with an HPV vaccine.\n\nThe rDNA that was found to be contaminating Gardasil is not “natural” rDNA from the HPV virus itself. Rather, it is agenetically engineeredform of HPV genetic code that is added to the vaccines during their manufacture.\n\nAs Dr. Lee, the pathologist who ran the laboratory tests identifying the biohazard contamination of Gardasil said:\n\n“Natural HPV DNA does not remain in the bloodstream for very long. However, the HPV DNA in Gardasil is not ‘natural’ DNA. It is a recombinant HPV DNA (rDNA) — genetically engineered — to be inserted into yeast cells for VLP (virus-like-particle) protein production. rDNA is known to behave differently from natural DNA. It may enter a human cell, especially in an inflammatory lesion caused by the effects of the aluminum adjuvant, via poorly understood mechanisms. Once a segment of recombinant DNA is inserted into a human cell, the consequences are hard to predict. It may be in the cell temporarily or stay there forever, with or without causing a mutation. Now the host cell contains human DNA as well as genetically engineered viral DNA.”\n\n“Once a segment of recombinant DNA is inserted into a human cell, the consequences are hard to predict. It may be in the cell temporarily or stay there forever, with or without causing a mutation. Now the host cell contains human DNA as well as genetically engineered viral DNA.”\n\nThe vaccine industry, of course, has a long and dark history of its vaccines being contaminated with cancer-causing viruses and other frightening contaminants. Watch this astounding video of Merck scientist Dr. Hilleman openly admitting that polio vaccines were widely contaminated with SV40 viruses that cause cancer.\n\nIt’s called “Merck vaccine scientist admits presence of SV40 and AIDS in vaccines – Dr. Maurice Hilleman” and was partially narrated by Dr. Len Horowitz. You can view the full transcript of this extraordinary interview at: naturalnews.com\n\nIf you thought vaccines were safe, think again.Get informed. Learn the truth, and please share this story so that others may also be informed.\n\nListen up, folks: Why do you think the vaccine industry pushed so hard for total financial immunity under the government’s vaccine injury compensation plan? Because they knew that if the truth ever got out about how many cases of cancer, autism and even death were truly caused by vaccines,they would be financially wiped out!\n\n47 girls have died so far after receiving HPV vaccinations, and some 12,000 others have been adversely affected according to reports. Yet, the HPV vaccines, Gardasil (and Cervarix abroad), has not been proven to prevent cervical cancer. Crazy? It gets worse. Despite the FDA’s own research, Gardasil shots are being mandated by more and more gov’t agencies as a requirement for young girls to enter 6th grade. How many more will be forced to suffer, or die, before this is stopped?", "opengraph": {"description": "Gardasil HPV vaccines found contaminated with recombinant DNA that persists in human blood. In seeking answers to why adolescent girls are suffering devastating health damage after being injected with HPV vaccines, SANE Vax, Inc decided to have vials of Gardasil tested in a laboratory. There, they found over a dozen Gardasil vaccine vials to be contaminated with rDNA of the Human Papillomavirus (HPV). The vials were purchased in the United States, Australia, New Zealand, Spain, Poland and France, indicating Gardasil contamination is a global phenomenon. This means that adolescents who are injected with these vials are being contaminated with a biohazard --", "title": "Gardasil HPV Vaccines Found Contaminated With Recombinant DNA", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/gardasil-hpv-vaccines-found-contaminated-with-recombinant-dna-2/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-06-09T00:22:02-04:00", "article:modified_time": "2019-06-10T10:28:48-04:00", "updated_time": "2019-06-10T10:28:48-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fgardasil-hpv-vaccines-found-contaminated-with-recombinant-dna-2%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fgardasil-hpv-vaccines-found-contaminated-with-recombinant-dna-2%2F&text=Gardasil+HPV+Vaccines+Found+Contaminated+With+Recombinant+DNA", "#", "/cdn-cgi/l/email-protection#516e2224333b3432256c163023353022383d74636119010774636107303232383f3422746361173e243f35746361123e3f25303c383f30253435746361063825397463610334323e3c33383f303f25746361151f1077333e35286c163023353022383d74636119010774636127303232383f3422746361373e243f35746361323e3f25303c383f30253435746361263825397463612334323e3c33383f303f25746361151f10746361253930257463612134232238222522746361383f74636139243c303f746361333d3e3e357f746361183f7463612234343a383f36746361303f2226342322746361253e74636126392874636130353e3d342232343f257463613638233d22746361302334746361222437373423383f367463613534273022253025383f367463613934303d253974636135303c30363474636130372534237463613334383f36746361383f3b34322534357463612638253974636119010774636127303232383f342274631274636102101f14746361073029746312746361183f3274636135343238353435746361253e746361393027347463612738303d227463613e37746361163023353022383d746361253422253435746361383f746361307463613d30333e2330253e23287f746361053934233474631274636125393428746361373e243f357463613e27342374636130746361353e2b343f746361163023353022383d74636127303232383f347463612738303d22746361253e7463613334741263741061323e3f25303c383f302534357463612638253974636123151f107463613e3774636125393474636119243c303f746361013021383d3d3e3c3027382324227412637410617463691901077463687f7463610539347463612738303d2274636126342334746361212423323930223435746361383f746361253934746361043f382534357463610225302534227463127463611024222523303d38307463127463611f34267463610b34303d303f35746312746361022130383f746312746361013e3d303f35746361303f357463611723303f3234746312746361383f3538323025383f36746361163023353022383d746361323e3f25303c383f3025383e3f746361382274636130746361363d3e33303d7463612139343f3e3c343f3e3f7f746361053938227463613c34303f227463612539302574636130353e3d342232343f252274636126393e746361302334746361383f3b34322534357463612638253974636125393422347463612738303d227463613023347463613334383f36746361323e3f25303c383f30253435746361263825397463613074636133383e39302b3023357463617c7c74611574611074611574611003343035711c3e233471193423346b717463613925252122746210746317746317263e233d3525232425397f2527746317363023353022383d7c3921277c27303232383f34227c373e243f357c323e3f25303c383f302534357c263825397c2334323e3c33383f303f257c353f307c63746317", "https://worldtruth.tv/wp-content/uploads/2011/11/Vaccine_Syringe2.jpg", "https://worldtruth.tv/wp-content/uploads/2011/11/gardasil3_biohazard.jpg", "https://worldtruth.tv/wp-content/uploads/2011/12/GARDASIL_syringe-632x470.jpg", "https://worldtruth.tv/wp-content/uploads/2011/11/Gardasil-2-650x4381.jpg", "http://www.naturalnews.com/033584_Dr_Maurice_Hilleman_SV40.html", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-06-09T00:22:02-04:00"}