{"result_id": "350018", "URL": "https://worldtruth.tv/secret-government-documents-reveal-vaccines-to-be-a-total-hoax/", "timestamp": "2023-04-25 18:17:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/secret-government-documents-reveal-vaccines-to-be-a-total-hoax/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Secret Government Documents Reveal Vaccines To Be A Total Hoax", "cleaned_text": "If you have children, you are more than likely already aware of the official U.S. Centers for Disease Control and Prevention (CDC) “Immunization Schedules,” which today recommend an astounding 29 vaccines be given between birth and six years of age, including yearly flu shots, as well as another five to 16 vaccines between ages seven and 18 (www.cdc.gov). But a recent investigative report compiled by Dr. Lucija Tomljenovic, Ph.D., uncovers more than 30 years of hidden government documents exposing these vaccine schedules as a complete hoax, not to mention the fraud of the vaccines themselves to provide any real protection against disease.\n\nThough her paper focuses primarily on the British health system’s elaborate cover-up of the dirty truth about its own national vaccination program, the tenets of the study’s findings still apply to vaccination schedules in general, which are typically designed for the purpose of serving corporate interests rather than public health. Government authorities, it turns out, in an ongoing bid to satisfy the private goals of the vaccine industry, have deliberately covered up pertinent information about the dangers and ineffectiveness of vaccines from parents in order to maintain a high rate of vaccination compliance. And in the process, they have put countless millions of children at risk of serious side effects and death.\n\nHiding the truth and covering up data to encourage vaccine compliance\n\nThrough several Freedom of Information Act (FOIA) requests, Dr. Tomljenovic was able to obtain transcripts of private meetings that were held between the Joint Committee on Vaccination and Immunization (JCVI), a so-called “independent expert advisory committee” that makes recommendations to the government about vaccine policy, and various British health ministers over the years. And after poring through this plethora of information, which had previously been veiled from public view, Dr. Tomljenovic made some disturbing discoveries.\n\n“[T]he JCVI (Joint Committee on Vaccination and Immunization) made continuous efforts to withhold critical data on severe adverse reactions and contraindications to vaccinations to both parents and health practitioners in order to reach overall vaccination rates which they deemed were necessary for ‘herd immunity,’ a concept which … does not rest on solid scientific evidence,” explains Dr. Tomljenovic in the introduction to her paper.\n\n“Official documents obtained from the U.K. Department of Health (DH) and the JCVI reveal that the British health authorities have been engaging in such practice for the last 30 years, apparently for the sole purpose of protecting the national vaccination program.”\n\nThese are some strong accusations, but the information Dr. Tomljenovic gathered speaks for itself. Not only did the JCVI routinely ignore questions of safety as they came up with regards to the ever-expanding vaccination schedule, but the group actively censored unfavorable data that shed a “negative” light on vaccines in order to maintain the illusion that vaccines are safe and effective. Beyond this, the JCVI regularly lied to both the public and government authorities about vaccine safety in order to ensure that people continued to vaccinate their kids.\n\nJCVI was fully aware of MMR vaccine dangers as early as 1989, but covered them up\n\nBeginning on page three of her report, Dr. Tomljenovic begins outlining the sordid details of meetings held as early as 1981 where the JCVI clearly engaged in fraud, cover-up, and lies about vaccines to protect the vaccine industry, not children, from harm. Minutes from these meetings reveal that the JCVI actively tried to cover up severe side effects associated with common vaccines like measles and whooping cough (pertussis), both of which were clearly linked at the time to causing severe brain damage in a substantial percentage of the children that received them.\n\nOf particular concern was how the JCVI handled unfavorable data on the controversial MMR vaccine for measles, mumps, and rubella. 10 years before Dr. Andrew Wakefield published his study on MMR in The Lancet, JCVI was already fully aware that the National Institute for Biological Standards and Control (NIBSC) had identified a clear link between MMR and vaccine-induced meningitis and encephalitis. But rather than come forward with this information and call for further safety assessments on the vaccine, the JCVI instead censored this critical information from the public, and blatantly lied about the safety of MMR for years.\n\n“The extent of the JCVI’s concerns with the implications of scientific assessment of vaccine safety on vaccine policy explains why they were opposed to any long-term surveillance for severe neurological disorders following vaccination,” writes Dr. Tomljenovic. “[I]nstead of re-evaluating the vaccination policy, at least until safety concerns were fully evaluated, the JCVI chose to support the existing policy based on incomplete evidence that was available at that time.”\n\nIn other words, the JCVI was more concerned with protecting the reputation of the dangerous MMR vaccine, as well as many other questionable vaccines, than with protecting children from sustaining serious injuries as a result of getting the jabs. As far as the MMR vaccine is concerned, this critical piece of information not only reinforces the legitimacy of Dr. Wakefield’s findings from 10 years later, which were illegitimately declared to be fraudulent by the establishment, but also illustrates just how painfully long this scam has been taking place.\n\nIf this is not bad enough, Dr. Tomljenovic also drudged up copious amounts of information on the JCVI’s longtime habit of encouraging vaccine companies to deliberately alter their data sheets in order to make dangerous and ineffective vaccines appear safe and effective, in accordance with their recommendations. When the JCVI’s guidance contraindications for MMR, for instance, did not match those of the vaccine’s manufacturer, JCVI apparently instructed the manufacturer to alter its data sheets to avoid “legal problems.”\n\nSimilarly, the JCVI’s official policy was to cherry-pick unreliable studies to support its own opinions on vaccines rather than rely on independent, scientifically-sound studies to make vaccine policy recommendations. Once again, the JCVI’s position on the safety and effectiveness of MMR is an excellent example of this, as the group flat out ignored legitimate MMR studies in favor of industry-backed junk studies like the infamous 2005 Cochrane Review, which technically proves nothing about the alleged safety of MMR because the 31 studies it evaluated did not even meet the group’s basic methodological criteria.\n\n“Over the years, the JCVI has consistently promoted the MMR vaccine as safe, based on studies that have been proven to be either irrelevant, inconclusive, or methodologically questionable,” explains Dr. Tomljenovic, adding that the JCVI routinely chose to rely on flawed epidemiological studies that only identified “association” rather than “causation,” a rather ironic inaccuracy in light of how scrutinizing the establishment typically is of studies that contradict its own positions.\n\nThe eye-opening, 45-page paper goes on to explain how vaccine schedules were established through the calculated downplaying of vaccine safety concerns and the over-inflating of vaccine benefits; the promotion of dangerous new vaccines into the pediatric schedule through deception; the discouraging of vaccine safety follow-up studies; and the widespread brainwashing of the public through manipulation and scientific sleight-of-hand tricks.", "opengraph": {"description": "If you have children, you are more than likely already aware of the official U.S. Centers for Disease Control and Prevention (CDC) 'Immunization Schedules,' which today recommend an astounding 29 vaccines be given between birth and six years of age, including yearly flu shots, as well as another five to 16 vaccines between ages seven and 18 (www.cdc.gov). But a recent investigative report compiled by Dr. Lucija Tomljenovic, Ph.D., uncovers more than 30 years of hidden government documents exposing these vaccine schedules as a complete hoax, not to mention the fraud of the vaccines themselves to provide any real protection against disease. Though her", "title": "Secret Government Documents Reveal Vaccines To Be A Total Hoax", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/secret-government-documents-reveal-vaccines-to-be-a-total-hoax/", "site_name": "WorldTruth.Tv", "article:published_time": "2018-11-05T01:00:45-04:00", "article:modified_time": "2018-11-12T09:22:42-04:00", "updated_time": "2018-11-12T09:22:42-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fsecret-government-documents-reveal-vaccines-to-be-a-total-hoax%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fsecret-government-documents-reveal-vaccines-to-be-a-total-hoax%2F&text=Secret+Government+Documents+Reveal+Vaccines+To+Be+A+Total+Hoax", "#", "/cdn-cgi/l/email-protection#5a65292f38303f392e67093f39283f2e7f686a1d352c3f2834373f342e7f686a1e35392f373f342e297f686a083f2c3f3b367f686a0c3b393933343f297f686a0e357f686a183f7f686a1b7f686a0e352e3b367f686a12353b227c38353e2367133c7f686a23352f7f686a323b2c3f7f686a393233363e283f347f68197f686a23352f7f686a3b283f7f686a3735283f7f686a2e323b347f686a3633313f36237f686a3b36283f3b3e237f686a3b2d3b283f7f686a353c7f686a2e323f7f686a353c3c3339333b367f686a0f7409747f19687f1b6a193f342e3f28297f686a3c35287f686a1e33293f3b293f7f686a1935342e2835367f686a3b343e7f686a0a283f2c3f342e3335347f19687f1b6a7f6862191e197f68637f686a7f68681337372f3433203b2e3335347f686a0939323f3e2f363f297f68197f68687f686a2d323339327f686a2e353e3b237f686a283f393537373f343e7f686a3b347f686a3b292e352f343e33343d7f686a68637f686a2c3b393933343f297f686a383f7f686a3d332c3f347f686a383f2e2d3f3f347f686a3833282e327f686a3b343e7f686a2933227f686a233f3b28297f686a353c7f686a3b3d3f7f68197f686a333439362f3e33343d7f686a233f3b2836237f686a3c362f7f686a2932352e297f68197f686a3b297f686a2d3f36367f686a3b297f686a3b34352e323f287f686a3c332c3f7f686a2e357f686a6b6c7f686a2c3b393933343f297f686a383f2e2d3f3f347f686a3b3d3f297f686a293f2c3f347f686a3b343e7f686a6b627f686a7f68622d2d2d74393e39743d352c7f6863747f686a182f2e7f686a3b7f686a283f393f342e7f686a33342c3f292e333d3b2e332c3f7f686a283f2a35282e7f686a3935372a33363f3e7f686a38237f686a1e28747f686a162f3933303b7f686a0e353736303f34352c33397f68197f686a0a32741e747f68197f686a2f3439352c3f28297f686a3735283f7f686a2e323b347f686a696a7f686a233f3b28297f686a353c7f686a32333e3e3f347f686a3d352c3f2834373f342e7f686a3e35392f373f342e297f686a3f222a352933343d7f686a2e323f293f7f686a2c3b393933343f7f686a2939323f3e2f363f297f686a3b297f686a3b7f686a3935372a363f2e3f7f686a32353b227f68197f686a34352e7f686a2e357f686a373f342e3335347f686a2e323f7f686a3c283b2f3e7f686a353c7f686a2e323f7f686a2c3b393933343f297f686a2e323f37293f362c3f297f686a2e357f686a2a28352c333e3f7f686a3b34237f686a283f3b367f19687f1b6a2a28352e3f392e3335347f686a3b3d3b3334292e7f19687f1b6a3e33293f3b293f747f686a0e32352f3d327f686a323f287f6a1e7f6a1b7f6a1e7f6a1b083f3b3e7a1735283f7a123f283f607a7f686a322e2e2a297f691b7f681c7f681c2d3528363e2e282f2e32742e2c7f681c293f39283f2e773d352c3f2834373f342e773e35392f373f342e2977283f2c3f3b36772c3b393933343f29772e3577383f773b772e352e3b367732353b227f681c", "https://worldtruth.tv/secret-government-documents-reveal-vaccines-to-be-a-total-hoax/vaccinations/", "https://www.cdc.gov/vaccines/schedules/", "http://www.naturalnews.com/038598_vaccines_medical_hoax_government_documents.html#ixzz2HPLWLfE9", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2018-11-05T01:00:45-04:00"}