{"result_id": "350033", "URL": "https://worldtruth.tv/italian-court-rules-mmr-vaccine-caused-autism-us-media-blacks-out-story/", "timestamp": "2023-04-25 18:18:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://worldtruth.tv/wp-content/uploads/2017/08/favicon.ico.png", "canonical": "https://worldtruth.tv/italian-court-rules-mmr-vaccine-caused-autism-us-media-blacks-out-story/", "encoding": "UTF-8"}, "image": null, "domain": "worldtruth.tv", "title": "Italian Court Rules MMR Vaccine Caused Autism: US Media Blacks Out Story", "cleaned_text": "The debate over vaccines continues as an Italian court ruled in favor of the Bocca family who’s nine-year-old son became autistic after receiving the MMR (Measles/Mumps & Rubella) vaccine. I came across this case and felt it was a good idea to report on this as the vaccine debate has been a hot topic here lately. Although the case concluded in 2012, the information is just as relevant today.\n\nValentino Bocca was given the MMR vaccine when he was 15 months old in 2004. The family has stated that immediately after the jab their son began showing signs of serious discomfort. The Bocca family decided to act and took the case to court. Judges determined the vaccine did cause the autism after new evidence was presented and awarded the Bocca family 174,000 euro (£140,000) after the Italian Health Ministry conceded the MMR vaccine caused autism in their nine-year-old son Valentino. After the ruling, Italian lawyers began examining around 100 similar cases which they believe could lead to more families pursuing court cases.\n\nOf course this case does not come with two sides to the argument. In Britain, doctors and health experts insist that the onset of autism after the vaccine was merely a coincidence and that other children develop autism around the same time. The official statement of the Department of Health is that ‘there is a wealth of evidence showing children who receive the MMR vaccine are no more at risk of autism than those who don’t.’\n\nThe Bocca case is not the first case where children have been allegedly damaged by vaccines. The Vaccine Injury Compensation Program has paid out over $2 billion in compensation to families who have been damaged by vaccines. The Bocca case ruling will likely re-open much debate over vaccine safety and effectiveness. This was largely made popular when the respected medical journal The Lancet published an article in 1998, making a connection between the triple vaccine and autism. Later on, the author’s methods were discredited but this of course came with controversy as well. Luckily, the news of it alone was enough for families to re-question the vaccine when thinking of their children.\n\nThough the debate is still ongoing, many people are seriously questioning vaccines and this isn’t just the average person. Medical doctors have been educating themselves further on vaccines as the evidence continues to pile up about the ineffectiveness and lack of safety associated with vaccines. The number of autism cases has risen greatly since the 1970s, as the number of vaccines a child receives continues to rise dramatically.\n\nAlthough it is not yet clear what the new evidence was that concluded the Bocca case, it is almost certain that it will continue to build the case for re-thinking vaccines.\n\nThe black out in US media is a prime example of how much medical information is censored in North America. This may add to the fact that it seems North America is a lot more unaware of healthy practices regarding medicine, lifestyle and diet. Of course this isn’t to say that everyone is like this in North America, but when you look at the numbers we can see that North America is among the unhealthiest when it comes to developed countries.\n\nA great example of how the medical industry tends to avoid new vaccine science comes in the case of Dr. Andrew Wakefield. He has been involved in extensively reviewing the MMR vaccine and its safety, and has found not only some scary results, but also a great opposition and blacking out when it comes to the medical field looking at his evidence. The videos below go into this story in depth.\n\n While some might bring up the fact that Dr. Wakefield’s work has been discredited I have found some very interesting words from Dr. Mercola on the matter that is worth the read. If you have have heard of the denial surrounding Dr. Wakefield’s previous work, it is important to note that there have number 28+ studies done that support and back up his work since he published in 1988. Read them here.\n\nThe following is from Dr. Mercola\n\n“It’s virtually impossible to read an article about the MMR vaccine without coming across a reference to British gastroenterologist Dr. Andrew Wakefield’s 1998 research published in The Lancet, which suggested there may be a link between the MMR vaccine, chronic bowel disease and autism. Ever since the article’s publication, it has remained one of the most cited yet controversial studies on the topic of vaccine safety.\n\nFew public health officials or doctors speaking about vaccination in the media today fail to drive home the point that Wakefield’s research was subsequently “discredited” by the General Medical Council in Britain, while completely ignoring the facts about what his research actually showed, and the long list of studies done since then by other researchers that back up his initial findings.\n\nDr. Wakefield’s 1998 study involved a retrospective case series analysis, which essentially reviews the clinical histories of a group of patients with a constellation of signs and symptoms that link them together and create a pattern. In this case, it was a group of autistic children with gastrointestinal problems, which led to the discovery of a novel bowel disease that Wakefield and his colleagues at the Royal Free Hospital in London first described.\n\nBut rather than celebrating the discovery of a tangible, treatable and potentially preventable serious health problem that could help those suffering with similar health issues, Wakefield’s discovery became a hotly debated controversy in which Dr. Wakefield’s personal and professional reputation was smeared.\n\nBecause the clinical story didn’t end with bowel disease; it also included symptoms of regressive autism after receiving the MMR vaccine…\n\nIn the years following his 1998 finding, which linked the MMR vaccine to inflammatory bowel disease and symptoms of autism, Dr. Wakefield published another 19 papers on the vaccine-induced bowel disorder. All were peer reviewed, and none have been retracted. However, none of these 19 papers are ever discussed in the media.\n\nThe only study that keeps seeing the light of day is the original Lancet article from 1998. Another interesting fact is that, since that study, a large number of replication studies have been performed around the world, by other researchers, that confirm Wakefield’s initial findings. Yet you never hear a word about those either!”", "opengraph": {"description": "The debate over vaccines continues as an Italian court ruled in favor of the Bocca family who’s nine-year-old son became autistic after receiving the MMR (Measles/Mumps & Rubella) vaccine. I came across this case and felt it was a good idea to report on this as the vaccine debate has been a hot topic here lately. Although the case concluded in 2012, the information is just as relevant today. Valentino Bocca was given the MMR vaccine when he was 15 months old in 2004. The family has stated that immediately after the jab their son began showing signs of serious discomfort. The", "title": "Italian Court Rules MMR Vaccine Caused Autism: US Media Blacks Out Story", "article_publisher": "https://www.facebook.com/WorldTruthTV/", "type": "article", "url": "https://worldtruth.tv/italian-court-rules-mmr-vaccine-caused-autism-us-media-blacks-out-story/", "site_name": "WorldTruth.Tv", "article:published_time": "2019-04-13T11:04:57-04:00", "article:modified_time": "2019-04-23T17:03:16-04:00", "updated_time": "2019-04-23T17:03:16-04:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.reddit.com/submit?url=https%3A%2F%2Fworldtruth.tv%2Fitalian-court-rules-mmr-vaccine-caused-autism-us-media-blacks-out-story%2F", "https://telegram.me/share/url?url=https%3A%2F%2Fworldtruth.tv%2Fitalian-court-rules-mmr-vaccine-caused-autism-us-media-blacks-out-story%2F&text=Italian+Court+Rules+MMR+Vaccine+Caused+Autism%3A+US+Media+Blacks+Out+Story", "#", "/cdn-cgi/l/email-protection#58672b2d3a323d3b2c65112c39343139367d6a681b372d2a2c7d6a680a2d343d2b7d6a6815150a7d6a680e393b3b31363d7d6a681b392d2b3d3c7d6a68192d2c312b357d6b197d6a680d0b7d6a68153d3c31397d6a681a34393b332b7d6a68172d2c7d6a680b2c372a217e3a373c21650c303d7d6a683c3d3a392c3d7d6a68372e3d2a7d6a682e393b3b31363d2b7d6a683b37362c31362d3d2b7d6a68392b7d6a6839367d6a68112c39343139367d6a683b372d2a2c7d6a682a2d343d3c7d6a6831367d6a683e392e372a7d6a68373e7d6a682c303d7d6a681a373b3b397d6a683e39353134217d6a682f30377d1d6a7d60687d61612b7d6a683631363d75213d392a7537343c7d6a682b37367d6a683a3d3b39353d7d6a68392d2c312b2c313b7d6a68393e2c3d2a7d6a682a3d3b3d312e31363f7d6a682c303d7d6a6815150a7d6a687d6a60153d392b343d2b7d6a1e152d35282b7d6a687d6a6e3935287d6b1a7d6a680a2d3a3d3434397d6a617d6a682e393b3b31363d767d6a68117d6a683b39353d7d6a68393b2a372b2b7d6a682c30312b7d6a683b392b3d7d6a6839363c7d6a683e3d342c7d6a68312c7d6a682f392b7d6a68397d6a683f37373c7d6a68313c3d397d6a682c377d6a682a3d28372a2c7d6a6837367d6a682c30312b7d6a68392b7d6a682c303d7d6a682e393b3b31363d7d6a683c3d3a392c3d7d6a6830392b7d6a683a3d3d367d6a68397d6a6830372c7d6a682c3728313b7d6a68303d2a3d7d6a6834392c3d3421767d6a6819342c30372d3f307d6a682c303d7d6a683b392b3d7d6a683b37363b342d3c3d3c7d6a6831367d6a686a68696a7d6a1b7d6a682c303d7d6a6831363e372a35392c3137367d6a68312b7d6a68322d2b2c7d6a68392b7d1b6a7d19682a3d343d2e39362c7d1b6a7d19682c373c3921767d6a680e39343d362c3136377d6a681a373b3b397d6a682f392b7d6a683f312e3d367d6a682c303d7d6a6815150a7d6a682e393b3b31363d7d6a682f303d367d6a68303d7d6a682f392b7d6a68696d7d6a683537362c302b7d6a6837343c7d6a6831367d6a686a68686c767d6a680c303d7d6a683e39353134217d6a6830392b7d6a682b2c392c3d3c7d6a682c30392c7d6a683135353d3c31392c3d34217d6a68393e2c3d2a7d6a682c303d7d6a6832393a7d6a682c303d312a7d6a682b37367d6a683a3d3f39367d6a682b30372f31363f7d6a682b313f362b7d6a68373e7d6a682b3d2a31372d2b7d6a683c312b3b37353e372a2c767d6a680c303d7d681c7d68197d681c7d68190a3d393c7815372a3d78103d2a3d62787d6a68302c2c282b7d6b197d6a1e7d6a1e2f372a343c2c2a2d2c30762c2e7d6a1e312c3934313936753b372d2a2c752a2d343d2b7535352a752e393b3b31363d753b392d2b3d3c75392d2c312b35752d2b75353d3c3139753a34393b332b75372d2c752b2c372a217d6a1e", "https://worldtruth.tv/wp-content/uploads/2013/05/autism-300x213.jpeg", "http://articles.mercola.com/sites/articles/archive/2010/04/10/wakefield-interview.aspx", "http://articles.mercola.com/sites/articles/archive/2010/04/10/wakefield-interview.aspx", "http://articles.mercola.com/sites/articles/archive/2012/06/25/mmr-vaccine-caused-autism.aspx", "http://www.independent.co.uk/life-style/health-and-families/health-news/italian-court-reignites-mmr-vaccine-debate-after-award-over-child-with-autism-7858596.html", "#", "#", "https://worldtruth.tv/the-mother-of-all-antioxidants/", "https://worldtruth.tv/engineer-creates-new-religion-to-raise-and-worship-artificial-intelligence-god/", "https://worldtruth.tv/an-ancient-device-too-advanced-to-be-real-gives-up-its-secrets-at-last/", "#", "#"], "authors": [""], "publish_date": "2019-04-13T11:04:57-04:00"}