{"result_id": "351017", "URL": "http://admin.worldviewweekend.com/news/article/former-pfizer-employee-and-whistleblower-reveals-horrifying-new-patent-will-connect", "timestamp": "2023-04-25 18:19:32 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "http://admin.worldviewweekend.com/news/article/former-pfizer-employee-and-whistleblower-reveals-horrifying-new-patent-will-connect", "encoding": "utf-8"}, "image": null, "domain": "admin.worldviewweekend.com", "title": "Former Pfizer Employee and Whistleblower Reveals 'Horrifying' New Patent That Will Connect Vaxxed People to AI-Powered Algorithms And Track Where You Go and Who You Are With | Worldview Weekend Broadcast Network", "cleaned_text": "The United States government is quietly cooperating with a 38-nation international organization to train the U.S. population for the \"appropriate\" human interaction with artificial intelligence in a plan that will ultimately connect people's bodies together in \"networks,\" tracking and monitoring them via an internet connection.\n\nKaren Kingston, a former Pfizer employee, consultant to the pharmaceutical industry and mega-whistleblower, in a bombshell interview with Brannon Howse Live, exposed a recently approved U.S. patent that proves there is more to the government's obsession with getting every man, woman and child injected than just an attempt to inoculate against a virus.\n\nKingston revealed that the U.S. Department of Defense and the U.S. Department of State are involved in research and propaganda efforts driven by a desire to merge humans with machines, the very essence of transhumanism.\n\nSo far, 90 percent of the Covid \"vaccines,\" which use advanced gene-based technology to deliver a toxic spike protein to human cells, have been deployed in 10 nations within the mostly Western or \"free world.\"\n\nThose are the same nations being targeted for death and ill-health, Kingston said.\n\nAnd the health impact of the injections are being tracked by the Joint Artificial Intelligence Center [JAIC], a little-known sub-agency within the U.S. Department of Defense.\n\n\"And they did a specific analysis on those 65 and older and came up with algorithms on who should be injected and who should be given the booster,\" Kingston said. \"So, you have to wonder, why was that happening?\"\n\nKingston thinks she's found the answer. It lies in Patent Number 20210082583, applied for in March 2021 and granted on Aug. 31, 2021.\n\nThe abstract for this patent application says this technology is applicable to all currently available Covid vaccines, and describes a situation in which injected persons are wirelessly connected with apps and servers.\n\n\"I think people are going to be horrified at what's in this patent: To use vaccines, to use advanced technologies to create user IDs, and you are then able to share that data with other people on your network who have this artificial intelligence in them and then it would go to a server and to apps,\" Kingston said.\n\nIn fact, the U.S. government is already prepared for integrating into American society existing technology that will connect people's bodies to the internet and allow them to interface with artificial intelligence.\n\nJust last week, on Oct. 5, U.S. Secretary of State Antony Blinken traveled to Paris to address a conference of the Organization for Economic Cooperation and Development. This is the international body, made up of 38 member states, that has taken upon itself to draft rules and set standards for how humans interact with artificial intelligence.\n\nBlinken, in his Paris speech, revealed that the Biden administration is working to place the U.S. and its entire population under the authority of this global body.\n\nShould anyone think this sounds too much like science fiction, Kingston cited another patent, Number 20120265001, for a \"composite magnetic nanoparticle drug delivery system for targeted controlled release of therapies.\"\n\n\"And the images in this patent match up to the images that physicians have seen when they see this material [from the Covid serum] reflecting light in this pattern [under a microscope].\"\n\nThere are four lipids that make up the lipid nanoparticles to release the spike protein, she said.\n\nThe international organization Blinken addressed on Oct. 5, the OECD, issued a joint statement on artificial intelligence.\n\nIn June 2019, the 38 member countries of the OECD agreed on a set of AI principles.\n\n\"Karen, they have a commitment, if you listen to Blinken continue on in his speech, he talks about them being a 38-member group, not the U.S., and every time they mention AI they say it's trustworthy,\" said Howse. \"...And part of their initiative is to get 70 percent of the world vaccinated by 2022, and Biden has committed to this as well.\"\n\nOn Oct. 8, the OECD announced a deal to create a minimum 15-percent global tax on corporations to support the new digital economy, to which 136 nations, including the United States, agreed. This is supposed to address the \"tax challenges\" of a globalized digital economy, according to the OECD website, OECD.org,\n\n\"The two-pillar solution will be delivered to the G20 Finance Ministers meeting in Washington D.C. on 13 October, then to the G20 Leaders' Summit in Rome at the end of the month,\" states the OECD document on the global tax.\n\nSignature countries are aiming to sign a multilateral convention on the global tax in 2022. And the Biden administration is fully on board, as stated by Blinken.\n\n\"A shared approach on taxation will end this race, level the playing field, stabilize the international tax system, and it will advance greater equality between nations, making it easier for developing countries to collect tax revenues and fund development priorities,\" Blinken said in his Oct. 5 speech. \"We've got to get this done, we've got to get this done together.\"\n\nThe Biden administration also wants to integrate artificial intelligence into every facet of the American economy, infrastructure, the workforce, and empowering every government agency with AI.\n\nOne of the goals of Dr. Lynne Parker, director of the National Artificial Intelligence Initiative Office and assistant director of artificial intelligence at the White House Office of Science and Technology Policy, is to \"make sure AI is integrated throughout our industry and society and across all of the departments of our government,\" Kingston said.\n\nHowse asked if this was starting to set up a global system of tracking people, monitoring people, assessing social credit scores like in China, \"and basically laying the foundation that you won't be able to buy or sell unless you are a part of this system.\"\n\n\"They're not beginning to set it up,\" Kingston responded. \"It's already set up.\"\n\nThe DoD is heavily involved and taking the lead in this effort.\n\nThe Joint Artificial Intelligence Center [JAIC] within DoD, headed by Lt. Gen. Michael Groen, talks about forming partnerships with private industry and academia while \"cultivating a leading artificial intelligence workforce,\" according to the JAIC website.\n\n\"What is that?\" asked Howse.\n\n\"Well again, if you hear them speak about AI it's going to be taking over the workforce and integrating all aspects of society,\" Kingston said. \"I suggest everyone watch Blinken's entire speech. He does talk about training people on how to appropriately interact with AI. That is going to be our new master.\"\n\nAccording to patent number 20210082583, approved on Aug. 31, 2021, this technology is able to store one's personal ID and various bio-medical data in an electronic device and generate a \"score\" that determines how safe that person is to be around.\n\nThe person in whom a pathogen is found to exist, even if he or she is devoid of symptoms, is then instructed by the app on their phone what vaccine or drug treatment to receive.\n\nIt claims to use \"Completely anonymous methods,\" which Kingston said are not to be trusted.\n\nYour score is based on your electronic info, geography, government information that identifies you, human health information, your genetics, etc.\n\n\"So if you're connected to others, you can identify if they are vaccinated or not and [based on your vaccine status] you could be deemed a 'spreader,'\" Kingston said.\n\nIn an example showing three fictitious persons, the patent abstract accounts for who they interacted with, where they went, and it gives a score. This is like contact tracing on steroids.\n\n\"If you score too high that means you need another treatment, a booster,\" Kingston explained.\n\nSection 10 the patent application describes that, unfortunately for Jane Doe, she attended a number of \"religious gatherings,\" so she is considered high risk.\n\n\"They are clear about your social score, about rewarding you for certain behavior,\" Kingston said, and punishing you for others.\n\nThis research was funded by a venture capital firm based in Israel.\n\nHowse said it's not hard to imagine how this app could be misused for nefarious purposes.\n\n\"It allows them to know who is getting together with who, and they can start looking not only at what symptoms a person may have, but people with a certain value system or political system that are congregating, which could be a red flag for them.\"\n\nSection 0350 of the patent application states that the technology is designed to be used to order vaccines be injected as a \"treatment.\" It states:\n\n\"In some embodiments, the term prophylactic treatment means a preventive measure taken to fend off a disease or another wanted consequence.\"\n\n\"Medication is used to treat a disease, not another unwanted consequence,\" Kinston said. \"We know that the virus was made in collaboration with China, the CCP, who are part of this organization, as well, that Secretary Blinken spoke in front of on Oct. 5.\"\n\nKingston said Section 0400 contained \"very alarming things. If you're too disobedient, you may be identified as a super spreader and need to be injected with a more potent vaccine.\"\n\nIn Secretary Blinken's Oct. 5 speech before the OECD, which is advancing principles of artificial intelligence, he talks about setting up an international taxation system, about climate change, cyber security, supply-chain security, people interacting with AI, etc.; he wants the OECD to play a role in policies for all of these things.\n\nBlinken talked about \"forging tighter bonds with other democracies\" and developing \"closer economic ties, breaking away from narrow nationalism. We now number 38 member nations. And the U.S. is committed to seeing the organization continue to grow stronger. No matter how significant the challenges we face, they are less formidable when faced together.\"\n\nKingston says the new global government is already put together.\n\n\"And the government that's in office now is part of that organization, and their job is to convince us that America is evil, and that there are authorities in America that believe in the Constitution and we have no place in this world, they made that very clear. Blinken made it very clear, there's going to be a global tax on every person and every company, and there will be a global economy and you are not welcome as a member of the nation if you do not comply with their rules, and he made it very clear in that speech that those rules are going to be compliant with artificial intelligence and we need to learn to cooperate with artificial intelligence. There was no mincing of words. I recommend everyone listen to the full speech and listen to it more than once so you understand the state of our nation and the state of this world.\"\n\nBlinken said \"at least 70 percent\" of the world's population will be vaccinated by 2022, \"in every country, in every income category.\"\n\nHe said OECD provides economic data to \"build back better,\" the slogan of the Great Reset coined by the elitist Davos-based World Economic Forum.\n\nAccording to a U.N. World Health Organization committee meeting on the global deployment and status of vaccines, 90 percent of the vaccines have been deployed to only 10 countries.\n\n\"Those 10 countries are our allies. They just need to take out America and its allies,\" Kingston said.\n\nWhat \"vaccination\" means to these elitists selling globalism is not necessarily what Americans think it means, Kingston said.\n\n\"You can be injected with a potent vaccine that can have other consequences other than prevention of disease,\" she noted. \"Yes, this has targeted us. And that's what the documents show and what Blinken is saying. Everyone needs to be vaccinated and some with a very potent vaccine. And the thing is we know the vaccine can harm, inflict chronic disease and kill people. And if you are a health professional and you have seen one child harmed, please come forward now.\"\n\n\"We need you to come forward. This has to stop,\" she said. \"And I don't know how else this can happen. You need to be honest about this.\"\n\nPlease go to Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts and our free articles.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.worldviewweekend.com/tv/video/vaccine-patents-track-who-you-associate-when-you-go-church-and-your-social-credit-score", "https://dodcio.defense.gov/About-DoD-CIO/Organization/JAIC/", "https://patents.google.com/patent/US20120265001A1/en", "https://www.oecd.org/going-digital/ai/principles/", "https://www.oecd.org/newsroom/international-community-strikes-a-ground-breaking-tax-deal-for-the-digital-age.htm", "https://www.oecd.org/tax/beps/oecd-g20-inclusive-framework-members-joining-statement-on-two-pillar-solution-to-address-tax-challenges-arising-from-digitalisation-october-2021.pdf", "https://www.state.gov/secretary-antony-j-blinken-at-oecd-opening-and-keynote-address/", "https://dodcio.defense.gov/About-DoD-CIO/Organization/JAIC/", "http://www.mypillow.com/", "http://www.wvwfoundation.com/"], "authors": [], "publish_date": null}