{"result_id": "351004", "URL": "https://www.worldviewweekend.com/news/article/doctor-who-fought-vaccine-mandates-and-wanted-treat-patients-ivermectin-gets-removed", "timestamp": "2023-04-25 18:19:09 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/doctor-who-fought-vaccine-mandates-and-wanted-treat-patients-ivermectin-gets-removed", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "Doctor Who Fought Vaccine Mandates and Wanted to Treat Patients with Ivermectin Gets Removed From Hospital Staff | Worldview Weekend Broadcast Network", "cleaned_text": "Physician sees 'too many red flags' with injections\n\nA Mississippi physician who has fought vaccine mandates and treated patients with hydroxychloroquine and considered using Ivermectin has been released from a hospital where he was working. Dr. John Witcher, a general practitioner at the Baptist Hospital in the small town of Yazoo City, is a lifelong resident of Mississippi.\n\n\"I'm kind of in limbo right now,\" he told Brannon Howse in a Dec. 8 video interview with Brannon Howse Live.\n\nDr. Witcher, who served as medical director of the emergency room hospice program, took his Covid patients off of Remdesivir after he documented that they were not responding well on the drug.\n\nHospitals are eligible for 20 percent bonuses if they prescribe the experimental Remdesivir, which studies have shown shuts down the kidneys of nearly 28 percent of patients who receive it.\n\n\"I've been paying a lot of attention to Dr. Peter McCullough and others who have networked together and have been discussing this, taking patients off of Remdesivir and putting them on Ivermectin,\" Witcher said.\n\nHe said he was considering giving Ivermectin to three Covid patients in the hospital when he was terminated.\n\nHe said he recently received a phone call from \"higher ups\" at the hospital, \"and they said 'you got to go, don't come back.'\"\n\nBut possibly even more detrimental to his contract relationship with the hospital was his work as an activist against the Covid vaccine mandates.\n\n\"I'm against the vaccine mandates. That's been ongoing. They wanted me to sign an order [as a medical director] mandating that all these hospital employees get [the Covid injection]. I felt they needed to be informed of the risks and I wasn't comfortable just signing a blanket order.\n\n\"That kinds started the ball rolling downhill for me.\n\n\"And then when our state health officer put out a memo wanting all pregnant patients to be vaccinated, I was concerned about that and spoke up.\n\n\"And then of course with this 5 to 11-year-old recommendations to be vaccinated, I'm very concerned about that.\"\n\nAs a medical director at the 20-bed hospital in Yazoo City, Witcher was a participant in staff meetings.\n\n\"They recently ordered 300 pediatric doses of the vaccine,\" he said. \"I sat there in the meeting and they know my thoughts that we can't just be giving these vaccines out without proper informing of the risks associated with it.\"\n\n\"I think that had something to do with it.\n\n\"I was already on thin ice.\"\n\nWitcher is co-founder of Mississippi Against Mandates, a coalition of state doctors with a website at MSagainstmandates.org, Their mission is to fight the mandates.\n\n\"We do not consent,\" the website states, and notes its consultant relations with medical scientists of national prominence such as Dr. Peter McCullough and Dr. Robert Malone.\n\n\"We've been in the fight against vaccine mandates since late August,\" Witcher said. \"We've had rallies all over Mississippi.\"\n\nHowse said Witcher was an example of \"a real American hero\" for stepping up to fight medical tyranny in the United States.\n\nWitcher said his hospital gave a deadline of Oct. 31 for every employee to get the Covid injection.\n\n\"So we went to the streets and said we don't want to be forced into these shots. That slowed it down, many of us were given religious exemptions,\" he said.\n\n\"So when they said they had enough of me I think, maybe going back, a little of that was still left over in their minds. There are 11 Baptist hospitals in Mississippi and we all got exemptions. Anybody that applied for them.\n\n\"And so there was some publicity there that maybe they didn't appreciate ...\"\n\nHowse asked Witcher if the U.S. healthcare system could be on the brink of collapse.\n\n\"If these folks walk off their jobs, do you think our healthcare system is at risk if they keep forcing this thing onto the nurses and doctors?\"\n\n\"Absolutely,\" Witcher said. \"Here in Mississippi, I'd say 20 percent of the healthcare workers, at least, maybe up to 30 or 40 percent would walk out.\n\n\"It would collapse. What they would have to do is what they've already done earlier – the federal government would have to come in and bring nurses and staff. The federal government would take it over.\"\n\nWitcher said he encourages all doctors who desire to practice independent medicine to join the Association of American Physicians and Surgeons, AAPS, an organization that stands in contrast to the corrupt American Medical Association, or AMA.\n\n\"It's an independent group. It's not as big as the AMA and that's OK,\" he said. \"I'll admit we're in the minority but in history there's a lot of people who have been in the minority that have been right, so we're OK with being in the minority right now. We have to practice medicine like we know how to practice medicine and that's to take care of patients first.\"\n\nDr. Witcher said there have been \"too many red flags\" surrounding the Covid vaccine.\n\n\"The government, first of all, there's a lot of fear mongering on the virus, 'it's deadly it's deadly,' and it does kill some people. No doubt about it. I've lost good friends, patients, but it's still a 98 percent survival rate, and that's if you get it. Most people haven't even had it.\n\n\"There is such a thing as natural immunity and innate immunity,\" he continued. \"I don't know why the government doesn't acknowledge that. And then Ivermectin and hydroxychloroquine. I was giving all my in-patients hydroxychloroquine from day one and having good success and then they took it off the market because of a false Lancet study that turned out to be bogus but yet they never brought it back to the hospital protocols. Instead they put Remdesivir on there.\n\n\"So there's a lot of buyer's incentives here and now it's gotten to the point where they want to give this [vaccine] to 5 to 11-year-old children? I've seen children that age, treated them, who have just a minor cold.\"\n\nWitcher said out of the roughly 88,000 children ages 0 to 17 known to have contracted Covid in Mississippi, only nine have died.\n\n\"But most had comorbidities, severe comorbidities,\" he said. \"Nine out of 88,000, so that's still a 99.97 percent survival rate. And none of those probably got any early treatment with Ivermectin or any of these other treatments advocated by Dr. McCullough.\"\n\nDr. McCullough has maintained that 85 percent of the Covid deaths in the U.S. could have been prevented if people had been given proper early treatment.\n\n\"Doctors like me, that practice out in rural setting have to use a lot of common sense to get through the day ...They say follow the science but the science changes in medicine. I stay current on the science. Dr. McCullough and some of those guys as far as I'm concerned are leading the science.\"\n\nHowse asked if Dr. Witcher was in touch with other Mississippi doctors who were seeing patients injured by the Covid injections.\n\n\"I talked with an OBGyn. She wasn't necessarily against the vaccines but when she started seeing in her hospital the fetal demise rate going off the charts, babies dying in the womb, they're not making it to full term, and she feels there's a very direct correlation between that and mothers getting vaccinated,\" he said. \"She's seeing it right here in Mississippi and she's talking to other OBGyn doctors in Mississippi and they're seeing the same thing. The babies die in the womb. They've never seen it like this. So, yes, very concerned about these vaccines, very concerned about giving them to healthy kids, the risks are just too great.\"\n\nHe said he was also seeing heart conditions in younger and younger patients, including myocarditis pericarditis.\n\nThe government reporting system, VAERS, has more than 19,500 deaths and if the Harvard study of a few years ago is correct, that only represents 1 percent of the actual numbers.\n\n\"So it could be 190,000 deaths at this point, not to mention the serious adverse events,\" Witcher said.\n\n\"And I have been in contact with many patients who have had adverse events, I've seen it for myself.\"\n\nHe said he's seen patients come in with blood clots, Gillian Barre syndrome and strokes.\n\n\"So yes I'm very concerned about the vaccines. If they want to take them that's fine but they need to be informed about the risks.\"\n\n\"Maybe they felt like vaccines were going to be the answer but they're certainly not working now. I don't know why they don't want to stop them. We need a safety profile at this point, bottom line.\"\n\nDr. Witcher said he was still seeing patients as an independent general practitioner but no longer works at the Baptist hospital.\n\n\"I'm a little concerned I could lose my medical license,\" he said. \"If you've been disciplined by a hospital and it goes to the licensing board they could open an investigation and revoke or suspend your license if they find you are a threat to public health.\"\n\nAttempting to put patients on Ivermectin in some jurisdictions would definitely qualify as a threat to public safety, even though the drug has a long track record of safety and has saved the lives of Covid patients worldwide.\n\n\"When I started speaking out against these vaccine mandates around the first of September they put a new policy I their manual that says any doctor that puts out misinformation, they run the risk of their license being revoked, so I'm on thin ice with them too.\"\n\nBut he feels like his side of the story needs to be told, especially since a local newspaper in the Jackson area put out a \"negative\" article about him.\n\n\"I talked with my wife and we feel I need to tell my side of the story.\n\n\"People that know me, that work with me. They know I'm always concerned about my patients. First of all I never want to do any harm. And second of all I always want to do the good for the patient, whatever resources are at hand. That's just who I am. I have many patients from years gone by, as well as those I've worked with who all would say I'm a caring, compassionate physician.\"\n\nHe said he's the first doctor in Mississippi who has faced repercussions over this issue.\n\n\"This hospital I work for, even though it’s a small 20-bed hospital, it is owned by a large conglomeration of 24 hospitals. It's a very large corporation based in Memphis, so it's very hard to practice independently in that situation.\n\n\"I don't have specialists around me or anything like that so many times I have to make decisions spur of the moment. And that's what I did with these three new Covid patients that showed up in the hospital.\"\n\nIf the power-grid goes down and cell phone towers fail will you still be able to reach your spouse or family members in the event of a national emergency? What if you are separated by miles and even hours? This satellite phone can give you peace by being able to verify the safety of your family and make necessary arrangements and plans. The new IsatPhone 2 satellite phone is ultimately designed to work flawlessly in all weather conditions - in rain storms, dust storms, searing heat to sub-zero cold, tropical humidity or freezing fog the IsatPhone 2 will provide you with a excellent voice, SMS and GPS services and guaranteed reliability. Click here for more details or go to: https://sat123.com/wvw\n\nPlease go to Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts.\n\nHelps Us Cover Our Huge Streaming Bill So You and Millions of Americans Can Watch Our TV Shows For Free. Many organizations put all their shows behind a pay-wall immediately but we make our shows available for all to watch as a public and educational service of WVW-TV and WVW Foundation. You can also use our mailing address to send your tax deductible support:\n\nIn 2016, WVW-TV began to urge our radio and television audience to prepare for increasingly uncertain times such as:\n• an EMP attack from China, Russia, Iran, or North Korea\n• A cyber attack on our critical infrastructure, including power-grid, water utilities and/or the banking industry\n\nThen, 2020 happened with the biological attack on America by Communist China through Covid-19. Finding hamburger meat, a can of soup, pasta, a can of tuna, and other basics became shockingly challenging.\n\nThose who had mocked our organization for calling on our audience to prepare with an emergency food supply were no longer laughing at us. In fact, some of them began to order emergency food from our store.\n\nI have enjoyed Mountain House food on camping trips going back to when I was in high school. I purchased 6 months of food for 5 people in April of 2013 for my family. Three and a half years later, Worldview Weekend became a distributor for Mountain House because we personally know and testify to the quality of the food and understand the need for families to have \"food insurance\" in an increasingly dangerous world.\n\nPlease go to www.wvwtv.com/store\n\nto place your order while we have the inventory or go directly to this link: https://shop.worldviewweekend.com/products/cat/14841\n\nYour purchase of emergency, freeze dried food will not only support your family, but you will also be supporting the continuation of WVW Broadcast Network and all our free radio and television programs through your purchase.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.worldviewweekend.com/tv/video/dr-john-witcher-head-mississippi-against-mandates-vaccine-injured-he-has-treated-and", "https://sat123.com/wvw", "https://sat123.com/wvw", "http://www.mypillow.com/", "http://www.wvwfoundation.com/", "http://www.wvwtv.com/store", "https://shop.worldviewweekend.com/products/cat/14841"], "authors": [], "publish_date": null}