{"result_id": "351031", "URL": "https://www.worldviewweekend.com/news/article/well-known-dj-and-vaccine-advocate-has-died-suddenly-stroke", "timestamp": "2023-04-25 18:20:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/well-known-dj-and-vaccine-advocate-has-died-suddenly-stroke", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "Well-Known DJ and Vaccine Advocate Has Died Suddenly of a Stroke | Worldview Weekend Broadcast Network", "cleaned_text": "\n• None A whistleblower comes forward to give an account of how the Moderna vaccine devastated her life by triggering a life-threatening allergic reaction.\n• None A well-known D.J. in the United Kingdom who bragged about his vaccination status has died suddenly of a stroke.\n• None A 2-year-old girl has died in the United States one day after receiving a combination Covid-flu shot.\n• None Dutch farmers are back out in the streets trying to stop their government’s devastating climate agenda from destroying their family businesses.\n• None And a House Oversight Committee has released a summary of the first bank records showing how a $3 million payment from a Chinese company came into the United States and eventually infused $1.3 million into the accounts of Joe Biden's family members.\n\nAll these stories and more when the Worldview Report begins, right now!\n\nGood evening and welcome to the Worldview Report.\n\nWe have a firsthand account tonight from a woman who is a former member of the American girl group and dance ensemble, the Pussycat Dolls, in which she shared her story of how two Moderna shots gave her tremors and neuropathy.\n\nJessica Sutta is an American singer, dancer, and actress.\n\nIn an episode of the Epoch Times’ podcast, American Thought Leaders, the 40-year-old actress shared for the first time what she experienced following the Covid shot and why she has decided to speak out.\n\n“I started developing a tremor. And then the next couple of nights, I started getting involuntary head jerks and leg jerks.”\n\nAccording to Sutta, the Moderna vaccine triggered a life-threatening allergic response. She claims it all began on the third day after her second shot, when she experienced a severe muscular spasm in her side.\n\nUnfortunately, her experience is not uncommon. We have reported on hundreds of these cases over the last year, and they are not going away.\n\nA well-known music disc jockey in Plymouth, England, who boasted about being fully vaccinated, has died suddenly of a stroke.\n\nAccording to the Plymouth Herald, Jefferson Vandike was “a talented and well-respected DJ, who was synonymous with the city's music scene, was incredibly well-known in Plymouth and beyond and was a popular performer at many nightlife venues.”\n\nHis death was announced on Wednesday, March 8, by his family. In a short statement, they explained Jefferson had died “suddenly” after battling a “short illness.”\n\nThe family said: “We, the Vandike family, have the deep sorrow to announce that our beloved son, brother, uncle, brother-in-law, the unique and beautiful man that was Jefferson Vandike, left us suddenly this morning, following a short illness. With loving gratitude to those who fought so hard to save him. We know he was truly loved, respected and adored by many in Plymouth and beyond.”\n\nVandike was vaccinated and posted to social media that he did not understand why anyone could be so selfish and self-centered as to not get the Covid shots.\n\nIn a January 2, 2021 post to Facebook, Vandike responded to another pro-vax person who was criticizing the unvaxxed by calling them “selfish ignorant pigs who deem that they are above the law of the land and show no compassion nor empathy. Idiots in the extreme? In many cases it would appear they need to lose someone dear before self-realization hits home? So very sad that so many are a lost cause until they are directly affected? We can only pray for them to begin to see the light and start acting responsibly. It’s never too late to start doing the right thing.”\n\nWe reported to you in our previous broadcast that the FDA had approved a fourth Covid shot for little children ages 6 months to 5 years, and we included in that report a list of children who had died after receiving the Covid shots.\n\nWe have more to report on that tonight.\n\nIt comes from the VAERS Data. In Report Number 2573802, a 2-year-old girl died one day after receiving a GlaxoSmithKline flu shot, and a Moderna COVID-19 shot on the same day.\n\nThe Independent Sentinel reports that this little girl received the bivalent vaccine for BA.4 and BA.5 even though those strains are no longer circulating.\n\nShe had no known illnesses or birth defects. The child died suddenly from an unknown cause. Information is sketchy, but these are cases that need investigation. It is especially so given that the FDA just approved another booster for babies as young as six months based on testing of 60 children.\n\nThen there’s VAERS case Number 1166062-1: A 5-month-old boy died after breastfeeding. He had no known illnesses or defects. This 5-month-old baby boy’s mother got her second dose of the Pfizer vaccine. Within 24 hours of breastfeeding her son, he broke out in a rash, became inconsolable, and died the following day.\n\nCause: Suspected exposure to mRNA via breast milk, diagnosed with blood clots.\n\nThere are many other cases just like this. Who is investigating these deaths? Answer. No one in any position of authority within the U.S. government. All they do is continue telling us to keep getting the next injection, and to inject our kids as well. This is a 21st century genocide.\n\nThe truth about Covid vaccines being unsafe and ineffective is starting to hit the mainstream in Japan as citizens demand answers from their government.\n\nThe Government of Japan was urged to come clean about the huge number of vaccine injuries and excess deaths during a recent hearing.\n\nIn Japan, the number of deaths after vaccination has increased by 210,000 since 2020, the highest number since World War II. People are dying immediately after vaccination, and Japan is flooded with people suffering from vaccine injuries. Under the circumstances, it is reasonable to assume that the unusual excess deaths currently occurring are caused by the vaccine.\n\nSo, a Japanese politician who is a member of the House of Councilors of Japan, accused the Japanese government of covering up COVID-19 mRNA vaccine injuries and deaths.\n\nTyson Foods will lay off nearly 1,700 employees in May with the closure of two chicken plants in Arkansas and Virginia, according to multiple reports.\n\nTyson will close plants in Van Buren, Arkansas, and Glen Allen, Virginia, on May 12, according to KFSM-TV and WTVR-TV. The closures will affect about 970 employees in Van Buren and nearly 700 workers in Glen Allen, the news stations reported.\n\nIn a statement obtained by CNBC, a Tyson official said that the decision “was not easy” but “reflects our broader strategy to strengthen our poultry business by optimizing operations and utilizing full available capacity at each plant.”\n\n“The current scale and inability to economically improve operations has led to this difficult decision to close the facilities.”\n\nLast month, Tyson reported an operating income of $69 million from its chicken business for a three-month period ending Dec. 31, 2022. A year earlier, the company reported an operating income of $140 million for the same business segment.\n\nIn a call discussing the company’s latest results, Tyson CEO Donnie King noted that “demand didn’t appear in the parts of the market where we had expected,” according to CNN.\n\nAs a result, he said the company “had to move things around. As we think about moving forward, efficiency in our operations in our company will be the focal point for us.”\n\nHe did not say if the decline in income and operating capacity had anything to do with the bird flu, which has led to the slaughter of tens of millions of birds in the U.S. over the last year. Often, entire flocks are slaughtered just because a few birds tested positive.\n\nTyson had 142,000 employees as of October 2022, including 124,000 in the U.S.\n\nThe Winepress News reports that farmers and their supporters are still refusing to back down from the Dutch government that persists in trying to strip away their farmland and cull their livestock in order to meet arbitrary goals set by the government’s globalist climate agenda. Many farmers and allies are once again resisting the government’s demands and are out on the streets to reverse these policies.\n\nThe first wave of protests began in June of last year. Farmers persistently stood up to their elitist leaders for trying to strip away their livelihoods, pushing policies that would ultimately cripple the food supply in The Netherlands and parts of Europe. The protestors eventually started to turn violent as police began to aggressively arrest some protestors, and The Winepress notes that some were even shot at, as crisis actors were also routinely spotted within the ranks of the protesters trying to make them look like violent criminals (this has definite parallels to the J-6 scenario that went down in Washington, D.C.). Some groups would blockade food distribution sites and dump manure on the streets and on the lawns of the politicians’ homes.\n\nThe government has stubbornly refused to receive any message from the protests and has continued to push forward with its suicidal anti-farming climate agenda. But nor are the farmers backing down and last week the farmers began to reengage with a new round of protests and demonstrations.\n\nThey are calling themselves the Farmers Defense Force.\n\nThe government was not pleased and actually threatened to deter the protestors with military force.\n\nOn March 6th Mayor Jan van Zanen of The Hague said he would consider sending the army and heavy military equipment to remove tractors and other vehicles that were expected to arrive in The Hague that weekend, the NL Times reported. This is the same tactic used by Prime Minister Justin Trudeau to put down the Canadian Freedom Trucker movement in February 2022.\n\nVan Zanen said in an interview with De Telegraaf:\n\n“I am not going to rule out the possibility that Defense equipment will be deployed. That is available if necessary. We cannot handle this alone. Also, to ensure that the demonstrations are safe.”\n\nAh, yes, it’s always about safety, isn’t it?\n\nThe mayor has also asked police forces elsewhere in the country to provide officers to assist with the crackdown.\n\nThe Counter Signal would later report that heavy military vehicles blocked tractors from entering the city as multiple arrests were made.\n\nHere are some scenes from the Dutch protest movement, including a man who was arrested and remains in custody simply because he moved a barrier.\n\nJust the News reports that House Oversight Committee Chairman James Comer (R-Ky) on Thursday released a summary of the first bank records showing how a $3 million payment from a Chinese company came into the United States, was broken up and eventually infused $1.3 million into the accounts of President Joe Biden's family members.\n\nComer's committee reported in a new memo summarizing its investigative findings:\n\n“Pursuant to a subpoena, the Committee recently obtained financial records related to Mr. John Robinson Walker, a Biden family associate, and his company Robinson Walker, LLC. Prior to issuing the subpoena, the Committee received information that Mr. Walker used his company to transfer money to Biden family members. The bank records proved that information correct.”\n\nThe committee said it traced a $3 million payment that was sent from a Chinese company to Walker in March 2017 -- just two months after Joe Biden stepped down as vice president -- and then money totaling $1.3 million was distributed to accounts tied to Hallie Biden, the widow of the late presidential son Beau Biden, presidential brother James Biden and presidential son Hunter Biden.\n\nA fourth account listed only as “Biden” also received money, the committee said. Comer said his committee is trying to determine which family member it belongs to.\n\n“The Committee is concerned about the national security implications of a President’s or Vice President’s immediate family members receiving millions of dollars from foreign nationals or companies without any oversight. Current financial disclosure laws and regulations do not require non-dependent family members to provide any information to the public.”\n\nLast week I interviewed Kevin Freeman, a writer on the economy who has authored several books including “Game Plan” and “Secret Weapon”. Kevin is a subject-matter expert on economic warfare and operates the website, EconomicWarroom.com. He has consulted with and briefed members of Congress, the CIA, DIA, FBI, SEC, and Homeland Security.\n\nWe spoke about the Chinese doctrine of unrestricted warfare, which includes economic warfare.\n\nHere is an excerpt from that interview with Kevin Freeman on my show, Brannon Howse Live.\n\nThe Kentucky Senate approved a measure this week that would bar state and local police departments from enforcing any federal bans on firearms and their related accessories.\n\nThe upper chamber approved the bill in a 27-9 vote, The Hill reported. The state House gave its approval, 78-19, in February and the legislation now heads to the desk of Democrat Governor Andy Beshear. It is unlikely that he will sign it into law, though Republicans hold veto-proof majorities in both chambers of the legislature, as Ballotpedia notes.\n\nJust the News reports that such a law would not only bar law enforcement from aiding the enforcement of federal firearms, accessories, or ammunition bans, but also prohibit the use of state funds more broadly for such endeavors.\n\nKentucky, should it enact the measure, would join other largely Republican-led states in enacting Second Amendment sanctuary laws. Second Amendment advocacy group Gun Owners of America currently identifies 10 states, most in the South and Midwest, as having sanctuary laws it rates as either “gold” or “silver.”\n\nPresident Joe Biden announced an executive order this month to expand the use of background checks during gun sales. He is also providing federal funding incentives for states to enact so-called red flag laws, which can be used to disarm citizens based on anonymous tips called in to law enforcement.\n\nTime now for our Worldview Report commentary.\n\nRed State Media reports that Florida’s Department of Business and Professional Regulation is moving to revoke the liquor license of the prestigious Hyatt Regency Miami. The cause of the complaint is a drag queen show held by the hotel just after Christmas where children were present.\n\nThis violates a Florida law, signed by Governor Ron DeSantis, that prohibits sexually explicit performances where there are minors in the audience.\n\nFlorida is one state that will not put up with child groomers, and it doesn’t matter who you are. The state took action earlier against the Orlando Philharmonic Plaza Foundation for putting on an obscene show despite being warned by the Department of Business and Professional Regulation of the consequences.\n\nOne has to assume that the Hyatt Regency Miami received the same warning and decided they were too big and too important to mess with.\n\nLike the Orlando Philharmonic Foundation, the Hyatt Regency Miami has 90 days to appeal and can continue serving liquor. I expect both will either pay hefty fines and/or have a suspension period before resuming operations.\n\nThis measured campaign of using existing state regulations to enforce some semblance of decency is having an effect. For example, the “Miss Rose Dynasty” drag pageant — run by Jason DeShazo, whose bio say he is, I’m not joking, a “former pastor of an LGBTQ church” who calls his organization the “Disney Channel of drag.” He has decided to move after the venue it was scheduled to use, the Dr. Phillips Center for the Performing Arts in Orlando, imposed age restrictions on the event.\n\nHere is DeShazo whining about having to move.\n\nNotice he did not deny that his shows are sexually explicit. He just assumes that because a parent brought their child to his shows it’s okay to introduce the child to simulated sex acts by men pretending to be women. He also thinks that he’s justified in corrupting the minds of young children because he’s giving a portion of his profits to “charity.” This is rank child abuse operating under the cover of philanthropy. In any serious country, child predators like Pastor Jason DeShazo would be behind bars.\n\nThat does it for this edition of the Worldview Report. Thanks for tuning in, and for supporting this viewer-supported broadcast.\n\nUntil next time, I’m Brannon Howse. May God save America. Take care.\n\nCall 901-468-9357 for phone orders or to make a donation\n\n ----------------------------------------------------------------------------------------------------\n\n Get your free, no obligation packet on precious metals by texting or calling Wes Peters with Swiss America at 602-558-8585\n\n ----------------------------------------------------------------------------------------------------\n\n FREE SHIPPING - Click here and visit www.wvwtvstore.com to order emergency, freeze-dried food that will last 25 years. \n\n ----------------------------------------------------------------------------------------------------\n\nPlease help us with the huge cost of producing and distributing FREE radio and television programs by making a contribution at www.wvwfoundation.com or by calling 901-468-9357 or by sending your contribution to:\n\nPlease go to www.Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://twitter.com/JanJekielek/status/1636178800311517188?s=20", "https://www.plymouthherald.co.uk/news/plymouth-news/plymouth-dj-jefferson-vandike-dies-8231553", "https://themadjewess.wordpress.com/2023/03/16/man-who-called-unvaxxed-selfish-ignorant-pigs-dies-from-a-stroke-vax-side-effect-no-doubt/", "https://www.cdc.gov/vaccinesafety/ensuringsafety/monitoring/vaers/access-VAERS-data.html", "https://twitter.com/TexasLindsay_/status/1635297586591711234?s=20", "https://twitter.com/TexasLindsay_/status/1635785289003089923?s=20", "https://twitter.com/TexasLindsay_/status/1635361674969628673?s=20", "https://twitter.com/You3_JP/status/1635360626901159936?s=20", "https://www.5newsonline.com/article/money/business/van-buren-tyson-plant-closing/527-c767b106-378e-4628-9781-4c700ee1d756", "https://www.wtvr.com/news/local-news/tyson-foods-closes-chicken-plant-reaction-march-14-2023", "https://www.cnbc.com/2023/03/14/tyson-foods-layoffs-chicken-plant-closures.html", "https://www.wsj.com/articles/tyson-to-close-two-chicken-plants-cutting-1-700-jobs-a43c6d81", "https://www.tysonfoods.com/news/news-releases/2023/2/tyson-foods-reports-first-quarter-2023-results", "https://www.cnn.com/2023/03/14/business/tyson-plant-layoffs/index.html", "https://winepressnews.com/2023/03/15/dutch-mayor-threatens-military-force-to-breakup-farmer-protestors-as-netherlands-government-continues-to-try-and-sequester-land/", "https://nltimes.nl/2023/03/06/hague-mayor-threatens-use-military-gear-keep-rival-climate-farmer-protests-check", "https://thecountersignal.com/dutch-military-blockades-farmers-from-capital-multiple-arrests/", "https://twitter.com/CSmiles_News/status/1636033122893537282?s=20", "https://justthenews.com/government/white-house/oversight-committee-chair-reveals-biden-family-members-received-payments", "https://www.worldviewweekend.com/tv/video/protecting-yourself-economic-cyber-attack", "https://thehill.com/homenews/state-watch/3903941-kentucky-lawmakers-pass-bill-to-make-state-a-second-amendment-sanctuary/", "https://ballotpedia.org/Veto_overrides_in_state_legislatures", "https://justthenews.com/politics-policy/kentucky-republicans-send-second-amendment-sanctuary-bill-governors-desk", "https://www.gunowners.org/state-sapas/", "https://justthenews.com/government/white-house/biden-sign-executive-order-gun-control", "https://redstate.com/streiff/2023/03/15/florida-pulls-another-liquor-license-for-allowing-kids-into-an-alcohol-fueled-drag-show-n716392", "https://www.rosedynastyfoundationinc.org/pageant/", "https://news.yahoo.com/amid-legal-uncertainty-charitable-drag-171000054.html", "https://www.youtube.com/watch?v=mxSXoPeAqx0&t=122s", "http://www.wvwtvstore.com/", "http://www.wvwfoundation.com/", "http://www.mypillow.com/"], "authors": [], "publish_date": null}