{"result_id": "351030", "URL": "https://www.worldviewweekend.com/news/article/satanic-temple-and-democrat-party-have-aligning-values", "timestamp": "2023-04-25 18:19:57 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/satanic-temple-and-democrat-party-have-aligning-values", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "The Satanic Temple and Democrat Party Have Aligning Values | Worldview Weekend Broadcast Network", "cleaned_text": "INTRO:\n\n  A former Obama aide who served at the Department of Health and Human\n\n Services, speaking shortly after the onset of the Covid pandemic, put forth a\n\n shocking solution for how to make sure everyone gets every vaccine the\n\n government says is needed.\n\n  One of America’s top swimmers dies suddenly at the age of 23.\n\n  The Satanic Temple announces plans to get into the abortion business.\n\n  The state of California drops its vaccine mandate for public school children.\n\n  The New York Police Department unveils some Orwellian technology for its\n\n new police cars.\n\n  Bill Gates, already invested in lab-grown meat, is now investing in artificial\n\n eggs.\n\n  And a major European newspaper apologizes for its corrupt coverage of the\n\n Covid scamdemic.\n\n  All these stories and more when the Worldview Report starts, right now!\n\nGood evening and welcome to the Worldview Report. I’m your host, Brannon\n\n Howse.\n\n Dr. Carol Baker, a former Obama aide at Health and Human Services, was caught\n\n on film a few months after the Covid scare hit the media in 2020 describing what\n\n she calls a “solution” to vaccine refusers.\n\n She made the shocking comments during a panel discussion at the “Achieving\n\n Childhood Vaccine Success in the U.S.” conference sponsored by the National\n\n Meningitis Association in New York City.\n\n Here’s what she said:\n\n “So I have the solution. Every study published in the last five years, when you look\n\n at vaccine refusers…I’m not talking about…hesitance, most of them we can talk\n\n into coming to terms. But refusers. We’ll just get rid of all the whites in the United\n\n States…Guess who wants to get vaccinated the most? Immigrants.”\n\n WATCH VIDEO (clip first 1:08)\n\n https://rumble.com/embed/v2557v0/?pub=rze3r\n\nThis was first reported by the National File on May 13, 2020 but was ignored by\n\n the mainstream corporate media. Even though it happened nearly three years ago,\n\n we thought it was important enough to share with you given all that’s happened\n\n with vaccines and vaccine coercion by the government and its corporate partners\n\n since then. We only discovered the video last week and have fact-checked it to\n\n make sure it’s legitimate.\n\n Notably, Baker was appointed chair of the CDC’s Advisory Committee on\n\n Immunization by Obama’s Health and Human Services Secretary Kathleen\n\n Sebelius in 2009.\n\n The Houston doctor was also honored with the Sabin Vaccine Institute’s 2019\n\n Albert B. Sabin Gold Medal at a Washington D.C. ceremony sponsored “in part by\n\n the Bill & Melinda Gates Foundation and Pfizer.”\n\n XXX\n\nThe University of Arizona’s former swimming standout, who competed from 2018\n\n to 2022, died suddenly and unexpectedly on Friday, according to Arizona\n\n Athletics.\n\n Ty Wells died on Friday, January 27. He was 23.\n\n SHOW TWEETED PHOTO\n\n https://twitter.com/AZATHLETICS/status/1620208577570045952?s=20&t=j…\n\n r-sjKBtiCPEu1j2PDw\n\n Arizona Athletics announced January 31 on its social media accounts:\n\n “We are deeply saddened by the loss of recent alum Ty Wells, who passed away\n\n on Friday. Our heartfelt condolences are with his family, his friends and the\n\n entire Arizona Swimming & Diving family.”\n\n No information has been released on the cause of death.\n\n Local news media Swim Swam debunked rumors that Wells died in a motorcycle\n\n accident. According to the report, “the confusion may stem from a 2022\n\n motorcycle accident in California that involved an individual with the same name.”\n\n All we know about his death is that it was “sudden.” According to the\n\n team’s GoFundMe page:\n\n“Our Arizona Wildcat swimming family was devastated at the sudden passing of\n\n one of our most adored swimmers this past Friday. He was a guiding light to all of\n\n his friends and teammates as well as to all of us parents.”\n\nA Georgia police officer died suddenly while on duty Saturday, January 28, at the\n\n age of 23.\n\n Officer Clarence “CJ” Williams died while chasing a suspect after a traffic stop,\n\n according to WCTV-TV. The Cairo Police Department said Williams suffered a\n\n “medical episode” but gave no details.\n\n The Cairo Police Department said in a Facebook post that Williams died “serving\n\n the community he so loved.”\n\n Williams made a tremendous impact on his hometown of Cairo, Georgia, and\n\n leaves behind a legacy of selfless service, the post said. He graduated from Cairo\n\n High School in 2017 and joined the Cairo Police Department in 2020.\n\n Williams is only the second Cairo police officer ever to die on duty — the first was\n\n in 1907, according to The Atlanta Journal-Constitution.\n\nCommon sense says it should give you pause when the policies of your political\n\n party are aligned with that of the Satanic Temple.\n\n The Gateway Pundit reminds us that the Satanic Temple joined Democrats in their\n\n battle against the Supreme Court’s 2022 ruling on Roe v. Wade.\n\n The Satanic Temple released a statement following the ruling on their plans to\n\n fight in court for the right to “religious abortion.”\n\n SHOW TWEET FROM SATANIC TEMPLE\n\n https://twitter.com/satanic_temple_/status/1522225566262476801?s=20&…\n\n kuGmGWNcqBgeejkw\n\n The satanists believe abortion is a “religious” sacrament.\n\n Now, the Gateway Pundit informs us that on February 1st the Satanic Temple\n\n announced they will open a “religious medical services clinic” in New Mexico.\n\nThe clinic will provide free religious medication abortion care to women in the\n\n state.\n\n In a press release, the Temple states:\n\n “The Satanic Temple announces the launch of its first reproductive health clinic,\n\n which will provide free religious medication abortion care in New Mexico. TST\n\n Health, The Satanic Temple’s religious medical services arm, will provide\n\n telehealth screenings and appointments and prescribe abortion medication for its\n\n patients. According to TST Health’s website, anyone in New Mexico seeking to\n\n perform The Satanic Temple’s abortion ritual will be able to receive free online\n\n medical services. Patients undergo a confidential screening and virtual\n\n appointment before having their prescriptions sent to the clinic’s pharmacy partner,\n\n who will mail the medications in a discreet package.”\n\n The Satanic Temple went on to say in that press release that it intends to expand its\n\n abortion services into other states.\n\nAfter delaying its implementation several times, the state of California has decided\n\n to drop its plan to make the Covid vaccine mandatory for all public school\n\n children.\n\n The California Department of Public Health hasn’t made an announcement, but\n\n officials told EdSource that the end of the state’s COVID-19 State of Emergency\n\n on February 28th effectively ends its current plan to add COVID-19 vaccinations\n\n to the list of 10 vaccinations children are required to have to attend school in\n\n person.\n\n An email from the department reads:\n\n “We continue to strongly recommend Covid-19 immunization for students and\n\n staff to keep everyone safer in the classroom. Turnkey mobile vaccination\n\n services remain available for any K-12 school within the state.”\n\n The statement went on to say that any changes to required K-12 immunizations are\n\n properly addressed through the legislative process.\n\n XXX\n\nNew York City police cars will be getting a high-tech makeover.\n\nIn addition to its use of controversial facial-recognition technology, the NYPD\n\n now has plans to get even more tech driven. It appears to be another move along\n\n the path to ensure that “Big Brother is protecting you,” as Mayor Eric Adams said\n\n recently.\n\n The website Gov Tech reports:\n\n “Department officials this week announced the upcoming changes to their patrol\n\n vehicles at the annual State of the NYPD breakfast. New tech additions will\n\n include 360-degree cameras and QR codes the public can use to contact the\n\n department.”\n\n The redesigned patrol vehicles will now have 360-degree cameras installed in them\n\n for constant monitoring of the streets, Police Commissioner Keechant Sewell said\n\n Wednesday.\n\n The city’s chief of police made her announcement during the department’s annual\n\n State of the NYPD breakfast in Midtown hosted by the New York City Police\n\n Foundation. She stated:\n\n “The NYPD RMP is iconic. We are exploring potential design changes as we\n\n speak.”\n\n RMP stands for radio motor patrol, a name coined decades ago still often used for\n\n marked NYPD vehicles.\n\n Each car will also have a QR code printed on the outside of the vehicle that the\n\n public can scan and connect to the NYPD’s websites.\n\n Sewell said the new design will “ensure the safety of our officers, have a QR code\n\n to improve customer service and a revamped interior for more efficient and\n\n comfortable work environment for our officers.”\n\n New all-electric Ford Mustang Mach-E Sport Crossover Utility Vehicles are\n\n among the models expected to take the place of the four-door police\n\n interceptor sedans.\n\n Afterward, the police chief told reporters there are no plans to expand the\n\n department’s use of facial recognition technology, a question raised with the\n\n announcement of another initiative — an “augmented reality” app.\n\n That app will allow police officers to point their smartphones at a location, such as\n\n an apartment building, and learn about things like wanted suspects or previous 911\n\ncalls connected to the address. Such information is already available to cops but\n\n takes time to get.\n\n The police chief said, “Augmented reality will help our officers better visualize\n\n that data.”\n\nAccording to multiple reports, Bill Gates is investing in artificial lab-grown eggs.\n\n No surprise here.\n\n As the globalists tear down our existing food infrastructure, based on livestock\n\n farming and traditional fuels and cultivating real food, they must endeavor to erect\n\n a new infrastructure based on CRISPR gene editing and man-made fake food.\n\n It’s no coincidence that egg farms are burning down, millions of birds have been\n\n slaughtered for allegedly coming in contact with a bird flu, and that eggs are now\n\n in short supply.\n\n The technocrats always manufacture problems that they then turn around and offer\n\n solutions to. And their solutions always involve more profits and control shifting to\n\n fewer and fewer people, while the rest of us get poorer and more easily controlled.\n\n Gates and others have been pushing fake meat for years and Wall Street is poised\n\n to throw lots of money at lab-grown meat factories coming online over the next 12\n\n to 24 months. These billionaire fraudsters are banking on the fact that as real meat\n\n becomes unaffordable for the masses, they will soon swallow their pride and start\n\n to bite on fake-food products.\n\n If they can do it with meat, why not with eggs and dairy products? Just make sure\n\n the real food is unaffordable and then replace it with the fake. That way they get to\n\n poison and/or malnourish the peasants while they get rich off the proceeds since\n\n they will own all the fake-food factories.\n\n Which brings me to a disturbing public survey.\n\n The survey, conducted by Ready To Harvest, polled Christians of all types and\n\n from a wide array of denominations.\n\n The question was simple: “If lab-grown meat becomes indistinguishable from\n\n regular meat in taste and texture and the cost is less expensive, would you consider\n\n switching to it?”\n\nMore than 17,000 people participated.\n\n A solid 40% said no, they would not eat it.\n\n 39% answered yes, they would eat it.\n\n 18% were indifferent and said they were unsure.\n\n XXX\n\nIconic political consultant Roger Stone had civil charges against him dismissed last\n\n week in a Washington D.C. court. The ridiculous lawsuit blamed Stone for the\n\n federally-incited violence that occurred on January 6th.\n\n Stone told Big League Politics:\n\n “Judge Amit P. Mehta rightly DISMISSED all counts against me in a civil suit\n\n filed by 8 members of the US Capitol Police based on the events of Jan 6 in which\n\n I had no involvement beyond the exercise of my First Amendment rights.”\n\n A CNN article stated in a footnote that Mehta determined that Stone’s actions were\n\n protected under the Bill of Rights of the Constitution.\n\n Here he is speaking at the Capital on January 5th.\n\n WATCH VIDEO\n\n https://rumble.com/embed/v1kt1je/?pub=rze3r\n\n Yeah, that sounds like a man who was inciting violence, doesn’t it?\n\nThanks to skyrocketing electricity prices, it now costs more to drive the average\n\n electric vehicle 100 miles than it does to drive a gas-powered car the same\n\n distance, Breitbart reports.\n\n A report from the Anderson Economic Group (AEG) shows that driving a gas-\n\n powered car 100 miles costs an average of $11.29. However, the cost for people\n\n who drive electric vehicles and charge up at home is $11.60 per hundred miles. A\n\n little more expensive.\n\n For those electric car owners who use recharging stations, the average cost for 100\n\n miles is substantially higher at $14.40.\n\n But at least you’re saving the planet, right?\n\nOh, wait, you’re not saving the planet because most of the “clean” electricity you\n\n use to charge your eco-car comes from burning fossil fuels.\n\n You are merely draining your pocketbook.\n\n XXX\n\nThe wave of job layoffs in the technology sector continued this week.\n\n PayPal announced January 31st they will shed about 2,000 employees, or 7 percent\n\n of its workforce, as the payment processing service faces what they call a\n\n “challenging macroeconomic environment.”\n\n PayPal president and CEO Dan Schulman wrote in a statement:\n\n “Today, I'm writing to share the difficult news that we will be reducing our global\n\n workforce by approximately 2,000 full time employees, which is about 7 percent\n\n of our total workforce. These reductions will occur over the coming weeks, with\n\n some organizations impacted more than others.” \n\n PayPal, which was ranked at 143 on the 2022 Fortune 500 list of the largest\n\n American corporations by revenue, also owns payment processors Venmo, Xoom,\n\n e-commerce coupon tool Honey, among other brands.\n\n Shares of PayPal have dropped about 53 percent in the last year, reported the Daily\n\n Mail.\n\n Of course, it didn’t help PayPal’s fortunes to bury an Orwellian new policy in its\n\n user agreement, which when it was reported by conservative media drove\n\n thousands of conservatives to either close out their PayPal accounts or stop using\n\n them for everyday sales and purchases.\n\n XXX\n\nThe Associated Press reports that a well-known former investigative journalist\n\n for ABC News has been arrested on a charge of “transporting” images depicting\n\n the sexual abuse of children, the Department of Justice said on Wednesday.\n\n James Gordon Meek, 53, of Arlington, Virginia, who covered national security and\n\n the military, was arrested Tuesday, months after his home was searched by federal\n\n authorities.\n\nAuthorities found images of children engaged in sexually explicit conduct on\n\n electronic devices taken from his home. Authorities also discovered multiple\n\n conversations in which “participants expressed enthusiasm for the sexual abuse of\n\n children,” according to court papers.\n\n He faces a charge of transportation of child pornography, which calls for a\n\n minimum of five years and up to 20 years in prison, officials said. An email\n\n seeking comment was sent to Meek’s attorney.\n\n ABC News declined to comment Wednesday. Meek resigned from ABC News last\n\n year.\n\n The FBI’s investigation was prompted by a tip from Dropbox about videos\n\n showing the sexual abuse of children found in March 2021 in an account that was\n\n associated with Meek, according to court papers. Federal authorities searched his\n\n home in April.\n\n Investigators also found that Meek engaged with minors on platforms like\n\n Snapchat, according to court documents. A minor interviewed by law enforcement\n\n told authorities that Meek approached her through Snapchat and pressured her to\n\n provide sexually explicit photos, according to court papers.\n\nXXX\n\n Time now for our Worldview Report commentary.\n\n Fee Stories reports that one of Denmark’s largest newspapers has apologized to\n\n its readers for not questioning the government’s data and narratives throughout the\n\n first two years of the Covid pandemic.\n\n The Ekstra Bladet, founded in 1904, said it should have done more to examine the\n\n government’s data and conclusions before reporting them.\n\n Bladet journalist Brian Weichardt wrote:\n\n “For ALMOST two years, we - the press and the population - have been almost\n\n hypnotically preoccupied with the authorities' daily coronatal. THE CONSTANT\n\n mental alertness has worn out tremendously on all of us. That is why we – the\n\n press – must also take stock of our own efforts. And we have failed.”\n\n SHOW TWEET\n\n https://twitter.com/JanGold_/status/1480886686045384706?s=20&t=WFxo…\n\n Mw\n\nIn the mea culpa, Weichardt suggested the newspaper should have asked more\n\n questions about how public health officials were tabulating data, adding:\n\n “WE HAVE NOT been vigilant enough at the garden gate when the authorities\n\n were required to answer what it actually meant that people are hospitalized with\n\n coronavirus and not because of coronavirus. Because it makes a difference. A big\n\n difference. The official hospitalization numbers have been shown to be 27 percent\n\n higher than the actual figure for how many there are in the hospital, simply because\n\n they have coronavirus. We only know that now.”\n\n The newspaper continued its mea culpa by stating:\n\n “Of course, it is first and foremost the authorities who are responsible for\n\n informing the population correctly, accurately and honestly. The figures for how\n\n many are sick and died of coronavirus should, for obvious reasons, have been\n\n published long ago…We Failed.”\n\n Journalists should have avoided adopting the state’s rhetoric and narrative on\n\n vaccination and Denmark’s hospitals, particularly the superlatives that\n\n accompanied them, Weichardt stated, admitting that vaccines were also over-\n\n hyped.\n\n “The vaccines are consistently referred to as our ‘superweapon.’ And our hospitals\n\n are called ‘super hospitals,.’ Nevertheless, these super hospitals are apparently\n\n maximally pressured, even though almost the entire population is armed with a\n\n superweapon.”\n\n While this admission is admirable, it’s only one newspaper in one country. Don’t\n\n expect America’s corporate media to follow suit. They stand to lose too many\n\n advertising dollars from those pushing shots, which include Big Pharma, the\n\n government and all of the ancillary organizations that have boarded the vaccine\n\n gravy train.\n\n That does it for this edition of the Worldview Report. Thank you for watching and\n\n for supporting this broadcast.\n\n Until next time, may God save America. I’m Brannon Howse. Take care.\n\nCall 901-468-9357 for phone orders.\n\n -----------------------------------------------\n\n Get your free, no obligation packet on precious metals by texting or calling Wes Petes with Swiss America at 602-558-8585\n\n -----------------------------------------------\n\n Click here and visit www.wvwtvstore.com to order emergency, freeze-dried food that will last 25 years.\n\n -----------------------------------------------\n\n Please go to www.Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts. Sincerely Brannon Howse WVW Broadcast Network", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://rumble.com/embed/v2557v0/?pub=rze3r", "https://twitter.com/AZATHLETICS/status/1620208577570045952?s=20&amp;t=jmGP", "https://twitter.com/satanic_temple_/status/1522225566262476801?s=20&amp;t=F32jk4", "https://rumble.com/embed/v1kt1je/?pub=rze3r", "https://twitter.com/JanGold_/status/1480886686045384706?s=20&amp;t=WFxoOOWjMpUaWF03v6tW", "http://www.wvwtvstore.com/", "http://www.mypillow.com/"], "authors": [], "publish_date": null}