{"result_id": "351041", "URL": "https://www.worldviewweekend.com/news/article/scientists-have-developed-first-edible-vaccine", "timestamp": "2023-04-25 18:20:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/scientists-have-developed-first-edible-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "Scientists Have Developed The First \"Edible Vaccine\" | Worldview Weekend Broadcast Network", "cleaned_text": "\n• None The U.S. Army is getting ready to conduct training exercises testing its ability to mount a massive ground invasion in the Pacific.\n• None The CEO of a human resources tech company says artificial intelligence will “transform every single business going forward” and give workers “superpowers.”\n• None Volcanoes are waking up around the world.\n• None Euthanasia is becoming one of the leading causes of death in the Netherlands.\n• None And who was Connor Sturgeon, the man who shot up a downtown Louisville, Kentucky, bank? We have his profile.\n\nAll these stories and more when the Worldview Report begins, right now!\n\nGood evening and welcome to the Worldview Report.\n\nDefense News reports that China’s military declared Monday it is “ready to fight” after completing three days of large-scale combat exercises around Taiwan that simulated sealing off the island in response to the Taiwanese president’s trip to the U.S. last week.\n\nThe “combat readiness patrols” named Joint Sword were meant as a warning to self-governing Taiwan, which China claims as its own, China’s military said earlier.\n\n“The theater’s troops are ready to fight at all times and can fight at any time to resolutely smash any form of ‘Taiwan independence’ and foreign interference attempts,” it said Monday.\n\nThe exercises were similar to ones conducted by China last August, when it launched missile strikes on targets in the seas around Taiwan in retaliation for then-Speaker Nancy Pelosi’s visit to Taiwan, but have been smaller and less disruptive.\n\nMilitary experts say the exercises serve both as intimidation and as an opportunity for Chinese troops to practice sealing off Taiwan by blocking sea and air traffic, an important strategic option the Chinese military might pursue in the event it uses military force to take Taiwan.\n\nThe Chinese actions follow President Tsai Ing-wen’s delicate mission to shore up Taiwan’s dwindling diplomatic alliances in Central America and boost its U.S. support, a trip capped with a sensitive meeting with U.S. House Speaker Kevin McCarthy in California. A U.S. congressional delegation also met with Tsai over the weekend in Taiwan after she returned.\n\nChina responded immediately to the McCarthy meeting by imposing a travel ban and financial sanctions against those associated with Tsai’s U.S. trip and with increased military activity through the weekend.\n\nKuo Yu-jen, a defense studies expert and director of the Institute for National Policy Research in Taiwan, told Defense News:\n\n“China wants to use any increase of diplomatic interactions between the U.S. and Taiwan as an excuse to train its military.”\n\nThe exercises this time have focused more on air strength, with Taiwan reporting 200 flights by Chinese warplanes in the past three days. Chinese state broadcaster CCTV, citing the People’s Liberation Army, said the exercises are “simulating the joint sealing off” of Taiwan as well as “waves of simulated strikes” at important targets on the island.\n\nMeanwhile, on the other side of this growing conflict, the U.S. is preparing logistically for its Army to be able to mount a massive ground invasion in the Pacific.\n\nAccording to Defense News, the Army considers the Indo-Pacific to be the most challenging operational theater in the world.\n\nIn late July, the service will hold a large-scale exercise in Australia dubbed Talisman Sabre in cooperation with its allies, Australia, South Korea, Japan and Indonesia. As part of the two-week training event, the Army will deliver massive amounts of equipment across challenging terrain and large distances, Brigadier General Jered Helwig, the Army’s 8th Theater Sustainment Command commander, told Defense News.\n\nHe said during an interview at the Association of the U.S. Army’s Global Force Symposium in Huntsville, Alabama:\n\n“The scale is an order of magnitude higher than anything that has ever been done before. It’s been a huge undertaking. Just for one example, Australia’s got very strict agricultural requirements, and we have quadrupled the amount of equipment that we’re bringing … one of the contested things is ensuring that we can keep the leopard snail from getting into Australia.”\n\nThat has meant months cleaning equipment in Oahu, Hawaii, to prevent the tiny hitchhikers from migrating.\n\nLogistics and sustainment are central to carving out a key role for the Army in the Pacific as the U.S. seeks to deter China and prepares to protect allies and partners, according to Defense News.\n\nTop military officials have said the region will require the Army to adapt its approach to logistics, and the service is standing up a team focused on enabling the deployment of troops and large amounts of equipment in constantly contested environments.\n\n“We have to rehearse sustainment at scale and treat logistics as a warfighting function as we rehearse it as part of our campaigning.”\n\nThe CEO of a human resources tech company says artificial intelligence will “transform every single business going forward” and give workers “superpowers,” reports Business Insider.\n\nJob van der Voort told the outlet that staff use AI to search through information in databases on a daily basis at Remote, his HR company that helps firms employ people globally by managing their payroll, benefits, compliance, and taxes.\n\nGenerative AI platforms have been used by students to write essays, news outlets to publish articles, and job hunters to craft résumés and cover letters.\n\nBut, as noted by Business Insider, “AI can plagiarize material and develop bias, and some companies have warned their employees against using generative AI to help them with their jobs, with Amazon telling employees not to share confidential information with ChatGPT.”\n\nThe platform has been taken offline in Italy and tech CEOs, software engineers, and professors including Elon Musk and Steve Wozniak have signed an open letter calling for a six-month pause on advanced AI development.\n\n“This technology will change every business and all of our business in the most meaningful way possible,” he told Business Insider.\n\nVan der Voort said that Remote uses AI to automatically generate email responses to customers but that these are read by a member of staff before they're sent.\n\n“In a year or two from now at the latest, we'll have an AI just answering any email directly if it is confident about it,” he said. “And if it's not, then it will escalate it to a human.”\n\nThis next story is something we’ve reported here at the Worldview Report more than a week ago, but I think it’s worth repeating.\n\nSlay News is now reporting that scientists have developed the first “edible vaccines” in the form of cow’s milk that’s infused with mRNA technology.\n\nThe move comes amid a global push to vaccinate the food supply through gene-edited plants and livestock.\n\nThe milk was loaded with an experimental mRNA product similar to that found in the Covid shots.\n\nUsing “mRNA bovine milk-derived exosomes,” Chinese scientists managed to create an oral vaccine for SARS-CoV-2, the virus that causes COVID-19.\n\nThe milk programs the body to elicit an immune response when exposed to spike protein, according to their study.\n\n“These results indicated that bovine milk-derived exosome-based mRNA vaccine could serve as a new strategy for preventing SARS-CoV-2 infection. Meanwhile, it also can work as a new oral delivery system for mRNA.”\n\nSadly, this dangerous technology already has the potential to be introduced into America’s dairy supply.\n\nIn the United States, there is no law requiring informed consent for vaccines in the food supply.\n\nThe former Tennessee legislators who were ousted last week by the state’s Republican-led House of Representatives said on April 9 they would accept reappointments by their respective districts and will run in the special elections to fill their seats.\n\nJustin Pearson, a Democrat who had represented Memphis, and Justin Jones, a Democrat who represented Nashville, appeared on the deep-state corporate mouthpiece NBC News’s “Meet the Press,” vowing to return as lawmakers while trashing the Tennessee State Legislature.\n\nPearson called it a “toxic work environment” and Jones said the House “is an institution filled with people who are more concerned about supporting the NRA and supporting the Second Amendment than it is protecting the First Amendment rights of children and teenagers to be able to come to the Capitol to advocate for gun violence prevention laws.”\n\nThe truth is Democrats hate the First Amendment as much as they hate the Second. But they will hide under the First Amendment when it suits them while ignoring it when it comes to the free-speech rights of conservatives.\n\nOn March 30, hundreds of protestors assembled at the state Capitol in Nashville to demand stronger gun control laws after an assailant shot and killed three 9-year-olds and three adults at The Covenant School in the city.\n\nProtestors entered the House and Senate chambers, interrupting the day’s business, while chanting and shouting and even spitting on lawmakers and their staff.\n\nVice President Kamala Harris traveled to Nashville to meet with the three disgraced Democrats on April 7, and Joe Biden praised them during a video conference call from Camp David.\n\nThe Western hemisphere’s deadliest volcano is showing signs of increased activity, prompting evacuations in Colombia.\n\nIn 1985, the Nevado del Ruiz volcano erupted, killing 23,000 people in Colombia and wiping out the town of Armero. Now, Fortune magazine reports that authorities warn, the volcano could be ramping up to erupt again.\n\nExperts say the volcano is showing signs of increased activity, which haven’t been observed since the tragedy in the 1980s. As a result, the alert level has been raised from yellow to orange, the second-highest level on the scale and residents on the upper slopes of the volcano are being evacuated.\n\nLast week, the volcano registered an unprecedented average of 6,000 earthquakes per day, likely caused by magma moving through the main fault system, says Colombia's Geological Service (CGS). Prior to the change in status, the average was 50 per day.\n\nOn peak days, the CGS says, there have been as many as 12,000 earthquakes in a single day, though it notes “the number of daily earthquakes alone is not the only indicator that measures the behavior of a volcano.”\n\nThe Semeru Volcano in Indonesia is also percolating.\n\nThe actively growing lava dome in the inner Jonggring Saloko summit crater has generated a block-and-ash flow.\n\nThe pyroclastic flow descended along the steep southeastern ravine and reached approx. 1.5 km length as can be seen in this video recorded by local observers in the village of Huntap, where gray ash could be seen belching from the volcano.\n\nA shooting Monday at a bank in downtown Louisville killed four people and injured six others, including two police officers. The shooter was also shot dead by police.\n\nThe shooter has been identified as Connor Sturgeon, a 23-year-old Louisville banker. The deranged gunman was reportedly a loan officer at the Old National Bank, where the shooting took place.\n\nLike clockwork, Joe Biden immediately blamed the gun for the crime.\n\nThe timing of the attack and his posts on Instagram just minutes before indicate Sturgeon targeted bank employees and had an ax to grind against those who don’t support transgenderism.\n\nSome suggest Sturgeon’s post stating “they won’t listen to words or protests,” was a reference to recent protests regarding trans rights and the calls for violence by the TRANS organization.\n\nDalton Godbey of WDRB News tweeted: “The shooter who killed four people and injured nine others at Old National Bank in Louisville posted these messages on his Instagram this morning. The last post by 23-year-old Connor Sturgeon read, ‘They won’t listen to words or protests. Let’s see if they hear this.'”\n\nLouisville Metropolitan Police Department Deputy Chief Paul Humphrey told reporters that officers who arrived on the scene “found active gunshots inside the location at the time.”\n\nVideo of the scene showed police running to warn people outside the bank while shouting, “Active shooter at the bank!”\n\nAccording to a report by Intel Point Alert, Sturgeon texted a friend before the shooting saying he was feeling suicidal and “would shoot up the bank.”\n\nBut here’s what the mainstream media won’t tell you.\n\nOn his Linked-In profile, Sturgeon listed he preferred pronouns as He/Him, marking him as a radical progressive pro trans lunatic.\n\nBut that’s not all.\n\nSturgeon was also a Trump hater. He posted in an online chat room calling the former president a “frail, pathetic, thin-skinned loser.”\n\nSo any media that tries to paint this man as a conservative or as “MAGA” just because he was a white male banker, is lying.\n\nEuthanasia now accounts for 5 percent of the deaths in the Netherlands.\n\nIn 2022, the Netherlands experienced an unprecedented increase in the number of recorded euthanasia cases, reports LifeSite News.\n\nAt the same time, the share of euthanasia and assisted suicide in the total number of deaths increased.\n\nIn total, 8,720 requests for euthanasia were honored, compared with 7,776 the previous year. This represents an increase of more than 13 percent.\n\nThe percentage of deaths by euthanasia rose from 4.6% in 2021 to 5.1% in 2022. This means that one in 20 deaths was caused by a lethal injection. Although this is not quite a “new normal” in Dutch society, it is at least a sign of “normalization.” Euthanasia is no longer seen as a rare exception.\n\nEuthanasia has been legal in the Netherlands since the Dutch end-of-life law came into force in 2002. Until 2007, the number of annual euthanasia cases did not exceed 2,000. In 2016, it exceeded 6,000 cases for the first time. The development over 20 years shows that the legality of the act is increasing the demand for and use of euthanasia while at the same time the legally acceptable grounds for euthanasia are expanding. Canada has recently decided to go down this same road. The U.S. is trying to move the goal posts in the same direction. We can see here it leads in the same direction as abortion and recreational drug use. You legalize it. You get more of it.\n\nThe Biden regime filed papers with a federal appeals court asking it to block a federal judge’s ruling banning the abortion pill nationwide.\n\nAs LifeNews reported, a federal judge has issued a ruling that will stop the sales of the drugs nationwide and possibly save hundreds of thousands or even millions of babies from abortions.\n\nThe chemical abortion drug Mifepristone is used for more than half of all abortions in the U.S. every year, killing hundreds of thousands of unborn babies, according to the pro-abortion Guttmacher Institute.\n\nBut a new lawsuit, filed by a group of doctors with the Alliance for Hippocratic Medicine, challenges the U.S. Food and Drug Administration’s approval and later expansion of the deadly drug under the Clinton, Obama and Biden administrations. Represented by the Alliance Defending Freedom, the doctors point to evidence that the FDA ignored safety problems and failed to properly study the risks of Mifepristone.\n\nJudge Matthew Kacsmaryk of the Northern District of Texas issued the ruling blocking approval of the dangerous abortion pill. Kacsmaryk issued a ruling in Alliance for Hippocratic Medicine vs. FDA that halts FDA approval of the chemical abortion drug Mifepristone and gave Biden seven days to appeal the ruling.\n\n“By illegally approving dangerous chemical abortion drugs, and imposing its mail-order abortion regime, the FDA put women in harm’s way, and the agency should be held accountable for its reckless actions. Pregnancy is not an illness, and chemical abortion drugs don’t provide a therapeutic benefit—they can cause serious and life-threatening complications to the mother, in addition to ending a baby’s life. The district court’s ruling last week was a significant victory for the doctors and medical associations we represent and, more importantly, the health and safety of women and girls.”\n\nTime now for our Worldview Report commentary.\n\nNick Arama has an important article up at Red State that’s worth a read.\n\nHe talks about America’s rapidly falling level of respect from around the world.\n\nAmerica may have been hated in certain corners of the Post-World War II world order, built on the strength of the U.S. petrodollar and the U.S. as the world policeman, but at least American power was respected.\n\nThat’s no longer the case. One national leader after another has taken his turn openly bashing the U.S. in recent months, from the president of Mexico to the princes in Saudi Arabia.\n\nBut now, even America’s oldest ally, France, appears to be getting ready to cut the ties.\n\nPresident Emanuel Macron has been making concerning statements after returning from his visit with Chinese leader Xi Jinping, which makes one wonder what all was said and agreed upon during their private meetings.\n\nMacron said Europe must reduce its dependency on the United States and avoid getting dragged into a confrontation between China and the U.S. over Taiwan.\n\nSpeaking with POLITICO and two French journalists after spending around six hours with Chinese President Xi Jinping during his trip, Macron underscored his theory of “strategic autonomy” for Europe to become a “third superpower.”\n\nHe said “the great risk” Europe faces is that it “gets caught up in crises that are not ours, which prevents it from building its strategic autonomy.”\n\nHe also told the journalists that:\n\n“The paradox would be that, overcome with panic, we believe we are just America’s followers. The question Europeans need to answer … is it in our interest to accelerate [a crisis] on Taiwan? No. The worse thing would be to think that we Europeans must become followers on this topic and take our cue from the U.S. agenda and a Chinese overreaction.”\n\nHe also stated that Europe should reduce its dependence on the “extraterritoriality of the U.S. dollar.” In doing so, Macron echoed a key policy objective of both Russia and China to strip away the U.S. dollar as the world’s reserve currency.\n\nYou can see here that NATO is not as united as the Biden regime would have us believe.\n\nLook for Macron to be the leader in pulling Europe, at least a chunk of it, out of the American orbit in the months and years ahead.\n\nThat does it for this edition of the Worldview Report. Thanks for tuning in, and for your support of this viewer-supported broadcast.\n\nUntil next time, may God save America. I’m Brannon Howse. Take care.\n\nCall 901-468-9357 for phone orders or to make a donation\n\n ----------------------------------------------------------------------------------------------------\n\n Get your free, no obligation packet on precious metals by texting or calling Wes Peters with Swiss America at 602-558-8585\n\n ----------------------------------------------------------------------------------------------------\n\n FREE SHIPPING - Click here and visit www.wvwtvstore.com to order emergency, freeze-dried food that will last 25 years. \n\n ----------------------------------------------------------------------------------------------------\n\nPlease help us with the huge cost of producing and distributing FREE radio and television programs by making a contribution at www.wvwfoundation.com or by calling 901-468-9357 or by sending your contribution to:\n\nPlease go to www.Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.defensenews.com/news/your-military/2023/04/10/china-military-ready-to-fight-after-drills-near-taiwan/", "https://www.defensenews.com/digital-show-dailies/global-force-symposium/2023/04/07/army-readies-for-record-setting-logistics-exercise-in-pacific/", "https://www.defensenews.com/training-sim/2019/07/23/see-japanese-us-forces-assault-a-beach-during-the-talisman-sabre-exercise/", "https://www.defensenews.com/land/2022/10/10/us-army-heightens-focus-on-contested-logistics-in-pacific/", "https://www.defensenews.com/digital-show-dailies/ausa/2022/10/11/us-army-materiel-command-tasked-to-ramp-up-joint-logistics-in-pacific/", "https://www.defensenews.com/land/2023/03/29/us-army-forms-new-modernization-team-to-tackle-contested-logistics/", "https://www.businessinsider.com/generative-ai-tech-workers-superpowers-remote-job-van-der-voort-2023-4", "https://www.businessinsider.com/chatgpt-essays-college-cheating-professors-caught-students-ai-plagiarism-2023-1", "https://www.businessinsider.com/buzzfeed-writers-react-ai-generated-articles-content-chatgpt-maker-openai-2023-1", "https://www.businessinsider.com/chatgpt-avoid-parking-fine-openai-letter-council-2023-4", "https://www.businessinsider.com/nyc-schools-ban-chatgpt-cheating-concern-grows-2023-1", "https://www.insider.com/chatgpt-is-like-many-other-ai-models-rife-with-bias-2023-1?_gl=1*126s9n3*_ga*NzUzNDA4MzM2LjE2NzYwMTcxOTY.*_ga_E21CV80ZCZ*MTY3Njk3MjYwNC40NS4xLjE2NzY5NzQ1OTkuMC4wLjA.", "https://www.businessinsider.com/amazon-chatgpt-openai-warns-employees-not-share-confidential-information-microsoft-2023-1", "https://www.businessinsider.com/chatgpt-banned-by-regulators-in-italy-over-data-privacy-concerns-2023-3", "https://www.businessinsider.com/elon-musk-ai-pause-openai-gpt4-powerful-development-2023-3", "https://slaynews.com/news/mrna-spiked-milk-vaccinate-food-supply/", "https://www.biorxiv.org/content/10.1101/2022.12.19.517879v1.full.pdf", "https://www.bbc.com/news/world-latin-america-65162781", "https://www2.sgc.gov.co/Noticias/Paginas/Que-esta-pasando-en-el-volcan-Nevado-del-Ruiz-actualizacion-05-abril-2023.aspx", "https://twitter.com/volcaholic1/status/1645016638373220354?s=20", "https://www.newsweek.com/trans-day-vengeance-date-details-activists-choose-fight-1791451", "https://twitter.com/DaltonTVNews/status/1645509091765174274?s=20", "https://twitter.com/MSNBC/status/1645434736070868992?s=20", "https://twitter.com/krassenstein/status/1645428045996515331?s=20", "https://www.usasupreme.com/the-louisville-bank-shooter-has-been-identified-as-connor-sturgeon-he-him-was-weres-linkedin-profile-remains-active-screenshot/", "https://twitter.com/CitizenFreePres/status/1645513308093521920?s=20", "https://www.lifesitenews.com/analysis/euthanasia-now-accounts-for-5-of-deaths-in-the-netherlands/", "https://www.lifenews.com/2023/04/08/federal-judge-blocks-dangerous-abortion-pill-nationwide-saving-babies-from-abortion/", "https://www.lifenews.com/2022/02/24/report-shows-half-of-babies-killed-in-abortions-now-killed-with-dangerous-abortion-pill/", "https://www.lifenews.com/2023/02/07/judge-could-stop-sales-of-dangerous-abortion-drug-nationwide-save-countless-babies/", "https://urldefense.com/v3/__https:/link.quorum.us/f/a/WSuUZd6srFYB4j213Aq3Rg**A/AACYXwA*/RgRmEzy8P0R2aHR0cHM6Ly93d3cuY291cnRsaXN0ZW5lci5jb20vZG9ja2V0LzY1NzY4NzQ5LzEzNy9hbGxpYW5jZS1mb3ItaGlwcG9jcmF0aWMtbWVkaWNpbmUtdi11cy1mb29kLWFuZC1kcnVnLWFkbWluaXN0cmF0aW9uL1cDc3BjQgpkIry3MGQUUJITUhtyZWJlY2NhLndlc3RAbWFpbC5ob3VzZS5nb3ZYBAAAAAA*__;fn5-fg!!Bg5easoyC-OII2vlEqY8mTBrtW-N4OJKAQ!J4m3iZuLgBLrxNd-6P5ubSb45h83vk3vn6Ep41Or2O-1t8PunRw3PIPyD8d42_Ku1iViOB7QDGEp24y8VyZeu8wbfQ$", "https://redstate.com/nick-arama/2023/04/09/macrons-words-after-meeting-with-xi-are-so-bad-they-should-be-setting-off-alarms-for-u-s-and-taiwan-n728907?bcid=16355dec4c83e14e4f48f36d7bfa0067", "https://www.politico.eu/article/emmanuel-macron-china-america-pressure-interview/amp/", "https://www.politico.eu/article/emmanuel-macron-china-america-pressure-interview/", "http://www.wvwtvstore.com/", "http://www.wvwfoundation.com/", "http://www.mypillow.com/"], "authors": [], "publish_date": null}