{"result_id": "351021", "URL": "https://www.worldviewweekend.com/news/article/national-vaccine-pass-has-quietly-rolled-out-and-red-states-are-getting-board", "timestamp": "2023-04-25 18:19:39 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/national-vaccine-pass-has-quietly-rolled-out-and-red-states-are-getting-board", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "A National Vaccine Pass Has Quietly Rolled Out – And Red States Are Getting On Board | Worldview Weekend Broadcast Network", "cleaned_text": "A National Vaccine Pass Has Quietly Rolled Out – And Red States Are Getting On Board by Suzanne Rowan Kelleher for Forbes\n\nEven as the omicron variant loosens its grip on the world, destinations continue to require travelers to show proof of vaccination. And, increasingly, a paper CDC vaccination card is not cutting it.\n\nWhile the United States government has not issued a federal digital vaccine pass, a national standard has nevertheless emerged. To date, 21 states, the District of Columbia and Puerto Rico offer accessibility to the SMART Health Card, a verifiable digital proof of vaccination developed through the Vaccination Credential Initiative (VCI), a global coalition of public and private stakeholders including Microsoft, Salesforce, Oracle, the Mayo Clinic and other health and tech heavyweights.\n\nAnd very soon, at least four more states will be rolling out access to SMART Health Cards. “We’ve seen a notable uptick in states that have officially launched public portals where individuals can get verifiable vaccination credentials in the form of SMART Health Cards with a QR code,” says Dr. Brian Anderson, co-founder of the VCI and chief digital health physician at MITRE.\n\nThere is already an impressively widespread availability of SMART Health Cards in the U.S. More than 200 million Americans can now download, print or store their vaccination records as a QR code. When the QR code is pulled up, only the individual’s name, date of birth and vaccination information is visible. No other medical information or personal data is shared. This code is also digitally signed to ensure that the card was issued from a verified location and to prevent forgery.\n\nHelps Us Cover Our Huge Streaming Bill So You and Millions of Americans Can Watch Our TV Shows For Free. Many organizations put all their shows behind a pay-wall immediately but we make our shows available for all to watch as a public and educational service of WVW-TV and WVW Foundation. You can also use our mailing address to send your tax deductible support:\n\nIn 2016, WVW-TV began to urge our radio and television audience to prepare for increasingly uncertain times such as:\n• an EMP attack from China, Russia, Iran, or North Korea\n• A cyber attack on our critical infrastructure, including power-grid, water utilities and/or the banking industry\n\nThen, 2020 happened with the biological attack on America by Communist China through Covid-19. Finding hamburger meat, a can of soup, pasta, a can of tuna, and other basics became shockingly challenging.\n\nThose who had mocked our organization for calling on our audience to prepare with an emergency food supply were no longer laughing at us. In fact, some of them began to order emergency food from our store.\n\nI have enjoyed Mountain House food on camping trips going back to when I was in high school. I purchased 6 months of food for 5 people in April of 2013 for my family. Three and a half years later, Worldview Weekend became a distributor for Mountain House because we personally know and testify to the quality of the food and understand the need for families to have \"food insurance\" in an increasingly dangerous world.\n\nPlease go to www.wvwtv.com/store\n\nto place your order while we have the inventory or go directly to this link: https://shop.worldviewweekend.com/products/cat/14841\n\nYour purchase of emergency, freeze dried food will not only support your family, but you will also be supporting the continuation of WVW Broadcast Network and all our free radio and television programs through your purchase.\n\nGet your free, no obligation packet on precious metals by texting or calling Wes Petes with Swiss America at 602-558-8585", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.forbes.com/sites/suzannerowankelleher/", "https://smarthealth.cards/", "https://vci.org/", "https://www.mitre.org/", "https://www.forbes.com/sites/suzannerowankelleher/2022/02/24/national-vaccine-quietly-rolled-out/?sh=4d336a8c6be6", "http://www.wvwfoundation.com/", "http://www.wvwtv.com/store", "https://shop.worldviewweekend.com/products/cat/14841"], "authors": [], "publish_date": null}