{"result_id": "351007", "URL": "https://www.worldviewweekend.com/news/article/whats-causing-pfizers-vaccine-vials-glow-whistleblower-says-its-most-likely-luciferase?amp", "timestamp": "2023-04-25 18:19:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/whats-causing-pfizers-vaccine-vials-glow-whistleblower-says-its-most-likely-luciferase", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "What's Causing Pfizer's Vaccine Vials to Glow? Whistleblower Says it's Most Likely 'Luciferase' | Worldview Weekend Broadcast Network", "cleaned_text": "Pfizer employee Melissa Strickler McAtee blew the whistle on the pharmaceutical giant's duplicitous efforts to con Christians into believing their vaccine did not use fetal cell lines in the testing phase.\n\nBut there's more to know about the Pfizer vaccine and McAtee issued new bombshells in an Oct. 19 video interview with Brannon Howse. She said the company has yet to explain why the liquid substance in the vaccine vials appears to glow and why so many Pfizer employees at the plant in Kansas still refuse to get injected with the vaccine.\n\nMcAtee became a public figure overnight when she leaked emails from Pfizer execs in a Project Veritas video proving the company willfully sought to deceive people into believing the fetal cells were not an issue with its experimental mRNA injections. She was promptly terminated. The video has been viewed 3.2 million times on YouTube since it was posted by Veritas on Oct. 6. Her last day of employment was Oct. 19, and Pfizer canceled her retirement benefits despite her 10 years of service at the company's McPherson, Kansas, plant.\n\nIn a follow-up interview with Howse, the firebrand former Pfizer quality control worker revealed how Pfizer colluded with the Vatican to cover up the truth about the vaccine's reliance on fetal cell lines in the development and testing phase.\n\nShe told Howse she did not want to be seen as a martyr for speaking out and losing her job.\n\n\"I couldn't stomach to work for a company like that, honestly,\" McAtee said. \"I feel it's my job to do that. That's literally what quality does to raise issues and when they're not getting addressed it's to make sure they get addressed. I looked at hundreds of thousands of units.\"\n\nShe said the first red flag was that the vials glowed.\n\n\"Only the liquid solution, the product, in a bluish florescent blue light. For some reason when it's in white or translucent light, but if that light changes to a black or grayish background it shows as a florescent blue light.\n\n\"It's much more translucent on a white background to be slightly yellowish and then it goes in front of black and it's just a very pretty blue color.\"\n\n\"What is that blue color?\" Howse asked.\n\n\"They still won't tell me,\" she said. \"At first they tried to say it was a reflection of the lid, which is purple.\"\n\nIn a series of photos, McAtee shows the difference between the Pfizer jab vials and other products packaged by the company. Only the jab vials glow.\n\n\"But we've run other purple-cap product and it's clear. The lid has nothing to do with the product color, regardless of the lid color or the background....This is the jab. Same light, same table, no different environment, it glows.\"\n\nIn fact, she said Pfizer strategically placed white labels lower than normal on the vaccine vials so that the glowing product would appear less obvious. This manipulation of the packaging helps obscure the appearance of the product.\n\nMcAtee said the most important issue for her is that people get informed consent before being injected.\n\n\"I don't care who gets the vaccine, I don't care about any of that; I care that people are informed and they know what they are injecting into their bodies,\" she said. \"And I personally believe as a Pfizer employee, due to my experience and my interaction with the company, that the people are not being well informed. If the people knew this vaccine glowed, would they get it? If people knew that the FDA is kind of skimming over all this, on this specific product, would they get it?\"\n\nIn her 10 years at the plant, McAtee said she's never seen a glowing liquid in a vial.\n\n\"I was devastated. I saw it immediately,\" she said. \"No one, all the people on the line were like what do you say? What do you do? One of the leads was saying it literally looked like you took a blue glow stick and poured it in a vial.\"\n\nMcAtee has researched the product and can only speculate that the glowing component could be related to a product called Luciferase.\n\n\"Luciferase has a blue light. That's the only thing I can find that makes sense.\"\n\nLuciferase is a chemical dye containing an oxidative enzyme that produces bioluminescence. It is used in the vaccines to track the movement of lipid nanoparticles that carry the messenger RNA throughout the body. The generic term Luciferase is from the root word Lucifer, which means \"light bearer.\"\n\nMcAtee said she noticed early on that the vaccine was \"moving seamlessly\" through the manufacturing process, devoid of any of the production hiccups that typify other products.\n\n\"Most products don't move through the plant without any problems. But this product is just seamlessly moving through the plant,\" she said.\n\nBatches can be as big as 25 pallets. \"This is quite a bit. So I would say it's probably a couple of hundred thousand doses a day [being produced],\" she said.\n\nTypically, even a missing signature, a missing date, would trigger a quality issue, causing that entire batch to get held up for further checks.\n\n\"Normally Pfizer is really good with staying on top of those things and making sure that only good quality product is getting out, but with this product that's not the case. Specifically just the Covid batches seem to seamlessly move throughout the process, without issues, no failures, no holdbacks, and some of my friends who are still in the plant, who oversee this product regularly, they're just not comfortable. Some people are being made to sign off on things that normally they wouldn't, and it's just making everybody skeptical of everything and then they wonder why their own employees won't take it.\"\n\nShe said Pfizer is being less than honest about its employee vaccination rate.\n\n\"They tell us 90 percent of the plant is vaccinated but we know that's not true. Even the vaccinated people are willing to leave over this [quality issues] but supposedly over half the plant is not vaccinated.\"\n\nShe estimated that only about 50 percent of Pfizer's own employees in Kansas actually received the vaccine.\n\n\"Some have been there close to 20 years and they are risking it all by not getting the vaccine.\"\n\nAbout 1,200 people work at the plant in McPherson and about 25 percent of the plant is working on producing the Pfizer vaccine, which continues to be administered under an emergency use authorization by the FDA. The FDA granted full licensure to a separate product called Comirnaty that is not currently available and likely won't be for at least two years.\n\n\"This is the only time we've ever received ingredients and told just to mix them. The people at the plant in McPherson don't even know what it is they're mixing. They almost always know. As far as I know this is the only one that's different.\"\n\nHowse asked McAtee if she was concerned for her safety since she came out as a whistleblower.\n\n\"Yes, but I'm in good hands with God so whatever is supposed to happen I trust him,\" she said.\n\n\"I think, honestly, one of the biggest things I want people to know is to research this yourself, because I wouldn't know any of this if I hadn't taken things into my own hands. And once I searched their database, people have been giving me a hard time about the fetal cell line thing, saying this was common knowledge, and that's just the tip of the iceberg. And the point was to show they are being deceitful about something that should be common knowledge and well known by everybody.\n\n\"But yet, many Christians and Catholics were told Pfizer's' vaccine was special and did not include any fetal cell lines in the development or testing at all and they were misled and got their vaccine.\"\n\n\"From emails I've leaked through Project Veritas, they very clearly state that it was used in the development and testing but to not make a big deal about that, to use careful wording,\" McAtee said.\n\n\"The Vatican has already said that pro-lifers have no excuse not to get our vaccine so let's just stick with the selected wording that the Vatican has already agreed upon. They're very scripted, very careful with their words because they know they can't lie but they can sure try to deceive people with their verbiage that the common person may not understand.\"\n\nHowse asked if she anticipates any legal action being filed against her by Pfizer.\n\n\"If they want to make themselves look good I'm sure they would but they don't have a leg to stand on because everything I've said I can back up,\" McAtee said.\n\nShe believes history will be a harsh judge on the pharmaceutical industry and its government regulators.\n\n\"I remember people sitting in history class saying how did Hitler do that? How did he convince so many people the Jews were bad and they needed to be exterminated?\" McAtee said. \"And yet people from outside had no idea it was even going on for a while because it was all propaganda. In America they showed people in the footage [from Germany] gardening and playing outside. It was very selective footage they would show and it was just all propaganda that the Nazis were doing good things for the Jews like keeping them separate for their own good. I kind of feel we're heading right back to that but just with, and if I'm being honest, it's mostly Christians and people of faith who don't want to get this, and it's eventually going to segregate people out, and even people who don't follow a faith but maybe just don’t feel right doing this are going to be counted out and we're going to be deemed a danger to society – just like Hitler convinced people the Jews were.\"\n\nMcAtee said she will eventually have to hire an attorney. She is raising funds for her legal defense at GiveSendGo.\n\nPlease go to Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts and FREE articles.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.worldviewweekend.com/tv/video/pfizer-whistleblower-melissa-mcatee-vaccine-glowing-and-what-happened-when-she-confronted", "https://www.youtube.com/watch?v=FUXGB5FzhPc", "https://www.alecsatin.com/what-is-luciferase/", "https://givesendgo.com/pfizerwhistleblower", "http://www.mypillow.com/", "http://www.wvwfoundation.com/"], "authors": [], "publish_date": null}