{"result_id": "351016", "URL": "https://www.worldviewweekend.com/news/article/rinos-globalists-big-business-and-big-pharma-unite-covid-collaborative", "timestamp": "2023-04-25 18:19:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/rinos-globalists-big-business-and-big-pharma-unite-covid-collaborative", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "RINOs, Globalists, Big Business and Big Pharma Unite For Covid Collaborative | Worldview Weekend Broadcast Network", "cleaned_text": "Few would doubt that the response to the Covid 19 virus and vaccine roll out is highly coordinated from deep within the progressive machine. Virtually no thinking person anywhere on planet Earth would dispute that the Pandemic has been politicized and used to alter the 2020 election process and outcome. Covid responses have also reshaped everyday life and the economy on a global scale.\n\nSo who is coordinating it? Who has taken the lead in developing the initiatives, the narratives, and the media for the Pandemic Industrial Complex? What funding is behind it and who composes the “Covid Pandemic Brain Trust”?\n\nHERE IS THE ANSWER – OR AT LEAST ONE MAJOR ORGANIZATIONAL EFFORT.\n\nWe will look in this article at the organization called the “Covid Collaborative” and its initiatives, leadership, funding and programs. Little commentary is needed in this brief overview of the organization and the efforts it is coordinating on a daily basis. These decisions impact all our lives while it is highly likely we did not even know the organization existed.\n\n“We’ve assembled a diverse and comprehensive team of experts, leaders and institutions in health, education, and the economy representing the diversity of the country to shape the work of the COVID Collaborative, develop consensus recommendations, and engage with local, state and national leaders – ensuring that our efforts are truly from the nation, for the nation.”\n\n“Many institutions of higher education are taking steps to maximize vaccinations and implement risk mitigation within their communities in order to become \"COVIDSafeZones.\"\n\n“ #TurnThePage Project is about writing the next chapter in education, together. COVID-19 pushed a system with persistent opportunity gaps deeper into crisis, with our most disadvantaged students facing the greatest challenges. To ensure this is a moment of reinvention for our schools, for our teachers, and for our students, we must listen to and elevate transformative people, perspectives, programs, and policies.”\n\nThe Walton Family Foundation is, at its core, a family-led foundation. Three generations of the descendants of our founders, Sam and Helen Walton, and their spouses, work together to lead the foundation and create access to opportunity for people and communities. We work in three areas: improving K-12 education, protecting rivers and oceans and the communities they support, and investing in our home region of Northwest Arkansas and the Arkansas-Mississippi Delta.\n\nMORE ON THE COVID COLLABORATIVE EDUCATION INIATIVES\n\n“APRIL 28, 2021, Washington, D.C. | An independent task force published resources today to support schools and districts in implementing CDC guidance and getting students and staff safely back for in-person learning. The resources, which come as schools across the country are reopening or preparing for reopening in the fall, are designed to help integrate effective infection prevention and control measures in schools, which can keep transmission of COVID-19 near zero, even with community spread.”\n\n“The task force was convened by the COVID Collaborative, Harvard’s Edmond J. Safra Center for Ethics, Brown School of Public Health, and New America, and brings together representatives from across health and education, from associations representing teachers, principals and superintendents, to public health institutions and professional associations. The initiative was launched shortly after President Biden set a target to reopen a majority of schools by May 1 with the goal of supporting schools as they reopened in-person learning.”\n\n“These materials, developed by Chiefs for Change with the support of the Rockefeller Foundation, can help districts design and implement a testing program inside schools.”\n\nTHE MASSIVE AD CAMPAIGN FOR VACCINE EDUCATION\n\nCOVID-19 Vaccine Education Initiative by the Ad Council and COVID Collaborative\n\n“The Ad Council and COVID Collaborative have partnered to educate the American public and build confidence around the COVID-19 vaccines, as part of one of the largest public health education campaigns in history.”\n\nIF YOUR COMPANY IS INTERESTED IN BECOMING A #COVIDSAFEZONE, PLEASE CONTACT COVIDSAFEZONES@COVIDCOLLABORATIVE.US\n\nThe United States sits at a critical juncture in our efforts to move beyond the pandemic. We are seeking your help. More than 164 million Americans – representing 58 percent of the eligible population – have been fully vaccinated, providing substantial protection against illness, reducing deaths, lessening the burden on hospitals, and reducing missed workdays and closures. Increasing vaccination rates is the country’s most immediate and best hope of reaching population immunity, beating the pandemic, and restoring our national vitality and way of life.”\n\n“The #COVIDSafeZones recommendations are not a broad vaccination mandate. We believe they are consistent with established precedent and any state laws that prohibit broad vaccination requirements in places of business. “\n\n“These recommendations are temporary measures until we are reliably back to low COVID rates and the public health threat is behind us. The recommendations can be combined with other steps such as improved ventilation and distancing. “\n\nNew tool shows more than 50 percent of the population is vaccine-hesitant in over 580 ZIP codes across the US\n\n“COVID Collaborative, Health Action Alliance, and partners representing rural America hosted a National Business Summit on engaging employees and residents in rural areas and small cities, offering case studies, best practices and actionable tools for employers and other leaders. The Summit featured guest speakers including U.S. Secretary of Agriculture Tom Vilsack; White House Vaccinations Coordinator Bechara Choucair; and COVID Collaborative co-chair and former Governor Dirk Kempthorne. “\n\n“COVID Collaborative and Blue Star Families have teamed up to support servicemembers and their families in getting the information needed to build confidence and increase vaccine uptake.”\n\nU.S. Global Health Experts Urge G7 Action to Vaccinate the World Quickly and Equitably\n\n“Open Letter to G7 leaders proposes five-point action plan - including sharing of at least one billion doses worldwide this year and striving to vaccinate at least 60% of every country's population in 2022”\n\n“COVID Collaborative, along with Center for Global Development, Center for Strategic & International Studies (CSIS), and three units of Duke University issued an open letter urging the G7 leaders and member states to use their vaccine expertise and manufacturing capacity to accelerate global access to vaccines while meeting domestic health needs. The letter was endorsed by a number of renowned global health experts.”\n\n“The letter highlights that today’s global vaccine gap is not just a supply problem, but also a massive distribution and delivery challenge. To this end, we call on G7 leaders to take action in five areas:”\n\n“Ray Chambers- Ray Chambers is a philanthropist and humanitarian who has directed most of his efforts towards helping children. He is the chairman of The MCJ Amelior Foundation, and the co-founder of COVID Collaborative.\n\nHe is the founding Chairman of the Points of Light Foundation and co-founder, with Colin Powell, of America’s Promise - The Alliance for Youth.”\n\n“John Bridgeland is Founder and CEO of Civic, a social enterprise firm in Washington, D.C. He is also Vice Chairman of the Service Year Alliance, an initiative to create a civilian national service counterpart to military service in the United States; Vice Chairman of Malaria No More; Co-Convenor of the Grad Nation campaign; Co-Chair of the Future of Work Initiative; and Co-Founder of the High Seas Initiative to bring the national park idea to the ocean. … President Obama appointed Bridgeland to the White House Council for Community Solutions. Bridgeland previously served as Director of the White House Domestic Policy Council in the first term of President George W. Bush, and Assistant to the President and first Director of the USA Freedom Corps,”\n\nHe is President of the COVID Collaborative and a principal of Civic Enterprises, a bipartisan ideas company that partners with think tanks, foundations, nonprofits, and corporations to advance solutions to key domestic and international challenges… In government, Edson served as Deputy National Security Advisor and “Deputy National Economic Advisor to President George W. Bush. He established the ground-breaking Millennium Challenge Corporation to fight global poverty; co-led the launch of the President’s Emergency Plan for AIDS Relief (PEPFAR),… Edson was also President Bush’s chief negotiator for summits of G7/8, Latin American, EU, and Asia-Pacific leaders.”\n\nCOVID COLLABORATIVES ASSORTMENT OF LEADERS IN THE ADVISORY COUNSIL\n\nThe Advisory Council has a virtual who’s-who of Obama era operatives, RINO former Governors and Bush administration appointees along with media, University heads and political healthcare operatives.\n\nHEALTHCARE POLITICIANS-JUST A SAMPLING BELOW. NOTE FEW IF ANY ARE PRACTICING PHYSICIANS .\n\n“Andy Slavitt was President Biden’s White House Senior Advisor for the Covid response. He has led many of the nation’s most important health care initiatives, serving as President Obama’s head of Medicare and Medicaid and overseeing the turnaround, implementation and defense of the Affordable Care Act. Slavitt is the “outsider’s insider”, serving in leading private and non-profit roles in addition to his government services. he is founder and Board Chair Emeritus of United States of Care, a national non-profit health advocacy organization as well as a founding partner of Town Hall Ventures, a healthcare firm that invests in underrepresented communities.”\n\n“Regina Benjamin served as the 18th U.S. surgeon general from 2009 to 2013, appointed by President Barack Obama.”\n\n“Joycelyn Elders, the first person in the state of Arkansas to become board certified in pediatric endocrinology, was the fifteenth Surgeon General of the United States, the first African American and only the second woman to head the U.S. Public Health Service. Long an outspoken advocate of public health, Elders was appointed Surgeon General by President Clinton in 1993.”\n\n“David Satcher, M.D., Ph.D. was the 16th Surgeon General of the United States and former Secretary for Health in the Department of Health and Human Services. He was the second person in history to hold both posts simultaneously. His tenure of public service also includes serving as Director of the Centers for Disease Control and Prevention from 1993 to 1998.”\n\n“Barbara Bush is a fellow with Schmidt Futures focused on racial justice and health equity.\n\n“She is co-founder and Board Chair of Global Health Corps, an organization that mobilizes a global community of young leaders to build the movement for health equity. Since 2009, Global Health Corps has supported over 1,000 young leaders to solve the world’s most pressing global health issues. Barbara served as GHC’s CEO for its first 9 years.”\n\n“David Brailer, MD, PhD, is known around the world for his leadership and entrepreneurialism in health care, particularly in the use of health information technology. Over the past three decades, Dr. Brailer has built a variety of private and public sector organizations… From 2007 to 2017, Dr. David Brailer was a managing partner at HEP, a fund that invested in companies with the potential to transform health care delivery.”\n\n“Nancy Brown is CEO of the American Heart Association (AHA), a 96-year-old organization guided by a mission: To be a relentless force for a world of longer, healthier lives. Under Nancy’s leadership, the AHA has risen from the largest and oldest nonprofit focused on cardiovascular diseases and stroke, to a global authority in overall health and well-being.”\n\n“Robert M. Califf, MD, MACC, is the Head of Clinical Policy and Strategy for Verily and Google Health. Prior to this Dr. Califf was the vice chancellor for health data science for the Duke University School of Medicine; director of Duke Forge, Duke’s center for health data science; and the Donald F. Fortin, MD, Professor of Cardiology. He served as Deputy Commissioner for Medical Products and Tobacco in the U.S. Food and Drug Administration (FDA) from 2015-2016,”\n\n“Beth Cameron is Nuclear Threat Initiative’s vice president for global biological policy and programs.\n\nCameron previously served as the senior director for global health security and biodefense on the White House National Security Council (NSC) staff, where she was instrumental in developing and launching the Global Health Security Agenda “\n\n“ As chief staff officer, Marla Dalton, PE, CAE provides leadership and direction for NFID in furthering its mission to educate the public and healthcare professionals about the burden, causes, prevention, diagnosis, and treatment of infectious diseases across the lifespan.”\n\n“Mark Del Monte, JD, serves as the CEO/Executive Vice President of the American Academy of Pediatrics (AAP). In this capacity, Mark leads a strong chief executive team for the organization which serves 67,000 pediatrician, pediatric medical subspecialist, and pediatric surgical specialist members.”\n\n“ Charity Dean MD, MPH&TM is the CEO and Co-Founder of The Public Health Company which brings together the best expertise in public health disease control with private sector tech innovation to build autonomous disease control decision capabilities in scalable software. Prior to this she was the Assistant Director of the California Department of Public Health (CDPH) and part of the executive leadership team directing California’s strategy and response to the COVID-19 pandemic. Dr. Dean served as Co-Chair of the California Testing Task Force”\n\nONE OF SEVERAL HIV/AIDS EXPERTS\n\n“Dr. Carlos del Rio is Distinguished Professor of Medicine at Emory University School of Medicine, and professor of global health and epidemiology at the Rollins School of Emory University. He serves as the Executive Associate Dean of Emory University School of Medicine at Grady Health System, and is the co-director and principal investigator of the Emory Center for AIDS Research. His research interests include the early diagnosis of HIV, linkage to and retention in HIV care, and prevention of HIV infection. He has long worked in hospitals and clinics with hard-to-reach populations including substance abuse users to improve outcomes of those infected with HIV and to prevent infection among those at risk… Dr. del Rio also works on emerging infections, epidemic and pandemics including the response to the 2009 Pandemic Influenza A (H1N1) as member of the WHO and CDC advisory teams. During the COVID-19 pandemic Dr. del Rio has been a leader locally and nationally, doing research, developing policies, writing scientific publications and making media appearances.”\n\n“ The Honorable Mark Dybul, MD, is the Co-Director of the Center for Global Health Practice and Impact, and Professor in the Department of Medicine at Georgetown University Medical Center. He is also a Chair and Fellow with the Joep Lange Institute.\n\n“Dr. Tom Frieden served as Director of the Centers for Disease Control and Prevention, and Commissioner of the New York City Health Department. His work made New York City’s tuberculosis control program and overall health department models for the world, established effective programs in India, and improved morale, effectiveness, and impact at the Centers for Disease Control and Prevention.”\n\nA well-recognized global health expert and humanitarian, Dr. Dybul served as Executive Director of the Global Fund to Fight AIDS, Tuberculosis and Malaria”\n\n“ Ezekiel J. Emanuel is Vice Provost for Global Initiatives and chair of the Department of Medical Ethics and Health Policy at the University of Pennsylvania. From January 2009 to January 2011, he served as special advisor for health policy to the director of the White House Office of Management and Budget. Since 1997 he was chair of the Department of Bioethics at The Clinical Center of the National Institutes of Health… . He is currently a columnist for the New York Times.”\n\n“Trained as a molecular biologist at Johns Hopkins University and Harvard Medical School, Dr. Jay Winsten served as co-editor of the three-volume work, Origins of Human Cancer, with Nobel laureate James D. Watson and Howard H. Hiatt, former dean of the Harvard T.H. Chan School of Public Health”\n\n“Brian C. Castrucci, DrPH, is an epidemiologist, public health practitioner, and president and chief executive officer of the de Beaumont Foundation. In just under a decade, Brian helped build de Beaumont into a leading voice in health philanthropy and public health practice by creating national projects that advocate for health and social policy change, develop cross-sector partnerships, and elevate the state and local public health agency workforce…During the COVID-19 pandemic, Brian co-produced a documentary, Outbreak: The First Response, chronicling the first US-based outbreak of COVID in Seattle, Washington. He also focused on message development, testing, and deployment to groups expressing concern about the COVID-19 vaccine through ChaningtheCOVIDconversation.org and for the governmental public health workforce through the newly created Public Health Communications Collaborative.”\n\n“Scott Z. Burns is a screenwriter, director, producer and playwright. Scott began his career in advertising, working on everything from beer to cars to athletic shoes. Before leaving the industry, he was part of the team that created the ‘Got Milk?’ campaign. His work in film includes producing the Academy Award winning documentary AN INCONVENIENT TRUTH, as well as AN INCONVENIENT SEQUEL and SEA OF SHADOWS.”\n\n“The Honorable Patricia de Stacy Harrison is the longest-serving president and chief executive officer of the Corporation for Public Broadcasting (CPB), which serves as the steward of federal funding for more than 1,500 public radio and television stations and producers throughout the United States.”\n\n“Dr. Frank Luntz has written, supervised, and conducted more than 2,500 surveys, focus groups, ad tests, and dial sessions in more than two dozen countries on six continents over the past 20 years. His political knowledge and skills are recognized globally, and he has served as an election consultant and commentator in Canada, Britain, Ireland, Germany, Austria, the Netherlands, Australia, Venezuela, and Ukraine.”\n\n“Joshua Bolten is President & CEO of the Business Roundtable (BRT), an association of CEOs of leading US companies. Before joining BRT in January 2017, Bolten was Managing Director of Rock Creek Global Advisors, a consulting firm that he co-founded in 2011. Bolten spent the preceding two years as a visiting professor in the Woodrow Wilson School at Princeton University.”\n\n“Suzanne Clark is President of the Chamber of Commerce of the United States, the largest business federation in the world. She is the first female President in the institution’s 107-year history. “\n\n“CEO, author, and media commentator, Joshua DuBois is one of our country’s top voices on community partnerships, issues impacting African Americans, and religion in the public square. Joshua led the White House Office of Faith-based and Neighborhood Partnerships under President Obama. In the White House he brought together community leaders from across the ideological spectrum to tackle some of the nation’s biggest challenges. Joshua is now CEO of Gauge (gauge.ai), a market research company, and also leads Values Partnerships.”\n\n“John B. King Jr. is the president and CEO of The Education Trust, a national nonprofit organization that seeks to identify and close opportunity and achievement gaps, from preschool through college. King served in President Barack Obama’s cabinet as the 10th U.S. Secretary of Education.”\n\n“ARNE DUNCAN -As managing partner at Emerson Collective, former U.S. Secretary of Education Arne Duncan returns to Chicago on a mission to improve the lives of young adults in his hometown. Through partnerships with local business leaders, community organizers, and nonprofit groups, Duncan aims to create job and life opportunities for disconnected youth between the ages of 17 and 24.\n\nPrior to joining the Obama Administration, Duncan served as chief executive officer of Chicago Public Schools. From 2001 to 2008, “\n\nCO-CHAIR IS A FORMER NAACP LEADER AND POLITICIAN\n\n“NAACP Legal Defense Fund and led the Civil Rights Division of the U.S. Department of Justice. As the Assistant Attorney General, he coordinated the investigation of arson at black churches across the South…. He led reforms at Texaco, where a court appointed him to create a more equitable and inclusive workplace, and at Coca-Cola,… After he left office, Deval joined Bain Capital to launch an impact investing fund. This new fund, Bain Capital Double Impact, has invested hundreds of millions of dollars into mission-driven companies that target both social and environmental good.”\n\n“Spero M. Manson, Ph.D. (Pembina Chippewa) is Distinguished Professor of Public Health and Psychiatry, directs the Centers for American Indian and Alaska Native Health, and occupies the Colorado Trust Chair in American Indian Health within the Colorado School of Public Health at the University of Colorado Denver’s Anschutz Medical Center.”\n\n“Carrie Billy, an enrolled member of the Navajo Nation and attorney from Arizona, was appointed President & CEO of the American Indian Higher Education Consortium (AIHEC) June 2008. Carrie is a graduate of the University of Arizona and the Georgetown University Law Center. Her career reflects a commitment to public service and to protecting and promoting the cultures,”\n\n“Chi Kim is the CEO of Pure Edge, Inc. She is a 2018 Pahara Aspen Education Fellow, serves on the Board of Directors of CASEL, Coalition for Career Development Center, and is the board chair of Great Minds nonprofit board. She has served as a school superintendent, principal, teacher and leadership coach as well as a program officer at the Bill & Melinda Gates Foundation”\n\n“Evangelical Christians can overcome their suspicion of COVID-19 vaccines through a renewed focus on missions and a form of patriotism that engenders unity instead of division, Russell Moore said during a recent webinar hosted by the Facebook for Faith learning group.\n\n“I spend a lot of time telling Christians, don’t make your country your idol. Put the kingdom of God first. (Being vaccinated) is an opportunity for good, genuine, God-approved patriotism,” said Moore, president of the Southern Baptist Convention’s Ethics and Religious Liberty Commission.\n\nHe and fellow panelists Emily Smith, a Baylor University epidemiologist, and Walter Kim, president of the National Association of Evangelicals, sought to address the vaccine skepticism of white evangelicals.”\n\nWarren, Russell Moore and Ed Stetzer have worked closely with the press and COVID COLLABORATIVE LAUNCHED initiatives to promote the Pandemic Response and vaccinations.\n\n“Founded in 1942, the National Association of Evangelicals seeks to honor God by connecting and representing evangelical Christians in the United States. It represents more than 45,000 local churches from 40 different denominations and serves a constituency of millions. Learn more at nae.net.”\n\nTHE FAITH BASED PARTNERSHIP COORDINATOR IS AT WHEATON UNDER THE DIRECT PROMOTION OF STETZER AND THE BILLY GRAHAM CENTER\n\n“The Humanitarian Disaster Institute (HDI) at Wheaton College (Ill.) is the first faith-based academic disaster research center in the country. Our mission is to help the church prepare and care for a disaster-filled world. We use our research to create resources and events geared toward churches, students, survivors, helpers, and researchers. Learn more at wheaton.edu/hdi and get info about our M.A. in Humanitarian & Disaster Leadership at wheaton.edu/hdl.”\n\nThe above center now offers Masters degrees in Disaster Response and preparedness. So Wheaton and the Billy Graham Center on its campus are signed on for the long haul with the Global Pandemic Industry.\n\nBy the way- the true church of Jesus Christ sould NEVER be in bed with this collaborative of progressives and operatives of the left. Nor should anyone who professes to know the true hope the Gospel offers the world. They are simply incompatible -a mixture of light and darkness with no one to raise a banner of truth among them.\n\nIt is likely the Pandemic Industrial Complex is never going away. Americans and people all over the world looked for a vaccine which would allow life to return to normal. Once that vaccine arrived and the shots were being administered the public was informed that two of the three options would require two shots and now perhaps a third booster and then annual boosters. The narrative changes with each passing day. Now people everywhere are facing vaccine mandates to continue to hold their jobs, to travel, to be admitted onto campuses and into sporting events.\n\nThe willingness and even zealous attempts to coordinate the suppression of information or simple concerns on personal social media pages have only heightened suspicion and doubt in the narrative. A politically charged public health response to a global pandemic and vaccine which ignores, denies, and even persecutes medical professionals who dispute the science or lack thereof should remain suspect. Thinking people the world over have taken to the streets in protest of lockdowns, mask mandates and now vaccine mandates. The cry for governments to recognize the privacy and rights of individuals and to be heard with their concerns validated by realities all around them seems lost to the sheer force of the money – the political players- career “public servants” and the determined efforts to own the crisis and its responses by organizations like the “COVID COLLABORATIVE”. Come variants or high water the organizations who feed from the progressive machine look to continue to cash in and steam roll humanity in the process of “saving” it.\n\nPlease go to Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts.\n\nYour Tax Deductible Support at www.wvwfoundation.com Helps Us Cover Our Huge Streaming Bill So You and Millions of Americans Can Watch Our TV Shows For Free. Many organizations put all their shows behind a pay-wall immediately but we make our shows available for all to watch as a public and educational service of WVW-TV and WVW Foundation. You can also use our mailing address to send your tax deductible support:", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.prnewswire.com/news/covid-collaborative/", "https://www.prnewswire.com/news-releases/bipartisan-group-of-leaders-and-health-experts-urge-institutions-of-higher-education-to-establish-covidsafezones-301356363.html", "https://www.covidcollaborative.us/infection-prevention-and-control-in-schools%23ipc-press-release", "https://www.covidcollaborative.us/issues/testing-tracing", "https://www.covidcollaborative.us/content/testing-tracing/chiefs-for-change-content", "https://www.covidcollaborative.us/vaccine-education", "mailto:covidsafezones@covidcollaborative.us", "https://www.covidcollaborative.us/vaccine-hesitancy-visualization", "https://www.covidcollaborative.us/global-vaccine-inequity", "http://gauge.ai/", "https://www.covidcollaborative.us/ray-chambers", "https://www.covidcollaborative.us/deval-patrick", "https://www.facebook.com/groups/2819920958291248/?ref=pages_group_cta", "https://www.covidcollaborative.us/rick-warren", "https://www.covid19churchsummit.com/", "https://www.nae.net/", "https://www.wheaton.edu/academics/academic-centers/humanitarian-disaster-institute/", "https://www.wheaton.edu/graduate-school/degrees/ma-in-humanitarian-and-disaster-leadership/", "http://www.mypillow.com/", "http://www.wvwfoundation.com/"], "authors": [], "publish_date": null}