{"result_id": "351037", "URL": "https://www.worldviewweekend.com/news/article/data-reveals-vaccinated-have-higher-mortality-rate-100000-people-unvaccinated?amp", "timestamp": "2023-04-25 18:20:07 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/data-reveals-vaccinated-have-higher-mortality-rate-100000-people-unvaccinated", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "Data Reveals Vaccinated Have Higher Mortality Rate per 100,000 People Than the Unvaccinated: Worldview Report For August 3, 2022 | Worldview Weekend Broadcast Network", "cleaned_text": "INTRO: Another data dump from the U.K. shows why so many people have been dying “suddenly” and “unexpectedly” in the spring and summer months of 2022.\n\nAnd we also have data from Israel that shows a 25 percent jump in emergency calls for heart issues among young adults since the rollout of the Covid shots.\n\nAnd why are so many Canadian doctors dying without explanation? It’s up to five now in just one week’s time.\n\nA New York judge has delivered a fatal blow to that state’s Covid quarantine camps, saying they were never legal or enforceable.\n\nWe have all these stories and more when the Worldview Report begins, right now!\n\nGood evening and welcome to the Worldview Report. I’m Brannon Howse.\n\nWe have more government data coming out of the U.K. and the results are shocking.\n\nThis data reveals that the vaccinated population has a higher mortality rate per 100,000 people than the unvaccinated population.\n\nThe figures show that it takes an average of about five months from the time one receives the Covid-19 vaccine for that elevated mortality rate to be realized, The Expose reports.\n\nAs a result, the mass “booster” campaign that took place in the winter began to kill off the recipients in the spring. This explains the sudden rise in weekly deaths across England since the end of April 2022, the article reports.\n\nThe most recent week shows that there were 10,515 deaths in England and Wales, equating to 1,113 excess deaths against the five-year average; that’s an increase of nearly 12 percent in the all-cause mortality rate over the five-year average. This trend has been occurring since the end of April 2022.\n\nA new study by Israeli researchers and published in Nature has revealed an increase of more than 25 percent in cardiovascular-related emergency calls in the young-adult population, following the rollout of COVID vaccines.\n\nThe increase cuts across genders and affects both males and females.\n\nIsraeli health authorities and the U.S. Centers of Disease Control have acknowledged a link between COVID vaccines and specific cardiovascular complications. The risk of myocarditis after receiving a second vaccine dose is now estimated to be between 1 in 3000 to 1 in 6000 in men aged 16 to 24.\n\nRecent articles in scientific journals, however, have sought to suggest that cardiovascular complications following COVID infection are more common than those following vaccination. This assertion is contradicted by the findings of the Israeli study, using data from Israel National Emergency Medical Services (EMS) related to \"cardiac arrest and acute coronary syndrome EMS calls in the 16–39-year-old population\" between 2019 and 2021. This enabled them to compare baseline pre-COVID numbers to COVID pandemic without vaccines, and to the period following widespread vaccination.\n\nAn increase of over 25% was detected in both call types during January–May 2021, compared with the years 2019–2020. That is to say, \"increased rates of vaccination ... are associated with increased number of cardiac arrest and acute coronary syndrome.\"\n\nBy contrast, the trial \"did not detect a statistically significant association between the COVID-19 infection rates and the weekly call counts.\"\n\nThe phrase #DiedSuddenly started trending on Twitter Thursday, likely sparked by two Canadian hospitals that were forced to defend the COVID-19 shot after three of their physicians died this week, following another who died earlier this month.\n\nThe Trillium Health Partners hospital network told the Toronto Sun on Wednesday, “It is with deep sadness that Trillium Health Partners mourns the loss of three of our physicians who recently passed away. Dr. Jakub Sawicki, Dr. Stephen McKenzie and Dr. Lorne Segall were trusted colleagues who were committed to caring for their patients and community.”\n\nThe three physicians reportedly worked at Trillium’s Mississauga hospital.\n\nTrillium added that “The rumor circulating on social media” that these deaths could be linked to the COVID-19 shots “is simply not true.”\n\nAmerica’s Frontline Doctors reports that while the hospital network noted that Dr. Segall’s death on July 17th was linked to a “year-long battle with advanced lung cancer,” it did not offer any cause of death for Dr. Stephen McKenzie’s death the next day or Dr. Jakub Sawicki, in his early thirties, who died on July 21st.\n\nThen, with the ink barely dry on that hospital press release, a fourth Canadian doctor and then a fifth, also died suddenly without explanation.\n\nThe latest was a super-fit 27-year-old triathlete, Dr. Candace Nayman, who collapsed during a competition on Thursday, July 28th, The Toronto Sun reported. She was a pediatrician at McMaster Children’s Hospital in Hamilton, Ontario.\n\nOne of the first known cases of the experimental vaccine’s adverse effects being passed down from mother to baby has come to light, demonstrating the dangers of the shots for women who are or who later decide to get pregnant while being “fully vaccinated.”\n\nAccording to a report by Natural News, Little Zack Reilly is now missing an arm after it had to be amputated almost immediately after his birth when it was discovered that the child had developed blood clots in both his now-removed left arm, as well as his brain.\n\nThe child was reportedly delivered in an emergency caesarean at 37 weeks on July 11, 2021. He had a “bruised and blistered” left arm, we are told, and the limb was removed after an MRI scan showed that he had suffered a stroke while still inside his mother’s womb.\n\nThat stroke destroyed the child’s arm and brain, though he was initially said to be adapting “brilliantly,” according to media reports. His parents, one of whom is a Royal Navy assistant careers advisor and the other a telecoms engineer, say he enjoyed his first family barbecue, which made them proud – but the fun did not last.\n\n“For the first few weeks of Zack’s life, it felt like one thing after another was going wrong,” said the boy’s mother, adding, “It was just heartbreaking.”\n\nDr. Kelly Victory recent appeared on an episode of the Chief Nerd podcast and set the viewers straight about the United Nations World Health Organization and its leader, Dr. Tedros.\n\nShe said it’s crucial that people are not confused. If they don’t understand this one fact, they will never understand the world’s over-the-top response to the Covid bioweapon and to future global health emergencies.\n\nThey are one in the same, indeed.\n\nWe reported in June that several members of the Tampa Bay Rays baseball team refused to wear a gay pride logo on their uniforms during Pride Month, citing that the logo was at odds with their Christian faith.\n\nWell, now the same issue has surfaced in the world of professional soccer.\n\nA player for the National Women’s Soccer League, the NWSL, chose to miss a game on Friday night instead of wearing the “Pride” jersey her team was scheduled to wear.\n\nJaelene Daniels, a defender for the Carolina Courage, cited her commitment to her Christian faith when explaining her decision to miss the game due to the pride-themed jerseys. She wrote on social media:\n\n“I remain committed to my faith and my desire for people to know that my love for them isn’t based on their belief system or sexuality. I pray and firmly believe that my teammates know how much I cherish them, respect them, and love them.”\n\nThe Courage said they were “disappointed” by Daniels’s decision.\n\n“Jaelene will not be rostered tonight as she has made the decision to not wear our Pride jersey,” the team said via ESPN, adding that, “While we’re disappointed with her choice, we respect her right to make that decision for herself. We’re excited to celebrate the LGBTQIA+ community with our fans, players and staff tonight and look forward to hosting our first ever Pride Festival before kickoff.”\n\nBreitbart reports that this is not the first time Daniels has chosen principle over career enhancement. In 2017, she turned down an offer to play for the U.S. Women’s National Team due to that team’s plan to wear pride-themed jerseys.\n\nFlorida sheriffs are just wired differently than the sheriffs in most other states.\n\nIn recent months we’ve seen their epic statements on law-abiding citizens shooting criminals, and their no-nonsense crackdowns on pedophiles, including quite a few who worked at Disney World.\n\nNow, Brevard County Sheriff Wayne Ivey has rolled out a weekly feature he calls the Wheel of Fugitives.\n\nPretty creative stuff there from Sheriff Ivey. Congrats on a job well done.\n\nThe overturning of Roe v. Wade is prompting pro-abortion activists to do what pro-life advocates have wanted all along: take responsible actions to prevent unplanned pregnancies.\n\nLifenews.com reports that some are going on a “sex strike” — and suddenly abstinence does not seem so unreasonable or impossible — while others are seeking out sterilizations.\n\nAccording to Lifenews, doctors across the country report more patients are asking for sterilizations after the U.S. Supreme Court overturned Roe on June 24, according to a new NPR report.\n\nThey include women like Dani Marietti, of Helena, Montana, a 25-year-old who said she never wanted children and hopes to make her therapy career the focus of her life.\n\n“I always knew I didn’t want children, and of course when you say that as a younger person, everyone is like, ‘Oh, you’ll change your mind,’ or, ‘Just wait until you find the one. I always kind of ignored that.”\n\nOnce news broke about the Supreme Court abortion ruling, Marietti, who is pro-abortion, said she decided to schedule a permanent sterilization procedure. Earlier this month, she and her friends celebrated the removal of her fallopian tubes at a party that included cookies decorated with pro-abortion sayings like “My body, my choice,” according to the report.\n\nThe NPR piece also reported that Planned Parenthood in Montana has been seeing an “unprecedented” number of patients asking for vasectomies and other sterilization procedures.\n\nDr. Kavita Arora, a North Carolina OB-GYN and leader of the American College of Obstetricians and Gynecologists Committee on Ethics, said doctors in other parts of the country are also seeing an increased demand for such procedures.\n\nDr. Arora said one of her patients recently sought a sterilization procedure because she “wanted to have autonomous control over her body, and this was her way of ensuring she was the person who got to make the decisions.”\n\nThe Epoch Times reports that a New York judge overturned a law that allowed the state to place even healthy people in quarantine camps for an indefinite time without review.\n\nUntil July 8, the New York Department of Health had near unchecked power to toss citizens into Covid camps. It received this power from the state’s Rule 2.13.\n\nBut state legislators never voted to allow the New York Commissioner of Health to put anyone into quarantine for any length of time.\n\nGovernor Kathy Hochul and the Department of Health ordered the rule’s protocols during the COVID-19 pandemic.\n\nThe state extended Rule 2.13 every 90 days, and the health commissioner wanted to make the rule permanent, respondents told the court.\n\nBut the court overturned Rule 2.13, stating that the executive branch had usurped legislative authority.\n\n“Involuntary detention is a severe deprivation of individual liberty, far more egregious than other health safety measures, such as requiring mask wearing at certain venues. Involuntary quarantine may have far-reaching consequences such as loss of income [or employment] and isolation from family.”\n\nAccording to the Epoch Times report, the court barred state enforcement of Rule 2.13 because the executive branch lacked the authority to introduce it. But the court decision also condemned the rule for its failure to consider individual freedom or due process.\n\n“The commissioner has unfettered discretion to issue a quarantine or isolation for anyone, even if there is no evidence that person is infected or a carrier of the disease. Further, the commissioner sets the terms, duration, and location of the detention, not an independent magistrate.”\n\nNew York’s previous quarantine laws protected individual rights. But Rule 2.13 put all power into the hands of the commissioner of health, the document stated.\n\nA leaked list of nearly 2 million Chinese Communist Party members contains thousands of names of individuals living in the West and employed in government positions in the U.K. or at top corporations.\n\nOne group of names stands out. It includes 123 names of individuals who work for pharmaceutical giants Pfizer and AstraZeneca. Both companies are currently engaged in the ongoing mass vaccination campaign related to Covid.\n\nThe Daily Mail confirms that a “detailed analysis,” now “reveals that pharmaceutical giants Pfizer and AstraZeneca – both involved in the development of coronavirus vaccines – employed a total 123 party loyalists.”\n\nThe threat is not just to their corporate image, by the way, or to our moral standing as a nation – it is a threat to our security. Companies such as Boeing, Airbus, Thales, and Rolls-Royce each play an essential role in manufacturing equipment used by our Armed Forces.\n\nThey make some of our most advanced weaponry and are trusted to guard top-secret designs for our most sensitive assets and facilities. Yet collectively they employ hundreds of Chinese Communists who have pledged to serve the Party above all else.\n\nOther vital firms such as Pfizer, AstraZeneca and GlaxoSmithKline employ hundreds of Communist Party members, giving them access to networks, designs and supply chains.\n\nSo, there you have it. A Chinese virus followed by a Chinese vaccine. What could possibly go wrong with that?\n\nThe Chinese government's English language mouthpiece, The Global Times, has grown particularly brazen in response to Nancy Pelosi's potential trip to Taiwan.\n\nA message posted by China’s People’s Liberation Army regarding the U.S. visit to Taiwan, as reported on Friday, July 29, stated: “Get ready for war!”\n\nThe Chinese Army’s war message over the potential visit reportedly generated more than 300,000 thumbs-up in just 12 hours on a popular Chinese social media site, creating “high morale among Chinese soldiers,” according to Global Times.\n\nYou can see the translation of the PLA’s message in this tweet from a Chinese-speaking researcher.\n\nAt the same time, a prominent Global Times pundit and the publication's former editor (name unpronounceable) has claimed the Chinese military \"has the right\" to block Pelosi's plane and any U.S. fighter jet escorts from Taiwan's airspace, which China claims as its own.\n\nA federal judge ruled on Friday that it was reasonable to conclude that the credit-card company Visa knowingly financed and profited from the distribution of child pornography on Pornhub and other websites operated by parent company MindGeek.\n\nThe Post Millennial reports that the lawsuit filed last year, Fleites v. MindGeek, alleges that MindGeek was profiting from videos depicting “rape, child sexual exploitation, revenge porn, trafficking, and other nonconsensual sexual content.\" Visa was implicated in the lawsuit as “knowingly complicit in the sex-trafficking and monetized child sexual abuse,” according to Variety.\n\nU.S. District Judge Cormac Carney wrote in his ruling that “Visa knew that MindGeek’s websites were teeming with monetized child porn,” finding that the plaintiff had “adequately alleged” that Visa engaged in a criminal conspiracy with MindGeek to monetize child pornography, and that Visa “knowingly providing the tool used to complete the crime.”\n\n\"When MindGeek decides to monetize child porn, and Visa decides to continue to allow its payment network to be used for that goal despite knowledge of MindGeek’s monetization of child porn, it is entirely foreseeable that victims of child porn like plaintiff will suffer the harms that plaintiff alleges.”\n\nLead attorney Michael Bowe representing the plaintiff in the lawsuit, said “The court’s holding that our detailed complaint adequately pleads Visa was engaged in a criminal conspiracy to monetize child porn means Visa and other credit card companies are finally going to face the civil and perhaps criminal consequences of this unconscionable and illegal activity.”\n\nTime now for our Worldview Report commentary.\n\nInvestigative journalist Lara Logan spoke Saturday in Arizona on a voter integrity panel but the clip we want to play for you touches on illegal immigration.\n\nOver 3 million illegals will have crossed into the United States via the open southern border in Joe Biden’s first two years in office.\n\nWhat does illegal immigration have to do with voter integrity, you ask?\n\nHere is Logan explaining the connection to her Arizona audience.\n\nYes, it all starts with a Social Security number and then the Census, which provides the basis for apportionment and how many gerrymandered seats in Congress each party gets. You don’t even have to be a citizen, let alone a registered voter, to be counted in the Census. All you need to be is a warm body with a pulse.\n\nThat does it for this edition of the Worldview Report. Thanks for tuning in. God bless you all, and may God save America.\n\n----------------------------------------------------------------------------------------------\n\n Your Tax Deductible Support at www.wvwfoundation.com Helps Us Cover Our Huge Streaming Bill So You and Millions of Americans Can Watch Our TV Shows For Free. Many organizations put all their shows behind a pay-wall immediately but we make our shows available for all to watch as a public and educational service of WVW-TV and WVW Foundation. You can also use our mailing address to send your tax deductible support: WVW Foundation P.O. Box 1690 Collierville, TN 38027\n\n --------------------------------------------------------------------------------------------------------------\n\n Get your free, no obligation packet on precious metals by texting or calling Wes Petes with Swiss America at 602-558-8585\n\n --------------------------------------------------------------------------------------------------------------\n\n Click here and visit www.wvwtvstore.com to order emergency, freeze-dried food that will last 25 years.\n\n -----------------------------------------------------------------------------------------------------------------\n\n Please go to www.Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts. Sincerely Brannon Howse WVW Broadcast Network", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://expose-news.com/2022/07/31/uk-gov-report-covid-vaccination-5-months-kill/", "https://www.israelnationalnews.com/news/328529", "https://torontosun.com/news/local-news/warmington-hospitals-confirm-deaths-of-four-physicians-but-deny-vaccine-related", "https://americasfrontlinenews.com/post/diedsuddenly-trends-on-twitter-after-3-physicians-die-in-one-week-at-same-hospital", "https://torontosun.com/news/local-news/warmington-triathlete-27-becomes-5th-gta-doctor-to-die-in-july", "https://newspunch.com/fully-jabbed-mom-horrified-after-babys-arm-amputated-due-to-blood-clots-suffered-the-womb/", "https://www.naturalnews.com/2022-07-31-baby-arm-amputated-mom-covid-vaccines-clots-womb.html", "https://rumble.com/embed/v1bo3ej/?pub=4", "https://www.breitbart.com/sports/2022/07/31/christian-nwsl-player-misses-game-over-refusal-to-wear-pride-jersey/?mibextid=2tq33u", "https://www.foxnews.com/faith-values", "https://www.breitbart.com/", "https://twitter.com/TheNCCourage/status/1553027295094398978?s=20&t=GrTPTzOfbCKwI22nT75kPw", "https://www.breitbart.com/sports/2022/07/31/christian-nwsl-player-misses-game-over-refusal-to-wear-pride-jersey/?mibextid=2tq33u", "https://genzconservative.com/chances-of-them-reoffending-are-zero-florida-sheriff-gives-a-bold-statement-on-what-to-do-to-intruders-refuses-to-back-down-to-left/", "https://genzconservative.com/i-bet-his-wifes-not-pleased-multiple-disney-employees-arrested-in-human-trafficking-sting-108-total-creeps-arrested/", "https://www.youtube.com/watch?v=k6032K8SWug", "https://www.lifenews.com/2022/07/29/liberals-are-getting-sterilizations-to-protest-supreme-court-overturning-roe-v-wade/", "https://nypost.com/2022/06/25/abstinence-trends-on-twitter-in-wake-of-roe-v-wade-ruling/", "https://www.npr.org/sections/health-shots/2022/07/29/1113573995/more-people-are-opting-to-get-sterilized-and-some-are-being-turned-away", "https://www.theepochtimes.com/new-york-judge-throws-out-states-quarantine-camp-law-declaring-it-unenforceable_4629156.html", "https://www.theepochtimes.com/t-covid-19", "https://www.dailymail.co.uk/news/article-9046783/Leaked-files-expose-mass-infiltration-UK-firms-Chinese-Communist-Party.html", "https://euroweeklynews.com/2022/07/29/chinas-army-posts-get-ready-for-war-message-over-us-visit-to-taiwan/", "https://twitter.com/jenniferatntd/status/1553045071314010118?s=20&t=akrxqplsz8Ul7K86mDW-Ww", "https://thepostmillennial.com/pornhub-sued-for-profiting-from-rape-child-exploitation-human-trafficking-videos", "https://thepostmillennial.com/judge-rules-visa-knowingly-facilitated-the-distribution-of-child-pornography-in-pornhub-lawsuit", "https://thepostmillennial.com/pornhub-sued-for-profiting-from-rape-child-exploitation-human-trafficking-videos", "https://variety.com/2022/digital/news/pornhub-visa-child-pornography-court-ruling-1235330052/", "https://rumble.com/embed/v1bniur/?pub=4", "http://www.wvwfoundation.com/", "http://www.wvwtvstore.com/", "http://www.mypillow.com/"], "authors": [], "publish_date": null}