{"result_id": "351042", "URL": "https://shop.worldviewweekend.com/topics/covid-vaccine", "timestamp": "2023-04-25 18:20:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon.ico", "canonical": "https://shop.worldviewweekend.com/topics/covid-vaccine", "encoding": "utf-8"}, "image": null, "domain": "shop.worldviewweekend.com", "title": "Covid Vaccine | Worldview Weekend Broadcast Network", "cleaned_text": "Guest: Dr. Judy Mikovits. Topic: Brannon begins the program detailing some of the topics in the annual report of the globalist, neo-Marxist World Economic Forum which is hosting the Great Reset conference in January of 2021. Topic: Dr. Mikovits joins us to discuss these topics: How did she know and thus predict in her books years before the Covid-19 “pandemic” that this would occur? Why is it wrong to call her anti-Vaccine? Is it true she spent years developing vaccines that would boost our God given immune system and not suppress it as is the case with most of today’s vaccines? Is Covid-19 a creation of dirty or tainted vaccines and how did they become tainted? Is there no legal recourse against a vaccine manufacturer for those damaged by a vaccine? Are more people being infected by the flu shot as well as the Covid-19 shot? Are people infected or injected with Covid-19 and if so how are they injected with Covid? Why does she believe the Covid-19 vaccine will actually increase Covid cases as well as spur the emergence of a more virulent strain? Why are so many older people and people with underlying conditions dying from Covid? Are so-called “useless eaters” being targeted through this plandemic? Why does Dr. Mikovits believe the Covid vaccination could make men and women unable to reproduce? Since pregnant women are not given the vaccination in clinical trials, how do we know if there is any negative impact on a woman’s ability to bear children or the impact on the unborn child? Why are there news reports that men should have their semen frozen before being vaccinated? Why have medical doctors not been willing to come on to Brannon’s program and refute Dr. Mikovits, but in fact, have written to Brannon affirming her books and her interviews with Brannon? Why are so many religious organizations pushing the Covid-19 vaccination while claiming to be pro-life if it is tainted with the cells of aborted babies? Topic: We take your calls.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/situation-room", "/profile/brannon-howse"], "authors": [], "publish_date": null}