{"result_id": "351019", "URL": "https://www.worldviewweekend.com/news/article/renowned-covid-doctor-vaccinated-are-super-delta-carriers-spreading-sickness", "timestamp": "2023-04-25 18:19:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/renowned-covid-doctor-vaccinated-are-super-delta-carriers-spreading-sickness", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "Renowned COVID Doctor: Vaccinated Are 'Super Delta Carriers' Spreading Sickness to the Unvaccinated | Worldview Weekend Broadcast Network", "cleaned_text": "The Biden administration has been spitting out daily talking points that we are in a \"pandemic of the unvaccinated,\" repeating this mantra over and over at daily briefings, in speeches and on social media.\n\nBut the scientific data suggests the opposite is true, according to Dr. Peter McCullough, an internist, cardiologist, epidemiologist and author of 46 peer-reviewed articles on Covid-19, in a recent interview with Brannon Howse Live on the WVW Broadcast Network.\n\n\"What we have seen is the ability for vaccinated individuals to carry and then develop and transmit Covid-19 in very high viral loads with the delta variant – it's 251- to 1,000-fold higher than the prior variants in the unvaccinated era,\" Dr. McCullough told Howse.\n\n\"So we do know that those who are vaccinated, and our CDC director has told us this, can become what we call super delta carriers, since 99 percent of what we have right now is the delta variant.\"\n\nThe transmissions of the virus from vaccinated to unvaccinated would seem to defeat the stated purpose of the vaccination, and yet there has been almost no coverage of this phenomenon by the corporate-owned establishment media.\n\nMcCullough said if it were not for \"independent alternative channels\" like Worldview Weekend and others, no one would be hearing the truth.\n\n\"We have seen in a sense the vaccine program backfire,\" McCullough said. \"We have seen this emergence of the super dominant delta, and the vaccine has allowed delta to move forward in being a hyper-dominant variable because the vaccines don't cover delta enough.\"\n\nThese are what some scientists, McCullough included, have called \"leaky\" vaccines.\n\n\"There's what's called antigenic escape and that's been shown in multiple papers ... meaning the antibodies raised by the current Covid vaccines don't completely neutralize or sterilize the delta variant enough and so that allows the vaccinated person to not only get sick themselves but then pass it to other vaccinated or unvaccinated individuals,\" McCullough said.\n\nThis is different and more serious than mere \"shedding,\" which is when a vaccinated person transmits small bits of the spike protein through skin to skin contact with others in the first 30 days or so after being injected.\n\n\"I would call this transmission [not shedding],\" McCullough said. \"We know this transmission occurs when someone is symptomatic,\" meaning they are coughing or sneezing.\n\n\"Most of it is transmitted through the air, coughing and sneezing. In public restrooms you're talking about closely confined areas, where the air is heavy; you have a small room and a lot of people going in and out. The virus is spread by coughing and sneezing and also through the GI tract.\"\n\nMcCullough said the FDA hearings last month for the Pfizer booster shot provided no evidence of any benefits from boosters that outweigh the risks. Shockingly, the FDA approved the Pfizer booster anyway.\n\nRepresenting the public at those hearings were Drs. Joseph Freeman, an emergency-room physician in New Orleans; Steve Kirsch, executive director of Covid-19 Early Treatment Fund; Steven Weisman, a regulatory consultant; and Jessica Rose, an epidemiologist from Canada now based in Haifa, Israel.\n\nThese doctors and scientists made the case to the FDA that the vaccines did not have a favorable risk-to-benefit relationship.\n\n\"In fact, it wasn't debated. It wasn't refuted,\" McCullough said. \"One was more likely to die after receiving a vaccine than from getting Covid-19 itself as a respiratory illness. So I think this was really big testimony. And for that reason the only thing they were able to provide in support of the boosters was a rise in antibodies, but we know the rise in antibodies doesn't cover the delta variant so these are still antibodies to the original Wuhan spike protein.\n\n\"Steve Kirsch led that presentation and it wasn't strongly supportive at all for Pfizer as boosters.\"\n\nSince those hearings, there have been follow-up papers published in scientific journals that support the position of the four experts on the public comments panel.\n\nHe cited a multi-national study \"that concluded across every age group, that one was more likely to die of the vaccine.\n\n\"The reason was once one receives the vaccine, that is a certainty, the vaccine is in the body. With Covid-19 there's a chance that many people never come in contact with it. So the way it calculates out, within every age group one is more likely to die with the vaccine than actually taking their luck without the vaccine and getting Covid.\"\n\nAnother paper by Dr. Tracy Hoeg at University of California at Davis, was published specifically on young people injected with the vaccine.\n\n\"It estimated that the risks of the messenger RNA vaccines, Pfizer and Moderna, causing myocarditis and having that heart inflammation causing a person to be hospitalized, was greater than Covid-19 causing a hospitalization in a young person,\" McCullough said. \"So now we have two analyses, both on death and myocarditis, showing you'd be better off forgetting the vaccine and just taking your chances with Covid-19.\"\n\n\"This is huge news,\" he added, totally ignored by the establishment, corporate-owned media. \"And I can tell you that's why people are turning to your channel and other independent channels.\"\n\n\"I feel like I'm under direct threat in terms of the medical boards, and the threats that doctors like myself have received, just for citing the data,\" McCullough said. \"Every single author can be found on the internet, I'm just reciting the data for you.\"\n\nMcCullough cited two more studies in the interview that show 23 percent of hospitalizations are the vaccinated.\n\nFor that reason the only thing that was presented in support of the boosters was a rise in antibodies. But, we know the antibodies don't cover the delta variant, so these are antibodies related to the original Wuhan spike protein which is produced by the current coded Pfizer vaccine.\n\nThe result of meeting and testimony from the experts was not a broad approval of boosters, but a consideration for boosters for those over age 65. The FDA added, without any supporting data, individuals who could be at high risk for having exposure to Covid.\n\nMcCullough said data through June, 2121, shows 23 percent of hospitalizations were the unvaccinated, not 1 percent like the Biden administration has said.\n\nAnd how many of the unvaccinated infected with Covid actually caught it from a vaccinated person?\n\n\"They could have received a transmission from the vaccinated. But also, the CDC has told hospitals not to test the vaccinated, but they do test the unvaccinated, and so that is generating a lot of positive cases among the unvaccinated. So, a lot of the numbers are stilted toward the unvaccinated being the problem.\"\n\nMcCullough also cited four peer-reviewed papers, all of which showed \"those who previously had Covid and then unwisely took the vaccine had higher side-effect rates. So as far as we can tell there's absolutely no reason for a Covid-recovered patient to take the vaccine. There's no data for that at all.\"\n\nPlease go to Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts and FREE articles.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.worldviewweekend.com/tv/video/dr-peter-mccullough-studies-reveal-risk-covid-shot-versus-covid", "https://www.theguardian.com/world/2021/sep/10/boys-more-at-risk-from-pfizer-jab-side-effect-than-covid-suggests-study", "https://www.americaoutloud.com/dr-peter-mccullough-presents-bold-challenge-to-those-who-crush-our-rights/", "http://www.mypillow.com/", "http://www.wvwfoundation.com/"], "authors": [], "publish_date": null}