{"result_id": "351012", "URL": "https://www.worldviewweekend.com/news/article/former-pfizer-employee-karen-kingston-covid-vaccines-will-likely-cause-increase-deadly?amp", "timestamp": "2023-04-25 18:19:26 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/sites/default/files/favicon_0.ico", "canonical": "https://www.worldviewweekend.com/news/article/former-pfizer-employee-karen-kingston-covid-vaccines-will-likely-cause-increase-deadly", "encoding": "utf-8"}, "image": null, "domain": "www.worldviewweekend.com", "title": "Former Pfizer Employee Karen Kingston: Covid Vaccines Will Likely Cause Increase in 'Deadly Cancers' | Worldview Weekend Broadcast Network", "cleaned_text": "\"This is a massive global terrorist attack against humanity. It's all criminal. It needs to stop.\" - Karen Kingston\n\nFormer Pfizer employee and research patent expert Karen Kingston returned for another blockbuster interview with Brannon Howse in which she shed more light on some of the key ingredients used in the Covid vaccines and their potential impact on human health.\n\nSome of the ingredients are known toxins that could cause a dramatic increase in deadly cancers, Kingston explained in the nearly one-hour interview on Oct. 20.\n\nOne questionable ingredient is a product known generically as Luciferase, which is a bioluminescent enzyme catalyst that gives the vials of liquid vaccine a blueish glow under certain light.\n\n\"It's in the patent so we know it's in the product,\" Kingston said.\n\nLuciferase serves two purposes, she said.\n\n\"It's a chemical agent used for scientific testing, so what it does is it will map out and test to see what genetic changes have occurred within the biology of a specimen, which in this case is a human being.\n\n\"It's also a catalyst for amplification and replication of genetic material and it improves the integration of that material into cells.\n\n\"So it both provides information and testing as well as replication of genetic material and integration of that genetic material into cells. It aides in these processes.\"\n\nBut that's not the most shocking revelation about the vaccines. That honor is reserved for the HeLa immortal cell line used in scientific research and included in the vaccines. It is the oldest and most commonly used human cell line, named after a 31-year-old mother of five who died on Oct. 4, 1951, of cervical cancer. The cell line was taken from her cancer cells on Feb. 8, 1951. Her name was Henrietta Lacks.\n\nHeLa cells have been reported to contain human papilloma virus 18 (HPV-18) sequences.\n\nGen. Colin Powell was suffering from cancer and died last week of Covid-related symptoms despite being fully vaccinated.\n\n\"What's in the vaccines has been proven to accelerate the formation of cancer cells and if you have cancer it's going to accelerate the cancer growth in your body in a couple of different ways,\" Kingston said. \"One is the patent contains the HeLa stem cell line, an immortal stem cell line from a woman from the 1950s who died from cervical cancer. Unlike the normal stem cells, this is from the most aggressive cancer.\n\n\"It accelerates cancerous cell growth. It's very deadly.\"\n\nThe code or genetic sequencing from that cell line is now in the vaccine. This is not disputable or up for debate. It's a raw fact.\n\n\"It's in the patent. It explains why people are getting these rare forms of cancer,\" Kingston said. \"This woman was 31 years old when she died and left five children behind.\"\n\nDr. Judy Mikovitz also believes many of these vaccines are causing cancers in people, Howse pointed out. She reported in a previous interview with Howse that her daughter-in-law died of a rare bone cancer after being fully vaccinated.\n\n\"This is how dirty these vaccines are,\" Howse said.\n\n\"Yes, there will be a massive outbreak of cancers and very advanced forms showing up out of nowhere, basically,\" Kingston reiterated.\n\nBut the full list of ingredients remains unknown, she said.\n\n\"We don't know. The consumer goods manufacturing practices were all skipped. It's Russian roulette. We know there are micro-organisms in some of the vaccines. But they're not in all of them.\"\n\nShe cited a German doctor's research that found one out of every five vials contained a micro-organism.\n\n\"So what vials contain the HeLa stem cell line? We don’t know.\"\n\nKingston said the mass vaccination programs need to be stopped now and those who have participated in their government approval, manufacture and promotion need to be held accountable.\n\n\"There needs to be a mass stop to all of this right now in our country and across the globe. Everything that’s been done. It has not been just unlawful. It's criminal. The FDA's [emergency] authorization has been criminal, the FDA approval has been criminal, the manufacturing has been criminal, the propaganda promoting it as 'safe and effective' has been criminal.\n\n\"This is a massive global terrorist attack against humanity. It's all criminal. It needs to stop. We've been lied to and people are dying. As people like myself and doctors come forward, it's clear this is an act of genocide against the global population.\"\n\nKingston said the entire global campaign surrounding Covid and the mandating of Covid \"vaccines\" was part of an international criminal conspiracy to take down the United States as a global superpower and upholder of democracy.\n\n\"Whether it's China or some global terrorist group, there was no defeating the United States. We have the most powerful economy, we have the most powerful military. So the only way to take out democracy would be for the American people to concede in an effort to commit self-harm and/or suicide against their own population. And they would need their own military to do this. That’s the only way America could ever be taken out, and that’s what we've done.\"\n\nKingston said she does not understand why neither the federal nor any state governments have filed criminal charges against the FDA, the CDC, the NIH and Dr. Anthony Fauci.\n\n\"What the FDA has done is not unlawful, it is criminal. What Fauci has done is criminal,\" she said.\n\n\"And yet the FBI is going after moms voicing concerns at school board meetings,\" Howse said.\n\n\"That's part of it,\" Kingston responded.\n\nThat's part of the deception and diversionary tactics of a mass psychological warfare campaign.\n\nKingston said the government defines terrorism as any tactic waged against the civilian population that violates state or federal law and results in harm to American citizens.\n\n\"That's what's going on,\" she said. \"If you look at the VAERS data [on the CDC website] those are not adverse events because that would be unintended consequences. The FDA met on Oct. 22, 2020, and they listed out myocarditis, encephalitis, elimination of your platelets [as possible side effects].\n\n\"They knew what they were doing. We have all the evidence to show the FDC, the NIH, and the CDC, they all knew what was going to happen. They executed their plan. They used behavioral insights in partnership with the Organization for Economic Cooperation and Development [OECD], including Harvard Business at the helm of it, to know how to psychologically, mentally and emotionally manipulate Americans to do something that had no benefit to them, and then to cover it up.\"\n\nThe OECD, comprised of 38 member nations, is involved with the World Economic Forum, the Gates Foundation, the Rockefeller Foundation, the United Nations and other elitist, globalist NGOs in using the Covid scare to push for a new international economic and political system based on so-called \"green\" practices and \"sustainable development.\"\n\nKingston did not speculate on why these practices were being pushed, but the reasons are hiding in plain sight in the documents published by the above organizations.\n\nThe OECD, for example, states on its website that:\n\n\"The COVID-19 pandemic is transforming how we think about our economies and our societies. The policy choices governments make today will determine their success in building a transition to a greener, more inclusive and more resilient tomorrow.\"\n\nKlaus Schwab, founder and director of the World Economic Forum, has made countless statements echoing the same exploitive view about Covid, which he says presents \"a narrow window of opportunity\" for elites to \"transform society.\"\n\nThese elites all use words like \"greener,\" more \"inclusive\" and \"resilient\" as code for a more controlled society in which everything and everyone is connected to the internet, monitored, surveilled and assessed 24/7. Those found to be less obedient to the dictates of big government and big corporations/big tech, are assigned a low social credit score and forbidden from participating in basic life functions like travel, working a job, banking or even entering stores and other public facilities.\n\nThe Washington Post, the Associated Press, CBC-Canada, the BBC and other major news outlets participated in the global Covid conspiracy by partnering with Facebook and other social media giants in what they dubbed, in typical Orwellian fashion, the Trusted News Initiative.\n\nUnder this initiative big corporate media agreed in December 2020 to stamp out any reporting on Covid vaccines that challenged the prevailing government narrative by branding it as \"misinformation\" or \"disinformation.\"\n\n\"This is all criminal,\" Kingston said. \"I don't understand why people aren't filing criminal charges.\"\n\nHeLa cell lines are listed in the patent on the Moderna website for all of the mRNA vaccines.\n\n\"This and the Luciferase may explain why someone like Gen. Colin Powell, already sick with cancer, may have exacerbated his condition. Is that true?\" Howse asked.\n\n\"Yes. And Dr. Mikovits has had to mourn the loss of her daughter-in-law who is in her forties, from a rare form of bone cancer that normally hits people in their eighties,\" Kingston said. \"They could be delivering anything to people.\n\nThose doctors and scientists who truly \"follow the science\" have been attacked. This includes Drs. Peter McCullough, Brian Ardis, Sheri Tenpenny, Lee Merritt, Sucharit Bahkti and others.\n\n\"There's nothing I'm presenting that isn't in standard government documents. That's what I do for a living,\" Kingston said. \"The other stuff you're listening to in the mainstream media is propaganda.\"\n\nPlease go to Mypillow.com and use the promo code WVW to save up to 66% off and Mike Lindell will give a generous percentage back to WVW-TV to support our free broadcasts and FREE articles.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.worldviewweekend.com/tv/video/former-pfizer-employee-karen-kingston-covid-mrna-vaccine-patent-ingredients-will-bring", "https://www.atcc.org/products/ccl-2", "https://www.oecd.org/coronavirus/en/", "https://www.oecd.org/coronavirus/en/", "https://www.bbc.com/mediacentre/2020/trusted-news-initiative-vaccine-disinformation", "http://www.mypillow.com/", "http://www.wvwfoundation.com/"], "authors": [], "publish_date": null}