{"result_id": "352026", "URL": "https://x22report.com/scavinos-message-sent-received-the-fight-to-take-back-the-country-has-begun-trust-ep-2591/", "timestamp": "2023-04-25 18:20:53 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://x22report.com/wp-content/uploads/2019/08/favicon_new-3.ico", "canonical": "https://x22report.com/scavinos-message-sent-received-the-fight-to-take-back-the-country-has-begun-trust-ep-2591/", "encoding": "UTF-8"}, "image": null, "domain": "x22report.com", "title": "Scavino’s Message Sent & Received, The Fight To Take Back The Country Has Begun, Trust – Ep. 2591", "cleaned_text": "On Feb. 4, Merck came out with a shocking statement warning against the use of ivermectin to treat COVID. The statement claimed there was “no scientific basis for a potential therapeutic effect against COVID-19 from pre-clinical studies” and that there was “a concerning lack of safety data in the majority of studies.”\n\nThis was quite a bizarre assertion given that 59 studies, including 30 randomized controlled trials, have shown the drug to be extremely effective at all stages of the virus.\n\nWell, now we have an answer. On June 9, Merck announced that it had entered into a procurement agreement. Merck will receive approximately $1.2 billion to supply approximately 1.7 million courses of molnupiravir to the United States government. Molnupiravir is a new drug Merck is currently evaluating in a Phase 3 clinical trials to serve as the wonder drug to treat COVID. The estimated cost of the drug per treatment is $700!\n\nSo now we can understand why the company would swap out its own drug that has already been proven safe and effective for something new and experimental. Without the government sending a penny to Merck, I can buy a lifesaving dose of ivermectin for just $26 through GoodRX.\n\nWhat is particularly disturbing is that it appears that molnupiravir contains some of the same molecular qualities as ivermectin, which makes you wonder if Merck knows that ivermectin is effective and just sought a more expensive drug that could be marketed as exclusive and new for COVID, thereby justifying another budget blowout by Washington policymakers.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theblaze.com/op-ed/horowitz-facebooks-independent-fact-checker-on-vaccines-is-funded-by--you-guessed-it", "https://www.merck.com/news/merck-statement-on-ivermectin-use-during-the-covid-19-pandemic/", "https://c19ivermectin.com/", "https://www.theblaze.com/op-ed/horowitz-who-data-ivermectin-reduces-covid-mortality-by-81-also-who-we-still-dont-recommend-it", "https://www.businesswire.com/news/home/20210609005142/en/Merck-Announces-Supply-Agreement-with-U.S.-Government-for-Molnupiravir-an-Investigational-Oral-Antiviral-Candidate-for-Treatment-of-Mild-to-Moderate-COVID-19"], "authors": [], "publish_date": "October 3, 2021"}