{"result_id": "352004", "URL": "https://x22report.com/principalities-and-powers-chapter-1-the-wicked-potion/", "timestamp": "2023-04-25 18:20:38 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://x22report.com/wp-content/uploads/2019/08/favicon_new-3.ico", "canonical": "https://x22report.com/principalities-and-powers-chapter-1-the-wicked-potion/", "encoding": "UTF-8"}, "image": null, "domain": "x22report.com", "title": "PRINCIPALITIES and POWERS – CHAPTER 1 – The Wicked Potion", "cleaned_text": "We’re a little over a month into the new year. I am pretty sure I have been in the same kind of fog that many are in right about now. Biden is still President. Elections are still a joke. No arrests. Gitmo is still empty. No red wave. Inflation continues to rise. People are dying from vaccines. And did I mention that Biden is still President? But once our minds become cluttered with information and misinformation, it’s difficult to see that there is also much good taking place. The reveals from Twitter, Biden classified documents, exposure of big tech, big pharma, big government, and of course, big balloons. These are all things that are happening and need to keep happening.\n\nIs there a plan? We shall see. That is a hugely important topic, but not the topic for this piece. We must first zone in on the enemy and understand their focus.\n\nI spent some time since December pondering my approach. Many writers and researchers have been left wondering what exactly is going on. Some of the criticism has been that people have heard enough of the silly theories and speculation mixed with hopium. They want the truth. Folks got a few things here and there right and even some of the topics I covered may very well play out as I indicated, but that remains to be seen. In the meantime, partial success should never be the goal. We owe it to ourselves to dig deeper into what is happening that we can’t see or that we are choosing not to see. I have always been of the opinion that until I am fully able to lay down my preconceived ideas of what I believe to be true, then I always run the risk of missing out on truth itself. If the last two years haven’t forced a rethinking of even your most basic understanding of what is going on, then I’m afraid your confirmation bias is working overtime.\n\nAll theories, thoughts, notions, and emotions must give way to simple realities which often lead to greater and more solid conclusions. What you desire to be true may or may not have any correlation to what actually is true. And yet I look on the various social media platforms and the same folks are pushing the same themes with the same rationales. Something else we’ve learned is that credibility gap on social media between someone with tens of thousands of followers and someone with 7 followers sitting at his/her kitchen table is paper thin. Nothing is more deadly to research than the illusion of popularity. This type of focus has all sorts of interesting ingredients but more times than not, it produces a main course that more closely resembles humble pie.\n\nWhat is the one thing that most people in this country have in common? Does that one thing have the ability to show us what is truly going on in this messed up world? The answers? God and Yes.\n\nYou can search profile after profile after profile on the conservative wings of social media and the majority of them read very similarly: “A Patriot that loves God, Family, Country, in that order. We need to keep government out of our business and take back control of this country.” Those are noble statements and I agree with them all. But therein is my disconnect. Why is it that a high percentage of the people love God and yet a low percentage of influencers, podcasters, and writers that those people depend on for information cover little or nothing as it relates to any level of detail about God and His role in all this? That is not a rhetorical question. It’s a serious question that deserves an answer or at least a heck of a lot more attention. I don’t want to get self-righteous or preachy. I just want to give God a better seat at the table. After all, it is His table.\n\nTo better understand the fight we are in, let’s hear a word from our enemy’s sponsor. There are many to choose from but in this case, let’s go with Neil deGrasse Tyson, one of America’s favorite scientists.\n\nNeil’s explanation of a God he isn’t convinced exists includes that God would only be powerful or benevolent. So, not only does God not exist, but Neil also reserves the right to define the core attributes of that God that he says doesn’t exist. This is a picture-perfect example of a darkened heart that results from a blatant refusal to acknowledge God. Romans says, “although they knew Him as God, they did not acknowledge Him as God and their foolish hearts were darkened.” That powerful and benevolent God is also perfectly just, and He is more than willing to let us ignore him given that we understand we are doing so.\n\nThe reason why this is important is because there is a distinct and fundamental flaw within those that deny and defy God and that flaw is that they can no longer think clearly. They begin worshiping the creation rather than the creator.\n\nWith that as some fundamental grounding, one topic that most everyone reading this document can take pride in is the fact that most of us correctly went with common sense when it came to COVID and more specifically vaccines. Experts like Neil deGrasse Tyson did not, and because he bows at the feet of the science of man, he is not capable of eating his humble pie.\n\nThere is a link below to another interview that you can view at your leisure but essentially, Neil deGrasse Tyson goes on and on about the process and plans for testing and distributing the COVID vaccines. Like any good globalist would do, he rambles on and on about how COVID was a moving target, so the vaccines couldn’t keep up with all the mutations and therefore they were not as effective as was originally hoped.\n\nBut there is a great providential irony in the interview, as Neil spews out the excuses while recollecting the plans of the vaccines and their rollout. If you look at the background, you’ll see on one of the small lockers a Bible verse which reads Proverbs 16:3.\n\nWith everyone completely consumed with the World Economic Forum (WEF) and the perils of what it stands for, it’s so easy to forget that in order for this type of system to continue to operate, it has to have something to sell to the masses. If the love of money truly is the root of all kinds of evil, then we must never forget that even the most evil actors will focus on money first and foremost. Only by understanding that unwavering principle used by the enemy, are we able to really get to the root cause. Once we see the root cause, then we can better understand not only what is happening but also what may be next.\n\nThere is a letter written by a very accomplished German commercial banker, of which I’ve heard a portion read aloud, and it reminded me of what I had been pondering for quite some time concerning the current economic landscape both nationally and internationally. In this letter, the commercial banker was explaining how his primary focus for many years has been corporate acquisitions, but almost exclusively on the debt financing of these acquisitions. Some of the investment and commercial banks included the likes of JP Morgan, Merrill Lynch, Bank of America, and others. The letter was written from a German angle, but the points almost completely mirror what is transpiring in the US, as well as most countries in the west.\n\nThe concept is centered almost exclusively on the modern economic system. The type of system we’re talking about doesn’t allow for a long shelf life because once people wake up to the fact that the goal is enslavement, then we start to see social cracks, moral decay, and chaos kick in (LGBT, transgender surgeries, etc.), and society becomes increasingly debased. Once that happens, then the powers that be are able to refocus the scope of their agenda and it goes completely undetected.\n\nDuring critical times in history like now, we MUST stop thinking about what they want us to think about and start thinking about who they are. They (the WEF) are a forum about economics and their primary purpose is to keep the wheels of “their” economy spinning by whatever means necessary. It’s never meant for you to truly know how or better yet, why their economy operates the way it does. Their goal is to keep you focused on silly figureheads like Klaus Schwab and Yuval Noah Harari because they make for intriguing real-life villains that would make the likes of Darth Vader and Venom proud.\n\nBut the stark reality is that the darkness the enemy employs is far more deceptive than most can even comprehend. In this environment where truth is bordering on undetectable, it is almost mandatory that we ignore what we see and hear and start looking for sources whose only interest is truth. My instincts, discernment, and research tell me that we woefully underestimate the deception of the enemy. We tend to think that Biden is the distraction from Schwab and Harari or vice versa. Perhaps it’s Biden we need to focus on.\n\nWrong. Biden, Schwab, and Harari are all distractions.\n\nThe global financial crisis of 2008-09 was widely termed the “Great Recession” and it began with the housing market bubble, created by an overwhelming load of mortgage-backed securities that bundled high-risk loans. This led to unprecedented numbers of loans in default; bundled together, the losses led many financial institutions to fail and require a governmental bailout. The financial crisis took its toll on individuals and institutions around the globe, with millions of Americans being deeply impacted. Financial institutions started to sink, many were absorbed by larger entities, and the US Government was forced to offer bailouts to keep many institutions afloat. Efforts to revive the economy were made through the American Recovering and Reinvestment Act of 2009. This, of course, is what we all now refer to as quantitative easing.\n\nIt’s funny how time heals even fake wounds. At the time it was happening, we all thought the world was on the precipice of disaster. Since then, we have had QE2, 3, 4, and so on. The national debt of $9.7 trillion in 2008 is child’s play compared to the $31.5 trillion we see today.\n\nBut whenever you’re dealing with spending that is debt-financed as is always the case with fiat currency, it means that it all must be repaid unless there is some sort of reset that involves a war or catastrophically high inflation. Of course, both of these scenarios can be avoided if the borrower of the debt can somehow put forth additional collateral in order to meet the terms of the loan(s).\n\nAs a general rule, the lifespan of a structured economic system is about 70-80 years. And just to provide some context as it relates to the Federal Reserve, a new international monetary system was forged by delegates from forty-four nations in Bretton Woods, New Hampshire, in July 1944. Delegates to the conference agreed to establish the International Monetary Fund and what became the World Bank Group. Fast forward 79 years and if you say the United States is out of collateral to meet the $31.5 trillion in debt, you would be making the understatement of the century, as the spending is insane with no end even remotely in sight.\n\nBut what happens when an entire country runs out of collateral? By the 4th quarter of 2019, the fiat system was basically at the point of complete collapse and the major power players decided to slam on the brakes. All collateral that could have been pledged to the banks and large financial investors (Vanguard, Blackrock, Fidelity, etc.) had pretty much run out. These are the key financiers. These are the firms that make the money flow that allows the various social agendas to keep moving as designed in the west.\n\nBy this time, people are already starting to become a little wobbly financially. For more and more people, life was becoming merely a paycheck and to secure that paycheck they were more than willing to accept immoral concepts like the fact that men could be women or that they were born racist and were in dire need or rehabilitation. Accepting these agendas keeps the paychecks coming. The agendas are confusing children about their sexuality, breaking up the family unit, pushing abortions, and creating weak, effeminate, gamma males. But this is all contingent on proper mismanagement of the debt crisis.\n\nAt this point, everything had already been pledged, so what else can possibly be collateralized? Remember the basic definition(s) of collateral.\n\nRomans chapter 1 verse 30 gives a very telling description of what ultimately happens to men once they turn fully away from God and toward their own desires. It describes that they will become “backbiters, haters of God, violent, proud, boasters, inventors of evil things…”\n\n“The evil that men do lives after them” wrote Shakespeare, in Julius Caesar. And Milton followed this in Paradise Lost with the chilling words: “Evil be thou my good.”\n\nSo, getting back to this question: what can be used as collateral?\n\nThe human body can be collateralized. It’s difficult to ponder this level of darkness, but for those that have fully turned their backs on the creator this is the most logical next step because the love of money truly is the root of all evil.\n\nAt this moment, 330+ million people already have unique identifiers (SSN, Tax ID) in order to be able to interact with the system and/or government. It’s not that the system considers the person to be real, but rather a useful instrument solely for the purposes of generating revenue streams. Via taxation, the system has attempted to take large portions of our wealth, but now it appears as if they want the entire human body as collateral for the unfathomable debt. Before putting forth the vaccines, the investors required what any investor would require prior to moving forward on the venture: an inventory.\n\nIn order to produce this inventory, a 1-to-3-month period of almost complete lockdown would be required to make an adequate value assessment and to see if anything was potentially missed.\n\nThis is no different than your neighborhood grocery store at quarter end, where they close the doors and start counting the inventory. Shutting down the world economy was an absolute must that was required to do a proper inventory and also to provide a convenient excuse for what was about to transpire. There is no easier way to confuse the masses than by fear and isolation. How can you do a proper inventory when the inventory is moving?\n\nSo, what do they need now? They need a link to the human body. This is where the mRNA vaccine comes into play. By causing any alteration in the genes, it created new collateral by creating a new asset class. The vaccine acted as a mechanism to get this new asset class on the books. Of course, the argument is that you cannot patent nature but once the DNA altering has taken place, then it can be patented. Once injected, the human body (by their definition) then becomes a GMO (genetically modified organism). In other words, the new asset class can now be owned. So once the link is established by those that took the vaccine for the sake of keeping or regaining their privileges back, you now have your target market.\n\nWhether they realize it or not, these people were willing to completely sacrifice their bodily autonomy for the sake of the “Branch Covidians.” Now, all future cash flows can be raised through mass intrusion into the human body. Below are the approximate vaccination statistics as of January 15th, 2023.\n\nI am quite confident that the original plan was probably to tax or fine the unvaccinated in order to push the vaccinated percentages even higher. This could have produced considerable tax revenues. However, once they realized the number of people that fell prey to the dishonest vaccination push was going to be absurdly high, suddenly the human bodies of the vaccinated became immeasurably higher on the value proposition scale. There are all sorts of theories as to what is in the vaccine. For example, it could change your DNA, which could be hugely relevant for these major pharma companies who might want to place proprietary claims on the human bodies that were injected. There could also be inheritance law implications (who is your daddy? etc.)\n\nIt would appear they are on a FedEx path to creating a link from the human body and the digital person. That much seems quite obvious to me. The creativity granted by God to the human makes it a very valuable asset. The crowning jewel may be to chip us all, but the target is the same end, and that end is maximum profit. As is always the case, you tend to find the most definitive answers when you follow the money. Don’t get me wrong, they are profiting in every conceivable way off the deaths as well because of the excess mortality rates in 2021 and 2022.\n\nThink about how much money you can make by killing off the people to whom you owe money.\n\nHowever, the real power is in the multiple compounding payouts that come from keeping you intact but fully enslaved both mentally and now physically.\n\nBut as a reminder, I want to go back to that Ephesians 6 verse that explicitly states that we DO NOT wrestle against flesh and blood, but against rulers of the darkness of this world, against spiritual wickedness in high places. This is not about Schwab, Gates, Biden, and all the others pushing their agendas. We cannot win a spiritual battle using fleshly means. What these forces are doing is getting the large majority of the world to focus on topics like the origins of COVID, death counts, and the hazards of the vaccines. We cannot think that way any longer if we hope to fight this enemy. They are already dropping down their lifeboats, filling ours with cement, and we’re still captivated by the fact that water is filling up the Titanic.\n\nI know this is a dark topic, but we face an enemy that is here for the stated purpose of destroying everything that is good. And honestly, we haven’t seen anything close to the deception we will likely see in the not-so-distant future. A level of deception and persecution that will make 5th generation warfare look like a game of checkers by comparison. And if we are not equipped with what God has provided us to deal with what is coming then we are sitting ducks.\n\nJoy Newball and Cassey McFadden were both fired from their New York City teaching positions for refusing to be vaccinated because of their faith and now that same school system is accepting illegal migrant children without requiring proof of vaccination.\n\nThis, of course, is one of countless examples where lawlessness and deception has ruled the day when it comes to all topics related to COVID and vaccinations. But these amazing ladies understood the stakes. Generally speaking, ‘Stakes’ are the amount of prize money that is won by someone betting or a participant in a game. ‘The stakes are high’ means that the participants have a lot to gain or lose. It’s safe to say that the stakes have never been higher. In the case of our current time in history, we should not deceive ourselves. Scripture says that if any of us think we are wise by the standards of this age, we should become ‘fools’ so that we may become wise. In other words, wipe the slate clean and start thinking in a way that has you seeing what is coming next as opposed to always reacting. When we are reacting, the enemy is winning.\n\nYou can take all the God haters in the world and roll them all into one and it still would not be a fair fight. This has not been and never will be about how many are on each team. This is about spiritual discernment and in this category the enemy is completely unarmed.\n\nIt’s never wise to paint with broad brushstrokes, however, I would be lying if I didn’t at least acknowledge that it appears that God has become a supporting actor in a movie where we only survive when He has the lead role. Somehow, we have convinced ourselves that we’ll figure it out and if we can’t we’ll turn to God. For some, this is a pattern of life that is repeated over and over again therefore there will be no incentive to suddenly turn to Him when the stakes are the highest. The human being is the pinnacle of God’s creation, and nothing would satisfy the enemy more than to somehow claim ownership of that creation.\n\nSo, what happens when the enemy attempts to usurp Gods authority by claiming to now own his crowning achievement?\n\nLet’s just say I would not want to be the enemy right about now because there is always the next chapter…..and God owns the next chapter.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "409", "embed_code": "<iframe loading=\"lazy\" src=\"https://www.youtube-nocookie.com/embed/I0nXG02tpDw?rel=0&amp;autoplay=0&amp;showinfo=0&amp;enablejsapi=0\" width=\"728\" height=\"409\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\" data-mce-fragment=\"1\"/>", "src": "https://www.youtube-nocookie.com/embed/I0nXG02tpDw?rel=0&autoplay=0&showinfo=0&enablejsapi=0"}], "links": ["https://www.addtoany.com/add_to/telegram?linkurl=https%3A%2F%2Fx22report.com%2Fprincipalities-and-powers-chapter-1-the-wicked-potion%2F&linkname=PRINCIPALITIES%20and%20POWERS%20%E2%80%93%20CHAPTER%201%20%E2%80%93%20The%20Wicked%20Potion", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fx22report.com%2Fprincipalities-and-powers-chapter-1-the-wicked-potion%2F&linkname=PRINCIPALITIES%20and%20POWERS%20%E2%80%93%20CHAPTER%201%20%E2%80%93%20The%20Wicked%20Potion", "https://www.addtoany.com/share", "https://www.youtube.com/watch?v=CquiSjgJNc8&t=334s", "https://richardthesaint.substack.com/", "https://truthsocial.com/@RichardTheSaint"], "authors": [], "publish_date": "February 6, 2023"}