{"result_id": "352007", "URL": "https://x22report.com/trump-confirms-the-path-forwardmuch-has-been-exposedmore-than-anyone-thought-possible-ep-2903/", "timestamp": "2023-04-25 18:20:40 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://x22report.com/wp-content/uploads/2019/08/favicon_new-3.ico", "canonical": "https://x22report.com/trump-confirms-the-path-forwardmuch-has-been-exposedmore-than-anyone-thought-possible-ep-2903/", "encoding": "UTF-8"}, "image": null, "domain": "x22report.com", "title": "Trump Confirms The Path Forward,Much Has Been Exposed,More Than Anyone Thought Possible – Ep. 2903", "cleaned_text": "The [D]’s are doing everything they can to keep the illusionary economy from imploding right before the midterms. They know that the R’s are going to win. Their plan to coverup everything they did has been exposed. Durham is doing exactly what he needs to do to bring down the top level criminals. The [DS] knows that more information is going to be coming out this winter, they are already planning to shutdown communications. Trump confirms that so much has been exposed, more than any could have imagined. The path is set, Durham is going for [HRC] and the [DS] is panicking, they don’t want the Durham report to come out, they are trying to control it all but this will fail.\n\nBiden: ‘If Republicans win, inflation’s going to get worse’\n• – The Steele Dossier and its allegations are dead. The claims were made up and that is a matter of record now. Dolan admitted to fabricating his part and Danchenko never met with the manager of the Ritz-Carlton. Danchenko, over the course of 3.5yrs as a CHS, could not provide ANY corroboration.\n• “I’ve said for months that John Durham is not prosecuting these cases in the Russia Hoax to obtain convictions.”\n• That’s true IMO. Convictions were not Durham’s top priority in the Sussmann or Danchenko cases.\n• 2- “The entire purpose of Durham’s work is to cast the FBI as the victim rather than the perpetrator.”\n• That is incorrect. And everyone who paid attention to the cases KNOWS THIS. But for whatever reason, a lot of influencers and ConInc media are pushing this black pill hard.\n• – Chuck Dolan, Clinton Crony and longtime Democrat operative, was referred for an investigation thanks to information Danchenko gave the FBI. That investigation was opened and as part of it, Dolan’s email, phone, and social media records were obtained via search warrant.\n• That investigation was later turned over and is now with the Durham Special Counsel.\n• – Durham put the FBI on trial via the agents he put on the stand. SIA Brian Auten was subjected to two full days of questiong, none of it friendly. We learned of the Crossfire Hurricane and Mueller SCO failures. We also learned that Auten has been under investigation by the OIG for some time.\n• He has been recommended for suspension for his role in the Carter Page FISA.\n• – Likewise with Special Agent Helson, Danchenko’s handler. He was also forced to admit to failures in regards to handling Danchenko, though there were also successes as far as the information he sold the FBI as a CHS.\n• Helson is also a subject of an OIG investigation.\n• – Durham, via the investigation and prosecution of Danchenko, obtained a large number of interviews and testimony with Spygate players major and minor. He also got phone, email, social media, and travel records.\n• Being that Danchenko was in direct contact with so many consequential people as relates to Spygate, I wonder what else Durham learned from such records? I'm pretty ambivalent about Danchenko's acquittal. Yes, he made up some stories but he also exposed that the dossier was fake. I'm pissed that Durham pursued the guy who exposed the dossier fraud instead of the guys who covered up the fraud because they wanted to take down Trump.\n\nBarr- (Durham Report) it will leave a very good foundation to pursuing it further on the hill\n• Precisely. What exactly did Trump say?\n• He’s going to get his AG (Sessions/Barr) to appoint a special prosecutor (Durham originally on 10/28/17 by Sessions and promoted further by Barr right before end of Trump’s term) to look (NOT INTO RUSSIA OR THE FBI—Trust Wray) but into HILLARY.\n• How many of these “not guilty” trials comin from Durham’s work point towards HRC.\n• The walls are closing in on HRC.\n\n People need to not get their panties in a wad.\n• What does NCSWIC mean again?\n• “People actually believe those responsible for the attempted coup [coup attempt] of a duly elected sitting US President will go unpunished?” Yes, yes there are people that believe this, especially since Danchenko was found not guilty sniff sniffwhaaa boo whoo sniff. They crying. Mama The Danchenko verdict doesn’t mean a hill of beans to me. YAWN. Borrrrrring. You either believe Trump/Team/US Military will deliver or you don’t. I believe they will.\n• Special counsel John Durham should not have the final say in his investigation seeking out misconduct in the FBI‘s Russia inquiry, says an Obama-era spokesman for the Justice Department.\n• Matthew Miller, who was director of the Justice Department’s public affairs office from 2009 to 2011, argued Attorney General Merrick Garland, or another top official at the agency, should review the final report Durham is reportedly expected to prepare by the end of the year before making a decision on releasing its findings to the public.\n• The challenge to Garland to take a “pause” followed a jury in Alexandria, Virginia, finding Russian national Igor Danchenko not guilty Tuesday on several false statements charges over allegations that the main source of British ex-spy Christopher Steele lied to the FBI about his sourcing for the now-discredited anti-Trump dossier. MSNBC host Alex Wagner asked Miller whether Durham’s endeavor is coming to an end.\n• A very sad result for our Justice System, but so much has been exposed—far more than anyone thought possible.\n• Danchenko is acquitted, but Comey and the FBI are guilty of perpetrating the Russia hoax Special counsel John Durham should be commended for exposing the crooked FBI and the dirtiest political trick ever witnessed in the history of the United States.\n• The military attorney who ended the Pentagon’s anthrax vaccine mandate in 2004 is now, almost 20 years later, fighting to end the Pentagon’s coronavirus vaccine mandate.\n• Former Marine Capt. Dale Saran is now representing more than a thousand service members in two separate cases that he hopes will end the current mandate, if he is once again successful.\n• During a press conference Tuesday, Saran said the Pentagon’s mandate is illegal, since it entails ordering service members to take a vaccine approved for Emergency Use Authorization (EUA) and not the vaccine licensed by the FDA, known as Comirnaty.\n• By law, under 10 U.S.C. Section 1107a, the Pentagon cannot legally mandate an EUA vaccine. In order to do so, the defense secretary must request and receive a presidential waiver in order to mandate an EUA vaccine, and the Pentagon has refused to clarify whether it has ever requested or received that waiver. Instead, the Pentagon has argued that the EUA vaccine and the FDA-approved Comirnaty are “interchangeable,” as Breitbart News has previously reported. Saran said: There is no licensed vaccine. The day that the FDA licensed Comirnaty on August 23 of 2021, the same day, it removed it from the market. So if you look at the marketing begin and end date of Comirnaty, you’ll find that it cannot be sold in the United States because it was removed from the U.S. market the same day that it was actually licensed. The CDC Opened Up Public Comments on Mandatory Covid Vaxes for Children — And the Blowback is Glorious\n• The Centers for Disease Control and Infection has opened up public comments on its imminent Advisory Committee on Immunization Practices (ACIP) vote on adding Covid-19 shots to its annual childhood vaccination schedule.\n• The public remarks are but a taste of the political blowback that is in store for Democrats if the CDC rams through Covid shots in its list of recommended annual childhood vaccinations.\n• “I am writing to implore you to not make the Covid vaccines a mandatory vaccine for children. Children are not at risk from Covid and the vaccines do NOT prevent anyone from being contagious and giving Covid to someone else. The vaccines are still experimental and there have been children who have been injured or have died after receiving the M-RNA vaccine. Thank you, Lisa Callanan RNC, MSN.”\n• “I am appalled by the CDC and FDA push to force mRNA vaccinations on our entire population especially children and low risk groups. I oppose any attempts to coerce or mandate COVID19 vaccinations until the vaccines are proven safe and effective as other vaccines have been and the manufacturers are accountable for the safety of their products. Our Governments (State & Federal) are not protecting the citizens against COVID but perpetuating a false narrative to protect previous bad decisions and corporate profits, this is very concerning to me as a citizen of this great nation.” — Barry Barnett\n• “Parents MUST NOT BE forced to inject their children with a dangerous, experiential drug. Facts: other countries have halted the shots due to dangerous results in children. Children are NOT in danger from Covid. Studies are proving the shots are killing those aged 18-39. The public knows these things and more even though you keep lying about it. They are NOT safe and effective. God help you if you proceed with this iatrogenocide.” — Sheila Secrist\n• These are the CDC clowns who just unanimously voted (15-0) to include the COVID vaccine into the child vaccination schedules. Ladapo rejects adding COVID-19 to Florida Vaccines for Children Program ahead of CDC vote\n• “Regardless of what @CDCgov votes tomorrow on whether COVID-19 vax are added to routine child immunizations – nothing changes in FL,” Ladapo wrote. “Thanks to @GovRonDeSantis, COVID mandates are NOT allowed in FL, NOT pushed into schools, & I continue to recommend against them for healthy kids.”\n• If the CDC mandates the WuFlu injection, a homeschooling revolution as never before conceived of will begin in every corner of this country.\n• Public school will rot on the vine.\n• And coming generations will be less brainwashed.\n• Sorry to interrupt the constant negativity – but there you go. Dear everyone who hasn’t lost their minds. You can vote against this insanity on November 8th. Remember it and show up. If you don’t it’s only going to get a lot worse. https://t.co/RqHeXzqBQR\n• The ultimate goal is to lower the age of consent to 13.\n• I keep saying it because it keeps being true. Senate Bill 145 is the canary in the coal mine and the fact checker overlords are fully behind hiding it.", "opengraph": {}, "tags": ["#Navy", "#USNavy"], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">March: Inflation problems? Just let your dog die </p>\n<p>October: Inflation problems? Just kill your kid <a href=\"https://t.co/RcP8gIsMDb\">pic.twitter.com/RcP8gIsMDb</a></p>\n<p>— John Hasson (@SonofHas) <a href=\"https://twitter.com/SonofHas/status/1582730837056897025?ref_src=twsrc%5Etfw\">October 19, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Prediction:</p>\n<p>-GOP wins the midterms  <br/>-After ~2 months, economists finally declare a recession<br/>-White House blames recession on GOP</p>\n<p>— John Hasson (@SonofHas) <a href=\"https://twitter.com/SonofHas/status/1582116993033195520?ref_src=twsrc%5Etfw\">October 17, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Another one:</p>\n<p>1.Biden claims the Inflation Reduction Act will start working “early” in 2023</p>\n<p>2.Also claims student debt relief won’t add to inflation (it will)</p>\n<p>3. GOP plans to repeal IRA</p>\n<p>Therefore: When inflation keeps rising in ‘23, Biden will blame it on GOP for repealing IRA</p>\n<p>— John Hasson (@SonofHas) <a href=\"https://twitter.com/SonofHas/status/1582119379663142913?ref_src=twsrc%5Etfw\">October 17, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">I'm pretty ambivalent about Danchenko's acquittal. Yes, he made up some stories but he also exposed that the dossier was fake. I'm pissed that Durham pursued the guy who exposed the dossier fraud instead of the guys who covered up the fraud because they wanted to take down Trump.</p>\n<p>— Hans Mahncke (@HansMahncke) <a href=\"https://twitter.com/HansMahncke/status/1582477866910248960?ref_src=twsrc%5Etfw\">October 18, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"pt\" dir=\"ltr\">Vox Populi Vox Dei</p>\n<p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1582778449583693836?ref_src=twsrc%5Etfw\">October 19, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">BREAKING: UK Home Secretary Suella Braverman resigns, reason unclear – PA</p>\n<p>— BNO News (@BNONews) <a href=\"https://twitter.com/BNONews/status/1582757000639021056?ref_src=twsrc%5Etfw\">October 19, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">Dear everyone who hasn’t lost their minds. You can vote against this insanity on November 8th. Remember it and show up. If you don’t it’s only going to get a lot worse. <a href=\"https://t.co/RqHeXzqBQR\">https://t.co/RqHeXzqBQR</a></p>\n<p>— Donald Trump Jr. (@DonaldJTrumpJr) <a href=\"https://twitter.com/DonaldJTrumpJr/status/1582708869939490816?ref_src=twsrc%5Etfw\">October 19, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">\"COMPUTER ERROR\" California county says 5,000 election ballots mailed by accident <a href=\"https://t.co/KxeSrMrLyO\">https://t.co/KxeSrMrLyO</a> <a href=\"https://twitter.com/hashtag/FoxNews?src=hash&amp;ref_src=twsrc%5Etfw\">#FoxNews</a></p>\n<p>— Tom Fitton (@TomFitton) <a href=\"https://twitter.com/TomFitton/status/1582573811714883588?ref_src=twsrc%5Etfw\">October 19, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.addtoany.com/add_to/telegram?linkurl=https%3A%2F%2Fx22report.com%2Ftrump-confirms-the-path-forwardmuch-has-been-exposedmore-than-anyone-thought-possible-ep-2903%2F&linkname=Trump%20Confirms%20The%20Path%20Forward%2CMuch%20Has%20Been%20Exposed%2CMore%20Than%20Anyone%20Thought%20Possible%20%E2%80%93%20Ep.%202903", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fx22report.com%2Ftrump-confirms-the-path-forwardmuch-has-been-exposedmore-than-anyone-thought-possible-ep-2903%2F&linkname=Trump%20Confirms%20The%20Path%20Forward%2CMuch%20Has%20Been%20Exposed%2CMore%20Than%20Anyone%20Thought%20Possible%20%E2%80%93%20Ep.%202903", "https://www.addtoany.com/share", "https://media.blubrry.com/x22report/content.blubrry.com/x22report/episode_2903.mp3", "https://x22report.com/aiovg_videos/ep-2903b-trump-confirms-the-path-forwardmuch-has-been-exposedmore-than-anyone-thought-possible/", "https://x22report.com/aiovg_videos/ep-2903b-trump-confirms-the-path-forwardmuch-has-been-exposedmore-than-anyone-thought-possible/", "https://x22report.com/aiovg_videos/ep-2903a-ds-economic-cover-story-plan-exposed-no-place-to-hide/", "https://x22report.com/aiovg_videos/ep-2903a-ds-economic-cover-story-plan-exposed-no-place-to-hide/", "https://x22report.com/wp-content/uploads/2022/10/youtube_website_10192022_lg.jpg", "https://www.thegatewaypundit.com/2022/10/joe-biden-announces-release-another-15-million-barrels-oil-strategic-reserves-boost-chances-midterm-elections/", "https://apnews.com/article/2022-midterm-elections-putin-biden-climate-and-environment-government-politics-7fa1a7e4c1d2196856566f9401d8369b?taid=634f31fd0c97a30001df0b94&utm_campaign=TrueAnthem&utm_medium=AP&utm_source=Twitter", "https://t.co/RcP8gIsMDb", "https://twitter.com/SonofHas/status/1582730837056897025?ref_src=twsrc%5Etfw", "https://thehill.com/homenews/administration/3687005-biden-if-republicans-win-inflations-going-to-get-worse/", "https://twitter.com/SonofHas/status/1582116993033195520?ref_src=twsrc%5Etfw", "https://twitter.com/SonofHas/status/1582119379663142913?ref_src=twsrc%5Etfw", "https://truthsocial.com/@justhuman/posts/109192473618177636", "https://truthsocial.com/users/justhuman/statuses/109196384699967637", "https://twitter.com/HansMahncke/status/1582477866910248960?ref_src=twsrc%5Etfw", "https://truthsocial.com/@stormypatriotjoe/posts/109195354245364619", "https://truthsocial.com/@DanScavino", "https://truthsocial.com/@InevitableET/posts/109194952071750049", "/cdn-cgi/l/email-protection", "https://www.washingtonexaminer.com/news/obama-doj-official-durham-report-pause", "https://www.washingtonexaminer.com/tag/john-durham", "https://www.washingtonexaminer.com/tag/fbi", "https://www.washingtonexaminer.com/tag/russia", "https://www.washingtonexaminer.com/tag/justice-department", "https://www.nytimes.com/2022/10/18/us/politics/igor-danchenko-russia-acquittal-trump.html", "https://www.washingtonexaminer.com/news/justice/john-durham-verdict-steele-dossier-igor-danchenko", "https://truthsocial.com/@realDonaldTrump/posts/109196048054747226", "https://www.foxnews.com/opinion/danchenko-acquitted-comey-fbi-guilty-perpetrating-russia-hoax", "https://truthsocial.com/@lisamei62/posts/109195717149021072", "/cdn-cgi/l/email-protection", "https://twitter.com/elonmusk/status/1582778449583693836?ref_src=twsrc%5Etfw", "https://www.merriam-webster.com/dictionary/vox%20populi%20vox%20Dei", "https://truthsocial.com/users/AwakenedOutlaw/statuses/109195755643173010", "https://truthsocial.com/@BradCGZ", "https://conservativebrief.com/judge-43-67475/", "https://thereload.com/california-judge-blocks-law-mandating-release-of-gun-owners-personal-information/", "https://twitter.com/BNONews/status/1582757000639021056?ref_src=twsrc%5Etfw", "https://sputniknews.com/20221019/putin-declares-martial-law-in-new-russian-territories-amid-kievs-shelling-1102078657.html", "https://www.thegatewaypundit.com/2022/10/top-nih-director-admits-unaware-boston-labs-new-covid-strain-research-80-death-rate-says-research-not-authorized/", "https://www.thegatewaypundit.com/2022/10/arrest-now-boston-university-doctors-create-new-covid-variant-80-kill-rate-funded-dr-fauci-nih/", "https://www.dailymail.co.uk/health/article-11327741/Top-NIH-director-admits-Boston-lab-created-new-Covid-strain-did-NOT-clear-research-agency.html", "https://www.breitbart.com/politics/2022/10/18/its-done-just-to-break-troops-speak-out-against-covid-vaccine-mandate/", "https://uscode.house.gov/view.xhtml?req=granuleid:USC-prelim-title10-section1107a&num=0&edition=prelim", "https://www.breitbart.com/politics/2022/09/27/exclusive-dod-wouldnt-let-troops-wait-fda-approved-vaccine-before-punishing-them/", "https://beckernews.com/the-cdc-opened-up-public-comments-on-mandatory-covid-vaxes-for-children-and-the-blowback-is-glorious-47522/", "https://truthsocial.com/@ssg_q/posts/109196694120613120", "https://www.clickorlando.com/news/2022/10/19/ladapo-rejects-adding-covid-19-to-florida-vaccines-for-children-program-ahead-of-cdc-vote/", "https://twitter.com/CDCgov", "https://twitter.com/GovRonDeSantis", "https://truthsocial.com/@RealSKeshel/posts/109195589758703804", "https://t.co/RqHeXzqBQR", "https://twitter.com/DonaldJTrumpJr/status/1582708869939490816?ref_src=twsrc%5Etfw", "https://truthsocial.com/@somebitchiiknow/posts/109193792240505405", "/cdn-cgi/l/email-protection", "https://t.co/KxeSrMrLyO", "https://twitter.com/hashtag/FoxNews?src=hash&ref_src=twsrc%5Etfw", "https://twitter.com/TomFitton/status/1582573811714883588?ref_src=twsrc%5Etfw", "https://truthsocial.com/@Clandestine/posts/109195380901163365", "https://truthsocial.com/@realDonaldTrump/posts/109193399003652579", "https://truthsocial.com/@realDonaldTrump/posts/109192353202698867", "https://www.thegatewaypundit.com/2022/10/beginning-arizona-ballot-stuffer-caught-covering-license-plate/", "https://justthenews.com/nation/states/center-square/75-names-sent-prosecutors-potential-ohio-voter-fraud", "https://truthsocial.com/@brunobarking/posts/109195900350436765", "https://truthsocial.com/tags/WatchTheWater", "/cdn-cgi/l/email-protection", "https://truthsocial.com/@Navy", "https://truthsocial.com/tags/Navy", "https://truthsocial.com/tags/USNavy", "https://8kun.top/qresearch/res/11146782.html#11147059", "https://www.military.com/video/aircraft/gunships/ac-130-gunship-lights-up-the-night/658552061001"], "authors": [], "publish_date": "October 19, 2022"}