{"result_id": "352043", "URL": "https://x22report.com/the-system-is-panicking-the-narrative-no-longer-has-you-hold-the-line-the-enemy-is-cracking/", "timestamp": "2023-04-25 18:21:04 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://x22report.com/wp-content/uploads/2019/08/favicon_new-3.ico", "canonical": "https://x22report.com/the-system-is-panicking-the-narrative-no-longer-has-you-hold-the-line-the-enemy-is-cracking/", "encoding": "UTF-8"}, "image": null, "domain": "x22report.com", "title": "The System Is Panicking, The Narrative No Longer Has You, Hold The Line, The Enemy Is Cracking", "cleaned_text": "This present constant drum beat of COVID and vaccine hysteria by the mainstream media, from fear-mongering politicians, Big Tech oligarchs and corporate interests all results in one smothering cultural voice…inside Big Brother’s Matrix.\n\nIt can literally feel like the entire world has gone insane…but it hasn’t. Because what you are seeing on your electronic devices is\n\nThere are mass protests going on now all over the globe as people fight for their rights and liberties in the face of an encroaching and increasingly naked tyranny.\n\nBut you won’t know about any of this, and you’ll see little if any of it, if you keep your eyes fixed on Big Brother’s networks or scan Big Brother’s Big Tech social media platforms. Because Big Brother is always watching, and tightly controlling what people are allowed to see.\n\nIn the real world, Neo and Zion are winning. As I begin planning this column, I’m watching this laughable Facebook fake “whistleblower” testimony which is only a transparent pretext for calling for more censorship of Trump and his supporters. They had to throw this together fast because their J6 plot blew up on them and their insurrection narrative is dying.\n\n“We do not censor people hard enough on social media! Why aren’t we censoring people even harder yet?!”\n\nOnly in the MEDIA WORLD controlled by people like Zuckerberg are we losing. Only in the media world is the vaccine mandate ‘working’, is Biden doing a heckuva job, etc.\n\nTune it out. Unplug from the Big Brother Matrix.\n\nSpend too much time watching the illusions being carefully and craftily created for Fake News channels and websites, it’s going to warp your perception of what is really happening all across this country.\n\nFake News is designed to attempt to unbalance your mind. And to put you into a state in which you can be either more easily controlled by the State or led into doing something rash and stupid that can be used to further the tyrannical causes of the State.\n\nMy brother, Duane Cates, calls this ‘the Soul War’, and I believe that is quite accurate. There is a war on for the soul of every American.\n\nScared, terrified and paranoid people are paralyzed or they act out in violent and irrational ways. That’s how the vile cabal behind all of this insanity of the past year and a half wants you to be right now, as you watch the news media they control, use the Big Tech platforms they own, read the magazines and books they publish. Scared, terrified, paranoid and paralyzed or making plans to do something stupid.\n\nThey would prefer you become pacified and paralyzed, because then you’ll very likely do what you are told to do in order that things may soon ‘get back to normal’. It’s so easy. All you must do is comply.\n\nBut they’re lying to you. The more you comply the more they change everything.\n\nRight now, they’re in the midst of rolling out an endless regime of booster shots even as they attempt to implement vaccine mandates on entire populations.\n\nYou are not going to comply your way out of this present tyranny. The madness only ends when enough people stand up and say “No I won’t.”\n\nA lot of the problems in American society right now would sort themselves out if most people would just tune out the Fake News Media and get off their Big Tech platforms.\n\nPeople may not think they are being affected by it, but they are.\n\nBob Woodward launched a new book full of his usual serial fabulist lies and I watched people on both sides of the aisles eat up the bullshit claims found in it. Every single person who bought into the fantastical tales about General Milley supposedly having a private phone call with the CCP leadership was influenced by Big Brother.\n\nIf all you watch is the Fake News, you don’t know anything about the mass protests that are taking place all over the world. The mainstream corporate media is not going to show you any real look at the millions of citizens who’ve been rising up to protest against their local tyrants.\n\nA deliberate impression is created that the bad guys are not only winning, but they are also winning easily in their long uninterrupted march to making the US and much of the Western world into totalitarian states.\n\nQuit watching the illusion. Come back to reality.\n\nSome people don’t believe the country will ever emerge from the state it has ended up in since the election was stolen in 2020.\n\nI am not one of those people.\n\nThe media’s job right now is to make things look ten times worse than they really are, to fill you will fear, a feeling of being isolated, dependent, and helpless.\n\nPart of your resistance to the Fake News Media, the Big Tech oligarchs and the corporatist monopolists is to shut them out of your life.\n\nAs long as you are watching their news or using their platforms or services, you are empowering them to try to control you, to influence your behavior, to limit and control your speech.\n\nThe reason they make frequent use of some of the most publicly visible people like movie stars, athletes and other celebrities to push their current narratives is to sell the idea that they have iron clad control of our culture.\n\nThere is an illusory ‘Vanity Fair’ culture they control, and then there’s the real American culture that exists outside the cabal’s media bubble.\n\nMany Americans have been shocked over the past year or so into waking and realizing they have been immersing themselves in this fake “Vanity Fair” version of the world created by these elite sophists on news networks, in their books and magazines, their movies, TV shows, music, and more.\n\nThey are unplugging from that fake version of the world, and there shall be no going back for them.\n\nHold The Line, The Enemy Is Cracking\n\nThe Shadow Cabal can’t bluff for much longer. They never counted on the level of mass noncompliance they are seeing to their draconian power-grabs.\n\nRight now, as a short-term stop-gap fix, some governors are deploying their state’s National Guard force to staff hospitals and schools where employees have been fired for defying vaccine mandates. Maybe when thousands of airline pilots walk off the job they can have the National Guard fly the planes too.\n\n“National Guard fly the planes too? What a great idea!”\n\nBut there simply aren’t enough National Guard to staff both the hospitals and the public schools. Or fly the planes or run the trains or drive the buses.\n\nThese out-of-touch politicians can issue all the vaccine mandates they want. They have no legal way to enforce them and the sooner everyone figures that out, the better off we’ll all be.\n\nCompanies that are following illegal orders issued by politicians are going to be left twisting in the wind on their own when they get sued by the employees they fired over refusing vaccinations.\n\nBiden and Newsom will be nowhere to be found when these business owners suffer judgements against them in the millions of dollars.\n\nIt was just over three months ago that Joe Biden told the biggest whopper of his 50-year political career when he said, in answer to the question of if he could mandate vaccinations and have people fired for refusing to comply, “I don’t know that yet.”\n\n“Please stupidly institute your own private vaccine mandate on your employees while I dodge all accountability for the looming economic fiasco.”\n\nSuddenly last month Biden pretended that he now **does** know that he can institute vaccine mandates and cause mass firings all across the fruited plain.\n\nUnderstand what happened here: This White House claimed a national OSHA law was coming, and that the federal workforce, state governors and business owners had better get a ‘head start’ and institute their own private vaccine mandates on their own to show good faith in complying with the coming OSHA regulation.\n\nBut Biden and his White House team have been bluffing this entire time. They know full well what would happen if OSHA begin trying to enforce a vaccine mandate.\n\nThe courts would instantly issue injunctions and shut it all down. 25+ states would instantly sue Biden’s administration in the courts.\n\nWhen pressed, White House spokesperson Jennifer Psaki has admitted that nobody really knows when this much talked about OSHA rule is going to officially take effect.\n\nThe strategy that’s emerging has been one of bluffing private companies into instituting their own private vaccine mandates even though no such law has yet been implemented. There hasn’t even been a draft of such a regulation or law presented yet.\n\nBiden’s Controllers Are Doing More To Wake Up Americans Than Anyone Else\n\nThe fact we had things very good under Trump and so many things have become truly awful so very quickly under this current illegitimate President in the White House will lead to another dichotomy between the Fake World and the Real World that is going to wake up many of our American brethren who still slumber in the Big Tech Matrix.\n\nNot only does the Fake News Media and Big Tech have to make things look far worse than they really are, but they also have to constantly pretend none of this current chaos and misery is due to Joe Biden or his policy decisions.\n\nThey want to paralyze you with fear to get you to comply while at the same time trying to shield Biden and his gang of incompetents who are directly causing most of the current chaos from any accountability.\n\nBiden himself has made a spectacle of this by repeatedly refusing to take any questions and pointedly leaving as soon as he’s done reading the statements others wrote for him.\n\nThat is an impossible task and the Fake News Media is already struggling under the herculean weight of it.\n\nI don’t believe there will be any recovery from the tailspin that the Biden White House is currently in.\n\nWhen asked about the recent abysmal polling for Biden, Jen Psaki babbled something about how 20% of the population is still unvaccinated. That was an incredibly incoherent excuse, and it’s not going to get any better for her in the coming months.\n\nAlthough this makes for a tough period for us all to live in at the present, this too shall pass.\n\nYou could not tell people what they would do; hardly anyone would have believed you, that these elitist political class snobs would drop their masks and reveal themselves to be authoritarian tyrants.\n\nPeople had to experience the tyranny to forever reject those who sought to impose it upon them.\n\nIn short, to save the country from these cabal members they had to be led to believe it was now safe to drop their masks and show their true naked face to the people they mean to rule over.\n\nIn doing so, they have now destroyed themselves forever. The process of their destruction shall not be instantaneous, however. It will take some time for it to be accomplished by ‘the little people’.\n\n“Things will soon get back to normal…just as long as all you little people go on home and quit making trouble!”\n\nWe are now living in a transitional age. Such times are always difficult. Suffering is involved, and difficult and many times tragic sacrifices have to be made.\n\nIt’s easy to give up, to just give in and comply. It requires no effort from you, but it will cost you and your children and your children’s children .\n\nPeople who’ve given up are always looking for someone else to be the scapegoat for their own lack of courage and their dereliction of their duty.\n\nThe enemy seeks to convince you the battle was already lost long ago, that any effort you now make at fighting them is wasted and will be futile.\n\nWell, they lie to you about everything else, so of course they lie to you about this also.\n\nOnly as long as enough Americans are in the grip of the Big Brother Matrix illusion can they keep their power.\n\nResistance is futile, they tell us.\n\nIn fact, resistance to their tyranny is your duty as a citizen.\n\nThe moment you stop resisting, you’re not an American citizen any longer, you will have consented to be their serf. And once you become their serf, you will never be a citizen again.\n\nOn social media I encounter in some quarters endless whining that it’s not fair that these troubles have come in our time.\n\nWell life isn’t about fairness. It never has been.\n\nWe don’t get to choose our time; we can only make the decision to meet whatever challenges that arise to confront us with the best that is in us.\n\nUnplug from their Matrix. Get involved at the level of government that truly matters: your local county. Make your voice heard. Let them know you have woken from your slumber, and you will never sleep again.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/telegram?linkurl=https%3A%2F%2Fx22report.com%2Fthe-system-is-panicking-the-narrative-no-longer-has-you-hold-the-line-the-enemy-is-cracking%2F&linkname=The%20System%20Is%20Panicking%2C%20The%20Narrative%20No%20Longer%20Has%20You%2C%20Hold%20The%20Line%2C%20The%20Enemy%20Is%20Cracking", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fx22report.com%2Fthe-system-is-panicking-the-narrative-no-longer-has-you-hold-the-line-the-enemy-is-cracking%2F&linkname=The%20System%20Is%20Panicking%2C%20The%20Narrative%20No%20Longer%20Has%20You%2C%20Hold%20The%20Line%2C%20The%20Enemy%20Is%20Cracking", "https://www.addtoany.com/share"], "authors": [], "publish_date": "October 13, 2021"}