{"result_id": "352037", "URL": "https://x22report.com/the-truth-is-spreading-ds-prepares-to-shutdown-the-truth-be-careful-what-you-wish-for-ep-2806/", "timestamp": "2023-04-25 18:21:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://x22report.com/wp-content/uploads/2019/08/favicon_new-3.ico", "canonical": "https://x22report.com/the-truth-is-spreading-ds-prepares-to-shutdown-the-truth-be-careful-what-you-wish-for-ep-2806/", "encoding": "UTF-8"}, "image": null, "domain": "x22report.com", "title": "The Truth Is Spreading, [DS] Prepares To Shutdown The Truth, Be Careful What You Wish For – Ep. 2806", "cleaned_text": "The Fed, Treasury, Biden Admin knowingly lied to the people when they said inflation would disappear, the people know the truth now. People are rising up as the [CB] pushes their agenda. Countries are now preparing to counter the CBDC, the war with the [CB] has begun. The [DS] is trapped in their own agenda. They know they cannot control the narrative. The agenda is falling apart, the people are questioning everything they do. The precipice is meant to wake those people up who are in a deep sleep, a scare event will be necessary to snap them out of it. What will the scare event be, WAR, will we go to war, No. The corrupt politicians are pushing everything they have and now the people can see this very clearly, Trump readies the replacements. The [DS] will be so desperate that they will push a communication blackout, but this will not stop the patriots, countermeasures are in place. Buckle up, the ride is about to get really bumpy.\n• Biden was so impressed with Powell, that he decided to keep him on and add a socialist as one of his deputies.\n• Powell spoke in front of Congress this morning. CNBC reports: Federal Reserve Chairman Jerome Powell told congressional lawmakers Wednesday that the central bank is determined to bring down inflation and has the ability to make that happen. “At the Fed, we understand the hardship high inflation is causing. We are strongly committed to bringing inflation back down, and we are moving expeditiously to do so,” the Fed chief said in remarks for the Senate Banking Committee. “We have both the tools we need and the resolve it will take to restore price stability on behalf of American families and businesses.”\n• It will be based on a currency basket of the five-nation bloc, according to the Russian president\n• The Trafalgar Group and Convention of States Action conducted a survey and asked participants whether they believe “‘red flag’ gun control laws designed to temporarily take guns away from individuals has the potential to be abused by local authorities and government officials to disarm their political opponents and/or citizens who disagree with them?”\n• Among all the respondents, 46.7% said “yes” while 22.5% said they were unsure. Roughly 30% said “no.”\n• The NRA officially has responded by saying it will oppose the legislation. The NRA says “this legislation can be abused to restrict lawful gun purchases, infringe upon the rights of law-abiding Americans.” The NRA will support legislation that improves school security, promotes mental health services, and helps reduce violent crime. However, we will oppose this gun control legislation because it falls short at every level. It does little to truly address violent crime while opening the door to unnecessary burdens on the exercise of Second Amendment freedom by law-abiding gun owners. This legislation can be abused to restrict lawful gun purchases, infringe upon the rights of law-abiding Americans, and use federal dollars to fund gun control measures being adopted by state and local politicians. This bill leaves too much discretion in the hands of government officials and also contains undefined and overbroad provisions – inviting interference with our constitutional freedoms. Decisions by the Supreme Court of the United States in the Heller and McDonald cases make clear that the Second Amendment is an individual constitutional freedom. We will always fight for those freedoms – and the fundamental values we have defended for over 150 years. ​ Senate Gun Control Deal Uses Byrne Grants to Incentivize States to Adopt Red Flag Laws\n• The Senate gun control legislation introduced uses Byrne Grants as incentives for the adoption of red flag laws.\n• Section 12003 is titled “Use of Byrne Grants for Implementation of State Crisis Intervention Programs.”\n• The funds are to be used to create “mental health courts,” “drug courts,” “veterans courts,” and establish “extreme risk protection orders,” aka, red flag laws.\n• California has a red flag law, and so many other gun controls that Mike Bloomberg-affiliated Everytown for Gun Safety ranks the state number one for gun law strength.\n• Despite a red flag law and all the other controls, California is also number one for “active shooter incidents.” You walk around with a chip in you But at least Ukraine got $40,000,000,000 and Republicans passed red flag laws! Why do D’s push for ‘directly’ after every tragic incident? \n\n Why is this so very important to their agenda?\n\n We, the people, are who they are afraid of.\n\n We, the people, are who they fear will one day awake.Q https://twitter.com/KingstonChurch3/status/1203332761542520832\n\n What happens when people don’t conform to their rule?\n\n What happens when people cannot defend themselves?\n\n Why do [D]’s want to abolish the ?\n\n “A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.”\n\n What did the Framers of the Constitution fear the most?\n\n https://www.archives.gov/founding-docs/declaration-transcript\n\n “–That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.\n\n But when a long train of abuses and usurpations, pursuing invariably the same Object evinces a design to reduce them under absolute Despotism, it is their right, it is their duty, to throw off such Government, and to provide new Guards for their future security.–”\n\n We, the People.\n\n Q What happens when people don’t conform to their rule?What happens when people cannot defend themselves?Why do [D]’s want to abolish the“A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.”What did the Framers of the Constitution fear the most?“–That whenever any Form of Government becomes destructive of these ends, it is the Right of the People to alter or to abolish it, and to institute new Government, laying its foundation on such principles and organizing its powers in such form, as to them shall seem most likely to effect their Safety and Happiness.But when a long train of abuses and usurpations, pursuing invariably the same Object evinces a design to reduce them under absolute Despotism, it is their right, it is their duty, to throw off such Government, and to provide new Guards for their future security.–”We, the People.\n• The deal on “Gun Control” currently being structured and pushed in the Senate by the Radical Left Democrats, with the help of Mitch McConnell, RINO Senator John Cornyn of Texas, and others, will go down in history as the first step in the movement to TAKE YOUR GUNS AWAY. Republicans, be careful what you wish for!!! What would happen if texts originating from a FBI agent to several [internals] discussed the assassination (possibility) of the POTUS or member of his family?\n\n What if the texts suggest foreign allies were involved?\n\n Forget the Russia set up [1 of 22].\n\n This is only the beginning.\n\n Be careful what you wish for.\n\n THE WORLD TURNS.\n\n Could messages such as those be publicly disclosed?\n\n What happens to the FBI?\n\n What happens to the DOJ?\n\n What happens to special counsel?\n\n What happens in general?\n\n Every FBI/DOJ prev case could be challenged.\n\n Lawless.\n\n Think logically.\n\n We haven’t started the drops re: human trafficking / sacrifices [yet][worst].\n\n Those [good] who know cannot sleep.\n\n Those [good] who know cannot find peace.\n\n Those [good] who know will not rest until those responsible are held accountable.\n\n Nobody can possibly imagine the pure evil and corruption out there.\n\n Those you trust are the most guilty of sin.\n\n Who are we taught to trust?\n\n If you are religious, PRAY.\n\n 60% must remain private [at least] – for humanity.\n\n These people should be hanging.\n\n Q The delta between this drop and Trump’s truth is exactly 4 years and 5 months…45\n\n‘We’re the only country in the world doing this right now’: Biden boasts about vaccinating under-5s as he takes selfies with toddlers and comforts crying boy named Joe\n• They saw kids six months to five years old get their shot\n• Vaccines for toddlers were approved last week\n• Remains unclear how many parents will get their kids vaccinated\n\n\n\n = propaganda tool of the D party.\n\n POTUS economy – not good enough – IMPEACH.\n\n POTUS job creating (record) – not good enough – IMPEACH.\n\n POTUS GPD – not good enough – IMPEACH.\n\n POTUS fair trade (protect America) – not good enough – IMPEACH.\n\n POTUS manufacturing – not good enough – IMPEACH.\n\n POTUS record low unemployment – not good enough – IMPEACH.\n\n POTUS tax reform (more take home money) – not good enough – IMPEACH.\n\n POTUS save the world from – not good enough – IMPEACH.\n\n POTUS stock market gains – not good enough – IMPEACH.\n\n POTUS undo harmful regulations – not good enough – IMPEACH.\n\n POTUS boost US energy dominance – not good enough – IMPEACH.\n\n POTUS protect US homeland – not good enough – IMPEACH.\n\n POTUS combatting opioids – not good enough – IMPEACH.\n\n POTUS accountability (audit Pentagon, , re-org executive branch etc.) – not good enough – IMPEACH.\n\n POTUS protecting life – not good enough – IMPEACH.\n\n POTUS helping Veterans – not good enough – IMPEACH.\n\n POTUS peace through strength – not good enough – IMPEACH.\n\n POTUS restore confidence/respect of US – not good enough – IMPEACH.\n\n ………………..all while under constant attack.\n\n DO YOU NOT BELIEVE THE TRUTH IS SPREADING?\n\n DO YOU NOT BELIEVE THEY ARE LOSING THEIR SLAVE GRIP HOLD?\n\n DO YOU NOT BELIEVE WE ARE WINNING?\n\n ‘SILENT’ MAJORITY NO MORE.\n\n FIGHT, FIGHT, FIGHT!\n\n WWG1WGA!!!!!\n\n WHAT A WONDERFUL DAY.\n\n Q ARE YOU AWAKE?= propaganda tool of the D party.POTUS economy – not good enough – IMPEACH.POTUS job creating (record) – not good enough – IMPEACH.POTUS GPD – not good enough – IMPEACH.POTUS fair trade (protect America) – not good enough – IMPEACH.POTUS manufacturing – not good enough – IMPEACH.POTUS record low unemployment – not good enough – IMPEACH.POTUS tax reform (more take home money) – not good enough – IMPEACH.POTUS save the world from– not good enough – IMPEACH.POTUS stock market gains – not good enough – IMPEACH.POTUS undo harmful regulations – not good enough – IMPEACH.POTUS boost US energy dominance – not good enough – IMPEACH.POTUS protect US homeland – not good enough – IMPEACH.POTUS combatting opioids – not good enough – IMPEACH.POTUS accountability (audit Pentagon,, re-org executive branch etc.) – not good enough – IMPEACH.POTUS protecting life – not good enough – IMPEACH.POTUS helping Veterans – not good enough – IMPEACH.POTUS peace through strength – not good enough – IMPEACH.POTUS restore confidence/respect of US – not good enough – IMPEACH.………………..all while under constant attack.DO YOU NOT BELIEVE THE TRUTH IS SPREADING?DO YOU NOT BELIEVE THEY ARE LOSING THEIR SLAVE GRIP HOLD?DO YOU NOT BELIEVE WE ARE WINNING? http://www.breitbart.com/big-journalism/2018/06/27/poll-72-of-americans-believe-establishment-media-intentionally-report-fake-news/ ‘SILENT’ MAJORITY NO MORE.FIGHT, FIGHT, FIGHT!WWG1WGA!!!!!WHAT A WONDERFUL DAY. THESE are the times that try men’s souls. The summer soldier and the sunshine patriot will, in this crisis, shrink from the service of their country; but he that stands by it now, deserves the love and thanks of man and woman. Tyranny, like hell, is not easily conquered; yet we have this consolation with us, that the harder the conflict, the more glorious the triumph. What we obtain too cheap, we esteem too lightly: it is dearness only that gives everything its value. Heaven knows how to put a proper price upon its goods; and it would be strange indeed if so celestial an article as FREEDOM should not be highly rated. – Thomas Paine\n\n Q Think The Swamp Has Won? Not So Fast … The Founders Slipped A Fail Safe Into The Constitution: The Convention of States Believe it or not, our Founding Fathers, during the time of Louis XVI’s Versailles and having just lived under the domination of King George III and an English Parliament in London almost 6000 miles away, anticipated there may come a time when the political elite, all living together in a far off capital city, might become detached from those they are supposed to serve and may need to be reigned in. For just this eventuality, the Founders slipped a mechanism into the Constitution, which allows The States (specifically the State Legislatures) to overrule the power-drunk tyrants living as permanent residents in the capital and return the power of our Constitutional Republic back to The States and We the People. This fail safe is called The Convention of the States (COS). Mark Levin has discussed the need for The Convention of the States in an excellent description of the process. 15 states have already passed COS resolutions, 8 more States have passed a COS resolution through 1 state legislative chamber, another 12 states have active legislation pending this year. So a total of 35 states are already inclined to support the COS, and that doesn’t even include states like Idaho, Kansas, Michigan, Ohio, and Pennsylvania with Republican state legislatures that could easily be persuaded to join in given all the election and other chaos seen in 2020. Surely additional state legislatures could be persuaded to join either through political pressure or future elections. If the amendments passed were the type with broad 70 to 80% public support, there is a real chance some or all of the amendments could see ratification. Convention of the States progress map as of March 7, 2021 This can all be done outside of the sphere of Washington D.C. The States do not need a single vote in Congress, the President cannot veto it, and the Supreme Court cannot rule ratification of a constitutional amendment to be unconstitutional. Not even the Associated Press gets a say.", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">There is only one criminal between the two of us…YOU!!! <a href=\"https://t.co/68cawpAXVI\">pic.twitter.com/68cawpAXVI</a></p>\n<p>— Andrew Gillum (@AndrewGillum) <a href=\"https://twitter.com/AndrewGillum/status/1197895197696417797?ref_src=twsrc%5Etfw\">November 22, 2019</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The country dodged such a bullet. If Gillum had won we'd probably still be in various stages of lockdown because there would have been no Gov. DeSantis to say \"wait, this is stupid.\" <a href=\"https://t.co/7BsJhIoG4R\">https://t.co/7BsJhIoG4R</a></p>\n<p>— Karol Markowicz (@karol) <a href=\"https://twitter.com/karol/status/1539631795116953600?ref_src=twsrc%5Etfw\">June 22, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">BREAKING: Robb Elementary, the Texas school where 19 children and 2 teachers were killed in a mass shooting, will be demolished – Uvalde Mayor</p>\n<p>— Breaking911 (@Breaking911) <a href=\"https://twitter.com/Breaking911/status/1539415670668001282?ref_src=twsrc%5Etfw\">June 22, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The phrase “currently available” tells you everything you need to know: the Biden absolutely plans to restrict future production at Winchester’s Lake City plant to cut off 5.56 ammunition supply to the public.</p>\n<p>They got caught red-handed and are now trying to pretend otherwise. <a href=\"https://t.co/6MSuwTGTzq\">https://t.co/6MSuwTGTzq</a></p>\n<p>— Sean Davis (@seanmdav) <a href=\"https://twitter.com/seanmdav/status/1539359661228445696?ref_src=twsrc%5Etfw\">June 21, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The year is 2040:</p>\n<p>Owning guns is illegal</p>\n<p>The dollar is dead</p>\n<p>Gender no longer exists</p>\n<p>You walk around with a chip in you</p>\n<p>Electric vehicles are mandatory</p>\n<p>Children are taught Chinese before English</p>\n<p>But at least Ukraine got $40,000,000,000 and Republicans passed red flag laws!</p>\n<p>— Charlie Kirk (@charliekirk11) <a href=\"https://twitter.com/charliekirk11/status/1539461611793965057?ref_src=twsrc%5Etfw\">June 22, 2022</a></p></blockquote>\n", "<blockquote class=\"twitter-tweet\" data-width=\"550\" data-dnt=\"true\">\n<p lang=\"en\" dir=\"ltr\">The Supreme Court has added another opinion day this week. The court will issue opinions on both Thursday and Friday at 10 a.m. EDT. There are 13 cases that still remain to be decided.</p>\n<p>— SCOTUSblog (@SCOTUSblog) <a href=\"https://twitter.com/SCOTUSblog/status/1539615033461772289?ref_src=twsrc%5Etfw\">June 22, 2022</a></p></blockquote>\n"], "movies": [], "links": ["https://www.addtoany.com/add_to/telegram?linkurl=https%3A%2F%2Fx22report.com%2Fthe-truth-is-spreading-ds-prepares-to-shutdown-the-truth-be-careful-what-you-wish-for-ep-2806%2F&linkname=The%20Truth%20Is%20Spreading%2C%20%5BDS%5D%20Prepares%20To%20Shutdown%20The%20Truth%2C%20Be%20Careful%20What%20You%20Wish%20For%20%E2%80%93%20Ep.%202806", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fx22report.com%2Fthe-truth-is-spreading-ds-prepares-to-shutdown-the-truth-be-careful-what-you-wish-for-ep-2806%2F&linkname=The%20Truth%20Is%20Spreading%2C%20%5BDS%5D%20Prepares%20To%20Shutdown%20The%20Truth%2C%20Be%20Careful%20What%20You%20Wish%20For%20%E2%80%93%20Ep.%202806", "https://www.addtoany.com/share", "https://media.blubrry.com/x22report/content.blubrry.com/x22report/episode_2806.mp3", "https://x22report.com/aiovg_videos/ep-2806b-the-truth-is-spreading-ds-prepares-to-shutdown-the-truth-be-careful-what-you-wish-for/", "https://x22report.com/aiovg_videos/ep-2806b-the-truth-is-spreading-ds-prepares-to-shutdown-the-truth-be-careful-what-you-wish-for/", "https://x22report.com/aiovg_videos/ep-2806a-the-cbdc-is-now-being-countered-by-other-countries/", "https://x22report.com/aiovg_videos/ep-2806a-the-cbdc-is-now-being-countered-by-other-countries/", "https://x22report.com/wp-content/uploads/2022/06/youtube_website_06222022_lg.jpg", "https://truthsocial.com/@JordanSather/posts/108522492097840242", "https://www.thegatewaypundit.com/2022/06/biden-economy-fed-chief-jerome-powell-tells-congress-anticipate-ongoing-rate-increases/", "https://www.cnbc.com/2022/06/22/powell-tells-congress-the-fed-is-strongly-committed-to-bringing-inflation-down.html", "https://www.cnbc.com/jay-powell/", "https://www.rt.com/business/557627-brics-developing-global-reserve-currency/?utm_source=rss&utm_medium=rss&utm_campaign=RSS", "https://t.co/68cawpAXVI", "https://twitter.com/AndrewGillum/status/1197895197696417797?ref_src=twsrc%5Etfw", "https://t.co/7BsJhIoG4R", "https://twitter.com/karol/status/1539631795116953600?ref_src=twsrc%5Etfw", "https://truthsocial.com/@AlinaHabba/posts/108518503443392871", "https://truthsocial.com/@realDonaldTrump", "https://t.me/drawandstrikechannel/45985", "https://www.thegatewaypundit.com/2022/06/ghislaine-maxwell-trying-use-clinton-connection-get-lower-sentence/", "https://www.dailymail.co.uk/news/article-10935097/Ghislaine-Maxwell-touted-connection-Bill-Clinton-lower-sentence-trafficking.html", "https://twitter.com/Breaking911/status/1539415670668001282?ref_src=twsrc%5Etfw", "https://thefederalist.com/2022/06/22/white-house-refuses-to-deny-plans-to-halt-future-civilian-ammo-sales-from-lake-city-plant/", "https://thefederalist.com/2022/06/17/white-house-aims-to-shut-down-ammunition-sales-while-dems-claim-to-engage-in-good-faith-gun-talks/", "https://t.co/6MSuwTGTzq", "https://twitter.com/seanmdav/status/1539359661228445696?ref_src=twsrc%5Etfw", "https://thefederalist.com/2022/06/22/the-14-republicans-who-voted-to-advance-democrats-gun-control-wish-list-just-betrayed-their-base/?utm_source=rss&utm_medium=rss&utm_campaign=the-14-republicans-who-voted-to-advance-democrats-gun-control-wish-list-just-betrayed-their-base", "https://dailycaller.com/2022/06/22/republicans-independents-fear-red-flag-laws-will-be-abused-by-government-poll/", "https://www.thetrafalgargroup.org/news/nat-issues-red-flag-0621/", "https://www.thetrafalgargroup.org/wp-content/uploads/2022/06/COSA-RedFlag-Poll-Report-0621.pdf", "https://www.thegatewaypundit.com/2022/06/nra-reacts-senate-cave-guns/", "https://home.nra.org/statements/nra-announces-opposition-to-senate-gun-control-legislation/", "https://www.breitbart.com/politics/2022/06/21/senate-gun-control-deal-uses-byrne-grants-to-incentivize-states-to-adopt-red-flag-laws/", "https://www.breitbart.com/politics/2022/06/05/california-no-1-gun-control-no-1-active-shooter-incidents/", "https://twitter.com/charliekirk11/status/1539461611793965057?ref_src=twsrc%5Etfw", "https://archive.4plebs.org/pol/thread/149463784/#149467690", "https://8kun.top/projectdcomms/res/20.html#97", "https://twitter.com/KingstonChurch3/status/1203332761542520832", "https://www.archives.gov/founding-docs/declaration-transcript", "https://truthsocial.com/@realDonaldTrump/posts/108521433131808244", "https://qanon.pub/index2.html#586", "https://8ch.net//qresearch/res/130072.html#130638", "https://qanon.pub/index2.html#t1516675652", "https://twitter.com/SCOTUSblog/status/1539615033461772289?ref_src=twsrc%5Etfw", "https://truthsocial.com/@realDonaldTrump/posts/108521026620377658", "https://www.dailymail.co.uk/news/article-10939313/Biden-takes-selfies-toddlers-getting-covid-shot.html", "https://www.dailymail.co.uk/news/joe-biden/index.html", "https://alexberenson.substack.com/p/urgent-the-covid-vaccine-paper-on", "https://onlinelibrary.wiley.com/doi/10.1111/andr.13209", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F50436b50-f6a8-4931-b7a4-64ed1908cdf9_1170x975.jpeg", "https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Ff94f473b-3fac-4a18-99b5-a8e814512270_1170x692.jpeg", "https://onlinelibrary.wiley.com/doi/10.1111/andr.13209", "https://www.thegatewaypundit.com/2022/06/joe-biden-says-quiet-part-loud-need-money-gonna-another-pandemic-video/", "https://truthsocial.com/@Qtah17/posts/108517874939555615", "/cdn-cgi/l/email-protection", "https://www.breitbart.com/politics/2022/06/21/less-ten-percent-following-january-6-committee-hearings-very-closely/", "https://abcnews.go.com/Politics/10-americans-trump-charged-jan-riot-poll/story?id=85482369", "https://msmagazine.com/2022/01/05/white-men-insurrection-january-6-masculinity-trump/", "https://truthsocial.com/@realDonaldTrump/posts/108521081651523004", "https://www.thegatewaypundit.com/2022/06/something-strange-happened-georgia-vernon-jones-latest-trump-endorsed-candidate-lose-run-off-election-peach-state-clean-sweep-never-trump/", "https://www.thegatewaypundit.com/2021/03/georgia-secretary-state-raffensperger-launched-investigation-president-trumps-phone-calls-state-lying-call-trashing-evidence/", "https://www.thegatewaypundit.com/2021/08/traitor-gov-brian-kemp-brutally-booed-off-stage-helping-democrats-steal-election/", "https://www.cnn.com/election/2022/results/georgia/primaries", "https://www.thegatewaypundit.com/2022/05/president-trump-supported-vernon-jones-makes-runoff-georgia-gop-representative/", "https://www.thegatewaypundit.com/2022/02/general-flynn-rescinds-endorsement-mike-collins-following-vicious-attack-ad-endorses-vernon-jones-congress/", "https://www.cnn.com/election/2022/results/georgia/primaries", "https://www.thegatewaypundit.com/2022/06/recent-cisa-report-identifies-massive-system-vulnerabilities-dominion-voting-systems-used-georgia-claims-no-evidence-vulnerabilities-abused-2020-can/", "https://truthsocial.com/@realDonaldTrump/posts/108518752055030138", "https://www.dailywire.com/news/massive-sunspot-doubles-in-size-sparking-solar-storm-concerns?%3Futm_source=twitter&utm_medium=social&utm_campaign=dwtwitter", "https://truthsocial.com/@Q/posts/108521249077518620", "/cdn-cgi/l/email-protection", "https://truthsocial.com/@allyannlove", "https://qanon.pub/index2.html#1609", "https://8ch.net/qresearch/res/1928866.html#1929392", "https://qanon.pub/index2.html#t1530133110", "http://www.breitbart.com/big-journalism/2018/06/27/poll-72-of-americans-believe-establishment-media-intentionally-report-fake-news/", "https://qanon.pub/index2.html#4544", "https://8kun.top/qresearch/res/9795086.html#9795415", "https://qanon.pub/index2.html#t1593490171", "https://twpundit.com/2021/03/07/think-the-swamp-has-won-not-so-fast-the-founders-slipped-a-fail-safe-into-the-constitution-the-convention-of-states/", "https://conventionofstates.com/", "https://twpundit.com/2020/11/08/8-ways-to-stopthesteal-sorry-associated-press-its-not-over/"], "authors": [], "publish_date": "June 22, 2022"}