{"result_id": "352030", "URL": "https://x22report.com/big-pharma-is-hiding-the-cure-from-the-world/", "timestamp": "2023-04-25 18:20:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://x22report.com/wp-content/uploads/2019/08/favicon_new-3.ico", "canonical": "https://x22report.com/big-pharma-is-hiding-the-cure-from-the-world/", "encoding": "UTF-8"}, "image": null, "domain": "x22report.com", "title": "Big Pharma Is Hiding The Cure From The World", "cleaned_text": "They really did.\n\nThey tried SO HARD.\n\nBut the truth about Ivermectin got out anyway.\n\nAnd now anybody who is looking can see it.\n\nAs with the cheap and widely available drug hydroxychloroquine last year, this year the Great Reset Cabal’s present disinformation target is the drug Ivermectin.\n\nBut this is like trying to close the barn door after the horse got out. The literature and case examples of Ivermectin being effective as a COVID virus treatment have already been established and are readily available.\n\nWhen Ivermectin’s prophylactic properties against COVID infection began to emerge based on solid evidence in recent weeks, the usual suspects immediately leaped to demonize the very idea of doctors prescribing Ivermectin as any sort of prophylactic against COVID-19.\n\nThen right in the middle of this furious debate that had started, the CDC got caught red-handed advising doctors to prescribe Ivermectin to the incoming Afghan refugees created by Biden’s totally botched Afghanistan withdrawal.\n\nSo before coming to America, taking Ivermectin is just fine and dandy. But once you are in the country, all of a sudden Ivermectin is dangerous and nobody should be taking it to combat viruses or parasites?\n\nWe’re now being told there’s a multitude of reasons why a person can take Ivermectin – to combat a variety of diseases and illnesses and some viruses. But just not for the COVID or it’s cousins. That’s out of bounds.\n\nThe stated reason for the HCQ hysteria we saw last year was the supposed fear that American citizens were going to overdose themselves on it if they started taking it.\n\nThat fake reason has now been resurrected for Ivermectin. As a case example, a doctor appeared in a local newscast video that quickly went viral in which he claimed rural hospitals in Oklahoma were being overwhelmed by patients who got ahold of Ivermectin and overdosed on it so that no beds were available for other patients.\n\n“The ERs are so backed up that gunshot victims were having hard times getting to facilities where they can get definitive care and be treated.” Dr. Jason McElyea is seen in the video telling local news reporter Katelyn Ogle.\n\nOnly the story this doctor was telling was far from true.\n\nThe fact the fanciful story McElyea was telling made rural Oklahoma sound like the Wild West was the first tipoff. Anybody looking into how many gunshot victims there actually are typically in a month in rural Oklahoma would’ve instantly realized what McElyea was saying was nonsensical.\n\nRolling Stone was forced to issue an update to its viral story about Oklahoma hospitals being overwhelmed by patients who overdosed on the drug ivermectin after the doctor it cited was contradicted by the hospitals he referenced.\n\nHowever, the Northeastern Hospital System, which McElyea works for, issued a statement regarding his association with the hospitals reported in the story. The NHS revealed while McElyea “is affiliated” with a medial staffing group, he has not worked at the location in question for 2 months nor has he treated any ivermectin overdoses.\n\n“Although Dr. Jason McElyea is not an employee of NHS Sequoyah, he is affiliated with a medical staffing group that provides coverage for our emergency room. With that said, Dr. McElyea has not worked at our Sallisaw location in over 2 months. NHS Sequoyah has not treated any patients due to complications related to taking ivermectin. This includes not treating any patients for ivermectin overdose.”\n\n“All patients who have visited our emergency room have received medical attention as appropriate,” NHS said. “Our hospital has not had to turn away any patients seeking emergency care. We want to reassure our community that our staff is working hard to provide quality healthcare to all patients. We appreciate the opportunity to clarify this issue and as always, we value our community’s support.”\n\nForced To Use the Same Methods As Last Year, The Cabal Is Getting Diminishing Returns\n\nThose with long memories will recall how last year within a few days of then-President Donald J. Trump touting hydroxychloroquine in a new conference, the mainstream media spread a viral story all over the country about a woman who’d poisoned her husband with fish tank cleaner. The fake narrative went that the wife got this idea of giving her husband this chemical because she listened to Trump talking about HCQ. This allegedly proved Trump was being incredibly irresponsible in touting HCQ, a drug hundreds of millions have been taking since 1955.\n\nBut it was all a lie. The story quickly fell apart. It subsequently was established when the woman was charged with murder that she was actually a staunch Democratic donor and far from a Trump fan. The tale the wife told the police simply did not add up. Chloroquine phosphate in fish tank cleaner isn’t certainly not HCQ, which is a legal drug for human consumption that has been taken for decades to combat diseases and illnesses like malaria for more than six decades.\n\nOur enemies don’t really have any new plays in their playbook and so they are being forced into transparent and obvious repetition. The exact same playbook is being utilized to suppress the facts about Ivermectin that were used against HCQ last year.\n\nDespite the fact that many medical organizations have reversed the HCQ disinformation they were actively spreading a year ago, some medical groups and many news media outlets have not retracted or amended their own hysteria-inducing disinformation about this drug. Some are doubling down.\n\nHCQ had to be attacked because if enough people took it early enough, it would have ended the pandemic by the end of the summer of 2020, through protecting enough people against COVID infection, something that we were all told for over a year and a half that the vaccines were going to do – until suddenly after the massive vaccination programs had begun, we began to be told otherwise.\n\nThe Vaccination Agenda Cannot Be Allowed to Have A Viable Competitor\n\nAnd now it’s the same with Ivermectin. If it works and enough people take it, there’s little reason to continue the very expensive and very profitable vaccine programs.\n\nDoesn’t it strike you as strange that the people who supposedly knew all along that these Emergency Use vaccines wouldn’t prevent infection with the COVID virus or its variants waited until several months after hundreds of millions of people had been vaccinated worldwide and it was becoming increasingly obvious that vaccinated persons were catching the virus and becoming seriously ill with it anyway to finally let us all know the vaccine didn’t prevent infection or serious illness and that endless rounds of booster shots would be necessary?\n\nI don’t know about you, but that does strike as being exceedingly strange.\n\nAny cheap, widely available drug that acts as a prophylactic against COVID infection is instantly attacked and demonized because it is a direct competitor with the big vaccination agenda many countries are currently pursuing.\n\nThat was the big reason that India was urged not to use Ivermectin but to instead engage in the much slower and far more costly program of vaccination for its citizens in Uttar Pradesh as the Delta variant surged in the region. The local officials in Uttar Pradesh did not listen, and by doing so ended up giving the entire world a highly visible test case of Ivermectin’s effectiveness in combatting COVID infection.\n\nThe chief way to stop a pandemic is to put the majority of the people in a region into a state in which they are immune to future infection. It was assumed vaccination was going to do this. Now we know that is not going to happen, as those pushing the Great Reset are now rolling out an endless regime of booster shots to supplement the original vaccines, which they now claim were never intended to prevent COVID infection.\n\nThe other ways to stop the pandemic are herd immunity and use of cheap and widely available drugs and supplements that have prophylactic properties against COVID.\n\nMany of the members of America’s Frontline Doctors took an incredible amount of heat last year for talking about the use of HCQ and Zinc to combat COVID infection. They stood firm and now the tide has turned. They were right, but they’ve gotten no apologies that I’ve seen.\n\nNow doctors like Dr. Peter McCullough are getting a big dose of what Dr. Simone Gold got last year because he’s touting Ivermectin.\n\nBut if in fact cheap and widely available drugs and vitamins and minerals can be utilized by a population to boost their immune systems to the point they will have prophylactic protection against COVID and it’s variants, then the very expensive and very profitable vaccine agenda is placed at risk.\n\nWe Already Won By Forcing Them Out Into The Open And Making Them Go Far Too Fast\n\nYou have to understand what’s going on here. The enemy is being forced out into the open because to implement their agenda they must go far too fast, which makes what they are doing quite obvious to anyone who is paying attention. Which is a number of people that increases exponentially ever day.\n\nWhile much of the mainstream media’s function at the present time is to keep as much of the public as possible propagandized, docile, and distracted, it can only fulfill that purpose on a slumbering population. Too many people have woken up and as the Great Reset Cabal is forced to repeat the same program from last year they are starting to get massive pushback.\n\nThis fake story about hospitals being “overwhelmed” by patients who had overdosed on Ivermectin didn’t even have a shelf life of two days.\n\nThis was always obvious – that when they attempted to repeat 2020 in 2021 it would not work. And it is indeed not working.\n\nThe U.S. Corporate Propaganda Media avoids covering it, but mass protests against the new round of lockdowns and vaccine mandates continue to grow worldwide.\n\nAs I said in a previous column, “The Great Reset has now run smack into The Great Setback”. They can proceed with The Great Reset only as long as most of their populations in the countries around the world obediently follow the agenda being demanded of them. Consent of the governed is a real thing. They should never have forgotten that, and now it’s too late. They’ve exposed themselves.\n\nThe side in an information war that is constantly being forced to move it’s goalposts, deny it’s former positions, change its story and fight to censor the side who is still standing where it always was is the one that is losing.\n\nAnd it’s more obvious than ever who’s losing this war.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.addtoany.com/add_to/telegram?linkurl=https%3A%2F%2Fx22report.com%2Fbig-pharma-is-hiding-the-cure-from-the-world%2F&linkname=Big%20Pharma%20Is%20Hiding%20The%20Cure%20From%20The%20World", "https://www.addtoany.com/add_to/email?linkurl=https%3A%2F%2Fx22report.com%2Fbig-pharma-is-hiding-the-cure-from-the-world%2F&linkname=Big%20Pharma%20Is%20Hiding%20The%20Cure%20From%20The%20World", "https://www.addtoany.com/share", "msn.com/en-gb/video/headlines/overdoses-from-ivermectin-overwhelm-rural-oklahoma-hospitals/vi-AAO4HUa", "https://www.foxnews.com/media/rolling-stone-forced-issue-update-after-viral-hospital-ivermectin-story-false", "https://www.rollingstone.com/politics/politics-news/gunshot-victims-horse-dewormer-ivermectin-oklahoma-hospitals-covid-1220608/", "https://news.yahoo.com/woman-blamed-trump-giving-her-133613382.html", "https://www.republicworld.com/india-news/general-news/tracing-history-of-hydroxychloroquine-hcq-from-tipu-sultan-to-covid.html", "https://journals.lww.com/americantherapeutics/Fulltext/2021/06000/Review_of_the_Emerging_Evidence_Demonstrating_the.4.aspx", "https://pubmed.ncbi.nlm.nih.gov/32418114/", "https://www.msn.com/en-us/health/medical/study-shows-hydroxychloroquine-and-zinc-treatments-increased-coronavirus-survival-rate-by-almost-three-times/ar-AAKSGnq", "https://www.wired.com/story/hydroxychloroquine-covid-19-strange-twisted-tale/", "https://newsroom.uw.edu/postscript/end-hydroxychloroquine-treatment-covid-19", "https://www.fda.gov/drugs/drug-safety-and-availability/fda-cautions-against-use-hydroxychloroquine-or-chloroquine-covid-19-outside-hospital-setting-or", "https://www.msn.com/en-us/health/medical/hydroxychloroquine-study-further-erodes-credibility-of-health-experts/ar-AAKWXYw", "https://www.msn.com/en-us/health/medical/seriously-do-not-take-ivermectin-to-treat-covid/ar-AANQrBS", "https://www.theblaze.com/op-ed/horowitz-the-unmistakable-ivermectin-miracle-in-the-indian-state-of-uttar-pradesh", "https://www.worldtribune.com/doctor-fired-web-site-taken-down-after-viral-video-on-hydroxychloroquine/", "https://www.snopes.com/news/2020/07/30/americas-frontline-doctors/", "https://www.snopes.com/news/2020/07/30/americas-frontline-doctors/", "https://news.yahoo.com/study-shows-hydroxychloroquine-zinc-treatments-210300816.html", "https://www.youtube.com/watch?v=F7cLxs8fNq8", "https://www.lifesitenews.com/news/covid-19-expert-dr-peter-mccullough-sued-by-texas-health-system/", "https://americasfrontlinedoctors.org/legal_team/simonegold/", "https://uncoverdc.com/2021/08/26/global-elites-reminded-the-hard-way-about-consent-of-the-governed/"], "authors": [], "publish_date": "September 8, 2021"}