{"result_id": "353023", "URL": "https://www.zerohedge.com/covid-19/mother-sues-doctor-who-allegedly-administered-covid-19-vaccines-children-without-consent", "timestamp": "2023-04-25 18:21:21 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/mother-sues-doctor-who-allegedly-administered-covid-19-vaccines-children-without-consent", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Mother Sues Doctor Who Allegedly Administered COVID-19 Vaccines To Children Without Consent | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nA doctor violated the law by administering COVID-19 vaccines to children without consent, according to a new lawsuit.\n\nDr. Janine Rethy, chief of community pediatrics at MedStar Georgetown University Hospital, is being accused of holding two children in a room until she convinced them to get a COVID-19 vaccine.\n\nThe minors are both children of NaTonya McNeil, a Washington resident who brought the suit in D.C. Superior Court.\n\n“Ms. McNeil’s two minor children were held in a room by Defendant until she overcame their will and forcibly vaccinated them while physically preventing them from consulting with their mother, who was right outside the room,” the 9-page suit states.\n\nThe children were also allegedly provided with “false and fraudulent information” in order to get their purported consent to administer the vaccines.\n\nRethy told the kids that they had to get a COVID-19 vaccine to attend school and that they could not legally decline vaccination, according to the filing.\n\nThe kids gave in when given the false information.\n\nRethy and MedStar did not respond to requests for comment.\n\nMcNeil took the children to Rethy for annual physical examinations on Sept. 2, 2022.\n\nThe location was the Georgetown Kids Mobile Medical Clinic/Ronald McDonald Care Mobile, which is operated by the Georgetown University Hospital, at a recreation center. Rethy is director of the mobile clinic.\n\nMcNeil waited outside with her 1-year-old child while the two other kids went inside. But she called her daughter’s cell phone soon after and asked to speak with the doctor. McNeil told Rethy she was outside and available if needed to answer questions or provide information.\n\nRethy never asked McNeil about any vaccinations, according to the suit.\n\nThe 16-year-old child, who attends Dunbar High School, went first. Rethy “came at me with a needle,” the girl was quoted as saying. Rethy, asked what the injection was, said it was a COVID-19 vaccine. The minor said she did not want the shot.\n\n“Dr. Rethy told K.M. that the injection was required for her to attend school, and then injected the needle,” the suit states. The younger child, 14, “also reluctantly agreed to accept the injection after seeing his sister be injected, although he had repeatedly refused COVID-19 injections previously as well.”\n\n“Both children were very upset and angry that they had been coerced into being injected,” the filing states.\n\nRethy also injected the children with a meningococcal vaccine.\n\nNeither Rethy nor clinic staff provided information about the vaccinations to McNeil or the children, the suit says. Rethy did speak with McNeil, but only told her she was going to call a prescription for the asthma of one of the children.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/mother-sues-doctor-who-allegedly-administered-covid-19-vaccines-to-children-without-consent_5107971.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/pfizer-vaccine-doses-and-cards-700x420.jpg?itok=vhxfUCjt", "https://www.documentcloud.org/documents/23698375-mcneil-v-rethy", "https://www.theepochtimes.com/mother-sues-doctor-who-allegedly-administered-covid-19-vaccines-to-children-without-consent_5107971.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}