{"result_id": "353011", "URL": "https://www.zerohedge.com/political/pentagon-exploring-back-pay-troops-kicked-out-over-covid-vaccine-mandate", "timestamp": "2023-04-25 18:21:13 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/pentagon-exploring-back-pay-troops-kicked-out-over-covid-vaccine-mandate", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Pentagon \"Exploring\" Back-Pay For Troops Kicked Out Over COVID Vaccine Mandate | ZeroHedge", "cleaned_text": "Authored by Jack Phillips via The Epoch Times,\n\nThe U.S. Department of Defense may provide back pay to former service members who were removed for not receiving the COVID-19 vaccine, coming after the Pentagon repealed the mandate, a spokesperson confirmed Friday.\n\nA Pentagon spokesperson told The Epoch Times, in response to reports from Politico and others, that regarding back pay, the “Department is still exploring this and will provide its views on legislation of this nature at the appropriate time and through the appropriate process.”\n\nDietz did not provide a timetable for when back pay might be considered.\n\nOn Tuesday, Defense Secretary Lloyd Austin issued a memo (pdf) formally rescinding the vaccine mandate after lawmakers passed a defense spending bill into law in December that required the change. The Pentagon had already stopped discharging service members who didn’t get the vaccine.\n\nCommanders can decide on whether to deploy troops who are not vaccinated, the memo said. That includes when COVID-19 vaccination is mandated “for travel to, or entry into, a foreign nation,” it added.\n\n“Certainly commanders do have a responsibility to ensure that if they’re sending forces to a place that requires a vaccine that that’s a situation that will be addressed, you know, on a case-by-case basis,” Pentagon spokesman Brig. Gen. Patrick Ryder told reporters on Thursday. “But you know, we have a responsibility for the health and welfare of our forces. And so, you know, again, depending on the situation and the circumstances, it is incumbent on commanders to ensure that they’re doing what they need to do to make sure those forces are ready.”\n\nThe contentious mandate forced more than 8,400 troops out of the military as top officials said they were refusing to obey an order for declining to take the vaccine. Thousands of people sought medical and religious exemptions, although a federal judge last month wrote (pdf) that the number of service members who successfully obtained religious exemption is far smaller than those who got medical exemptions.\n\nAustin said more than 2 million service members, or 96 percent of the active duty and reserve forces, are fully vaccinated.\n\nIn August 2021 and after the Pfizer vaccine was granted emergency use authorization by the Food and Drug Administration, Austin instituted the mandate and said that it was necessary to protect the health of the military force.\n\nHe and other defense leaders argued that for decades troops, particularly those deployed overseas, had been required to get as many as 17 different vaccines, including shots for anthrax. No other vaccine mandates were affected by the new rules.\n\nWhite House press secretary Karine Jean-Pierre told reporters in December that the Biden administration believes removing the mandate was a “mistake,” repeating claims from Austin that the shot makes “sure our troops are prepared and ready for service.” President Joe Biden ultimately signed the bill when it passed both chambers of Congress.\n\nSecretary of Defense Lloyd Austin speaks during a news conference at the Pentagon in Washington on Nov. 3, 2022. (Andrew Harnik/AP Photo)\n\nDespite those arguments, Congress agreed to rescind the mandate, with opponents reluctantly saying that perhaps it had already succeeded in getting the bulk of the force vaccinated. Some lawmakers have expressed concerns that the mandate and other policy directives have driven down enlistment in recent years.\n\nThose members of Congress argued that ending the mandate would help with recruiting. Defense officials have pushed back by saying that while it may help a bit, a department survey during the first nine months of last year found that a large majority said the mandate did not change the likelihood they would consider enlisting.\n\nThose who were discharged for refusing to obey a lawful order to take the vaccine received either an honorable discharge or a general discharge under honorable conditions.\n\nAustin’s memo says that anyone who was discharged can petition their military service to request a change in the “characterization of their discharge” in their personnel records. It does not, however, say what possible corrections could be awarded.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/pentagon-exploring-back-pay-for-troops-kicked-out-over-covid-vaccine-mandate_4984309.html", "https://www.theepochtimes.com/t-pentagon", "/s3/files/inline-images/military-health-covid-19-700x420.jpg?itok=y05j4JJs", "https://www.politico.com/news/2023/01/13/pentagon-back-pay-troops-covid-vaccine-mandate-00077902", "https://media.defense.gov/2023/Jan/10/2003143118/-1/-1/1/SECRETARY-OF-DEFENSE-MEMO-ON-RESCISSION-OF-CORONAVIRUS-DISEASE-2019-VACCINATION-REQUIREMENTS-FOR-MEMBERS-OF-THE-ARMED-FORCES.PDF", "https://c212.net/c/link/?t=0&l=en&o=3743182-1&h=1832531018&u=https%3A%2F%2Fwww.sirillp.com%2Fwp-content%2Fuploads%2F2022%2F12%2FPI-granted_decision-535683b24f3b1ae25d6145818eb97f76.pdf&a=here", "/s3/files/inline-images/Lloyd-Austin-2-600x400_0.jpg?itok=YP6bbV6z"], "authors": [], "publish_date": null}