{"result_id": "353016", "URL": "https://www.zerohedge.com/covid-19/trials-should-have-been-stopped-rate-serious-adverse-events-closely-tracks-spike-post-vax", "timestamp": "2023-04-25 18:21:16 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/trials-should-have-been-stopped-rate-serious-adverse-events-closely-tracks-spike-post-vax", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "\"The Trials Should Have Been Halted\": Rate Of 'Serious Adverse Events' Closely Tracks Spike In Post-Vax Disabilities | ZeroHedge", "cleaned_text": "Over the past 18 months, skeptics of mRNA Covid-19 vaccines and those pointing out high rates of adverse reactions have been subject to ostracism, deplatforming, and flawed 'fact checks' to shut down opinions and analysis which conflicted with official narratives.\n\nNow, the data has begun to speak for itself, thanks to people like former Blackrock portfolio manager Ed Dowd, who has devoted the last several years to deep-dive research and analysis of pandemic-related data (in fact, he's written an excellent book on the topic). Dowd, along with partners Carlos Alegria and Yuri Nunes, launched Phinance Technologies - where, aside from traditional macroeconomic analysis, they have produced comprehensive reports on pandemic-related disabilities and excess deaths using official data.\n\nTheir latest analysis reveals that the rate of Serious Adverse Events in the mRNA Covid-19 vaccine clinical trials closely tracks a spike in disabilities reported after the vaccine rollout.\n\nIn part 3 of our US disabilities analysis we observed that the rise in disability rates post 2/2021 correlates closely with the rollout of the vaccination schedule. When looking at changes in disabilities on a wider time frame (since 2008) we observe that the disability rates rose or fell from month to month but tended to be relatively stable over time. However, as shown in part 1, the change in behaviour since early 2021 is clearly an abnormal occurrence with high level of statistical significance. It happens to be highly correlated to the cumulative Covid-19 vaccine rollout, but we cannot state that the correlation is statistically meaningful as it is based on a cumulative plot with obvious autocorrelation.\n\nIn this section we provide further evidence that the most likely cause of the rise in disabilities is the Covid-19 vaccines. For that purpose, we model the expected rise in disabilities due to the vaccination rollout in the general population. We do so by using the rates of Serious Adverse Events (SAEs) obtained by the safety analysis of the mRNA vaccine (Pfizer and Moderna) clinical trials, performed in the Vaccine journal paper we reviewed here, and our analysis in part five.\n\nWe can observe that the rate of rise in disabilities is higher than the computed rate of rise in SAEs of special interest, which could be explained in several different ways, or by a combination of factors.\n• By the definition of an SAEs of special interest being more extreme than the rate of disabilities reported by the individuals surveyed by the BLS i.e. some disabilities reported by the individuals surveyed by the BLS may be caused by adverse events that are not deemed SAEs of special interest, due to the criteria used to define an SAE being overly restrictive.\n• The population of the Civilian Labor Force as a whole may be less healthy (and somehow more vulnerable to vaccine-related disabilities) than the vaccine trial populations, either due to the selection criteria for participation in the trial, or ‘self-selection’ bias.\n• Under-reporting of SAEs of special interest in the trial populations.\n• Other factors causing excess disabilities in the Civilian Labor Force in a concurrent timeframe to the vaccine rollout.\n\nAs Dowd further notes via Twitter;\n\nThe rate of estimated SAEs appears to be under-reported relative the recorded rise in disabilities (according to the BLS survey) by about 2.6 times. These results were expected as we had already shown in part 3 of our study the high correlation between the rise in the disability rate since 2/21 with the vaccine rollout. We realise that performing the correlation of cumulative time series is misleading & the R2 should not be taken as an indication of establishing a statistically significant relationship as both time series have autocorrelation.\"\n\nBottom line: There were enough safety signals to show that what we are seeing in the BLS data was known during the clinical trials even given their narrow definition of a SAE. The trials should have been halted.", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">The time series of SAEs that were computed based on the rates estimated during the mRNA clinical trials are shown to be of the same magnitude as the rate of increase in disability rates in the 16-64 Civilian Labor Force.</p>\n— Edward Dowd (@DowdEdward) <a href=\"https://twitter.com/DowdEdward/status/1627014449206013952?ref_src=twsrc%5Etfw\">February 18, 2023</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">causation.<br/>\n✅We believe that a comprehensive investigation needs to be performed, either in the form of new phase III clinical trials for at least a 3-year period, or a programme of forensic autopsies in a large sample of deceased individuals where the Covid-19 vaccines were not</p>\n— Edward Dowd (@DowdEdward) <a href=\"https://twitter.com/DowdEdward/status/1627014456705445888?ref_src=twsrc%5Etfw\">February 18, 2023</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">restrictive.<br/>\n2)The population of the Civilian Labor Force as a whole may be less healthy (and somehow more vulnerable to vaccine-related disabilities) than the vaccine trial populations, either due to the selection criteria for participation in the trial, or ‘self-selection’ bias</p>\n— Edward Dowd (@DowdEdward) <a href=\"https://twitter.com/DowdEdward/status/1627014460362866688?ref_src=twsrc%5Etfw\">February 18, 2023</a></blockquote>", "<blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">3) Under-reporting of SAEs in the trial populations<br/>\n4) Other factors causing excess disabilities in the Civilian Labor Force in a concurrent timeframe to the vaccine rollout.</p>\n— Edward Dowd (@DowdEdward) <a href=\"https://twitter.com/DowdEdward/status/1627016118677434368?ref_src=twsrc%5Etfw\">February 18, 2023</a></blockquote>"], "movies": [], "links": ["https://www.zerohedge.com/markets/worlds-most-prestigious-medical-journal-roasts-facebook-over-inaccurate-incompetent", "/s3/files/inline-images/covid%20vax_3.jpg?itok=I62CPFw2", "https://www.amazon.com/Cause-Epidemic-Sudden-Childrens-Defense-ebook/dp/B0BB8JTNJZ?ref_=ast_author_mpb", "http://www.phinancetechnologies.com/Home.asp", "http://www.phinancetechnologies.com/HumanityProjects/Projects.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part2.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part4.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part5.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part5.htm", "http://www.phinancetechnologies.com/HumanityProjects/US Disabilities - Part3.htm", "http://www.phinancetechnologies.com/HumanityProjects/US Disabilities - Part1.htm", "http://www.phinancetechnologies.com/HumanityProjects/SAE mRNA Clinical Trials.htm", "http://www.phinancetechnologies.com/HumanityProjects/US%20Disabilities%20-%20Part5.htm", "https://twitter.com/DowdEdward/status/1627014449206013952?ref_src=twsrc%5Etfw", "https://twitter.com/DowdEdward/status/1627014450908897280?s=20", "/s3/files/inline-images/FpRKTDCaIAI9oK5.png?itok=YxkenBOS", "https://twitter.com/DowdEdward/status/1627014456705445888?ref_src=twsrc%5Etfw", "https://twitter.com/DowdEdward/status/1627014460362866688?ref_src=twsrc%5Etfw", "https://twitter.com/DowdEdward/status/1627016118677434368?ref_src=twsrc%5Etfw"], "authors": [], "publish_date": null}