{"result_id": "353038", "URL": "https://www.zerohedge.com/medical/bivalent-covid-vaccines-perform-worse-against-variant-now-dominant-united-states-studies", "timestamp": "2023-04-25 18:21:30 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/medical/bivalent-covid-vaccines-perform-worse-against-variant-now-dominant-united-states-studies", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Bivalent COVID Vaccines Perform Worse Against Variant Now Dominant In United States: Studies | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nThe new COVID-19 vaccines don’t work as well against XBB.1.5, the virus variant that’s now dominant in the United States, according to multiple studies.\n\nIn one of the papers, researchers found the vaccines boosted neutralizing antibodies, believed to be a measure of protection, but that the antibody levels declined to previous levels within three months.\n\nCompared to the antibody responses to BA.5, the responses to XBB.1.5 were reduced 20-fold.\n\n“Following bivalent mRNA boosting, responses to XBB.1.5 increase but remain low and wane within 3 months back to pre-boost levels. These data suggest that once a year boosters with the current mRNA vaccines may not provide adequate protection for an entire year for those at high risk of complications of COVID-19,” Dr. Dan Barouch, director of the Center for Virology and Vaccine Research at the Beth Israel Deaconess Medical Center and a co-author of the preprint study (pdf), told The Epoch Times via email.\n\nThe Moderna and Pfizer vaccines both utilize messenger RNA, or mRNA, technology. The updated versions of the vaccines are bivalent, targeting the Wuhan variant and a sublineage of the BA.4 and BA.5 strain. The new versions were cleared as boosters in the fall of 2022 despite no clinical data being available. They are poised to replace the original vaccines.\n\nOther studies have also found that the bivalents induce a better response than the old, monovalent boosters, but that the response is reduced against XBB.1.5 or its parent, XBB, which comes from BA.2 lineages.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/bivalent-covid-vaccines-perform-worse-against-variant-now-dominant-in-united-states-studies_5040659.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/moderna-booster-870x522.jpg?itok=as-p2I4L", "https://www.biorxiv.org/content/10.1101/2023.01.22.525079v1.full.pdf", "https://www.theepochtimes.com/fda-advisers-back-covid-19-vaccine-pivot-in-move-toward-annual-shot_5013899.html", "https://www.theepochtimes.com/health/bivalent-covid-vaccines-perform-worse-against-variant-now-dominant-in-united-states-studies_5040659.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}