{"result_id": "353040", "URL": "https://www.zerohedge.com/covid-19/nfl-players-association-urged-screen-heart-issues-over-vaccine-side-effects", "timestamp": "2023-04-25 18:21:31 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/nfl-players-association-urged-screen-heart-issues-over-vaccine-side-effects", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "NFL Players' Association Urged To Screen for Heart Issues Over Vaccine Side Effects | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nThe NFL Players’ Association is being urged to offer players cardiac screening in light of the growing concern over COVID-19 vaccines causing heart inflammation.\n\nThe Health Freedom Defense Fund urged the association in a recent letter to implement screening because the vaccines can cause myocarditis, a form of heart inflammation. Young males are the most at risk.\n\nMost NFL players received a COVID-19 vaccine under pressure from teams and the league.\n\n“Safety signals illustrate that the near and long-term health outcomes of the COVID-19 vaccines remain uncertain,” Leslie Manookian, president and founder of the fund, told DeMaurice Smith, executive director of the association (NFLPA), in the missive.\n\n“A multitude of adverse reactions to these injections, including myocarditis, are wide ranging and confirmed, and as such, prudence dictates that the NFLPA investigate the extent to which the COVID-19 shots may have resulted in injury, compromised health or death of players,” Manookian said.\n\nShe pointed out that Damar Hamlin, a safety for the Buffalo Bills, suffered a cardiac arrest on the field during a Monday Night Football game in January. The reason for the incident remains unknown; Hamlin declined to convey what his doctors told him during a recent televised interview. Former NFL players have also suffered heart attacks and strokes following vaccination.\n\nThe NFLPA should introduce “a testing and screening program to determine whether players have been adversely affected by the injections and to develop a set of functional medical protocols and treatments in order to address and heal any deleterious effects of the vaccines,” Manookian said.\n\nThe NFLPA declined to comment to The Epoch Times.\n\nThe association has not responded to the letter, which was sent via email and regular mail, Manookian told The Epoch Times.\n\nFormer NFL player Ken Ruettgers, who started the Voices for Medical Freedom podcast, previously warned an associate who works for the NFLPA of post-vaccination cardiac events and offered to connect the group with doctors with knowledge of the issues.\n\nThe associate thanked Reuttgers but did not accept the offer, Reuttgers told The Epoch Times.\n\n“The challenge is, it’s almost like a fighter pilot that, ‘I don’t want to be tested because if I come up positive, I don’t want to be grounded,'” Reuttgers said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/nfl-players-association-urged-to-screen-for-heart-issues-over-vaccine-side-effects_5060341.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/nurse-vaccine-870x522.jpg?itok=hCbpJ9P9", "https://www.documentcloud.org/documents/23680465-letter-to-nflpa", "https://www.theepochtimes.com/t-myocarditis", "https://www.theepochtimes.com/buffalo-bills-give-update-on-safety-damar-hamlin-after-on-field-collapse_4958836.html", "https://www.theepochtimes.com/damar-hamlin-is-asked-about-why-his-heart-stopped-something-i-want-to-stay-away-from_5057062.html", "https://www.theepochtimes.com/nfl-players-association-urged-to-screen-for-heart-issues-over-vaccine-side-effects_5060341.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}