{"result_id": "353027", "URL": "https://www.zerohedge.com/medical/doctors-scientists-call-mississippi-officials-take-covid-vaccines-market", "timestamp": "2023-04-25 18:21:23 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/medical/doctors-scientists-call-mississippi-officials-take-covid-vaccines-market", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Doctors, Scientists Call On Mississippi Officials To Take COVID Vaccines Off The Market | ZeroHedge", "cleaned_text": "Authored by Matt McGregor via The Epoch Times (emphasis ours),\n\nJACKSON, Miss.—The group of physicians, vaccine-injured people, and whistleblowers speaking at the Mississippi Capitol building on Monday and Tuesday weren’t asking state officials to cease all COVID-19 vaccinations and to convene a grand jury to investigate its rollout in the state.\n\nThey were demanding it.\n\n“Stop the shots” was the refrain of those who had treated COVID patients over the last three years and those injured by the vaccine.\n\nOn Monday and Tuesday, the medical freedom organization MS Against Mandates (MAM) held the Mississippi Medical Freedom Conference in Jackson, Mississippi, which included over a dozen physicians, several whistleblowers, six physician-confirmed vaccine-injured patients, and two parents whose sons died after receiving the vaccines.\n\nDr. John Witcher is the co-founder and former president of MAM. He stepped back from the leadership position to focus on his run for Mississippi governor in the 2023 gubernatorial election.\n\nMAM orchestrated the event that gave a voice to many who are being silenced in media and the medical community, such as Dr. Peter McCullough, a practicing internist and cardiologist in Dallas who is also the national medical adviser for MAM.\n\nMcCullough told The Epoch Times that the purpose of the three-and-a-half-hour roundtable—chaired by Republican state Rep. Randy Boyd—was primarily to educate Mississippi officials about safety concerns regarding the vaccine.\n\n“The state must pull these products off the market,” McCullough said. “There can be no more administration of the COVID-19 vaccines in the state of Mississippi.”\n\nMcCullough, author of “The Courage to Face COVID-19: Preventing Hospitalization and Death While Battling the Bio-Pharmaceutical Complex,” said the essential problem with the vaccines is the safety concern for the large number of people who have taken them without informed consent about adverse events.\n\n“The CDC now says 92 percent of Americans have taken at least one shot and that 79 percent have taken two shots,” McCullough said. “If there are safety concerns, that’s a problem because the denominator is so big.”\n\nBecause of those large numbers, any rare side effect isn’t rare from a safety perspective and, as was heard in the testimonies, there are concerns that the state officials haven’t kept track of the full number of the injuries and has even undercounted them, McCullough said.\n\nIn Mississippi, which represents under 1 percent of the U.S. population, McCullough estimated that there are several hundred people who have been injured by the vaccines and that some have died from the vaccines.\n\n“That’s several hundred too many, and it didn’t need to happen,” McCullough said. “None of this needed to happen.”\n\nPhysicians like Witcher and others on the panel have reported that their state health officials have only recited federal talking points instead of allowing them to cultivate what McCullough called their own “community standard-of-care,” which McCullough said is intended to evolve over time.\n\n“The community standard of care always comes from the doctors who are treating the patients,” McCullough said. “Under no circumstances does it come from federal or state agencies, pharmaceutical companies, or even from hospitals or hospital systems. It comes from the doctors in the field who are learning how to treat their patients based on the medical literature, clinical judgment, and the differences in the community.”\n\nThis is why McCullough said each state needs its own doctor-in-charge, like in Florida, where Surgeon General Joseph Ladapo has refuted federal guidelines handed down by the Centers for Disease Control and Prevention (CDC) and Dr. Anthony Fauci when he was director of the National Institute of Allergy and Infectious Diseases.\n\n“We’re seeing how valuable it is for a state to have its own independent thinker who is not biased, influenced by the pharmaceutical industry, or influenced by any state or federal public health agency,” McCullough said.\n\nA doctor-in-charge in Mississippi would have acted as the representative for state officials to hear the testimonies given in the state Capitol on Monday, McCullough said.\n\n“The state of Mississippi needs an independent thinker who can attend medical panels like this, take them under consideration, and provide advising to the attorney general,” McCullough said. “In this case, it would be to get the vaccines off the market.”\n\nIf Witcher were to become governor, he said he would create a position for a state surgeon general, and McCullough said he would “entertain the appointment as a doctor and a public figure.”\n\nNoticeably, the Capitol chamber where the roundtable convened was absent of lawmakers—aside from Boyd—which McCullough said wasn’t surprising, as he’s seen it “over and over again.”\n\n“The fear among legislators on both the state and federal levels is extraordinary,” McCullough said. “This is the biggest thing that’s happened to our country over the last three years in modern history and you’d think they’d be interested to hear from doctors who traveled from far distances and who have vast experience in this. It’s not for my benefit. It’s for their benefit, and it’s extremely disappointing that they found something else that they thought was a higher priority.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/doctors-scientists-call-on-mississippi-officials-to-take-covid-vaccines-off-the-market_5087686.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/copymculloughwitcher-700x420.jpeg?itok=AWLoRgTL", "https://www.theepochtimes.com/doctors-scientists-call-on-mississippi-officials-to-take-covid-vaccines-off-the-market_5087686.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}