{"result_id": "353006", "URL": "https://www.zerohedge.com/covid-19/doctor-calls-withdrawal-pfizer-moderna-covid-19-vaccines-following-new-research", "timestamp": "2023-04-25 18:21:11 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/doctor-calls-withdrawal-pfizer-moderna-covid-19-vaccines-following-new-research", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Doctor Calls For Withdrawal Of Pfizer, Moderna COVID-19 Vaccines Following New Research | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nAn American doctor is joining the calls for the withdrawal of the messenger RNA COVID-19 vaccines, pointing to new research that highlights a connection between the shots and adverse events.\n\nDr. Joseph Fraiman, a doctor based in Louisiana who also conducts research on COVID-19 and other health issues, says it’s time to halt the administration of the Pfizer and Moderna COVID-19 vaccines until new clinical trials prove the benefits from the vaccines outweigh the harms.\n\nThe new research, including a reanalysis of the trials for the vaccines, raise concerns about whether the benefits from the vaccines outweigh the harms, according to the doctor.\n\n“I don’t see how anyone couldn’t be certain that the benefits are outweighing the harms on a population level, or even in the high-risk groups. I don’t see the evidence to support that claim,” Fraiman told The Epoch Times. “But I also can’t say that there’s evidence to support that it’s potentially more harmful, but there’s also uncertainty here. … Given that scenario, I believe that people should not be given the [vaccines] outside of a clinical trial, because we need to figure out … if their benefits outweigh harm or if harm outweighs benefits.”\n\n“The only thing that can answer that question is going to be a randomized trial,” he added.\n\nPfizer and Moderna did not respond to requests for comment.\n\nThe U.S. Food and Drug Administration (FDA), which cleared the shots and has never stopped promoting them, did not return an inquiry.\n\nFraiman led a study that reanalyzed the original Pfizer and Moderna trials. He and his colleagues concluded in a study published following peer review that the vaccinated were at higher risk of serious adverse events.\n\nThat’s one data point. Another is the identification of safety signals, or adverse events, that are potentially caused by the vaccines but require further study. The FDA revealed in December 2022 that the Pfizer vaccine was linked to blood clotting in elderly individuals. The U.S. Centers for Disease Control and Prevention (CDC), which recommends the vaccines for virtually all Americans, found hundreds of other signals in its research, according to records obtained by The Epoch Times.\n\nSeveral serious problems that can lead to death have been causally linked, or proven to be caused by the vaccines. They include myocarditis, or heart inflammation.\n\nWhile U.S. health officials have repeatedly downplayed the severity of myocarditis and a related condition, pericarditis, German researchers who dug into the deaths of 25 people who died suddenly at home after vaccination ruled out every potential cause except for vaccination for five of the people. They reported their results in a study that was published after peer review in late 2022.\n\n“Given alternative causes are unlikely to cause myocarditis within one week of vaccination, this is essentially conclusive evidence that we’re seeing sudden cardiac deaths from the vaccines,” Fraiman said.\n\nFraiman also noted that excess mortality, or deaths from all causes, have risen during the pandemic—with spikes correlating with the introduction of the vaccines. Vaccines may not have caused the additional deaths, he says, but some researchers, including British professors Norman Fenton and Martin Neil, have examined the data and found a signal that the vaccines were linked to at least some of the excess deaths. U.S. officials say some of the deaths may be from COVID-19.\n\nWhen the vaccines were first introduced, Fraiman backed giving them to the elderly and others at high risk from COVID-19, or people of all ages with serious underlying health conditions. He says he also did not recommend against vaccination for any ages, though he told younger family members he was not sure if it was a good idea to get a jab.\n\nFraiman also says the vaccines likely reduced hospitalizations in the first two quarters of 2021, recalling how he did not see a single vaccinated person in his hospital until June of that year.\n\nWhen he and the other scientists discovered the vaccinated were at higher risk of serious problems, he shifted to a stance of the harms likely outweighing the benefits among healthy people.\n\nWith the new evidence of harm, along with Omicron being less dangerous and more likely to evade vaccine immunity, Fraiman questions whether the benefits outweigh the serious harms even among the elderly and otherwise infirm.\n\n“I see the likelihood that the harm could outweigh the benefit in the group who stood to benefit the most from the vaccine,” he said.\n\nClinical trial data on the vaccines have been hard to come by, especially trials not run by the vaccine makers themselves, and the standards for the trials have been lowered over time.\n\nThe FDA authorized shots for children based on immunobridging, or trial data that found the vaccines triggered a similar antibody response in kids than that in adults. For the new bivalent boosters, created because the original vaccines have been providing much lower levels of protection against Omicron and its subvariants, no clinical data, not even antibody measurements, was provided at all. Months later, that data is still not available to the public.\n\nSome observational studies have estimated the boosters provide subpar protection against infection and solid protection, at least initially, against hospitalization. Randomized, controlled trials are typically considered superior.\n\nFraiman recommends withdrawing the vaccines and U.S. officials going to the vaccine makers and asking them to demonstrate the benefits outweigh the harms in light of the changed dynamics of the pandemic. The trials should feature investigators looking closely at each COVID-19 hospitalization to distinguish whether they were caused by COVID-19, or the COVID-19 diagnosis was incidental. That distinction is known widely as being hospitalized, or dying, with COVID-19 versus from COVID-19.\n\nThe trial would take five or six months, similar to the original ones, Fraiman says.\n\nSome countries, such as Denmark, meanwhile, have stopped offering booster shots to certain segments of the population. A growing number of experts, meanwhile, are calling for the administration of the Moderna and Pfizer shots, which are by far the most administered in the United States, to be halted.\n\nThe group includes Dr. Aseem Malhotra, a British doctor who turned against the vaccines in 2022 due to the growing evidence of side effects. Malhotra’s citations included the Moderna and Pfizer trials, which showed no reduction in mortality or severe disease, and the research led by Fraiman.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/health/doctor-calls-for-withdrawal-of-pfizer-moderna-covid-19-vaccines-following-new-research_4975379.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/pfizer-vaccine-card-870x522.jpeg?itok=DYFam0j0", "https://www.theepochtimes.com/t-pfizer", "https://www.theepochtimes.com/t-moderna", "https://www.theepochtimes.com/vaccinated-at-higher-risk-of-serious-adverse-events-reanalysis-of-original-trial-data_4707356.html", "https://www.theepochtimes.com/health/pfizers-covid-19-vaccine-linked-to-blood-clotting-fda_4930377.html", "https://www.theepochtimes.com/health/exclusive-cdc-finds-hundreds-of-safety-signals-for-pfizer-and-moderna-covid-19-vaccines_4956733.html", "https://www.theepochtimes.com/health/heart-inflammation-can-be-lethal-after-covid-19-vaccination-study_4900037.html", "https://www.theepochtimes.com/t-vaccines", "https://wherearethenumbers.substack.com/p/the-devils-advocate-an-exploratory", "https://www.cdc.gov/nchs/nvss/vsrr/covid19/excess_deaths.htm", "https://www.theepochtimes.com/trial-data-for-newly-authorized-covid-19-boosters-based-on-mice-not-humans_4704068.html", "https://www.theepochtimes.com/new-covid-19-vaccine-boosters-perform-poorly-against-symptomatic-infection-cdc-study_4879371.html", "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4314067", "https://www.theepochtimes.com/top-pro-vaccine-doctor-calls-for-global-pause-of-messenger-rna-covid-19-vaccines_4754871.html", "https://www.theepochtimes.com/health/doctor-calls-for-withdrawal-of-pfizer-moderna-covid-19-vaccines-following-new-research_4975379.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}