{"result_id": "353033", "URL": "https://www.zerohedge.com/political/switzerland-stops-recommending-covid-19-vaccination", "timestamp": "2023-04-25 18:21:26 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/switzerland-stops-recommending-covid-19-vaccination", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Switzerland Stops Recommending COVID-19 Vaccination | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nSwiss authorities have stopped recommending COVID-19 vaccination, including for people who are designated at high risk from COVID-19.\n\nSwitzerland’s Federal Office of Public Health now says that “no COVID-19 vaccination is recommended for spring/summer 2023.”\n\nPeople designated high risk are also not recommended to get a COVID-19 vaccine, authorities said.\n\nThey attributed the change to the number of citizens who have received a vaccine, recovered from COVID-19, or both received a vaccine and enjoy natural immunity from post-recovery protection.\n\n“Nearly everyone in Switzerland has been vaccinated and/or contracted and recovered from COVID-19. Their immune system has therefore been exposed to the coronavirus. In spring/summer 2023, the virus will likely circulate less. The current virus variants also cause rather mild illness,” Swiss health officials said.\n\nSeroprevalence data from mid-2022 showed that more than 98 percent of the Swiss population had antibodies against the COVID-19 virus, indicating that people had immunity from prior infection, vaccination, or both.\n\nThe Omicron variant of the COVID-19 virus, which started circulating around the world in late 2021, causes less severe cases than its predecessor, Delta. Additionally, the available COVID-19 vaccines have performed increasingly worse against Omicron and its subvariants, providing little or even negative protection against infection and quickly waning shielding against severe disease.\n\nSwiss authorities nodded to the short-lived protection as they noted that people designated at high risk from COVID-19 can still receive a vaccine, despite the lack of recommendation, after consultation with their doctor.\n\n“Vaccination may be wise in individual cases, as it improves protection against developing severe COVID-19 for several months,” they said.\n\nPeople at high risk include those aged 65 or older and pregnant women.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/switzerland-stops-recommending-covid-19-vaccination_5180835.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/id5180875-GettyImages-1237226004-870x522.jpg?itok=_I3kktpv", "https://www.bag.admin.ch/bag/en/home/krankheiten/ausbrueche-epidemien-pandemien/aktuelle-ausbrueche-epidemien/novel-cov/impfen.html", "https://www.theepochtimes.com/moderna-covid-19-vaccine-effectiveness-turns-negative-within-months-study_4785855.html", "https://www.theepochtimes.com/protection-from-new-covid-19-vaccines-drops-sharply-within-months-cdc_5080704.html", "https://www.theepochtimes.com/switzerland-stops-recommending-covid-19-vaccination_5180835.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}