{"result_id": "353044", "URL": "https://www.zerohedge.com/political/contract-confirms-us-government-received-400-million-major-covid-19-vaccine-manufacturer", "timestamp": "2023-04-25 18:21:33 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/contract-confirms-us-government-received-400-million-major-covid-19-vaccine-manufacturer", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Contract Confirms US Government Received $400 Million From Major COVID-19 Vaccine Manufacturer | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nThe U.S. government has released the licensing agreement it hammered out with vaccine manufacturer Moderna but has refused to confirm many payment details.\n\nModerna agreed to pay the U.S. National Institutes of Health (NIH) to license spike protein technology the company included in its COVID-19 vaccine, the contract confirms.\n\nModerna resisted for years acknowledging the work by government researchers on the spike protein but relented in late 2021 and announced the contract during an earnings call on Feb. 23.\n\nModerna said it provided a “catch-up payment” of $400 million to the National Institute of Allergy and Infectious Diseases (NIAID), which is part of the NIH, under the agreement.\n\nThe newly disclosed contract says that Moderna would pay the NIH a “noncreditable, nonrefundable royalty in the amount of Four Hundred Million dollars.”\n\nPortions that would confirm Moderna’s statement that the company would pay “low single digit royalties” on future sales of its COVID-19 vaccines are redacted.\n\nThe contract, running 34 pages, has key sections redacted as to future royalties.\n\nOne section, for instance, says, “The licensee agrees to pay to the NIAID earned royalties on net sales … as follows.” But the rest of the section is redacted.\n\nThe Epoch Times obtained the contract through the Freedom of Information Act.\n\nThe NIH cited for the redactions an exemption to the act that enables agencies to withhold “trade secrets and commercial or financial information obtained from a person and privileged or confidential.”\n\n“They redacted the royalties, even though there have been press releases about the royalties,” James Love, director of the nonprofit Knowledge Ecology International, told The Epoch Times via email. “It’s common but [expletive] to redact royalties on a negotiated license on a government patent.”\n\nUnredacted information in the contract confirmed that Moderna had agreed to pay the NIH royalties before the agreement took effect in late 2022: a “minimum annual royalty,” “earned royalties,” and “benchmark royalties.”\n\nThe contract was signed on Dec. 14, 2022, by Michael Mowatt, director of the Technology Transfer and Intellectual Property Office at the National Institute of Allergy and Infectious Diseases, and Shannon Klinger, chief legal officer at Moderna.\n\nThe payments would include a royalty within 60 days after government officials provided a “reasonable detailed written statement and request” for an amount “equivalent to a pro rata share of the unreimbursed patent expenses previously paid by the NIAID.”\n\nModerna has made nearly $37 billion from its COVID-19 vaccines during the pandemic. It has forecast $5 billion in revenue from the vaccines in 2023. Moderna and Pfizer both received enormous government contracts for their vaccines, which helped in development and manufacturing.\n\nThe NIH shares ownership of the spike protein technology that Moderna utilized with researchers at Scripps Research Institute and Dartmouth University’s Geisel School of Medicine. Both are named as partners in the contract.\n\nWhile it’s unclear from the contract what specific revenue the partners will receive from Moderna, Dartmouth said previously it would make money through the agreement.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/contract-confirms-us-government-received-400-million-from-major-covid-19-vaccine-manufacturer_5144915.html", "/s3/files/inline-images/moderna-vaccine-vial-700x420.jpg?itok=KQIlbMsO", "https://www.theepochtimes.com/health/nih-says-moderna-wrongly-left-off-government-scientists-from-covid-19-vaccine-patent_4099478.html", "https://www.theepochtimes.com/us-government-received-400-million-in-covid-19-vaccine-royalty-payments-moderna_5078600.html", "https://www.theepochtimes.com/contract-confirms-us-government-received-400-million-from-major-covid-19-vaccine-manufacturer_5144915.html"], "authors": [], "publish_date": null}