{"result_id": "353022", "URL": "https://www.zerohedge.com/covid-19/cdc-set-add-covid-19-vaccines-childhood-immunization-schedule", "timestamp": "2023-04-25 18:21:20 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/cdc-set-add-covid-19-vaccines-childhood-immunization-schedule", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "CDC Votes To Add COVID-19 Vaccines To Childhood Immunization Schedule | ZeroHedge", "cleaned_text": "Update: As expected, the CDC's Advisory Committee on Immunization Practices voted 15-0 on Thursday to add Covid-19 shots to the children's recommended vaccine schedule.\n\nSpeaking earlier in the morning, Dr. Patricia Wodi said that the Covid-19 vaccine has been placed as a recommendation from 6 months of age and older.\n\nDuring a question period, one member of the committee raised questions over the vaccine being included on the schedule when it’s been recommended for use under an Emergency Use Authorizations, to which Wodi said they spoke with the Office of General Counsel, who said that it would be okay to add.\n\nThe vote comes after the committee approved 15-0 to add the vaccination to the federally funded Vaccine for Kids program, which provides vaccines to children at no or low cost to families.\n\nA Centers for Disease Control and Prevention (CDC) advisory committee is set to vote on Thursday over whether to add the Covid-19 vaccine to the recommended schedule of vaccines for children.\n\nAnd while left-wing fact checkers were quick to point out that this doesn't automatically mean schools will require students to take the jab - a decision made at the local level - even ABC News admits; \"If the CDC does update its list of suggested vaccinations to include the COVID vaccine, which is available to anyone 6 months or older, that will open the door for states to begin making those calls, too.\"\n\nThe CDC also pushed back, stating that it's Thursday meting is an annual gathering to simply update which vaccines doctors should recommend to their patients - with no acknowledgement that most doctors are going to follow it.\n\n\"Thursday, CDC's independent advisory committee (ACIP) will vote on an updated childhood immunization schedule. States establish vaccine requirements for school children, not [the Advisory Committee on Immunization Practices] or CDC,\" the agency wrote in response to a segment by Fox News' Tucker Carlson, who reported that the updated childhood vaccine schedule would soon mean that kids \"will not be able to attend school without taking the COVID shot.\"\n\n\"State laws establish vaccination requirements for school children. These laws often apply not only to children attending public schools but also to those attending private schools and day care facilities,\" the CDC writes on its website, adding \"All states provide medical exemptions, and some state laws also offer exemptions for religious and/or philosophical reasons.\"\n\nOn Wednesday, a CDC advisory committee separately decided to add the COVID vaccine to the Vaccines for Children program, which provides government-funded jabs to children who aren't insured or can't afford to pay.\n\n\"Equitable access to COVID-19 vaccines for all ages and populations remains critically important,\" said the CDCs Dr. Sara Oliver at the meeting, ABC News reports. \"This includes now, while the vaccines are being supplied by the federal government, and in the future, when we one day move to a commercial program.\"\n\nPaul had more to say on the topic:\n\nAnd as Summit News notes, Paul responded recent revelations from Boston University, which recently made headlines for genetically engineering a strain of Covid with an 80% mortality rate in mice.\n\nOthers noted that there's little to no data on how the Omicron strain of Covid-19 affects children.\n\nSo - while adding the Covid-19 vaccine to the list of recommended childhood immunizations does not automatically mean kids will be forced to get it if they want to attend school - it's nothing more than a game of semantics when it's clear that most schools will follow the guidance.\n\nAs Alex Berenson writes in The Burning Platform;\n\nIf I were a Republican candidate in a blue state, I would have ads about school Covid vaccine mandates ready to go today, assuming the the CDC vaccine committee is foolish enough to throw this chum in the water. At a time when countries all over the world are now rejecting mRNA shots for kids, can our public health “experts” really be this stupid? Or this beholden to the mRNA companies?\n\nExperience suggests the answer is yes.", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">The CDC complained about our segment on the Covid vaccine being required for kids to attend school. We stand by what we said. Here's our response. <a href=\"https://t.co/R5DqVkzef4\">https://t.co/R5DqVkzef4</a> <a href=\"https://t.co/y2srvIgAHf\">pic.twitter.com/y2srvIgAHf</a></p>\n— Tucker Carlson (@TuckerCarlson) <a href=\"https://twitter.com/TuckerCarlson/status/1582895910295855104?ref_src=twsrc%5Etfw\">October 20, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">CDC Votes 15-0 to Add COVID-19 Vax to \"Vaccines for Children (VFC)\" Program<br/>\nSource: <a href=\"https://t.co/vPG7a5vS2r\">https://t.co/vPG7a5vS2r</a> <a href=\"https://t.co/fF3pqSsFUL\">pic.twitter.com/fF3pqSsFUL</a></p>\n— Wittgenstein (@backtolife_2023) <a href=\"https://twitter.com/backtolife_2023/status/1582830081994809344?ref_src=twsrc%5Etfw\">October 19, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">This is the same committee that approved booster vaccines for children despite no evidence that COVID boosters reduce transmission, hospitalization, or death among children. Appalling! <a href=\"https://t.co/KWVEM6wI7f\">https://t.co/KWVEM6wI7f</a></p>\n— Rand Paul (@RandPaul) <a href=\"https://twitter.com/RandPaul/status/1582864380005228545?ref_src=twsrc%5Etfw\">October 19, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">With even Big Pharma tempering their enthusiasm for mandating COVID vaccines on young people, will Fauci-enthusiasts at CDC still vote to mandate COVID vaxx on kids? <a href=\"https://t.co/dwdkAinebT\">https://t.co/dwdkAinebT</a></p>\n— Rand Paul (@RandPaul) <a href=\"https://twitter.com/RandPaul/status/1582745505494634498?ref_src=twsrc%5Etfw\">October 19, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">more deception…And they wonder why no one trusts Fauci and his cronies 🤔 <a href=\"https://t.co/Tz6fh0bh38\">https://t.co/Tz6fh0bh38</a></p>\n— Rand Paul (@RandPaul) <a href=\"https://twitter.com/RandPaul/status/1582824839362260992?ref_src=twsrc%5Etfw\">October 19, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">I’d love to see the data on the Omicron vaccine in children but the Biden admin will not release it. Dr. Jha claims he’s (privately) seen it and it’s good. Why can’t it be made public? <a href=\"https://t.co/ocEyPGtXUj\">https://t.co/ocEyPGtXUj</a></p>\n— Marty Makary MD, MPH (@MartyMakary) <a href=\"https://twitter.com/MartyMakary/status/1582340763564011520?ref_src=twsrc%5Etfw\">October 18, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">These are the pediatric cases of vax myocarditis CDC will acknowledge. They know it’s 10x more likely to occur in males than females, and they claim their advice is based on risk-benefit, yet their recommendations do not account for this greatly increased risk in males vs females <a href=\"https://t.co/6ZlGJWf1bV\">pic.twitter.com/6ZlGJWf1bV</a></p>\n— Thomas Massie (@RepThomasMassie) <a href=\"https://twitter.com/RepThomasMassie/status/1583080100366385153?ref_src=twsrc%5Etfw\">October 20, 2022</a></blockquote>"], "movies": [], "links": ["/s3/files/inline-images/vaccine1_1.jpg?itok=mBg03jRP", "https://thepostmillennial.com/breaking-cdc-votes-to-add-covid-19-vaccines-to-childrens-immunization-schedule", "https://thepostmillennial.com/cdc-votes-to-add-covid-19-vaccine-to-vaccines-for-kids-program", "/s3/files/inline-images/hild%20vaccin_0.jpg?itok=EtKOsdRa", "https://www.washingtonpost.com/health/2022/10/19/covid-vaccines-children-cdc-disinformation/", "https://twitter.com/TuckerCarlson/status/1582534550651080706?s=20&t=giA7PPIX2coaOvrzCmoOBA", "https://t.co/R5DqVkzef4", "https://t.co/y2srvIgAHf", "https://twitter.com/TuckerCarlson/status/1582895910295855104?ref_src=twsrc%5Etfw", "https://t.co/vPG7a5vS2r", "https://t.co/fF3pqSsFUL", "https://twitter.com/backtolife_2023/status/1582830081994809344?ref_src=twsrc%5Etfw", "https://abcnews.go.com/Politics/cdc-corrects-conservative-claim-mandate-covid-vaccines-schools/story?id=91743794", "https://t.co/KWVEM6wI7f", "https://twitter.com/RandPaul/status/1582864380005228545?ref_src=twsrc%5Etfw", "https://t.co/dwdkAinebT", "https://twitter.com/RandPaul/status/1582745505494634498?ref_src=twsrc%5Etfw", "https://summit.news/2022/10/20/rand-paul-appalling-that-cdc-has-approved-covid-vaccines-for-kids/", "https://www.zerohedge.com/covid-19/boston-university-engineers-sars-cov-2-chimera-80-mortality-rate-mice", "https://t.co/Tz6fh0bh38", "https://twitter.com/RandPaul/status/1582824839362260992?ref_src=twsrc%5Etfw", "https://t.co/ocEyPGtXUj", "https://twitter.com/MartyMakary/status/1582340763564011520?ref_src=twsrc%5Etfw", "https://t.co/6ZlGJWf1bV", "https://twitter.com/RepThomasMassie/status/1583080100366385153?ref_src=twsrc%5Etfw", "https://www.theburningplatform.com/2022/10/20/on-the-simmering-fury-in-the-blue-states/"], "authors": [], "publish_date": null}