{"result_id": "353013", "URL": "https://www.zerohedge.com/geopolitical/omission-childrens-covid-19-vaccine-deaths-australia-raises-concerns", "timestamp": "2023-04-25 18:21:15 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/geopolitical/omission-childrens-covid-19-vaccine-deaths-australia-raises-concerns", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Omission Of Children's COVID-19 Vaccine Deaths In Australia Raises Concerns | ZeroHedge", "cleaned_text": "Authored by Victoria Kelly-Clark via The Epoch Times (emphasis ours),\n\nAn Australian senator has said he is concerned about the country’s therapeutic authorities’ delayed approach to updating Australia’s Database of Adverse Event Notifications (DAEN) after it was revealed the government body had neglected to include a number of deaths attributed to the vaccine, including that of two children aged 7 and 9.\n\nThis comes after a Freedom of Information request by an Australian doctor revealed the Australian pharmaceutical and drug administrator, the Therapeutic Goods Administration (TGA), had not updated its DAEN with the deaths.\n\nAustralian Liberal Party senator, Gerard Rennick, told The Epoch Times that he was deeply concerned about the TGA’s failure to update DAEN and is calling for there to be some independent oversight on the TGA, given the conflict of interest.\n\n“A third independent medical party should examine the evidence as the TGA has a conflict of interest because they approved the vaccines and would therefore be held responsible for the deaths of these children due to poor regulatory oversight,” Rennick said.\n\nThe senator noted that he was highly concerned that the TGA had soft-pedalled the risks involved with the COVID-19 vaccines, especially those around myocarditis and cardiac arrests.\n\n“They are definitely downplaying the risks. They do not have enough information to rule it out given the known link between the vaccines and myocarditis and myocarditis and cardiac arrests,” Rennick said.\n\nAs of March 6, the DAEN states that since the beginning of the vaccination rollout in Australia, 137,576 adverse events have been reported relating to the range of COVID-19 vaccines. Of those, 134,224 are believed to be directly related to the vaccines, while 980 are vaccine-related deaths.\n\nThe TGA does have a pre-existing independent review vehicle for vaccines called the Vaccine Safety Investigation Group (VSIG).\n\nThe group is meant to provide independent specialist immunisation (and other relevant) expertise to assist the TGA in investigating and managing Adverse Event Following Immunisation (AEFI) that require the services of national-level experts.\n\nThe group is described as a time-limited working group that can be convened when a single serious AEFI that is unexpected and without an obvious non-vaccine cause occurs. The TGA notes that an AEFI is considered unexpected when it is not listed in the product information document for the vaccine or is listed, but causality has not been established.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/omission-of-childrens-covid-19-vaccine-deaths-in-australia-raises-concerns_5071821.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/nurse-prepares-vaccines-700x420.jpg?itok=tF6OhwwA", "/s3/files/inline-images/20221121001732985680-original-min-600x400.jpg?itok=GHDbcpBk", "https://daen.tga.gov.au/medicines-search/", "https://www.theepochtimes.com/omission-of-childrens-covid-19-vaccine-deaths-in-australia-raises-concerns_5071821.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}