{"result_id": "353036", "URL": "https://www.zerohedge.com/covid-19/cdc-found-covid-19-vaccine-safety-signals-months-earlier-previously-known-files-show", "timestamp": "2023-04-25 18:21:28 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/cdc-found-covid-19-vaccine-safety-signals-months-earlier-previously-known-files-show", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "CDC Found COVID-19 Vaccine Safety Signals Months Earlier Than Previously Known, Files Show | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nThe top U.S. public health agency identified hundreds of safety signals for the Pfizer and Moderna COVID-19 vaccines months earlier than previously known, according to files obtained by The Epoch Times.\n\nThe U.S. Centers for Disease Control and Prevention (CDC) found more than 700 signals that the vaccines could cause adverse events—including acute heart failure and death—in May 2022, the files show.\n\nThe CDC detected many of the same signals in July 2022, The Epoch Times previously reported. The new files show that the first time the CDC calculated a proportional reporting ratio (PRR) on vaccine injury reports, signals were identified.\n\nThe analysis went over reports lodged between Dec. 14, 2020, and May 6, 2022.\n\nThe CDC initially claimed that it didn’t run the PRR, a data mining method, on the injury reports made to the Vaccine Adverse Event Reporting System. The CDC later claimed that it started the method in February 2021, shortly after the vaccines were rolled out. Both of those claims were false, the CDC ultimately said, adding that it didn’t start until March 2022.\n\nWhen the first analyses were done that month, CDC employees identified more than 200 signals for Pfizer’s shot and 93 signals for Moderna’s vaccine, the files show. Those analyses compare the events lodged after receiving one vaccine with events lodged after receiving another, or several others.\n\nThe Epoch Times obtained the files through Freedom of Information Act requests.\n\nThe strongest analysis involves comparing the reports lodged after vaccination with the Pfizer and Moderna COVID-19 vaccines with the reports lodged after vaccination with all non-COVID-19 vaccines. The analysis is contained in files labeled “Table 5.”\n\nAccording to the files provided by the CDC, the agency didn’t start that analysis until May 2022.\n\n“The program staff advises that ‘Table 5 was only created from May 6, 2022, to July 31, 2022,'” a CDC Freedom of Information Act processer told The Epoch Times via email.\n\nThe CDC didn’t respond to a request for more information.\n\n“Federal health agencies have ignored the flashing alarms of their own safety surveillance systems since early 2021. They have ignored my oversight letters and lied about what analyses they have performed. It is well past time for the American public to be told the truth,” Sen. Ron Johnson (R-Wis.), the top Republican on the Permanent Subcommittee on Investigations, told The Epoch Times via email.\n\nThe CDC and the U.S. Food and Drug Administration (FDA) co-manage the Vaccine Adverse Event Reporting System, which accepts reports from anybody but is primarily used by health care workers. Reports to the system are analyzed and verified by health officials and contractors.\n\nIn operating procedure documents, the agencies said that officials would monitor the system to identify “potential new safety concerns for COVID-19 vaccines.” The FDA would perform one type of analysis, called Empirical Bayesian data mining, while the CDC would perform PRR data mining.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/exclusive-cdc-found-covid-19-vaccine-safety-signals-months-earlier-than-previously-known-files-show_5151506.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/HEALTH-CORONAVIRUS-CDC-BOOSTERS-600x400_0.jpg?itok=4E67JM86", "https://www.theepochtimes.com/health/exclusive-cdc-finds-hundreds-of-safety-signals-for-pfizer-and-moderna-covid-19-vaccines_4956733.html", "https://www.theepochtimes.com/exclusive-cdc-says-it-performed-vaccine-safety-data-mining-after-saying-it-didnt_4617563.html", "https://www.theepochtimes.com/exclusive-cdc-says-it-performed-vaccine-safety-data-mining-after-saying-it-didnt_4617563.html", "https://www.theepochtimes.com/exclusive-cdc-admits-it-gave-false-information-about-covid-19-vaccine-surveillance_4657836.html", "https://www.documentcloud.org/documents/22119655-cdc-vaers-sop-2021", "https://www.documentcloud.org/documents/22278999-vaers-sop-2022", "https://www.theepochtimes.com/exclusive-cdc-found-covid-19-vaccine-safety-signals-months-earlier-than-previously-known-files-show_5151506.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}