{"result_id": "353034", "URL": "https://www.zerohedge.com/covid-19/why-there-covid-vaccine-mandate-students", "timestamp": "2023-04-25 18:21:27 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/why-there-covid-vaccine-mandate-students", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Why Is There A COVID Vaccine Mandate For Students? | ZeroHedge", "cleaned_text": "Authored by Margaret Anna Alice via 'Through The Looking Glass' Substack,\n\nLetter to the Stanford Daily: Why Is There a COVID Vaccine Mandate for Students?\n\nI can’t figure out why Stanford is mandating the COVID vaccine for students.\n• None Is it to protect students from the virus, hospitalization, or death?\n• None Is it to protect them from other students?\n• None Is it to protect the Stanford community members from the students?\n\nIf it’s to protect the students from catching COVID, that doesn’t make sense because the CDC says it “no longer differentiate[s] based on a person’s vaccination status because breakthrough infections occur.”\n\nThe CDC also acknowledges natural immunity, noting that “persons who have had COVID-19 but are not vaccinated have some degree of protection against severe illness from their previous infection.”\n\nIt appears Stanford didn’t get the memo because Maxwell Meyer—a double-jabbed, COVID-recovered alum who was nearly prohibited from graduating for choosing not to get boosted—was informed by an administrator that the booster mandate is “not predicated on history of infection or physical location.”\n\nDespite living 2,000 miles away from campus and not being enrolled in coursework for his final term, Maxwell was told Stanford was “uniformly enforc[ing]” the mandate “regardless of student location.” Does that sound like a rational policy?\n\nFortunately, a different administrator intervened and granted Maxwell an exemption, but few Stanford students are so lucky. Almost everyone else simply follows the rules without realizing they’ve volunteered for vaccine roulette.\n\nA Cleveland Clinic study of the bivalent vaccines involving 51,011 participants found the risk of getting COVID-19 increased “with the number of vaccine doses previously received”—much to the authors’ surprise.\n\nThey were stumped as to why “those who chose not to follow the CDC’s recommendations on remaining updated with COVID-19 vaccination” had a lower risk of catching COVID than “those who received a larger number of prior vaccine doses.”\n\nSo if the vaccines don’t keep you from getting COVID, maybe they at least protect you from hospitalization?\n\nThat doesn’t wash, either, because according to data from the Coronavirus Disease 2019 (COVID-19)-Associated Hospitalization Surveillance Network (COVID-NET), hospitalization rates for 18–64-year-olds have increased 11 percent since the vaccine rollout. Worse, kids under 18 have suffered a shocking 74 percent spike in hospitalizations.\n\nA new paper published in Science titled Class Switch Towards Non-Inflammatory, Spike-Specific IgG4 Antibodies after Repeated SARS-CoV-2 mRNA Vaccination even has Eric Topol concerned:\n\nIf you don’t know what that means, Dr. Syed Haider spells it out in this tweet. He explains that the shots “train your immune system to ignore the allergen by repeated exposure,” the end result being that “Your immune system is shifted to see the virus as a harmless allergen” and the “virus runs amok.”\n\nViral immunologist and computational virologist Dr. Jessica Rose breaks down the serious implications—including cancer, fatal fibrosis, and organ destruction—of these findings.\n\nWell, then does the vaccine at least prevent people from dying of COVID?\n\nNope. According to the Washington Post, “Vaccinated people now make up a majority of COVID deaths.”\n\nAt Senator Ron Johnson’s December 7, 2022, roundtable discussion on COVID-19 Vaccines, former number-one–ranked Wall Street insurance analyst Josh Stirling reported that, according to UK government data:\n\nObtained by a Freedom of Information Act (FOIA) request to KBV (the association representing physicians who receive insurance in Germany), “the most important dataset of the pandemic” shows fatalities starting to spike in 2021.\n\nData analyst Tom Lausen assessed the ICD-10 disease codes in this dataset, and the findings are startling. His presentation includes the following chart documenting fatalities per quarter from 2016 to 2022:\n\nThis parallels the skyrocketing fatality rates seen in VAERS:\n\nThe vaccinated are more likely to contract, become hospitalized from, and die of COVID. If the vaccine fails on all of those counts, does it at least prevent its transmission to other students and community members?\n\nThe obvious answer is no since we already know it doesn’t prevent you from getting COVID, but this CDC study drives the point home, showing that during a COVID outbreak in Barnstable County, Massachusetts, “three quarters (346; 74%) of cases occurred in fully vaccinated persons.”\n\nMaybe Stanford can tell us why they feel the mandate is necessary. Their booster requirement reads:\n\nThe claim that “booster shots enhance immunity” links to a January 2022 New York Times article. It seems Stanford has failed to keep up with the science because the very source they cite as authoritative is now reporting, “The newer variants, called BQ.1 and BQ.1.1, are spreading quickly, and boosters seem to do little to prevent infections with these viruses.”\n\nSpeaking of not keeping up, that same article says the new bivalent boosters target “the original version of the coronavirus and the Omicron variants circulating earlier this year, BA.4 and BA.5.”\n\nIt then goes on to quote Head of Beth Israel Deaconess’s Center for Virology & Vaccine Research Dan Barouch, who says, “It’s not likely that any of the vaccines or boosters, no matter how many you get, will provide substantial and sustained protection against acquisition of infection.”\n\nIn other words, Stanford’s rationale for requiring the boosters is obsolete according to the authority they cite in their justification.\n\nIf Stanford is genuinely concerned about “reduc[ing] the possibility of widespread disruptions that could impact the student experience,” then it should not only stop mandating the vaccine but advise against it.\n\nSome nations have suspended or recommended against COVID shots for younger populations due to the considerable risks of adverse events such as pulmonary embolism and myocarditis—from Denmark (under 50) to Norway (under 45) to Australia (under 50) to the United Kingdom (seasonal boosters for under 50).\n\nThe Danish Health Authority explains why people under 50 are “not to be re-vaccinated”:\n\nHere’s what a Norwegian physician and health official had to say:\n\nA new Nordic cohort study of 8.9 million participants supports these concerns, finding a nearly nine-fold increase in myocarditis among males aged 12–39 within 28 days of receiving the Moderna COVID-19 booster over those who stopped after two doses.\n\nThis mirrors my own findings that myocarditis rates are up 10 times among the vaccinated according to a public healthcare worker survey.\n\nCoauthored by MIT professor and risk management expert Retsef Levi, the Nature article Increased Emergency Cardiovascular Events Among Under-40 Population in Israel During Vaccine Rollout and Third COVID-19 Wave reveals a 25 percent increase in cardiac emergency calls for 16–39-year-olds from January to May 2021 as compared with the previous two years.\n\nThe paper cites a study by Israel’s Ministry of Health that “assesses the risk of myocarditis after receiving the 2nd vaccine dose to be between 1 in 3000 to 1 in 6000 in men of age 16–24 and 1 in 120,000 in men under 30.”\n\nA Thai study published in Tropical Medicine and Infectious Disease found cardiovascular manifestations in 29.24 percent of the adolescent cohort—including myopericarditis and tachycardia.\n\nEven Dr. Leana Wen, formerly an aggressive promoter of the COVID vaccine, admitted in a recent Washington Post op-ed:\n\nAll over the world, prominent physicians, scientists, politicians, and professors are asking pointed questions about illogical mandates; the safety and efficacy of the vaccines; and the dangers posed by the mRNA technology, spike protein, and lipid nanoparticles—including in the UK, Japan, Australia, Europe, and the US.\n\nFormerly pro-vaxx cardiologists such as Dr. Aseem Malhotra, Dr. Dean Patterson, and Dr. Ross Walker are all saying the COVID vaccines should be immediately stopped due to the significant increase in cardiac diseases, adverse events, and excess mortality observed since their rollout, noting that, “until proven otherwise, these vaccines are not safe.”\n\nPresident of the International Society for Vascular Surgery Serif Sultan and Consultant Surgeon Ahmad Malik are also demanding that we #StopTheShotsNow.\n\nAnd now, perhaps most notably, Dr. John Campbell has performed a 180-degree turn on his previous position and is saying it is time to pause the mass vaccination program “due to the risks associated with the vaccines”:\n\nA Rasmussen poll published on December 7, 2022, found 7 percent of vaccinated respondents have suffered major side effects—a percentage that echoes the 7.7 percent of V-Safe users who sought medical care as well as my own polling data.\n\nAdd the 34 percent who reported experiencing minor side effects, and you have nearly 72 million adults who’ve been hit with side effects from the vaccine.\n\nAccording to British Medical Journal Senior Editor Dr. Peter Doshi, Pfizer’s and Moderna’s own trial data found 1 in 800 vaccinated people experienced serious adverse events:\n\nAnd this is the same Pfizer data the FDA tried to keep hidden from the public for 75 years.\n\nNothing to see here … except 1,223 deaths, 158,000 adverse events, and 1,291 side effects reported in the first 90 days according to the 5.3.6 Cumulative Analysis of Post-Authorization Adverse Event Reports—and those numbers are likely underreported by a factor of at least 10 (my conservative calculations show an underreporting factor (URF) of 41 for VAERS).\n\nStanford is asking students to risk a 1 in 800 chance of serious adverse events—meaning the kind of events that can land you in the hospital, disable you, and kill you. And for what?\n\nAnyone who knows how to perform a cost-benefit analysis can see this is all cost and zero benefit.\n\nStanford’s own Dr. John Ioannidis—professor of medicine, epidemiology & population health, statistics, and biomedical data science—demonstrated that college students are at a near-zero risk of dying from COVID-19 in his “Age-Stratified Infection Fatality Rate of COVID-19 in the Non-Elderly Population.”\n\nOne of the six most-cited scientists in the world, Ioannidis found the median IFR was 0.0003 percent for those under 20 and 0.002 percent for twenty-somethings, concluding the fatalities “are lower than pre-pandemic years when only the younger age strata are considered” and that “the IFR in non-elderly individuals was much lower than previously thought.”\n\nAnd yet Ioannidis’s employer is mandating an experimental product with extensively documented risks of severe harm.\n\nWhat if a Stanford student dies and the coroner determines it was caused by the vaccine? That happened with George Watts Jr., a 24-year-old college student whose cause of death Chief Deputy Coroner Timothy Cahill Jr. attributed to “COVID-19 vaccine-related myocarditis.” Cahill says, “The vaccine caused the heart to go into failure.”\n\nNotorious for mandating a booster not yet tested on humans (just like Stanford), Ontario’s Western University dropped its mandate on November 29, 2022, stating:\n\nThat was the same day this article reported that 21-year-old Western University student and TikTok influencer Megha Thakur “suddenly and unexpectedly passed away” on November 24.\n\nThe timing is interesting, don’t you think? I’m sure it’s just a coincidence—even though this Clinical Research in Cardiology paper determined vaccine-induced myocardial inflammation was the cause of death in “five persons who have died unexpectedly within seven days following anti-SARS-CoV-2-vaccination.” In that analysis, the authors “establish the histological phenotype of lethal vaccination-associated myocarditis.”\n\nCoincidences notwithstanding, Stanford may want to revoke the mandate before anything like that happens to one of its students … if it hasn’t already.\n\nAnd if that’s not incentive enough, Stanford should consider the legal ramifications of mandating an experimental product. As this JAMA article warns:\n\nDr. Naomi Wolf delivered an impassioned speech to her alma mater, Yale, in which she called their booster mandate “a serious crime. It is deeply illegal. Certainly, it violates Title IX.” She explains:\n\nOther universities are currently facing lawsuits for mandating the COVID vaccine in violation of state laws, including one against Ohio University, University of Cincinnati, Bowling Green State University, and Miami University of Ohio.\n\nBy the same token, this evidence shows the vaccines are ASSOCIATED with:\n\nWhy is Stanford mandating these unsafe and ineffective products, again?\n\nIf logic, peer-reviewed studies, and legal concerns such as the violation of Title IX don’t convince Stanford to rescind the mandate, then what about its stated ethical commitment to upholding its Code of Conduct?\n\nBMJ’s Journal of Medical Ethics recently published COVID-19 Vaccine Boosters for Young Adults: A Risk Benefit Assessment and Ethical Analysis of Mandate Policies at Universities. In this paper, eminent researchers from Harvard, Oxford, Johns Hopkins, and UC San Francisco (among other institutions) present five reasons university mandates are unethical.\n\nThey argue that the vaccines:\n\nThis builds on a previously published BMJ Global Health article by some of the same authors titled, “The Unintended Consequences of COVID-19 Vaccine Policy: Why Mandates, Passports, and Restrictions May Cause More Harm Than Good.”\n\nIn this paper, the authors contend that COVID-19 vaccine mandates “have unintended harmful consequences and may not be ethical, scientifically justified, and effective” and “may prove to be both counterproductive and damaging to public health.”\n\nOver the course of history, countless products once thought to be safe—from DDT to cigarettes to thalidomide for pregnant women to Vioxx—were eventually discovered to be dangerous and even lethal. Responsible governments, agencies, and companies pull those products from the market when the scientific data proves harm—and institutions that care about their community members certainly don’t mandate those products when evidence of risk becomes obvious, as is the case now for the experimental COVID vaccines.\n\nThe truth is clear to anyone who’s willing to look.\n\nWill Stanford stop following the propaganda and start following the science—the real science and not the politicized science?\n\nWill it stand up for the lives and health of its students—or will it wait until tragedy strikes another George Watts Jr. or Megha Thakur?\n\nThis is a historic opportunity for Stanford to prove its allegiance to people, scientific data, and critical thought over pharmaceutical donors, political pressures, and conformist thinking.\n\nThe stakes could not be higher.\n\nFor 16.4 cents/day (annual) or 19.7 cents/day (monthly), you can help Margaret fight tyranny while enjoying access to premium content like Memes by Themes, “rolling” interviews, podcasts, Behind the Scenes, and other bonus content:", "opengraph": {}, "tags": [], "tweets": ["<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">Late after mRNA Covid vaccines, or with booster or breakthrough infections, there is a shift to IgG4 antibodies, not seen with adenovirus vector vaccines. The clinical significance is not known<a href=\"https://t.co/5thLxRwemm\">https://t.co/5thLxRwemm</a> <a href=\"https://twitter.com/SciImmunology?ref_src=twsrc%5Etfw\">@SciImmunology</a> <a href=\"https://twitter.com/UniFAU?ref_src=twsrc%5Etfw\">@UniFAU</a> <a href=\"https://t.co/YozSLVjVLd\">pic.twitter.com/YozSLVjVLd</a></p>\n— Eric Topol (@EricTopol) <a href=\"https://twitter.com/EricTopol/status/1606005665448595456?ref_src=twsrc%5Etfw\">December 22, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">Latest IgG4 COVID vax study<br/><br/>\nThink allergy shots. They train your immune system to ignore the allergen by repeated exposure.<br/><br/>\nThat’s what repeated shots with the vax are doing.<br/><br/>\nYour immune system is shifted to see the virus as a harmless allergen.<br/><br/>\nWhich means: virus runs amok.</p>\n— Dr. Syed Haider (@DrSyedHaider) <a href=\"https://twitter.com/DrSyedHaider/status/1607952054818840581?ref_src=twsrc%5Etfw\">December 28, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">Dear Prime Minister <a href=\"https://twitter.com/RishiSunak?ref_src=twsrc%5Etfw\">@RishiSunak</a>,<br/><br/>\nYOU have the power to stop the ongoing unnecessary harm that is devastating individuals and families. <a href=\"https://twitter.com/Keir_Starmer?ref_src=twsrc%5Etfw\">@Keir_Starmer</a> the Labour Party also lost one of its most decorated doctors <a href=\"https://twitter.com/KailashChandOBE?ref_src=twsrc%5Etfw\">@KailashChandOBE</a> to this mRNA product. Please stop this roll out NOW <a href=\"https://t.co/SECbfK9joz\">https://t.co/SECbfK9joz</a></p>\n— Dr Aseem Malhotra (@DrAseemMalhotra) <a href=\"https://twitter.com/DrAseemMalhotra/status/1604408625698676736?ref_src=twsrc%5Etfw\">December 18, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"qme\" xml:lang=\"qme\"><a href=\"https://twitter.com/DrAseemMalhotra?ref_src=twsrc%5Etfw\">@DrAseemMalhotra</a> <a href=\"https://twitter.com/DrJBhattacharya?ref_src=twsrc%5Etfw\">@DrJBhattacharya</a> <a href=\"https://twitter.com/JohnBoweActor?ref_src=twsrc%5Etfw\">@JohnBoweActor</a> <a href=\"https://twitter.com/PierreKory?ref_src=twsrc%5Etfw\">@PierreKory</a> <a href=\"https://t.co/lw7jdtzNl4\">pic.twitter.com/lw7jdtzNl4</a></p>\n— Dr Dean Patterson 🇾🇪 (@mottomeneki) <a href=\"https://twitter.com/mottomeneki/status/1601675590561837056?ref_src=twsrc%5Etfw\">December 10, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">BREAKING:<br/><br/>\nPresident of the international vascular society raises concerns about covid vaccines in relation to cardiovascular problems.<br/><br/>\n‘It would be great if someone can show us the light of where to go from here’<br/><br/>\nWe must pause the mRNA jab now to stop more unnecessary harm <a href=\"https://t.co/gIZr19SVl8\">pic.twitter.com/gIZr19SVl8</a></p>\n— Dr Aseem Malhotra (@DrAseemMalhotra) <a href=\"https://twitter.com/DrAseemMalhotra/status/1603757880221499394?ref_src=twsrc%5Etfw\">December 16, 2022</a></blockquote>", "<blockquote class=\"twitter-tweet\" data-conversation=\"none\"><p dir=\"ltr\" lang=\"en\" xml:lang=\"en\">Dr Peter Doshi senior editor of the BMJ wants to know why we haven't already <a href=\"https://twitter.com/hashtag/StoptheShots?src=hash&amp;ref_src=twsrc%5Etfw\">#StoptheShots</a> when 1 in 800 are seriously harmed, yet previous vaccines were suspended for harming 'only' 1 in 100'000.<br/>\nBeats me too! <a href=\"https://t.co/llT4JwL5WQ\">pic.twitter.com/llT4JwL5WQ</a></p>\n— Porridge2022 (@porridge2022) <a href=\"https://twitter.com/porridge2022/status/1603790238958116866?ref_src=twsrc%5Etfw\">December 16, 2022</a></blockquote>"], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "728", "height": "410", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"410\" src=\"https://www.youtube.com/embed/ljrMPvk4mjo\" title=\"12 MILLION PEOPLE! - Vaxxed Americans Report Major Side Effects, and Question Efficacy\" width=\"728\"/>", "src": "https://www.youtube.com/embed/ljrMPvk4mjo"}], "links": ["https://margaretannaalice.substack.com/p/letter-to-the-stanford-daily", "/s3/files/inline-images/2023-02-01_07-49-16.jpg?itok=naF4M5Rd", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7133e1.htm?s_cid=mm7133e1_w", "https://brownstone.org/articles/research-studies-affirm-naturally-acquired-immunity/", "https://maxmeyer.substack.com/p/how-i-almost-didnt-graduate-from", "https://pubmed.ncbi.nlm.nih.gov/34315610/", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full.pdf", "/s3/files/inline-images/2023-02-01_07-52-07.jpg?itok=rgIe6uR7", "https://gis.cdc.gov/grasp/covidnet/covid19_5.html", "https://metatron.substack.com/p/impact-of-covid-vaccination-on-covid", "https://www.researchgate.net/publication/365252268_Bivalent_BNT162b2mRNA_originalOmicron_BA4-5_booster_vaccination_adverse_reactions_and_inability_to_work_compared_to_the_monovalent_COVID-19_booster", "https://www.science.org/doi/10.1126/sciimmunol.ade2798", "https://twitter.com/EricTopol/status/1606005665448595456", "https://t.co/5thLxRwemm", "https://twitter.com/SciImmunology?ref_src=twsrc%5Etfw", "https://twitter.com/UniFAU?ref_src=twsrc%5Etfw", "https://t.co/YozSLVjVLd", "https://twitter.com/EricTopol/status/1606005665448595456?ref_src=twsrc%5Etfw", "https://substack.com/profile/58048459-dr-syed-haider", "https://twitter.com/DrSyedHaider/status/1607952054818840581", "https://twitter.com/DrSyedHaider/status/1607952054818840581?ref_src=twsrc%5Etfw", "https://substack.com/profile/40349025-jessica-rose", "https://jessicar.substack.com/p/the-immunological-mechanism-of-action", "https://jessicar.substack.com/p/igg4-and-cancer-a-mechanism-of-action", "https://jessicar.substack.com/p/igg4-related-disease-igg4rd-means", "https://web.archive.org/web/20221123173512/https://www.washingtonpost.com/politics/2022/11/23/vaccinated-people-now-make-up-majority-covid-deaths/", "/s3/files/inline-images/2023-02-01_07-55-30.jpg?itok=0r55wwvs", "https://rumble.com/v1ze4d0-covid-19-vaccines-what-they-are-how-they-work-and-possible-causes-of-injuri.html", "https://vigilantfox.substack.com/p/top-insurance-analyst-high-vax-regions", "https://rumble.com/v1ztkd4-eminent-insurance-analyst-vaxxed-have-49-higher-mortality-rate-for-those-un.html", "https://amidwesterndoctor.substack.com/p/the-most-important-dataset-of-the", "https://youtu.be/5L4dM44UP4s", "https://verifieddata.substack.com/p/analysis-of-the-recently-published", "/s3/files/inline-images/2023-02-01_07-56-29.jpg?itok=XUbS1ZWS", "https://openvaers.com/covid-data/mortality", "/s3/files/inline-images/2023-02-01_07-57-03.jpg?itok=pk3meQsX", "https://www.cdc.gov/mmwr/volumes/70/wr/pdfs/mm7031e2-H.pdf", "https://studentaffairs.stanford.edu/covid-guidance/covid-19-testing-vaccination-and-health-check-requirements/booster-shot-information", "https://www.nytimes.com/2022/01/21/health/covid-boosters-cdc-omicron.html", "https://www.nytimes.com/2022/01/21/health/covid-boosters-cdc-omicron.html", "https://www.nytimes.com/2022/01/21/health/covid-boosters-cdc-omicron.html", "https://www.nytimes.com/2022/11/18/health/covid-boosters-surge.html?smid=nytcore-ios-share&referringSource=articleShare", "https://openvaers.com/covid-data", "https://stevekirsch.substack.com/p/fda-acknowledges-that-pulmonary-embolism", "https://sensiblemed.substack.com/p/how-myocarditis-influences-vaccine", "https://www.cnbc.com/2022/04/28/denmark-the-first-country-to-halt-its-covid-vaccination-program.html", "https://www.helsenorge.no/en/coronavirus/covid19-vaccination/", "https://www.health.gov.au/our-work/covid-19-vaccines/who-can-get-vaccinated", "https://www.nhs.uk/conditions/coronavirus-covid-19/coronavirus-vaccination/how-to-get-a-coronavirus-vaccine/how-to-get-a-booster-dose/", "https://www.sst.dk/en/English/Corona-eng/Vaccination-against-covid-19", "https://www.tv2.no/nyheter/ut-mot-regjeringens-beslutning-meningslos-hensikt/15282767/", "https://www.medrxiv.org/content/10.1101/2022.12.16.22283603v1", "https://stevekirsch.substack.com/p/my-public-healthcare-worker-survey", "https://www.nature.com/articles/s41598-022-10928-z?ref=tjournal.ru", "https://www.mdpi.com/2414-6366/7/8/196", "https://www.youtube.com/watch?v=_7ChXpwHdOY", "https://archive.vn/GNusQ", "https://archive.vn/GNusQ", "https://archive.vn/GNusQ", "https://etana.substack.com/p/its-about-dam-time", "https://richardrosenthal.substack.com/p/uc-professors-decry-dangerous-booster", "https://nocollegemandates.substack.com/p/questioning-the-logic-of-covid-vaccine", "https://nocollegemandates.substack.com/p/mathematics-professor-paul-bourdon", "https://rumble.com/v1lwbgs-safe-and-effective-a-second-opinion-2022-oracle-films-news-uncut.html", "https://amidwesterndoctor.substack.com/p/critical-thinking-in-the-age-of-censorship", "https://stevekirsch.substack.com/p/british-mp-calls-for-immediate-halt", "https://vigilantfox.substack.com/p/japanese-professor-goes-nuclear-on", "https://dailysceptic.org/2022/12/20/top-australian-doctor-reveals-she-is-vaccine-injured-and-says-doctors-are-being-censored/", "https://www.youtube.com/watch?v=C93HlZ5WVuc", "https://efactssc-public.flcourts.org/casedocuments/2022/1710/2022-1710_disposition_157361_d04i.pdf", "https://twitter.com/DrAseemMalhotra/status/1574986541302104065", "https://twitter.com/mottomeneki/status/1601675590561837056", "https://www.theepochtimes.com/mkt_app/health/australian-cardiologist-calls-to-halt-mrna-covid-19-vaccines-citing-heart-damage_4924166.html", "https://ravarora.substack.com/p/why-are-cardiac-injuries-rising-in", "https://react19.org/1250-covid-vaccine-reports/", "https://www.amazon.com/Cause-Epidemic-Sudden-Childrens-Defense-ebook/dp/B0BB8JTNJZ/", "https://twitter.com/mottomeneki/status/1601675590561837056", "https://twitter.com/RishiSunak?ref_src=twsrc%5Etfw", "https://twitter.com/Keir_Starmer?ref_src=twsrc%5Etfw", "https://twitter.com/KailashChandOBE?ref_src=twsrc%5Etfw", "https://t.co/SECbfK9joz", "https://twitter.com/DrAseemMalhotra/status/1604408625698676736?ref_src=twsrc%5Etfw", "https://twitter.com/DrAseemMalhotra?ref_src=twsrc%5Etfw", "https://twitter.com/DrJBhattacharya?ref_src=twsrc%5Etfw", "https://twitter.com/JohnBoweActor?ref_src=twsrc%5Etfw", "https://twitter.com/PierreKory?ref_src=twsrc%5Etfw", "https://t.co/lw7jdtzNl4", "https://twitter.com/mottomeneki/status/1601675590561837056?ref_src=twsrc%5Etfw", "https://twitter.com/DrAseemMalhotra/status/1603757880221499394", "https://twitter.com/MrAhmadKMalik/status/1603294362586136576", "https://nakedemperor.substack.com/p/more-doctors-speak-out-and-call-for", "https://t.co/gIZr19SVl8", "https://twitter.com/DrAseemMalhotra/status/1603757880221499394?ref_src=twsrc%5Etfw", "https://www.youtube.com/channel/UCF9IOB2TExg3QIBupFtBDxg", "https://stevekirsch.substack.com/p/an-important-message-from-john-campbell", "https://twitter.com/Johnincarlisle/status/1608238557646278658", "https://rumble.com/v22ugd2-time-to-pause-covid-mass-vaccination.html", "https://stevekirsch.substack.com/p/rasmussen-poll-shows-the-covid-vaccines", "https://www.rasmussenreports.com/public_content/lifestyle/covid_19/concerns_about_covid_19_vaccines_remain_high", "https://ko-fi.com/margaretannaalice", "https://aaronsiri.substack.com/p/v-safe-part-3-who-were-the-10-million", "https://stevekirsch.substack.com/p/our-latest-polls-show-twice-as-many", "https://www.youtube.com/watch?v=ljrMPvk4mjo", "https://twitter.com/porridge2022/status/1603790238958116866", "https://www.bmj.com/about-bmj/editorial-staff/peter-doshi", "https://twitter.com/hashtag/StoptheShots?src=hash&ref_src=twsrc%5Etfw", "https://t.co/llT4JwL5WQ", "https://twitter.com/porridge2022/status/1603790238958116866?ref_src=twsrc%5Etfw", "https://aaronsiri.substack.com/p/the-fda-wants-to-hide-pre-licensure", "https://childrenshealthdefense.org/wp-content/uploads/pfizer-doc-5.3.6-postmarketing-experience.pdf#page=30", "https://childrenshealthdefense.org/wp-content/uploads/pfizer-doc-5.3.6-postmarketing-experience.pdf", "https://stevekirsch.substack.com/p/adverse-events-in-pfizer-trial-may", "https://stevekirsch.substack.com/p/latest-vaers-estimate-388000-americans", "https://openvaers.com/covid-data/hospitalizations", "https://openvaers.com/covid-data/disabled", "https://openvaers.com/covid-data/mortality", "https://standforhealthfreedom.com/storage/2023/01/Risk-Benefit-Final.pdf", "https://profiles.stanford.edu/john-ioannidis", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9613797/", "https://stevekirsch.substack.com/p/the-safe-and-effective-narrative", "https://thejewishvoice.com/2022/02/autopsy-confirms-ny-state-college-student-died-from-covid-19-vaccine-related-myocarditis/", "https://www.wsj.com/articles/latest-covid-boosters-are-set-to-roll-out-before-human-testing-is-completed-11661679003", "https://igorchudov.substack.com/p/western-university-drops-all-vaccine", "https://www.uwo.ca/coronavirus/updates/nov29-2022.html", "https://westerngazette.ca/news/western-mourns-passing-of-campus-tiktok-star/article_8052754a-6fff-11ed-99c2-8ff3e69d582d.html", "https://www.instagram.com/p/Clh-rv3OyYo/?utm_source=ig_embed&ig_rid=14af7fd2-32b0-47cb-be5f-89e680b2e585", "/s3/files/inline-images/2023-02-01_08-00-28.jpg?itok=1n3BnSxz", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://link.springer.com/article/10.1007/s00392-022-02129-5", "https://brownstone.org/articles/new-autopsy-report-reveals-those-who-died-suddenly-were-likely-killed-by-the-covid-vaccine/", "https://jamanetwork.com/journals/jama/fullarticle/2774712", "https://jamanetwork.com/journals/jama/fullarticle/2774712", "https://jamanetwork.com/journals/jama/fullarticle/2774712", "https://substack.com/profile/28216063-dr-naomi-wolf", "https://vigilantfox.substack.com/p/youre-violating-them-dr-naomi-wolf", "https://rumble.com/v1z1lz6-dr.-naomi-wolf-confronts-yale-for-crimes-against-students.html", "https://dailyclout.io/dr-naomi-wolf-pfizer-docs-miscarriages-and-the-war-on-life/", "https://www.campusreform.org/article?id=20730", "https://stevekirsch.substack.com/s/favorites/archive?sort=new", "https://oec.stanford.edu/", "https://oec.stanford.edu/code-conduct", "https://jme.bmj.com/content/early/2022/12/05/jme-2022-108449", "https://gh.bmj.com/content/bmjgh/7/5/e008684.full.pdf", "https://margaretannaalice.substack.com/p/letter-to-us-legislators-defundthethoughtpolice", "https://www.scientificamerican.com/article/consequences-of-ddt-exposure-could-last-generations/", "https://www.saturdayeveningpost.com/2019/09/when-smoking-was-just-what-the-doctor-ordered/", "https://thalidomide.ca/en/what-is-thalidomide/", "https://www.ucsusa.org/resources/merck-manipulated-science-about-drug-vioxx", "https://stevekirsch.substack.com/p/the-evidence", "https://stevekirsch.substack.com/p/what-the-data-tells-us", "https://amidwesterndoctor.substack.com/p/the-real-story-on-hot-covid-19-lots", "https://margaretannaalice.substack.com/p/letter-to-the-california-legislature", "https://margaretannaalice.substack.com/p/letter-to-the-california-legislature", "https://margaretannaalice.substack.com/p/letter-to-the-california-legislature", "https://margaretannaalice.substack.com/p/memes-by-themes-1-covid-tyranny", "https://margaretannaalice.substack.com/p/dissident-dialogues-meredith-miller", "https://margaretannaalice.substack.com/?sort=search&search=(podcast)", "https://margaretannaalice.substack.com/archive?sort=search&search=%22behind%20the%20scenes%3A%22", "https://margaretannaalice.substack.com/p/dialogue-with-a-curious-injectee-928"], "authors": [], "publish_date": null}