{"result_id": "353019", "URL": "https://www.zerohedge.com/political/senator-accuses-faa-ignoring-potential-vaccine-dangers-pilots", "timestamp": "2023-04-25 18:21:19 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/senator-accuses-faa-ignoring-potential-vaccine-dangers-pilots", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Senator Accuses FAA Of Ignoring Potential Vaccine Dangers To Pilots | ZeroHedge", "cleaned_text": "Authored by Janice Hisle via The Epoch Times (emphasis ours),\n\nU.S. Sen. Ron Johnson (R-Wis.) is expressing dismay over how the Federal Aviation Administration (FAA) responded to his questions about the agency’s handling of pilot health issues.\n\n“How can the FAA maintain safe skies when it turns a blind eye toward pilots experiencing COVID-19 vaccine injuries?” Johnson said in an email sent exclusively to The Epoch Times on Feb. 21. “Is it willful ignorance that the FAA is aware of only four active pilots experiencing adverse events connected to the COVID-19 vaccine? The American people are not getting the full transparency and honesty from federal agencies that they deserve.”\n\nJohnson made those remarks in response to how Susan Northrup, the FAA’s federal air surgeon, answered eight questions surrounding pilot health.\n\nIn his Jan. 27 letter to the FAA, Johnson provided specific information about five named pilots with suspected COVID-19 vaccine ill effects; one of the pilots died 17 days after being vaccinated.\n\nNumerous other accounts of pilots with suspected vaccine injuries are included in the Vaccine Adverse Event Reporting System, as The Epoch Times reported previously.\n\nJohnson wanted to know what steps the FAA has taken or planned to take to investigate whether the five named pilots and others had suffered adverse effects after COVID-19 shots.\n\nNorthrup wrote that her agency isn’t in charge of that.\n\n“The Centers for Disease Control and Prevention (CDC) is the responsible agency for tracking and follow up of suspected vaccine adverse events,” she wrote.\n\nNorthrup noted that pilots experiencing any medical issues are required to “ground themselves,” seek medical help and report any “significant medical events.”\n\n“FAA is responsible for determining whether that event will have an adverse safety effect,” Northrup wrote.\n\nShe also said the agency was “aware of only four potentially vaccine-related adverse events in active pilots.”\n\nAmong those four, “only one has provided medical documentation through the normal process,” Northrup wrote. She gave no further information on what that process involves.\n\nJohnson noted that, on Dec. 12, 2020, the day after the U.S. Food and Drug Administration authorized COVID-19 vaccines for “emergency use” among the general public, the FAA declared pilots were permitted to take the shots, too.\n\nThat action surprised many in aviation because pilots are forbidden from taking other emergency-use-authorized drugs.\n\nTo justify the drugs’ use in pilots, Northrup listed nine websites about the general safety of the various brands of vaccines. Aviation experts have questioned whether any studies were done on pilots specifically. There were no such studies immediately apparent among the list Northrup provided.\n\nAsked whether the FAA evaluated whether any changes should be made to guidance on COVID-19 vaccines for pilots, Northrup responded that the agency has “continued to monitor the data and determined no change in policy was indicated.”", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/exclusive-senator-accuses-faa-of-ignoring-potential-vaccine-dangers-to-pilots_5073387.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/GettyImages-1231062598-700x420.jpg?itok=4aeyEFqF", "https://www.documentcloud.org/documents/23589048-2023-01-27-rhj-to-faa-re-covid-19-vaccine-adverse-events?responsive=1&title=1", "https://www.theepochtimes.com/pilots-need-more-cardiac-tests-aviation-advocates-say-citing-concerns-over-covid-19-shots_5013818.html", "https://www.theepochtimes.com/exclusive-senator-accuses-faa-of-ignoring-potential-vaccine-dangers-to-pilots_5073387.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}