{"result_id": "353005", "URL": "https://www.zerohedge.com/political/pentagon-drops-covid-19-vaccine-mandate-troops", "timestamp": "2023-04-25 18:21:10 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/pentagon-drops-covid-19-vaccine-mandate-troops", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Pentagon Drops COVID-19 Vaccine Mandate For Troops | ZeroHedge", "cleaned_text": "The Pentagon announced on Tuesday that the Covid-19 vaccine will no longer be required for troops, according to a new memo signed by Defense Secretary Lloyd \"Raytheon\" Austin.\n\nThe memo - widely anticipated wince new legislation signed into law on Dec. 23 required him to rescind the mandate within 30 days - does give commanders discretion over how unvaccinated troops are deployed, whatever that means.\n\nLeading up to the decision, the Defense Department had already ceased all punitive actions against personnel who refused the shot.\n\n\"The Department will continue to promote and encourage COVID-19 vaccination for all service members,\" reads Austin's memo. \"Vaccination enhances operational readiness and protects the force.\"\n\nThe 30-day requirement to rescind the mandate was instituted under an $858 billion defense spending bill signed into law in December by President Joe Biden, who had opposed the GOP-backed provision, and agreed with Austin who at the time said that lifting the mandate wasn't in the best interests of the military.\n\nUltimately, Biden caved in order to win passage of the legislation.\n\nMore than 8,400 troops were forced out of the military for refusing the jab.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["/s3/files/inline-images/vax%20troop1_0.jpg?itok=NlWbCsqt", "/s3/files/inline-images/gettyimages-102370433_slide-4b7de1f4a08ff94e07bac6e1d7301a7a167aacc1-s1100-c50.jpg?itok=BKSfMmHc"], "authors": [], "publish_date": null}