{"result_id": "353030", "URL": "https://www.zerohedge.com/political/ny-supreme-court-strikes-down-covid-vaccine-mandate-health-care-workers", "timestamp": "2023-04-25 18:21:25 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/ny-supreme-court-strikes-down-covid-vaccine-mandate-health-care-workers", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "NY Supreme Court Strikes Down COVID Vaccine Mandate For Health Care Workers | ZeroHedge", "cleaned_text": "Authored by Tom Ozimek via The Epoch Times,\n\nA state Supreme Court judge in Syracuse, New York, struck down a statewide mandate for medical staff to be vaccinated against COVID-19, ruling that Gov. Kathy Hochul and the state’s health department overstepped their authority.\n\nIn a landmark ruling issued on Jan. 13, state Supreme Court Judge Gerard Neri declared the statewide COVID-19 vaccine mandate for medical staff “null, void, and of no effect.”\n\nHochul and the state Department of Health exceeded their authority by sidestepping the state legislature in imposing a permanent COVID-19 vaccine mandate for medical professionals, the judge wrote in the order (pdf).\n\nNeri also found that the mandate was “arbitrary and capricious,” citing evidence that COVID-19 vaccines don’t prevent the spread of the virus, undercutting the basis for the mandate.\n\nIn support of the view that the mandate was capricious, Neri also pointed to the fact that the order, titled Prevention of COVID-19 Transmission by Covered Entities (pdf), used a loose definition for “fully vaccinated,” namely one that was “determined by the Department.”\n\nNeri wrote, “A term which is defined at the whim of an entity, subject to change without a moment’s notice contains all the hallmarks of ‘absurdity’ and is no definition at all.”\n\nThe ruling came after a lawsuit was filed by Medical Professionals for Informed Consent, a group of medical professionals who were negatively affected by the vaccine mandate and either lost their jobs or faced the prospect of job loss.\n\n“This is a huge win for New York healthcare workers, who have been deprived of their livelihoods for more than a year,” the plaintiffs’ lead attorney, Sujata Gibson, said in a statement. “This is also a huge win for all New Yorkers, who are facing dangerous and unprecedented healthcare worker shortages throughout New York State.”\n\nIn siding with the group, Neri stated that the state is prohibited from mandating vaccinations outside of what’s detailed in public health law.\n\nMary Holland, president of Children’s Health Defense, which financed the lawsuit on behalf of Medical Professionals for Informed Consent and several individual health care workers, hailed the decision.\n\nNeither Hochul’s office nor the New York State Department of Health immediately responded to a request for comment and information on whether they plan to appeal.\n\nVaccinations helped reduce transmission of the early variants of the virus, according to the Centers for Disease Control and Prevention. However, recent studies show that the vaccines are less effective in reducing transmission of later variants although they continue to reduce serious illness, hospitalizations, and death.\n\nSome experts, meanwhile, have called for the messenger RNA shots made by Pfizer and Moderna to be withdrawn until new clinical trials can be run showing that they’re safe and effective.\n\nDr. Joseph Fraiman, based in Louisiana, became one of the latest to call for a pause in the administration of the vaccines pending new trials. He pointed to data including a reanalysis of the original trials that he and others conducted. They concluded that the vaccinated were at higher risk of severe adverse events.\n\nThe fact that the Omicron variant and its subvariants are also less virulent—leading to fewer hospitalizations and deaths—and the waning effectiveness of the vaccines also contributes to the building opposition to vaccinating all or portions of the population until better data is made available.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/syracuse-judge-rules-ny-states-vaccine-mandate-for-health-care-workers-unlawful-strikes-it-down_4985520.html", "https://www.theepochtimes.com/t-nyc", "/s3/files/inline-images/GettyImages-1346229010-700x420.jpg?itok=Fs9SfynA", "https://www.theepochtimes.com/t-covid-19-vaccine-mandate", "https://childrenshealthdefense.org/wp-content/uploads/2023-1-13-doc-86-decision-and-order.pdf", "https://regs.health.ny.gov/sites/default/files/pdf/emergency_regulations/Prevention%20of%20COVID-19%20Transmission%20by%20Covered%20Entities.pdf", "https://www.cdc.gov/coronavirus/2019-ncov/science/science-briefs/fully-vaccinated-people.html", "https://www.bmj.com/content/376/bmj.o298", "https://www.theepochtimes.com/health/doctor-calls-for-withdrawal-of-pfizer-moderna-covid-19-vaccines-following-new-research_4975379.html?utm_medium=left_sticky&utm_source=mr_recommendation", "https://www.theepochtimes.com/vaccinated-at-higher-risk-of-serious-adverse-events-reanalysis-of-original-trial-data_4707356.html?utm_medium=left_sticky&utm_source=mr_recommendation"], "authors": [], "publish_date": null}