{"result_id": "353041", "URL": "https://www.zerohedge.com/political/judge-rejects-request-moderna-moving-key-covid-19-vaccine-case-discovery", "timestamp": "2023-04-25 18:21:31 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/judge-rejects-request-moderna-moving-key-covid-19-vaccine-case-discovery", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Judge Rejects Request From Moderna, Moving Key COVID-19 Vaccine Case To Discovery | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nA key COVID-19 vaccine case is moving to the discovery phase after a U.S. judge rejected a bid by Moderna to dismiss some of the patent infringement claims against it.\n\nModerna and the U.S. government, which backed the company, failed to prove that claims involving the company’s COVID-19 vaccine contract with the government should be dismissed, U.S. District Judge Mitchell Goldberg ruled on March 10.\n\nGoldberg in late 2022 rejected a similar effort but Moderna revived its bid after the government filed a statement asserting it, not the company, should face the claims relating to the contract.\n\nThe parties, though, have failed to prove that the government’s interpretation “trumps a court’s analysis of this issue,” Goldberg said.\n\nModerna and the government had argued that under 28 U.S.C. 1498, the claims should be dismissed and moved to the Court of Federal Claims. That would mean the government was inserted as the defendant, replacing Moderna, and leave the government responsible for paying any damages awarded.\n\nThe law in question states that any infringement claims relating to inventions being used “by or for the government” and with “the authorization and consent of the government” must be handled in the Court of Federal Claims.\n\nThe 2020 vaccine contract between Moderna and the U.S. Army stated that it was “for the United States government … and the U.S. population.”\n\nWhile Moderna and the government said that evidence supported the contract being “by or for the government,” Arbutus Biopharma and Genevant Sciences said the dispute “can only be resolved on a fully developed record” and urged the court to allow discovery.\n\n“I will consider the [Section] 1498(a) issue after both parties have engaged in discovery, which will provide Plaintiff an opportunity to review the entire unredacted version of the ’-0100 Contract and discover facts regarding that Contract,” he said.\n\nNew Developments Highlight Need for Discovery\n\nNew developments in the case highlight the need for discovery, the judge said.\n\nThe original contract, or the ’-0100 Contract, was for the government, both Moderna and U.S. officials say. But the parties have also acknowledged that a second contract, reached in 2022 and known as the ’-0017 contract, doesn’t fall under the law because it lacks certain language.\n\nThe position on the second contract wasn’t known when the judge ruled in 2022 on the motion to dismiss.\n\n“Had I granted the relief Moderna sought in its original motion to dismiss, this fact would not have come to light and the relief ordered could have been incorrect,” the judge said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/judge-rejects-request-from-moderna-moving-key-covid-19-vaccine-case-to-discovery_5119082.html?ea_med=list&tmp=1&ea_src=frontpage_b2_newsforyou?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/moderna-vials-2-1200x784-700x420.jpg?itok=n72Tkixg", "https://www.documentcloud.org/documents/23706145-moderna-covid-19-opinion", "https://www.theepochtimes.com/us-says-government-not-moderna-should-face-covid-19-vaccine-lawsuit_5063469.html", "https://www.theepochtimes.com/judge-rejects-request-from-moderna-moving-key-covid-19-vaccine-case-to-discovery_5119082.html?ea_med=list&tmp=1&ea_src=frontpage_b2_newsforyou?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}