{"result_id": "353035", "URL": "https://www.zerohedge.com/covid-19/novavax-covid-19-vaccine-associated-heart-inflammation-study", "timestamp": "2023-04-25 18:21:28 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/novavax-covid-19-vaccine-associated-heart-inflammation-study", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Novavax COVID-19 Vaccine Associated With Heart Inflammation: Study | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nA higher than expected number of heart inflammation cases have occurred in people who received Novavax’s COVID-19 vaccine, researchers reported in a new study.\n\nSixty-one cases of myocarditis, pericarditis, or both following a Novavax vaccination were reported in the World Health Organization’s vaccine safety database through Aug. 23, 2022, Spanish researchers found.\n\nUsing pre-pandemic rates of heart inflammation in the population, the researchers calculated that the number of post-vaccination cases was higher than expected.\n\nReporting odds ratio values of higher than one indicate a higher-than-expected rate. For myocarditis following Novavax vaccination, the ratio was 5.2. For pericarditis, it was 24.75. For myopericarditis, or both conditions at once, it was 14.4.\n\nHeart inflammation is a known side effect of the Pfizer and Moderna COVID-19 vaccines, which utilize messenger RNA (mRNA) technology, but little data has been collected on the condition following Novavax vaccination, which does not contain mRNA.\n\nThe U.S. Food and Drug Administration, when it authorized Novavax’s shot during the summer of 2022, noted in fact sheets that clinical trials indicate there are increased risks of myocarditis and pericarditis after receipt of the Novavax vaccine. In the trial data submitted to the regulator, five cases of one or both conditions were reported in the vaccinated and zero were reported in placebo recipients. U.S. authorities have since cleared a Novavax booster, and recently reached a deal to obtain up to 1.5 million additional doses on top of the original tranche.\n\nThe European Medicines Agency initially did not warn about inflammation after Novavax vaccination but later added a warning to its product information.\n\nMost cases of myocarditis, pericarditis, or myopericarditis after Novavax vaccination in the real world—50—have been reported in Australia, according to the new study. Two have been reported in the United States and nine have been reported in Europe. Most have been among those aged 18 to 44.\n\nWhile the exact mechanism for induction of myocarditis has yet to be confirmed, the study’s authors pointed out that all of the Pfizer, Moderna, and Novavax vaccines use nanoparticles to deliver a spike protein into the body.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/novavax-covid-19-vaccine-associated-with-heart-inflammation-study_5062933.html", "/s3/files/inline-images/germany-vaccines-870x522.jpg?itok=AjHBPAGP", "https://www.theepochtimes.com/fda-grants-emergency-authorization-to-novavax-covid-19-vaccine_4596548.html", "https://www.theepochtimes.com/fda-cdc-give-emergency-approval-to-novavax-covid-19-vaccine-as-first-booster-shot_4807564.html", "https://www.theepochtimes.com/novavax-to-sell-us-government-1-5-million-more-doses-of-covid-19-vaccine_5053875.html", "https://www.theepochtimes.com/novavax-covid-19-vaccine-associated-with-heart-inflammation-study_5062933.html"], "authors": [], "publish_date": null}