{"result_id": "353015", "URL": "https://www.zerohedge.com/covid-19/hypocrisy-unlimited-hollywoods-secret-counterfeit-vaccine-network", "timestamp": "2023-04-25 18:21:16 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/hypocrisy-unlimited-hollywoods-secret-counterfeit-vaccine-network", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Hypocrisy Unlimited: Hollywood’s Secret Counterfeit Vaccine Network | ZeroHedge", "cleaned_text": "Authored by Roger L. Simon via The Epoch Times (emphasis ours),\n\nLast week, I had a remarkable phone call with a man or a woman—I am equivocating to protect the identity, though I assure you he or she was one or the other, not in the least transgendered—from my former home in the Los Angeles area, regarding Hollywood and COVID-19 or, as it is known hereabouts, the CCP virus.\n\nIronically, this was exactly one week before the deadline for Oscar voting. Although no longer working in the industry, I have been a member of the Academy of Motion Picture Arts and Sciences since the mid-’80s, but never have I received so many emails, texts, and phone calls reminding me to vote.\n\nThis tells me that other members may be as bored with the process as I am. Who wants to vote in the event, let alone watch it?\n\nBesides being reactionary in its obsession with race and sexual identity, “Woke” Hollywood just isn’t fun (or entertaining) anymore.\n\nEven less fun for all of us was COVID-19, but for Hollywood, it was especially inconvenient because of the stringent California laws that the studios took to with alacrity. You had no career without mRNA certification. You were supposed to be vaccinated just to get on the studio lot.\n\nThe phone call I mentioned above was with a person who works in the entertainment industry and said he or she obtained—through connections—vaccination record cards for use by major Hollywood celebrities and others.\n\nThese aren’t counterfeits, but actual cards purloined from a hospital pharmacy where the vaccines were sold and included batch numbers but without names attached. In essence, they were contraband.\n\nThe person claims to have been inspired to do something for people in the face of forced vaccination after news emerged the virus might have been the result of a lab leak in Wuhan, China, and that the government had been lying about the pandemic in general.\n\nMy interlocutor says he or she began selling the cards in early April 2021. Between then and early October of that year, calls were apparently coming in every day for contraband cards.\n\nThe individual estimates that he or she sold at least 250 of the cards during that period. When asked whether he or she was afraid of the Justice Department and IRS because of this, the answer was affirmative.\n\nThe celebrities for whom this person made these counterfeits were almost uniformly liberals or progressives, at least publicly. In other words, if you asked them, they supported mandates, masks, and so forth, sometimes adamantly. Behind the scenes was another matter.\n\nThe stories this person told me were amusing, nauseating, and, in some sense, edifying all at once. We have long known that Hollywood types are some of the most hypocritical people on the planet—living large while endlessly lecturing the little folk on climate and the rest—but this may take the proverbial cake.\n\nMany of the clients of this person, I was told, were well aware of details of the growing concerns about potential side effects of the vaccines—particularly in the reproductive area. Not surprisingly then, the person estimated 90 percent of the clients were female.\n\nThe general state of these people was described as fear and paranoia, reminiscent of the 1980 Lichtenstein-like cartoon in the LA Weekly that showed an anguished female studio executive intoning, “NUCLEAR WAR? There goes my career!”\n\nIt didn’t always go well.\n\nOne of my informant’s clients—a well-known entertainer whose name I was assured I would know—was allegedly upset that a favorite local sports team was demanding proof of vaccination for entry, even at the VIP entrance.\n\nSo this person apparently panicked when offered a card by my interlocutor. It was said there would be ushers at all entrances with iPads, checking the cards against the California state database.\n\nMy informant replied the database was hodgepodge—apparently, 30 percent of vaccinations were never recorded—and that the celeb should just insist the card was valid, loudly, if necessary, and all would be well. The entertainer apparently replied that was fine for the man and woman on the street, but if the celeb made a fuss, it would be on TMZ before morning, a career-ender like the 1980s cartoon.\n\nThe celeb ended up giving the VIP tickets, sans card, to the entertainer’s manager, only to find out later that no one was at the door checking anything.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/hypocrisy-unlimited-hollywoods-secret-counterfeit-vaccine-network_5081938.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/Hollywood-1-1200x798-700x420.jpg?itok=YFQ0WN4h", "https://art-for-a-change.com/Vallen/vallen_there_goes_my_career.htm", "https://www.theepochtimes.com/hypocrisy-unlimited-hollywoods-secret-counterfeit-vaccine-network_5081938.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}