{"result_id": "353039", "URL": "https://www.zerohedge.com/covid-19/florida-surgeon-general-warns-life-threatening-vaers-reports-4400-percent-covid-19-vaccine", "timestamp": "2023-04-25 18:21:30 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/covid-19/florida-surgeon-general-warns-life-threatening-vaers-reports-4400-percent-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Florida Surgeon General Warns Life-Threatening VAERS Reports Up 4,400 Percent Since COVID-19 Vaccine Rollout | ZeroHedge", "cleaned_text": "Authored by Chris Nelson via The Epoch Times (emphasis ours),\n\nFlorida Surgeon General Joseph Ladapo is sounding the alarm about a 4,400 percent increase in life-threatening conditions reported in the state to the Vaccine Adverse Event Reporting System (VAERS) since the 2021 rollout of the COVID-19 vaccines.\n\nIn a letter dated Feb. 15, Ladapo asks the Centers for Disease Control and Prevention (CDC) and the U.S. Food and Drug Administration (FDA) to “promote transparency in health care professionals to accurately communicate the risks these vaccines pose.”\n\nVAERS, co-managed by the FDA and CDC, documents reports of injuries and conditions related to vaccines.\n\n“In Florida alone, we saw a 1,700 percent increase in reports after the release of the COVID-19 vaccine, compared to an increase of 400 percent in vaccine administration for the same period,” Ladapo’s letter reads. “The reporting of life-threatening conditions increased 4,400 percent. ”\n\n“Even the H1N1 vaccine did not trigger this type of response,” reads the letter.\n\nIn 2009, during the H1N1 vaccination campaign, 1358 reports were made to the VAERS system in Florida.\n\nAfter the COVID-19 vaccination campaign in 2021, 41,473 reports of adverse reactions were made to VAERS.\n\nIn his letter, Ladapo cites a study on the website of the National Institutes of Health (NIH) entitled, “Serious adverse events of special interest following mRNA COVID-19 vaccination in randomized trials in adults.”\n\n“To claim these vaccines are ‘safe and effective’ while minimizing and disregarding the adverse events is unconscionable,” Ladapo’s letter to federal health officials reads.\n\nIn addition to the letter, the Florida Department of Health has issued a health alert related to the safety of the mRNA COVID-19 vaccine.\n\n“The state surgeon general is notifying the health care sector and the public of a substantial increase in Vaccine Adverse Event Reporting System reports from Florida after the COVID-19 vaccine rollout,” the warning reads.\n\nVAERS relies on healthcare professionals and individuals to report adverse reactions. But some have worried that findings have been downplayed by the media and even censored by Big Tech.\n\nIn January 2022, after the number of reported COVID-19 vaccine adverse events reported hit one million, Senator Ron Johnson posted a graphic from the VAERS website to Twitter.\n\n“Unsurprisingly, Twitter blocked my VAERS chart tweet,” Johnson wrote later in a post.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/florida-surgeon-general-warns-life-threatening-conditions-up-4400-percent-since-covid-19-vaccine-rollout_5064362.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/Ladapo-and-DeSantis-1-700x420.png?itok=j_QEZcUH", "/s3/files/inline-images/Daytona-500-3-1170x731-600x375.jpg?itok=MjHMwKy8", "https://www.theepochtimes.com/florida-surgeon-general-warns-life-threatening-conditions-up-4400-percent-since-covid-19-vaccine-rollout_5064362.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}