{"result_id": "353007", "URL": "https://www.zerohedge.com/markets/cdc-spreads-false-information-about-covid-19-vaccine-safety-monitoring", "timestamp": "2023-04-25 18:21:11 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/markets/cdc-spreads-false-information-about-covid-19-vaccine-safety-monitoring", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "CDC Spreads False Information About COVID-19 Vaccine Safety Monitoring | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nA top U.S. Centers for Disease Control and Prevention (CDC) official gave false information about COVID-19 vaccine safety monitoring to the agency’s vaccine advisory panel, and a spokesperson for the agency refused to correct the misinformation.\n\nDr. Tom Shimabukuro, director of the CDC’s Immunization Safety Office, presented on COVID-19 vaccine safety to the Advisory Committee on Immunization Practices on Feb. 24.\n\nShimabukuro went over updates to the safety signal for ischemic stroke following Pfizer bivalent booster vaccination that CDC officials detected in one of the agency’s monitoring systems.\n\nAfter sharing the updates, Shimabukuro made the false statement.\n\n“No safety signals were detected for ischemic stroke for the primary series or monovalent boosters for Pfizer or Moderna COVID-19 vaccines in U.S. and global monitoring,” Shimabukuro said.\n\nThat’s not true. The CDC identified ischemic stroke as a safety signal following Moderna and Pfizer vaccination after analyzing reports to the Vaccine Adverse Event Reporting System (VAERS), a different system, which the agency co-manages.\n\nAsked for comment, Shimabukuro did not respond. But a CDC spokesperson doubled down on the false claim.\n\n“The statement from Dr. Shimabukuro’s slides is correct. There have not been any safety signals detected at this time in the U.S. for ischemic stroke for the primary series or monovalent boosters,” Katherina Grusich, the spokesperson, told The Epoch Times in an email.\n\nThe CDC has previously offered misinformation and refused to correct it.\n\nBarbara Loe Fisher, president and co-founder of the National Vaccine Information Center, said what unfolded was concerning.\n\n“Those of us who worked with Congress to secure vaccine safety informing, recording, and reporting provisions in the 1986 National Childhood Vaccine Injury Act—of which VAERS was one—are deeply concerned that federal health officials are deliberately ignoring signals in VAERS and that mRNA COVID shots are causing ischemic strokes and other potentially fatal complications,” Fisher told The Epoch Times in an email.\n\nThe Pfizer and Moderna vaccines utilize messenger RNA, or mRNA, technology.\n\nBivalent boosters from both companies were authorized in the fall of 2022, but the primary series are still composed of the original vaccines, sometimes referred to as monovalent shots.\n\nShimabukuro’s statement had an impact. After his presentation, while the slide with the false information was on the screen, a member of the panel highlighted it.\n\n“I think it’s important to note [the statement] for the public,” Veronica McNally, president and CEO of the Fanny Strong Foundation, said, before reading it in full.\n\nDr. Helen Keipp Talbot, a member of the advisory panel, also offered false information about the safety signal.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/cdc-spreads-false-information-about-covid-19-vaccine-safety_5082854.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/cdc-headquarters-2-870x522_0.jpg?itok=syAGfC7E", "https://www.theepochtimes.com/health/stroke-could-be-a-safety-concern-with-new-pfizer-covid-19-vaccine-us-authorities_4984144.html", "https://www.theepochtimes.com/health/exclusive-cdc-finds-hundreds-of-safety-signals-for-pfizer-and-moderna-covid-19-vaccines_4956733.html", "https://www.theepochtimes.com/cdc-gave-facebook-misinformation-about-covid-19-vaccines-emails-show_4711892.html", "https://www.theepochtimes.com/group-calls-on-authorities-to-investigate-cdc-over-misinformation-about-child-covid-deaths_4869615.html", "https://www.theepochtimes.com/health/cdc-officials-who-spread-misinformation-apologized-to-source-of-false-data-but-not-to-public-emails_5003867.html", "https://www.theepochtimes.com/cdc-spreads-false-information-about-covid-19-vaccine-safety_5082854.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}