{"result_id": "353021", "URL": "https://www.zerohedge.com/political/wsj-shreds-vaccine-makers-biden-admin-over-deceptive-booster-campaign", "timestamp": "2023-04-25 18:21:19 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/wsj-shreds-vaccine-makers-biden-admin-over-deceptive-booster-campaign", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "WSJ Shreds Vaccine Makers, Biden Admin Over \"Deceptive\" Booster Campaign | ZeroHedge", "cleaned_text": "Wall Street Journal editorial board member Allysia Finley has taken a flamethrower to vaccine makers over their \"deceptive\" campaign for bivalent Covid boosters, and slams several federal agencies for taking \"the unprecedented step of ordering vaccine makers to produce them and recommending them without data supporting their safety or efficacy.\"\n\nYou might have heard a radio advertisement warning that if you’ve had Covid, you could get it again and experience even worse symptoms. The message, sponsored by the Health and Human Services Department, claims that updated bivalent vaccines will improve your protection. This is deceptive advertising. But the public-health establishment’s praise for the bivalent shots shouldn’t come as a surprise. -WSJ\n\nThe narrative behind the campaign was simple; mRNA Covid shots could simply be 'tweaked' to to target new variants - in this case, the jabs were claimed to confer protection against BA.4 and BA.5 Omicron variants, along with the original Wuhan strain.\n\nTo call this wishful thinking would be extremely generous.\n\nAs Finley writes, three scientific problems have arisen.\n• The virus is mutating much faster than vaccines can be updated.\n• Vaccines have 'hard wired' our immune systems to respond to the original Wuhan strain, \"so we churn out fewer antibodies that neutralize variants targeted by updated vaccines.\"\n• Antibody protection wanes after just a few months.\n\nTwo studies in the New England Journal of Medicine this month showed that bivalent boosters increase neutralizing antibodies against the BA.4 and BA.5 variants, but not significantly more than the original boosters. In one study, antibody levels after the bivalent boosters were 11 times as high against the Wuhan variant as BA.5. The authors posit that immune imprinting “may pose a greater challenge than is currently appreciated for inducing robust immunity against SARS-CoV-2 variants.” This isn’t unique to Covid or mRNA vaccines, though boosters may amplify the effect. Our first exposure as children to the flu—whether by infection or vaccination—affects our future response to different strains. -WSJ\n\nFor those who took (or were forced to take) the original vaccine, our memory B-cells were trained to produce antibodies against the original Wuhan strain. And as a New England Journal of Medicine article notes, people who have taken said original vaccine were \"primed\" to respond to the Wuhan strain, and 'mounted an inferior antibody response to other variants.'\n\nThe studies directly contradict marketing information from Pfizer and Moderna, which asserted that the bivalent boosters produced a response to the new strains (BA.4 and BA.5) that's 4-6x that of the original boosters - which the WSJ says is \"misleading.\"\n\nFor starters, neither Pfizer or Moderna conducted a randomized trial.\n\nHere's the moneyshot: \"The vaccine makers designed their studies to get the results they wanted. Public-health authorities didn’t raise an eyebrow, but why would they? They have a vested interest in promoting the bivalents.\"\n\nIn June, the FDA ordered vaccine makers to update the boosters against BA.4 and BA.5, and rushed the companies to push them out before clinical data was available. Meanwhile, Biden's CDC recommended the bivalents for all adults without evidence that they were effective or necessary.\n\nFinley further notes that vaccine makers could have performed small, randomized trials last summer and early fall on the bivalents - with results available by the end of September. But the Biden administration didn't want to wait (and now we know why).\n\nThe CDC published a study in November that estimated the bivalents were only 22% to 43% effective against infection during the BA.5 wave—their peak efficacy. As antibodies waned and new variants took over later in the fall, their protection against infection probably dropped to zero. Another CDC study, in December, reported that seniors who received bivalents were 84% less likely to be hospitalized than the unvaccinated, and 73% less likely than those who had received two or more doses of the original vaccine. But neither study controlled for important confounding factors—for one, that the small minority who got bivalents were probably also more likely than those who hadn’t to follow other Covid precautions or seek out treatments such as Paxlovid. -WSJ\n\nWe're amazed the Journal even put this out there... Kudos to them.\n\nFortunately for big pharma and the Biden administration, information overload is the new Soma, and Rachel Maddow et al. have everything under control.", "opengraph": {}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"315\" src=\"https://www.youtube.com/embed/InJGGhv4xuk\" title=\"YouTube video player\" width=\"560\"/>", "src": "https://www.youtube.com/embed/InJGGhv4xuk"}], "links": ["https://www.wsj.com/articles/the-deceptive-campaign-for-bivalent-covid-boosters-cdc-fda-biden-vaccines-moderna-pfizer-wuhan-imprinting-11674400955", "/s3/files/inline-images/biden%20vax.jpeg?itok=zXzG-VIs", "https://www.nejm.org/doi/full/10.1056/NEJMc2213948", "https://www.nejm.org/doi/full/10.1056/NEJMc2213907", "/s3/files/inline-images/pfizer%20vax1_0.jpg?itok=DptWtRG0", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780", "https://www.cdc.gov/mmwr/volumes/71/wr/mm7148e1.htm", "https://www.cdc.gov/mmwr/volumes/71/wr/mm715152e2.htm"], "authors": [], "publish_date": null}