{"result_id": "353025", "URL": "https://www.zerohedge.com/political/i-couldnt-remain-silent-physician-assistant-fired-reporting-covid-19-vaccine-adverse", "timestamp": "2023-04-25 18:21:22 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/political/i-couldnt-remain-silent-physician-assistant-fired-reporting-covid-19-vaccine-adverse", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "\"I Couldn't Remain Silent\": Physician Assistant Fired For Reporting COVID-19 Vaccine Adverse Events To VAERS | ZeroHedge", "cleaned_text": "Authored by Matt McGregor via The Epoch Times (emphasis ours),\n\nFor her efforts to report injuries to the Vaccine Adverse Events Reporting System (VAERS) and to educate others in her hospital system on doing the same, Physician Assistant Deborah Conrad said she was labeled an anti-vaxxer and fired from her job.\n\nToday, the New York-based Conrad tells her story at medical freedom conferences throughout the country, the most recent being one in Mississippi where physicians, scientists, and the vaccine injured warned state lawmakers to pull the COVID-19 vaccines from the market.\n\nConrad told The Epoch Times she began to see early danger signals in 2021 upon the vaccine rollout, and with that, resistance among her colleagues to report on them.\n\n“After the vaccines came out, there was this uptick in unusual symptoms, some of which I had never seen in my 20-year career,” Conrad said. “In every case, it was in somebody who had received the COVID-19 vaccine.”\n\nConrad said she had never admitted an adult patient with RSV (respiratory syncytial virus) until the COVID-19 vaccines.\n\n“And every patient who came in with RSV was vaccinated for COVID,” Conrad said. “It wasn’t normal.”\n\nThen, there were the adolescents with no previous medical conditions who had gotten the COVID-19 vaccine a week prior and, suddenly, they were struck with pneumonia and not able to function, she said.\n\n“They weren’t able to walk or eat, and they were completely and totally fatigued,” Conrad said.\n\nThis was in 2021 before myocarditis was being discussed, so many of those early cases that were probably myocarditis were diagnosed as pneumonia, she said.\n\n“A lot of these myocarditis cases came in with fevers because of this massive inflammatory response that was taking place in the body, so they would be labeled as septic, treated as if we were treating pneumonia or fevers of unknown origin,” Conrad said. “We’d treat them with antibiotics and all sorts of other things, not realizing that they were having heart failure.”\n\nConrad began reporting to VAERS, which she said was an overwhelming task not made easy by its multiple user-interface complications.\n\n“My entire life had been taken over by doing these VAERS reports by myself,” she said.\n\nIn meetings with leadership, she would propose implementing a reporting system and hiring someone to manage the reports, she said.\n\n“They kept telling me we’re looking into it and we’ll get back to you,” Conrad said. “Around April 2021, leadership came back and said no one else is reporting injuries—implying that I was crazy and there was nothing really going on with the vaccines.”\n\nLeadership then audited her reports, she said and concluded that she was overreporting.\n\n“I was then told that by doing VAERS reports and even discussing VAERS that it was an admission that the vaccines were unsafe, so it’s contributing to vaccine hesitancy,” Conrad said.\n\nFrom there, it became a “very hostile environment” that compelled her to seek legal counsel, who wrote letters to the Department of Health, the CDC, and the FDA.\n\n“No one cared,” Conrad said. “Finally, I had had it. It was so unethical; I couldn’t take it anymore. These VAERS reports are critical to assuring these vaccines are safe for us all. I could no longer be a part of a system that is lying to the American people.”\n\nConrad decided to become a whistleblower, telling her story on Del Bigtree’s The Highwire, knowing, she said, that it would cost her job.\n\n“I couldn’t remain silent, even if it meant losing my career and everything I worked for,” she said. “I was fired a few weeks later and walked out like a criminal in front of all my peers.”\n\nThe initiative and education she had brought forth to report to VAERS were squashed that day, she said.\n\nAccording to Barbara Loe Fisher, co-founder and president of the National Vaccine Information Center (NVIC), under the National Vaccine Injury Act of 1986, it’s a federal requirement for health care workers to report vaccine-related adverse events to VAERS.\n\nFisher, whose son was harmed by the DTP vaccine in 1980, worked with other parents of vaccine-injured children in establishing the NVIC in 1982.\n\n“The 1986 Act was driven by parents of DPT vaccine injured children asking the government to pass legislation to secure vaccine safety informing, recording, reporting, and research provisions in the vaccination system to make it safer, and to create a federal compensation system alternative to a lawsuit against manufacturers of vaccines that injure or kill children,” Fisher told The Epoch Times.\n\nIn addition to NVIC arguing that physicians and vaccine manufacturers should be giving informed consent and report injuries, the organization maintained they should also continue to be held accountable in a civil court to serve as an incentive for physicians to administer vaccines responsibly, for manufacturers to produce safer vaccines, and for adequate federal compensation to vaccine-injured children.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/physician-assistant-fired-for-reporting-covid-vaccine-adverse-events-to-vaers_5130783.html?ea_med=desktop_news&tmp=1&ea_src=ai_recommender", "/s3/files/inline-images/conradadjusted-700x420.jpg?itok=aNqbmB0H", "https://www.theepochtimes.com/health/doctors-scientists-call-on-mississippi-officials-to-take-covid-vaccines-off-the-market_5087686.html", "https://thehighwire.com/videos/these-patients-deserve-to-be-heard-vaers-whistleblower/", "/s3/files/inline-images/Deborah-Speaking-600x400.jpg?itok=PUplwm-A", "https://www.theepochtimes.com/physician-assistant-fired-for-reporting-covid-vaccine-adverse-events-to-vaers_5130783.html?ea_med=desktop_news&tmp=1&ea_src=ai_recommender"], "authors": [], "publish_date": null}