{"result_id": "353003", "URL": "https://www.zerohedge.com/medical/moderna-and-regulatory-agencies-caught-leaving-out-bivalent-vaccine-data-physicians", "timestamp": "2023-04-25 18:21:08 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/medical/moderna-and-regulatory-agencies-caught-leaving-out-bivalent-vaccine-data-physicians", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "Moderna And Regulatory Agencies Caught Leaving Out Bivalent Vaccine Data, Physicians Skeptical Of Timing | ZeroHedge", "cleaned_text": "Authored by Marina Zhang via The Epoch Times (emphasis ours),\n\nModerna and regulatory agencies did not present clinical data on bivalent shots at the U.S. Food and Drug Administration (FDA) and the Centers for Disease Control and Prevention (CDC) committee meetings in June and September 2022, respectively.\n\nPresentations to the FDA and CDC advisory committee excluded data from Moderna’s own clinical study that showed bivalent boosters may be no better at preventing infections than previous booster shots.\n\nThe data showed that among people who were never infected, 3.2 percent who took the bivalent booster got infected afterward, while 1.9 percent who took the monovalent booster were later infected.\n\nAdvisors to the FDA and CDC expressed concerns of lack of transparency.\n\nDr. William Schaffner from Vanderbilt University, a nonvoting member of the CDC advisory committee, said that he was disappointed that the data were not presented.\n\n“I think in the interests of transparency, those data should have been presented,” Schaffner said, “though they were very limited, and early data.”\n\nFDA advisor and a professor of clinical pediatrics at the University of California San Diego, Dr. Mark Sawyer, said that he understands people’s concern with the data being excluded, but not all information can be presented.\n\nThe committee has limited time, so the information presented must be relevant to the big picture.\n\n“Seeing that data would not have changed my opinion about the outcome,” said Sawyer, “and it would certainly have distracted from the discussion.”\n\nThe four advisors for the FDA and CDC who were contacted by The Epoch Times agreed that if the data were presented, it may have prolonged the discussion, but would not have changed the voting outcomes.\n\nBoth the FDA’s Vaccines and Related Biological Products Advisory Committee (VRBPAC) meeting and the CDC’s Advisory Committee on Immunization Practices (ACIP) meeting approved Moderna bivalent boosters.\n\nThe excluded data come out of a small Moderna study with 772 participants. The study primarily investigated the safety and immunogenicity of boosters, but also looked into the infection and reactogenicity of the subjects.\n\nImmunogenicity, the focus of the study, is defined as the ability of the vaccine to trigger an immune response. Though the study authors reiterated that the trial does not examine vaccine efficacy, the authors acknowledged that immunogenicity has been used to infer efficacy.\n\nThree days before the FDA VRBPAC meeting on June 28, 2022, Moderna published the study as a preprint, and in September, published the study in the New England Journal of Medicine (NEJM).\n\nBoth the preprint and peer-reviewed study included data on immunogenicity, safety, reactogenicity, as well as infection.\n\nModerna’s spokesman Christopher Ridley also told CNN that the company shared the infection data with the FDA and published the study before the FDA panel meeting.\n\nAt the VRBPAC meeting, Moderna president Stephen Hoge made several references to the study’s immunogenicity data, which showed that people who took the bivalent shots had a higher antibody level than those who took the monovalent booster, as an argument for the bivalent booster’s superiority.\n\nHoge also made references to the same study’s data on safety and reactogenicity, but infection rates were excluded.\n\nThe FDA’s documents provided to the committee panel on the same day, also referenced the study’s data on immunogenicity, safety, and reactogenicity, yet the infection data were similarly excluded.\n\nAccording to CNN, the FDA spokesman explained in an email that the data on infection were not included, as “the FDA received the preprint less than a day prior to the advisory committee meeting,” and “generally the FDA only discusses data at advisory committee meetings that the agency has had the opportunity to substantively review.”\n\nThis means that the FDA could review the study’s data on immunogenicity, safety, and reactogenicity, but had no opportunity to examine infection data.\n\nVRBPAC member and professor of microbiology and immunology from the University of Iowa, Dr. Stanley Perlman, said that with the absence of these data, there is always the concern that the public will lose trust in the health care system.\n\nAt the end of the meeting, the VRBPAC committee ruled in favor of using the Omicron variant’s mRNA in boosters to produce the bivalent COVID-19 vaccines in a 19-2 motion.\n\nThe CDC’s meeting with members of the Advisory Committee on Immunization Practices (ACIP) on Sep. 1, 2022, presented by Moderna staff Dr. Jacqueline Miller, also excluded data on infection rates in the presentation (pdf).\n\nHours into the CDC meeting, voting member of the ACIP Dr. Sybil Cineas asked whether there were any data on breakthrough infections between two experimental groups.\n\nMiller said that between the overall cohort of people who received the bivalent vaccine, the infection rate was 2.5 percent, and for the monovalent group, the rate of 2.4 percent.\n\nHowever, she failed to mention that for people who never had a previous infection, 3.2 percent of those who took the bivalent vaccine became infected, while 1.9 percent of subjects who took the monovalent developed an infection.\n\nThe ACIP members approved Moderna bivalent boosters being made available to people aged 18 and over in a 13-1 vote.\n\nDr. Cody Meissner, a VRBPAC member and a professor in the division of infectious diseases and international health from Dartmouth Health Children’s, also pointed out that the infection data came out of a non-randomized and non-blinded study.\n\nThis introduces the risk of bias into the study, as those assigned to bivalent or monovalent boosters were not based on random chance, and trial administrators would know what booster participants received.\n\nWhile this possibly discounts the significance of the data on infection rates, it can also affect the validity of the findings on immunogenicity, safety, and reactogenicity.\n\nBiochemist and mRNA platform inventor Dr. Robert Malone raised the point that immunogenicity data that only look at antibody levels are not good surrogate measures for vaccine efficacy.\n\nAntibody levels are also not a good measure of immunity, as antibodies will and should wane with time. The long-term immunity they provide is therefore unknown.\n\nIt is also unconfirmed if the antibodies produced are neutralizing antibodies that can block the virus and spike proteins, or if they may actually prevent the immune system from killing and controlling the virus, a scenario known as antibody-dependent enhancement.\n\nBivalent boosters have come under increasing scrutiny for their rapidly declining effectiveness.\n\nA December 2022 preprint study on bivalent vaccines, authored by the Cleveland Clinic, found that the higher the number of previous vaccinations, the greater the risk of contracting COVID-19.\n\nIn a letter to the editor (pdf) published in the NEJM, researchers from Columbia University compared antibody serum responses among people who received bivalent boosters, monovalent boosters, and those who were infected.\n\nThe authors found that there was no significant difference in neutralizing abilities among these groups when tested against Omicron and other variants.\n\nDr. Paul Offit, an advisor on the VRBPAC committee who voted against bivalent boosters at the meeting, also published a commentary, saying that young and healthy people shouldn’t get the latest boosters.\n\n“I believe we should stop trying to prevent all symptomatic infections in healthy, young people by boosting them with vaccines containing mRNA from strains that might disappear a few months later,” wrote Offit, also an FDA vaccine panel adviser and professor of pediatrics at the Children’s Hospital of Philadelphia, in the NEJM on Jan. 11, 2023.\n\nIn his article, Offit cited two studies suggesting that bivalent boosters, which target the original COVID-19 strain and two Omicron subvariants BA.4 and BA. 5, do not “elicit superior immune responses.”\n\n“Why did the strategy for significantly increasing BA.4 and BA.5 neutralizing antibodies using a bivalent vaccine fail?” he asked.\n\n“The most likely explanation is imprinting. The immune systems of people immunized with the bivalent vaccine, all of whom had previously been vaccinated, were primed to respond to the ancestral strain of SARS-CoV-2. They therefore probably responded to epitopes shared by BA.4 and BA.5 and the ancestral strain, rather than to new epitopes on BA.4 and BA.5.”\n\nMeissner, likewise, expressed that healthy people younger than 65 years of age may not need bivalent boosters.\n\n“We don’t know … how many or how often boosters are necessary. And could there be consequences from giving multiple vaccine doses that we don’t fully understand at this time?”\n\nA peer-reviewed study published on Jan. 12 in Germany also showed that people who received higher numbers of mRNA vaccines had a higher IgG4 antibody response. The authors did not further discuss what these antibody levels may indicate, but studies have associated IgG4 antibodies with immune tolerance, which is when the body reduces its immune response to fight off an infection.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/moderna-and-regulatory-agencies-caught-leaving-out-bivalent-vaccine-data-physicians-skeptical-of-timing_4985851.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/1.tagreuters.com2022binary_LYNXMPEI5D0J7-FILEDIMAGE-870x522.jpg?itok=h_XHfvc4", "https://www.nejm.org/doi/10.1056/NEJMoa2208343", "https://www.theepochtimes.com/t-omicron", "https://www.cdc.gov/vaccines/acip/meetings/downloads/slides-2022-09-01/06-COVID-Miller-508.pdf", "/s3/files/inline-images/20210528-Moderna-Vaccine-Syringes-Kingston-ON-CP124184336.jpg?itok=_hYz00Uv", "https://www.medrxiv.org/content/10.1101/2022.12.17.22283625v1.full", "https://www.nejm.org/doi/pdf/10.1056/NEJMc2213907", "https://www.nejm.org/doi/full/10.1056/NEJMp2215780"], "authors": [], "publish_date": null}