{"result_id": "353010", "URL": "https://www.zerohedge.com/medical/covid-vaccine-injuries-quietly-being-compensated-around-world", "timestamp": "2023-04-25 18:21:13 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/medical/covid-vaccine-injuries-quietly-being-compensated-around-world", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "COVID Vaccine Injuries Quietly Being Compensated Around The World | ZeroHedge", "cleaned_text": "Authored by Jennifer Margulis and Joe Wang via The Epoch Times,\n\nPrograms in countries around the world have begun quietly compensating people who have been injured by or died as a result of the COVID-19 vaccines.\n\nHumans are biologically diverse, with respect to both genetic makeup and past environmental exposures. Because of this, explained neurologist Dr. Robert Lowry, people can react very differently to the same medication or vaccination. Whenever a new drug or biologic hits the market, some people will have bad reactions and others may even suffer serious adverse events as a result.\n\nEven under the best testing conditions, rare reactions will be missed. This is especially true for any product which is fast-tracked or authorized for emergency use before all the phases of necessary testing are complete.\n\nCOVID-19 vaccines are no exception. Despite the fact that we are constantly and consistently assured that COVID-19 vaccines are safe, and that severe adverse reactions are “very rare,” the FDA and the CDC with its Advisory Committee on Immunization Practices, as well as the scientists and executives at each of the participating drug companies, know that some people will become permanently disabled or even die as a result of vaccination.\n\nIn fact, in 2011 the Supreme Court of the United States (pdf) reiterated the idea that vaccines, like other pharmaceutical products, are “unavoidably unsafe.”\n\nIn many countries around the world, consumers who are injured as a result of vaccines are covered by government compensation programs. In the United States there are two government-funded programs that are designed to compensate consumers for injuries, at the same time shielding vaccine manufacturers from liability for any serious injuries their products cause: The National Vaccine Injury Compensation Program (VICP) and the Countermeasures Injury Compensation Program (CICP).\n\nAs of July 1, 2022, not a single claim has been compensated by the CICP. However, 31 COVID-19 countermeasure claims have been denied, “because the standard of proof for causation was not met and/or a covered injury was not sustained,” according to the CICP website. “One COVID-19 countermeasure claim, a COVID-19 vaccine claim due to an anaphylactic reaction, has been determined eligible for compensation and is pending a review of eligible expenses.”\n\nAt the same time, countries around the world are quietly compensating families whose loved ones have been injured or have died as a result of COVID-19 vaccines.\n\nThe Japan Times reported this week that a 91-year-old woman who died after suffering an allergic response and sudden heart attack is the first person in Japan to be compensated for a COVID vaccine injury.\n\nA ministry of health panel ruled that a causal relationship “could not be denied” in her case. Her family will receive a lump sum worth approximately $325,000.\n\nThe panel reviewed another 11 cases ranging in age from 20s to 90s but did not reach any other ruling.\n\nSo far in Japan, according to the article, 3,680 people have applied for compensation, 820 have been approved and 62 denied, with decisions on another 16 being “postponed.”\n\nOn June 24, 2022, Taiwan’s National Vaccine Injury Compensation Program held a meeting to review 65 cases, according to the Taipei Times. The Taiwanese program awarded compensation to 10 claimants. These awards included a lump sum worth $116,877 to the family of someone who died after receiving the AstraZeneca vaccine.\n\nThis patient was hospitalized 10 days after receiving the vaccine due to a headache and vomiting. Testing revealed thrombocytopenia, a sometimes-lethal blood disorder that is characterized by low platelets.\n\nHowever, the patient was discharged the next day, only to return that evening after losing consciousness. The patient died of intracerebral hemorrhage, a common cause of stroke.\n\nWhen the vaccination program first rolled out in the United States, in December of 2020, an otherwise healthy obstetrician-gynecologist, Dr. Gregory Michael, 56, of Miami Beach, Florida, also died of thrombocytopenia.\n\nAlthough his death occurred approximately two weeks after he got Pfizer’s COVID-19 vaccine, and prompted an article exploring this side effect in the New York Times, the coroner deemed that there was no medical certainty that the complications from immune thrombocytopenia was vaccine-induced.\n\nVicki Spit was the first of a handful of people in the United Kingdom to be awarded compensation for injuries due to COVID vaccines, according to a June 24, 2022 article in the British Medical Journal.\n\nSpit’s 48-year-old partner, Zion, became ill eight days after receiving the AstraZeneca vaccine and died. The victims were awarded the maximum: $150,000. As of May 2022, 1,681 claims for vaccine injury following COVID-19 vaccinations had been filed.\n\nAs quoted in the BMJ, Sarah Moore, a spokeswoman for the law firm representing the victims or their families, pointed out that though the awards will not do much to alleviate the financial hardships caused by the injuries, they constitute “the clearest statement yet, by the government, that in some rare instances the COVID-19 vaccines have caused very significant injury or death.”\n\nMoore believes most of the compensation awards were for vaccine-induced thrombotic thrombocytopenia (VITT) or cerebral venous sinus thrombosis.\n\nAt the same time, Yahoo News has reported that 444 cases of VITT have been recorded in the United Kingdom from 49 million doses of the vaccine, with 81 deaths.\n\nAccording to Canada’s Vaccine Injury Support Program (VISP), from June 1, 2021 to June 1, 2022, 774 claims have been received. Eight of these claims were “approved by the Medical Review Board,” meaning “these claims represent cases where it has been determined by the Medical Review Board that there is a probable link between the injury and the vaccine and that the injury is serious and permanent.”\n\nAccording to the VISP website, “eligible individuals may receive income replacement indemnities; injury indemnities; death benefits; coverage for funeral expenses; reimbursement of eligible costs such as otherwise uncovered medical expenses.”\n\nThrombocytopenia can lead to blood clots as well as hemorrhaging. Thrombosis is another word for blood clots. Since it is very unusual for an otherwise healthy younger person to suffer from blood clots, the connection between the vaccines and this injury are difficult to refute.\n\nScandinavian countries have paid more attention to COVID-19 vaccine injuries than other countries. Norway compensated its first three victims in July of last year, a woman in her 40s who died, as well as a man and a woman in their 30s who both survived their vaccine injuries.\n\nAll three were healthcare workers who received the AstraZeneca vaccine, which Norway stopped administering on March 11, 2021, due to reports of serious blood clots, low platelet counts, and abnormal bleeding.\n\nIn fact, Norwegian doctors were among the first to point out the connection between the vaccine and these injuries.\n\nDenmark, too, has been quickly and quietly processing vaccine injury claims. The Danish government awarded compensation for their first case of VITT in May of 2021.\n\nAt the time, 158 people had filed claims for COVID-19 vaccine injuries. The director of the patient compensation board, Karen Inger-Bast, said, “Generally, we often see injuries from vaccination. We also see them from, for example, vaccination against influenza and children’s diseases. That’s also how it will be with COVID-19, with up to 5 million people being vaccinated.”\n\nNo Financial Assistance for Americans Harmed by Vaccines\n\nYet, while other countries are compensating people who have been injured by COVID-19 vaccines, America has yet to financially assist a single claimant. According to the Health Resources and Service Administration, as of July 1, 2022, the CICP had yet to award compensation to anyone for damages due to a COVID-19 vaccine.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/covid-vaccine-injuries-quietly-being-compensated-around-the-world-are-you-eligible_4632576.html?utm_source=partner&utm_campaign=ZeroHedge", "https://assets.zerohedge.com/s3fs-public/inline-images/vax%20sinovac.jpg?itok=zwR_tvLE", "https://www.fda.gov/patients/fast-track-breakthrough-therapy-accelerated-approval-priority-review/fast-track", "https://www.cnbc.com/2020/08/30/fda-willing-to-fast-track-coronavirus-vaccine-before-phase-three-trials.html", "https://www.supremecourt.gov/opinions/10pdf/09-152.pdf", "https://www.hrsa.gov/vaccine-compensation", "https://www.hrsa.gov/cicp", "https://www.hrsa.gov/cicp/cicp-data", "https://www.japantimes.co.jp/news/2022/07/26/national/science-health/japan-first-covid-19-vaccine-compensation", "https://www.theepochtimes.com/theres-no-mild-in-myocarditis_3952940.html", "https://www.taipeitimes.com/News/taiwan/archives/2022/07/18/2003781958", "https://www.local10.com/news/local/2021/04/08/coroner-south-florida-doctor-who-died-after-vaccine-died-of-natural-cause/", "https://www.theepochtimes.com/pfizer-covid-vaccine-safety-varies-from-lot-to-lot_4467336.html", "https://www.nytimes.com/2021/02/08/health/immune-thrombocytopenia-covid-vaccine-blood.html", "https://www.bmj.com/content/377/bmj.o1565", "https://www.theepochtimes.com/want-to-be-a-dad-count-your-sperm-if-youve-had-the-jab_4553274.html", "https://news.yahoo.com/three-people-win-payouts-linked-to-covid-vaccination-180521920.html", "https://vaccineinjurysupport.ca/en/program-statistics", "https://sciencenorway.no/covid19-vaccines/will-be-paid-damages-after-astrazeneca-vaccination/1884393", "https://sciencenorway.no/covid19/norwegian-experts-say-deadly-blood-clots-were-caused-by-the-astrazeneca-covid-vaccine/1830510", "https://www.thelocal.com/20210528/denmark-gives-woman-given-compensation-for-covid-19-vaccine-side-effects/", "https://www.hrsa.gov/cicp/cicp-data", "https://www.theepochtimes.com/covid-vaccine-injuries-quietly-being-compensated-around-the-world-are-you-eligible_4632576.html?utm_source=partner&utm_campaign=ZeroHedge"], "authors": [], "publish_date": null}