{"result_id": "353043", "URL": "https://www.zerohedge.com/medical/us-expert-panel-meet-determine-which-adverse-events-covid-19-vaccines-cause", "timestamp": "2023-04-25 18:21:32 CEST+0200", "meta": {"description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero", "lang": "en", "keywords": "", "favicon": "/favicons/favicon.png", "canonical": "https://www.zerohedge.com/medical/us-expert-panel-meet-determine-which-adverse-events-covid-19-vaccines-cause", "encoding": "utf-8"}, "image": null, "domain": "www.zerohedge.com", "title": "US Expert Panel To Meet To Determine Which Adverse Events COVID-19 Vaccines Cause | ZeroHedge", "cleaned_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\n\nA group of U.S. experts is set to meet soon as part of a project to determine which adverse events the COVID-19 vaccines cause.\n\nThe National Academies of Sciences, Engineering, and Medicine (NASEM) has appointed a committee to review evidence on the relationship between the vaccines and specific adverse events that have occurred after vaccination, including infertility and sudden death.\n\n“The committee will make conclusions about the causal association between vaccines and specific adverse events,” the NASEM website states.\n\nWhile their work is funded by the U.S. Centers for Disease Control (CDC) and the U.S. Department of Health and Human Services (HHS), the sponsors will not be able to examine the report before it is published to the public, Kathleen Stratton, a NASEM official, said during a recent meeting.\n\n“What that means is that if a sponsor doesn’t like what the committee has to say—the conclusions of the committee—… the sponsor can’t prevent the report from being made public,” Stratton said. “This is a very powerful tool that we have.”\n\nDr. Tom Shimabukuro, a CDC official, told panel members recently that the CDC would help members locate studies and data from the agency. “We very much value your expertise and your independence. We look forward to working with you, look forward to seeing the results of your findings,” he said.\n\nThe upcoming meeting will be held on March 27 and March 31, the latter of which will include time for public comments. The rest of the two-day meeting will be held behind closed doors.\n\nThe panel already met on Jan. 25 and Feb. 1.\n\n“Your conclusions will help inform injury compensation recommendations and decisions when assessing whether specific adverse events are causally associated with vaccines,” Dr. George Reed Grimes, the official in charge of the HHS Division of Injury Compensation Programs, told panel members during the meeting.\n\nThe report is slated to be published in March 2024.\n\nHHS officials directed NASEM to convene the ad hoc committee to review “the epidemiological, clinical, and biological evidence” in assessing whether the vaccines cause certain conditions.\n\nThe adverse events include conditions that officials already say are caused by one or more of the vaccines, including myocarditis, a type of heart inflammation caused by all four of the vaccines available in the United States, and thrombosis with thrombocytopenia syndrome, an often-fatal condition caused by the Johnson & Johnson vaccine.\n\nThe other specific events are:\n\nA NASEM panel last produced a vaccine adverse event report in 2012. The report ran nearly 900 pages.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.theepochtimes.com/us-expert-panel-to-meet-to-determine-which-adverse-events-covid-19-vaccines-cause_5147100.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge", "/s3/files/inline-images/covid-vaccination-870x522.jpg?itok=XJorLh9c", "https://www.nationalacademies.org/our-work/review-of-relevant-literature-regarding-adverse-events-associated-with-vaccines", "https://www.documentcloud.org/documents/23722724-nasem-2012-report", "https://www.theepochtimes.com/us-expert-panel-to-meet-to-determine-which-adverse-events-covid-19-vaccines-cause_5147100.html?utm_source=partner&utm_campaign=ZeroHedge&src_src=partner&src_cmp=ZeroHedge"], "authors": [], "publish_date": null}