{"result_id": "354001", "URL": "https://naturalcowgirl.wordpress.com/2010/09/27/much-ado-about-the-flu/", "timestamp": "2023-04-25 18:21:33 CEST+0200", "meta": {"description": "Do you have questions about the flu and flu shots? So do I. I have been all over the internet the last couple of days looking at flu shot safety and effectiveness – and I still don’t have any great revelations. I always try to consider the other side and to look around my “natural”…", "lang": "en", "keywords": "", "favicon": "https://s1.wp.com/i/favicon.ico", "canonical": "https://naturalcowgirl.wordpress.com/2010/09/27/much-ado-about-the-flu/", "encoding": "UTF-8"}, "image": null, "domain": "naturalcowgirl.wordpress.com", "title": "Much Ado About the Flu", "cleaned_text": "Do you have questions about the flu and flu shots? So do I. I have been all over the internet the last couple of days looking at flu shot safety and effectiveness – and I still don’t have any great revelations.\n\n I always try to consider the other side and to look around my “natural” position. This year, I don’t have any new information. Is the flu shot beneficial? Maybe. Does it have negative side effects? Probably. Should I get the shot? I can only answer that for me and my family. With us, the answer is no. Here’s why.\n\n 1. I am a naturopath – I really like using herbs and homeopathics because they tend to work with the body, leaving it healthier than it was to start with. So I am very prejudiced to begin with.\n\n 2. I am also a skeptic – not degreed. I watch who gets sick and who doesn’t. Based on my observations, most of those I know that got the flu also got the shot. Is there a connection? I don’t know. I know a number of people that did not get the shot and did not get sick – most of these took something natural to boost their immune system. I also know that I and my family stayed well with no shots – but we did take herbs.\n\n 3. I like being self-reliant. I would much rather use something outside of the “mainstream” system. I can figure out herbs and homeopathics by myself without having to rely on the medical or insurance businesses.\n\n 4. I think having choices is important. I want to be able to choose herbs and homeopathics. One of my biggest fears is mandated vaccines. When vaccines are mandatory – who benefits? What will happen to safety measures when the vaccine no longer has to be “sold”?\n\n 5. I do not trust the vaccines to be in my best interest. Problems with vaccines and prescription drugs arise years after their approval. Remember the “do no harm” part of the Hippocratic Oath? Now there are “acceptable losses” because it is known that some will have negative reactions to the vaccine. (This applies to other vaccines as well.)\n\n 6. I personally do not want to be exposed to thimerserol, a mercury based preservative, and whatever else goes into the vaccine.\n\n 7. I rebel against “vaccine” mentality. There is a myth that vaccines are necessary to improve our health. I think that our over-reliance on vaccines actually undermines our immune systems and makes us more susceptible to disease.\n\n I must add that I do not have an opinion on people with health issues that need to take the vaccine as the flu would further jeopardize their health. While it is a choice I would not make, I think people who want vaccines should be able to choose them.\n\n My next posting will be on what I use during flu season.", "opengraph": {"type": "article", "title": "Much Ado About the Flu", "url": "https://naturalcowgirl.wordpress.com/2010/09/27/much-ado-about-the-flu/", "description": "Do you have questions about the flu and flu shots? So do I. I have been all over the internet the last couple of days looking at flu shot safety and effectiveness – and I still don’t have any great…", "article:published_time": "2010-09-27T03:13:05+00:00", "article:modified_time": "2010-09-27T03:13:05+00:00", "site_name": "Margaret's Natural Health Blog", "image": "https://s0.wp.com/i/blank.jpg", "locale": "en_US", "article:publisher": "https://www.facebook.com/WordPresscom"}, "tags": ["Flu", "vaccine", "immune", "thimerserol"], "tweets": [], "movies": [], "links": ["https://naturalcowgirl.wordpress.com/2010/09/27/much-ado-about-the-flu/#print", "mailto:?subject=%5BShared%20Post%5D%20Much%20Ado%20About%20the%20Flu&body=https%3A%2F%2Fnaturalcowgirl.wordpress.com%2F2010%2F09%2F27%2Fmuch-ado-about-the-flu%2F&share=email", "https://naturalcowgirl.wordpress.com/2010/09/27/much-ado-about-the-flu/?share=facebook", "https://naturalcowgirl.wordpress.com/2010/09/27/much-ado-about-the-flu/?share=twitter"], "authors": [], "publish_date": "2010-09-27T03:13:05+00:00"}