{"result_id": "355004", "URL": "https://www.naturalhealthnews.uk/article/zinc-the-metal-of-life/", "timestamp": "2023-04-25 18:21:45 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/zinc-the-metal-of-life/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Zinc - the metal of life", "cleaned_text": "Zinc has been identified as one of the most important essential trace metals in human nutrition and lifestyle.\n\nZinc is not only a vital element in various physiological processes; it is also a drug in the prevention of many diseases. The adult body contains about two to three grams of zinc. It is found in organs, tissues, bones, fluids, and cells.\n\nTo underscore the importance of this element in our diets a new study published in the journal Comprehensive Reviews in Food Science and Food Safety, looked at the evidence supporting the relationship between zinc and vital human physiological processes. it found some amazing things:\n\nBrain The blood zinc level is less in patients with Alzheimer’s and Parkinson’s disease. In a rodent study, it was observed that zinc behaves like an antidepressant.\n\nCardiovascular system Zinc performs a noteworthy role in the regulation of arterial blood pressure. Males and females were reported to metabolize zinc differently when suffering from hypertension.\n\nLiver Zinc deficiency in the liver occurs not only in those with liver cirrhosis, but also in less advanced alcoholic and nonalcoholic liver disease.\n\nPregnancy A mild deficiency of zinc during a pregnancy can cause increased maternal illness, abnormal taste sensation, prolonged pregnancy, inefficient labour, postpartum bleeding, and an increased risk to the fetus.\n\nDiabetes Zinc is very important in the synthesis, storage, and secretion of insulin. A low level of zinc has been shown to play a role in diabetics with associated disease conditions such as coronary artery disease and several related risk factors including hypertension, and elevated levels of triglycerides (blood fats).\n\nEndocrine system Studies show a correlation between zinc deficiency in elderly patients and reduced activity of the thymus gland and thymic hormones, decreased response to vaccinations, and reduced immunity.\n\nPneumonia Zinc may shorten the duration of severe pneumonia and time in the hospital.\n\nHealing Zinc deficiency has been linked with delayed wound healing, and has been found to be crucial to the healing of gastric ulcers especially at the early stage.\n\nOther studies have emphasised that zinc is also crucial to efficient immune system function and may also have a role to play in delaying the progression of age-related macular degeneration (AMD) and vision loss.\n\nNearly half of the world’s population is at risk for inadequate zinc intake, though true deficiency is rare in developed countries.\n\nAdult men need around 11 mg per day, adult women 8 mg (though during pregnancy and breastfeeding a woman’s daily needs are more in line with men’s).\n\nChildren age 1-3 years need around 3 mg daily, from ages 4-8, 5mg daily and from 9-14, 8mg daily.\n\nA wide variety of foods contain zinc. Oysters contain more of this element per serving than any other food, but red meat and poultry provide the majority of zinc in the Western diet. Other good food sources include beans, nuts, certain types of seafood (such as crab and lobster), whole grains, fortified breakfast cereals, and dairy products.\n\nPhytates, which are present in whole-grain breads, cereals, legumes, and other foods, bind zinc and inhibit its absorption. Thus, the bioavailability of zinc from grains and plant foods can be lower than that from animal foods. Even so many grain- and plant-based foods are still good sources of zinc. Fermentation can help break down some of the phytate content of grains, another reason why sourdough bread is a better nutritional choice.\n\nCadmium, levels of which are increasing in the environment, also inhibits zinc absorption. A recent study found that organic crops contain less cadmium than conventional ones – so switching to organic may also be a good idea.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Zinc - the metal of life", "url": "https://www.naturalhealthnews.uk/article/zinc-the-metal-of-life/", "type": "article", "description": "Zinc is a vital trace element, involved in numerous physiological processes; it is also a drug in the prevention of many diseases", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2014/07/zinc.jpg"}, "tags": ["Health Tips"], "tweets": [], "movies": [], "links": ["http://onlinelibrary.wiley.com/doi/10.1111/1541-4337.12067/abstract;jsessionid=07FCF12BF3E70284F7066EAD68A5677C.f04t04", "https://www.naturalhealthnews.uk/article/the-natural-way-to-heal-cuts-and-wounds/", "http://www.ncbi.nlm.nih.gov/pubmed/9701160?dopt=Abstract", "http://www.ncbi.nlm.nih.gov/pubmed/16625532?dopt=Abstract", "http://www.ncbi.nlm.nih.gov/pubmed/11594942?dopt=Abstract", "http://www.ncbi.nlm.nih.gov/pubmed/15631515", "https://www.naturalhealthnews.uk/article/in-praise-of-sourdough/", "https://www.naturalhealthnews.uk/food/2014/07/organic-crops-higher-in-beneficial-antioxidants-lower-in-pesticides/"], "authors": [], "publish_date": null}