{"result_id": "355012", "URL": "https://www.naturalhealthnews.uk/article/vaccine-hazards-what-the-uk-government-hid-and-ignored/", "timestamp": "2023-04-25 18:21:53 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/vaccine-hazards-what-the-uk-government-hid-and-ignored/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Vaccine hazards - what the UK government hid and ignored", "cleaned_text": "Vaccine hazards – what the UK government hid and ignored\n\nIt never rains but it pours and in the last couple of weeks we have found ourselves in the middle of a deluge of news stories about childhood vaccinations.\n\nPerhaps as a result, an extraordinary paper, published by a respected medical researcher, which dishes the dirt on 30 years of secret official transcripts, has resurfaced. For those that missed it the first time it is a real eye opener.\n\nWorking with documents released through the Freedom of Information Act, and pertaining to meetings held between 1986-1992, Dr Lucija Tomljenovic, Neural Dynamics Research Group, Dept. of Ophthalmology and Visual Sciences, University of British Columbia, Vancouver, Canada, highlights some shocking minutes of meetings involving UK government’s Joint Committee on Vaccination and Immunisation (JCVI) and the supposedly independent medical “experts” sitting on them.\n\nThe transcripts, which are not amongst those made publicly available on the JCVI website, show the unethical shenanigans that government health committees get up to behind the locked doors.\n\nIn her strongly worded report Dr Tomljenovic accuses the UK government of misconduct and “Deliberately concealing information from parents for the sole purpose of getting them to comply with an ‘official’ vaccination schedule”.\n\nThe report continues: “Official documents obtained from the UK Department of Health (DH) and the Joint Committee on Vaccination and Immunisation (JCVI) reveal that the British health authorities have been engaging in such practice for the last 30 years, apparently for the sole purpose of protecting the national vaccination program.”\n\nThe 45 page paper entitled The vaccination policy and the Code of Practice of the Joint Committee on Vaccination and Immunisation (JCVI): are they at odds? can be downloaded here.\n\nIt was presented at, and forms part of, the proceedings of The 2011 BSEM Scientific Conference, now published online here.\n\nIn the introduction to her report Dr Tomljenovic pulls no punches:\n\n“Here I present the documentation which appears to show that the JCVI made continuous efforts to withhold critical data on severe adverse reactions and contraindications to vaccinations to both parents and health practitioners in order to reach overall vaccination rates which they deemed were necessary for “herd immunity”, a concept which with regards to vaccination, and contrary to prevalent beliefs, does not rest on solid scientific evidence as will be explained.”\n\n“As a result of such vaccination policy promoted by the JCVI and the DH,” writes Dr Tomljenovic “many children have been vaccinated without their parents being disclosed the critical information about demonstrated risks of serious adverse reactions, one that the JCVI appeared to have been fully aware of.\n\n“It would also appear that, by withholding this information, the JCVI/DH neglected the right of individuals to make an informed consent concerning vaccination. By doing so, the JCVI/DH may have violated not only International Guidelines for Medical Ethics (i.e., Helsinki Declaration and the International Code of Medical Ethics) but also, their own Code of Practice.”\n\n“The transcripts of the JCVI meetings also show that some of the Committee members had extensive ties to pharmaceutical companies and that the JCVI frequently co-operated with vaccine manufacturers on strategies aimed at boosting vaccine uptake. Some of the meetings at which such controversial items were discussed were not intended to be publicly available, as the transcripts were only released later, through the Freedom of Information Act (FOI).\n\n“These particular meetings are denoted in the transcripts as “commercial in confidence”, and reveal a clear and disturbing lack of transparency, as some of the information was removed from the text (i.e., the names of the participants) prior to transcript release under the FOI section at the JCVI website (for example, JCVI CSM/DH (Committee on the Safety of Medicines/Department of Health) Joint Committee on Adverse Reactions Minutes 1986-1992).”\n\nShe goes on to accuse the JCVI of several things:\n• Instead of reacting appropriately by re-examining existing vaccination policies when safety concerns over specific vaccines were identified by their own investigations, the JCVI either a) took no action, b) skewed or selectively removed unfavourable safety data from public reports and c) made intensive efforts to reassure both the public and the authorities in the safety of respective vaccines;\n• Significantly restricted contraindication to vaccination criteria in order to increase vaccination rates despite outstanding and unresolved safety issues;\n• On multiple occasions requested from vaccine manufacturers to make specific amendments to their data sheets, when these were in conflict with JCVI’s official advices on immunisations;\n• Persistently relied on methodologically dubious studies, while dismissing independent research, to promote vaccine policies;\n• Promoted and elaborated a plan for introducing new vaccines of questionable efficacy and safety into the routine paediatric schedule, on the assumption that the licenses would eventually be granted;\n• Deliberately took advantage of parents’ trust and lack of relevant knowledge on vaccinations in order to promote a scientifically unsupported immunisation program which could put certain children at risk of severe long-term neurological damage.\n\nLack of transparency, too much power\n\nThe JCVI has a troubling history over safety issues and in particular over its refusal to be transparent about the sources of information upon which it makes crucial decisions about public health. The JCVI, does not just direct policy with regard to childhood vaccinations, it oversees vaccines of all kinds.\n\nMore disturbing is the fact that this committee appears to be no longer answerable to the government but vice versa, placing an “Obligation on the Secretary of State to ensure implementation of JCVI recommendations“.\n\nAs one correspondent wrote recently in the British Medical Journal, in response to a critique of the JCVI’s decision to push the flu vaccine on children as young as 2: “While it remains constitutionally dubious whether parliament can abrogate its authority in such a way, the continuing prostration of government before this body deserves public scrutiny and scepticism.”\n\nDr Tomljenovic’s paper has received renewed attention in part because of recent stories of compensation paid to families of vaccine damaged children.\n\nAlso earlier this month the official US Centers for Disease Control and Prevention (CDC) Immunization Schedules were released, recommending a relentless 29 vaccines be given between birth and six years of age, including yearly flu shots, as well as another 5 to 16 vaccines between ages seven and 18. In the UK the vaccination schedule includes a minimum of 31 doses of vaccine given individually or in combination between birth and the age of 18.\n\nThis week yet another new vaccine the menningitis B has just been approved in the EU. The UK is now deliberating about whether to include it in the vaccination schedule for children as young as 2 months.\n\nFor parents concerned about possible vaccination adverse effects the lack of transparency – and possible deception and misconduct of government bodies over the safety of vaccines is disturbing.\n\nIt is not entirely clear whether it is the active ingredients in the vaccine or the adjuvants – substances added to the vaccine to increase the body’s immune response to the vaccine – which may have the most deleterious health effects. In the past these adjuvants, which can also act as preservatives, included substances such as mercury, but today they are more likely to be based on ‘safer’ aluminium salts.\n\nDr Tomljenovic’s presentation to the BSEM came not long after the publication of her study, published in February 2012 in the peer-reviewed journal Lupus, on the health effects of on aluminium vaccine adjuvants.\n\n“Experimental evidence also shows that simultaneous administration of as little as two to three immune adjuvants can overcome genetic resistance to autoimmunity. In some developed countries, by the time children are 4 to 6 years old, they will have received a total of 126 antigenic compounds along with high amounts of aluminum (Al) adjuvants through routine vaccinations.\n\n“According to the US Food and Drug Administration, safety assessments for vaccines have often not included appropriate toxicity studies because vaccines have not been viewed as inherently toxic. Taken together, these observations raise plausible concerns about the overall safety of current childhood vaccination programs.”\n\nDr Tomljenovic and her co author Chris Shaw PhD of the University of British Columbia believe their study: “…confirms that immune challenges during early development, including those vaccine-induced, can lead to permanent detrimental alterations of the brain and immune system function.”\n\nThey conclude that “A more rigorous evaluation of potential vaccine-related adverse health impacts in pediatric populations than what has been provided to date is urgently needed.”\n\nMany parents trying to negotiate their way through the tricky issue of vaccination would probably agree.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Vaccine hazards - what the UK government hid and ignored", "url": "https://www.naturalhealthnews.uk/article/vaccine-hazards-what-the-uk-government-hid-and-ignored/", "type": "article", "description": "An extraordinary paper published by a respected medical researcher has dished the dirt on decades of vaccine deception", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/01/practice_directions_right-e1359030021213.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://webarchive.nationalarchives.gov.uk/+/www.dh.gov.uk/en/FreedomOfInformation/Freedomofinformationpublicationschemefeedback/FOIreleases/DH_4135306", "http://www.dh.gov.uk/ab/DH_095169", "http://www.ecomed.org.uk/wp-content/uploads/2011/09/3-tomljenovic.pdf", "http://www.ecomed.org.uk/publications/the-health-hazards-of-disease-prevention", "http://www.wma.net/en/30publications/10policies/b3/", "http://www.dh.gov.uk/prod_consum_dh/groups/dh_digitalassets/@dh/@ab/documents/digitalasset/dh_115363.pdf", "http://www.dh.gov.uk/en/FreedomOfInformation/Freedomofinformationpublicationschemefeedback/FOIreleases/DH_4135306", "http://www.bmj.com/content/345/bmj.e5313", "http://www.legislation.gov.uk/uksi/2009/38/contents/made", "http://www.bmj.com/content/345/bmj.e5313/rr/599453", "https://www.naturalhealthnews.uk/chemicals-2/2013/01/california-family-awarded-nearly-1-million-for-mmr-damaged-child/", "http://www.cdc.gov/vaccines/schedules/", "http://www.nhs.uk/Planners/vaccinations/Pages/Vaccinationchecklist.aspx", "http://www.bbc.co.uk/news/health-21140285", "http://lup.sagepub.com/content/21/2/223"], "authors": [], "publish_date": null}