{"result_id": "355022", "URL": "https://www.naturalhealthnews.uk/vaccines/2013/09/uk-government-accepts-swine-flu-vaccine-caused-narcolepsy-in-children/", "timestamp": "2023-04-25 18:22:04 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/vaccines/2013/09/uk-government-accepts-swine-flu-vaccine-caused-narcolepsy-in-children/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "UK government accepts swine flu vaccine caused narcolepsy in children", "cleaned_text": "Natural Health News — In a surprising move the UK government has reversed a previous decision regarding the Pandemrix vaccine for swine flu and its link to narcolepsy, a serious sleep disorder.\n\nEarlier this year we reported that nearly 800 children in Europe have developed narcolepsy, an incurable sleep disorder, after being immunised with the Pandemrix H1N1 swine flu vaccine, produced by the British drug firm, GlaxoSmithKline (GSK), in 2009 and 2010.\n\nBut according to a report in the Guardian newspaper:\n\n“The Department for Work and Pensions (DWP) has contacted people turned down for compensation last year to explain that, after a review of fresh evidence, it now accepts the vaccine can cause the condition. The move leaves the government open to compensation claims from around 100 people in Britain, and substantial legal fees if a group action drawn up by solicitors is successful.”\n\nThe paper further reports that:\n\n“The government U-turn follows a major study of four- to 18-year-olds by the Health Protection Agency which found that around one in every 55,000 jabs was associated with narcolepsy. A spokesman for [vaccine maker] GSK said it had details of around 900 people from 14 countries who had narcolepsy and were vaccinated.”\n\nThe study appeared in the British Medical Journal earlier this year.\n\nAfter the global outbreak of swine flu – the H1N1 strain of the virus – in 2009, some 30million people across Europe were given the vaccine Pandemrix including 6m in Britain.\n\nBut its safety was questioned by health officials in Finland, where more than 300 cases of narcolepsy have now been reported in people vaccinated with Pandemrix.\n\nIn July 2011 the European Medicine Agency advised that, as a precautionary measure, the vaccine should only be given to the under-20s if they are at risk of contracting swine flu and alternative jabs are not available.\n\nIts analysis found that for every 100,000 adolescents who are given the injection, up to seven are likely to develop narcolepsy.\n\nThat same year scientists at Stanford medicine school in California which claimed that it was the swine flu itself and not the vaccine that was responsible for a rise in cases of narcolepsy a claim which seems to hold very little water.\n\nThere has since been a great deal of vacillating on an issue for which evidence is steadily accumulating.\n\nEarlier this year, a comprehensive report from the Reuters news agency, revealed spikes in narcolepsy cases are also surfacing in Finland, Norway, Ireland, France and Sweden.\n\nAccording to the Guardian a confidential letter, which the newspaper has seen, confirms that the UK’s welfare minister, Iain Duncan Smith, will announce the reversal in October.\n\n“It has been accepted that, on the balance of probability, vaccination has contributed to … disablement,” the letter says.\n\nNarcolepsy is the serious and incurable sleep disorder which causes nightmares, hallucinations, sleep paralysis and episodes of cataplexy, a condition which occurs when strong emotions trigger a sudden and dramatic loss of muscle strength.\n\nIn spite of this, the DWP denies that any disability caused by Pandemrix is severe enough to qualify for statutory compensation, a £120,000 tax-free lump sum. Those the DWP has contacted are invited to respond with their claims within three weeks.\n\nSolicitors representing those affected by the vaccine disagree and say nearly all of the 100 people in the UK who have been harmed by the vaccine qualify for compensation and that damages could reach up to £1 million per person.\n\nThe group action will be brought against GSK, but say the solicitors, the drug company had an indemnity clause in its contract to provide the vaccine which means the UK government will ultimately foot the bill.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "UK government accepts swine flu vaccine caused narcolepsy in children", "url": "https://www.naturalhealthnews.uk/vaccines/2013/09/uk-government-accepts-swine-flu-vaccine-caused-narcolepsy-in-children/", "type": "article", "description": "Confidential documents show UK government could be footing the bill for numerous claims for compensation arising from health damage caused by the swine flu vaccine", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/09/swine-flu-jab-linked-to-narcolepsy-310x415.jpg", "article:published_time": "2013-09-24T09:00:01+01:00", "article:modified_time": "2013-10-09T13:16:22+01:00", "updated_time": "2013-10-09T13:16:22+01:00", "article:section": "Vaccines"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.naturalhealthnews.uk/children-2/2013/01/swine-flu-vaccine-damage-no-one-wants-to-be-the-next-wakefield/", "http://www.theguardian.com/society/2013/sep/19/swine-flu-vaccine-narcolepsy-uk", "http://www.bmj.com/content/346/bmj.f794#aff-3", "http://www.ema.europa.eu/docs/en_GB/document_library/Press_release/2011/07/WC500109182.pdf", "http://onlinelibrary.wiley.com/doi/10.1002/ana.22587/abstract;jsessionid=961657810B222C7CD21BDE27106D74D6.d02t02?systemMessage=Wiley+Online+Library+will+be+unavailable+for+approximately+4+hours+between+09%3A00+EDT+and+14%3A00+EDT+on+Saturday%2C+28+September+2013+as+we+make+upgrades+to+improve+our+services+to+you.+There+will+also+be+some+delays+to+online+publishing+between+25+to+28+September+2013.+We+apologize+for+the+inconvenience+and+appreciate+your+patience.+Thank+you+for+using+Wiley+Online+Library%21", "http://www.reuters.com/article/2013/01/22/us-narcolepsy-vaccine-pandemrix-idUSBRE90L07H20130122", "http://www.hja.net/legal-news/hja-news/swine-flu-vaccine.aspx"], "authors": [], "publish_date": "2013-09-24T09:00:01+01:00"}