{"result_id": "355021", "URL": "https://www.naturalhealthnews.uk/article/the-autism-and-allergy-overlap/", "timestamp": "2023-04-25 18:22:03 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/the-autism-and-allergy-overlap/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "The autism and allergy overlap", "cleaned_text": "The food allergy and autism communities generally seen as separate groups have more in common than they may realize.\n\nOne has only to look at the meteoric rise of both epidemics in the last 20 years to wonder if they are connected. In fact, I contend that they are the same story with the same causes and overlapping symptoms but with different outcomes. It is as though one overwhelmed child turned left while the other turned right.\n\nChildren with life threatening food allergies often have a “mixed bag” of health concerns that can include ADHD, environmental sensitivities and gut inflammation. Typically, parents of these children pay such close attention to the food anaphylaxis that these “lesser” issues are often dismissed or medicated away. And yet, if we view this mixed bag as a collection of meaningful symptoms, a very different picture emerges. This picture mirrors that of many children on the spectrum.\n\nIn ‘The Function of Allergy: an immunological defense against toxins’ (1991) [i], Margie Profet confirms that any mammal overwhelmed and unable to detoxify will defend itself with allergy. This evolved defense is designed to expel the toxin(s) as fast as possible by sneezing, vomiting, itching or to prevent it from circulating by a drop in blood pressure.\n\nToxic exposures – any combination from air, food, water, drugs, pathogens, or vaccines – that precipitate the allergies can also result in a host of other health issues. The so-called “neuro-typical” (NT) kids with severe food allergies are not NT at all if we ask additional questions about fine or gross motor skills, unusual “gifts”, attention deficit, rage, sensory processing issues, hyperactivity and more.\n\nBy illuminating the ground shared by the food allergy kids and children on the spectrum, a broader collective awareness may emerge. This awareness will bring greater pressure to bear on addressing causes and forcing change.\n\nLike the word “autism”, allergy and anaphylaxis were coined early in the 20th century. These last two were created to describe reactions to sera administered for the first time in history using the hypodermic syringe. When children began to fall violently ill following the use of this new technology, doctors scrambled to understand why.\n\nPediatrician Clemens von Pirquet in 1906 saw the symptoms as an “altered reactivity” or allergy. Anaphylaxis “against protection” was coined by Charles Richet around 1913 to describe the condition he created in animals during immunization experiments.\n\nAutism was coined by a Swiss psychiatrist in 1912 and Asperger’s after the work of Hans Asperger in the 1930s. Leo Kanner in the 1940s provided a foundation for understanding the environmental causes of autism.\n\nFood allergies and autism in children increased slowly until about 1990 at which time their prevalence abruptly accelerated.\n\nThe first wave of affected children\n\nIt seemed to happen almost overnight about 20 years ago. Something changed suddenly at the same time in many Western countries to make scores of children terribly unwell:\n• Food anaphylaxis: severe food allergy increased abruptly in children, but just in certain Western countries including Australia (ACT), the US, Canada, and the UK. School teachers provided eye witness accounts of the sudden surge of severely allergic children who arrived for kindergarten in the early 90s. The timing is confirmed by hospital ER records. UK cohort studies indicated that peanut allergy in preschoolers had doubled in just four years through the early 1990s, from about 1% to over 3%.\n• Autism: in the early 1990s, increasing reports of autism alerted the US Centers for Disease Control and Prevention (CDC). One startling report of a “cluster” of autism in Brick Township, New Jersey drew the attention of the CDC in 1997.[ii] Children born in the late 1980s and early 90s were most affected. A steep increase in autism was noted at this time also in the UK, Canada, and Australia.\n\nThis was the beginning of what are now epidemics of life threatening food allergies and autism. In the US, one in 13 children (8%) have food allergies with one in 40 (2.5%, 1.8 million) being life threatening. Childhood peanut/tree nut allergies tripled between 1997 and 2008 from .6% to 2.1%.[iii] There has been a 265% rise in food allergy hospitalization among children (CDC).\n\nAutism has spiked 1,500% in the last 20 years. One in 88 children is on the spectrum: 825,000 in the US; 89,000 in Canada; 131,000 in the UK.\n\nMany severely food allergic children have atopy—allergies causing eczema, asthma and behavior issues. Food allergies are the main causes of ADHD according to a 2001 study in the Lancet.[iv] The opiate effect of dairy and wheat proteins on some children is well documented. Unrecognized allergies to chemicals, molds and more can also cause behavioral changes.\n\nIt is not known how many children on the spectrum have severe allergy, but most avoid certain foods that make other symptoms worse. The worst of these according to Kenneth Bock, MD in ‘Healing the New Childhood Epidemics‘ (2007) are dairy, chocolate, yeast-growing foods, gluten and casein.\n\nIn ‘Allergies and Autism‘ (2010), Michael Dochniak tells the story of a boy with multiple allergies who regressed after an anaphylactic reaction to latex. The role of allergy in autism can be profound and individual.\n\nAllergy and anaphylaxis function to defend the body against acute toxicity. The body may risk death to defend itself against perceived certain death.\n\nChildren on the spectrum can exhibit defensiveness. Cari Neal in ‘Tactile Defensiveness and Patterns of Social Behavior in Autism’ (1997)[v] explains that social withdrawal functions to limit tactile stimulation. Temple Grandin, quoted by Neal, confirms that for her, withdrawal is a defense from a “tidal wave of stimulation.”\n\nIn 1944, Hans Asperger believed that girls were unaffected by the syndrome he described although he later revised his conclusion. The gender gap is as high as 10:1 for Asperger’s, and 4:1 for autism. In 1964, Bernard Rimland observed that boys tended to be more vulnerable to “organic damage” than girls.\n\nStudies on peanut allergic children reveal that twice as many boys have the condition than do girls.\n\nMany parents see the 18 month mark or before the age of two as a point of change or regression for children on the autism spectrum.\n\nThe general age of onset for life threatening peanut allergy (the first reaction) has been declining: from 24 months of age for kids born between 1995 and 1997; 21 months for those born before 2000; and for those after 2000, it is now about 14 months of age.\n\nSince Charles Richet’s 1913 Nobel Prize winning research, allergists have defaulted to the idea that food allergy is caused by digestive failure, or a “leaky” gut. Or it was, until the explosion of food anaphylaxis in children starting around 1990. It seemed impossible that gut failure could occur on such a scale and so suddenly.\n\nThe gut is integral to the immune system and the brain. Also called the “second brain” because it is connected by millions of neurons to the central nervous system, the gut will react immediately when challenged by toxin or trauma:\n\nIn cases of extreme stress … the higher brain seems to protect the gut by sending signals to immunological mast cells in the plexus. The mast cells secrete histamine, prostaglandin and other agents that help produce inflammation. This is protective. By inflaming the gut, the brain is priming the [it] for surveillance.[vi]\n\nThe bystander effect occurs when compounds in the body/gut at the time or moment of the extreme stress become targets for allergic sensitization.\n\nAnd it goes without explanation that children on the spectrum struggle greatly with gut inflammation. What could have the power to provoke this so early in the lives of hundreds of thousands of children?\n\nMany following allergy and autism debates believe that both epidemics are man-made. And the medical community appears ready at last to consider this within the “hygiene hypothesis”:\n\n“The leading theory is about hygiene – with less infection thanks to city living, smaller families, vaccines, sanitation, antibiotics, etc., the immune system is less ‘busy’ with germs and may become more prone to attack harmless food proteins.” – Dr. Scott Sicherer, pediatrics professor at Mount Sinai School of Medicine, New York (Sept. 12, 2012).[vii]\n\nThe hygiene hypothesis suggests that vaccination, antibiotics and bug-killing products have unhinged the immune systems of children. Humans have co-evolved with microbes and gut parasites/worms, and without them are vulnerable to inflammatory disorders. Our bug-free, vaccine obsessed, pesticide loving Western existence appears to have doomed us to allergy and autism.\n\nYes, the hygiene hypothesis has entered the discussion on causes of autism. A 2007 Medical Hypotheses article by K. Becker suggests that immune pathways affected by western hygienic practices may impact brain structure or function contributing to autism. Becker mentions “immunization” in this light but in confessing its “controversial” nature does not pursue it.\n\nClarifying the matter is historical fact. The abrupt rise of allergy and autism around 1990 coincided with reforms to the pediatric vaccination schedules of many Western countries.\n\nIn 1986, the US National Childhood Vaccine Injury Act in essence de-regulated vaccination: no one could sue a vaccine maker without government approval. Largely relieved then of liability, manufacturers moved to meet government demand addressing new “diseases of priority” established by the US Institute of Medicine.\n\nIncreases to the vaccine schedule in many Western countries began in 1987 with the Haemophilus influenza type B (Hib) vaccine. By 1991, doctors did not hesitate to give this new conjugate vaccine to two-month-old children simultaneously with vaccines for diphtheria, tetanus, pertussis, and polio. This move was unprecedented. In that year, more than 17 million doses of Hib vaccine were sold in the US alone. In 1992, additional doses of combination vaccines were included in the schedule. Hib was a revenue-generating “blockbuster product” according to a 1998 WHO publication.\n\nAt the same time, coverage rates for vaccination soared. Between 1993 and 1995, the Clinton administration’s Childhood Immunization Initiative provided federal funds aimed at 90% coverage of all infants. Vaccination became a requirement before entry into many preschools and daycare centers. By 1997-98, childhood vaccination rates reached record highs. Canada, the UK, and AU followed the American example.\n\nIn 1983, US children received 22 doses of vaccines (combined or single) for seven diseases (two months to age six). Today in the US, children receive up to 48 doses of vaccines for 14 diseases starting at birth to age six.\n\nThe Hib, within an intense schedule that includes five-vaccines-at-once, has been the last straw in my opinion, tipping scores of children into peanut allergy.\n\nWhere the DPT-IPV with Hib is used en masse, peanut allergy follows: first in Western countries including the UK, the US, Canada, and ACT Australia, then after 2001 following its use with high coverage rates in Tasmania, Hong Kong, Singapore and most recently India.[viii]\n\nHib plays a role in autism according to Brian Richmand in ‘Hypothesis, Conjugate vaccines may predispose children to autism spectrum disorders’. Richmand suggests that the five-in-one with Hib has interfered with nerve myelin in the brain:\n\nThis period of hypo-responsiveness to carbohydrate antigens coincides with the intense myelination process in infants and young children, and conjugate vaccines may have disrupted evolutionary forces that favored early brain development over the need to protect infants and young children from capsular bacteria. [ix]\n\nRichmand further suggests that girls who received this vaccine carry antibodies that have the potential to damage nerve myelin and result in autism in their children.\n\nIn ‘Save the children (and make money)’, published in The Wall Street Journal (2009), writer James Altucher noted the massive rise in the last two decades in peanut allergy, asthma and more among children. The kids are sick and getting sicker, Altucher observed. So, he thought an “Autoimmune Index” would be a good idea:\n\nSuch an index would consist of the best mix of stocks that have good lower multiples that will supply the arms in our ongoing war against autoimmune diseases.[x]\n\nAltucher lists the drugs created for these conditions, their manufacturers, the status of their stocks and their billion dollar profits. And then without slowing he offers possible causes for the pediatric epidemics:\n\nThe increase in autoimmune illnesses and allergies in children may be due to high exposure to antibiotics and vaccines at an early age…\n\nAre the products causing the epidemics made by the same companies now making the remedies? It seems investors can make money at both ends of the epidemics.\n\nThe century old pattern of increasing drug and vaccine consumption in Western countries has meant profit for some but devastation for many more. The autism community is aware of the conflicted interests that underpin this pattern and the autism epidemic. And parents of anaphylactic children are listening.\n\nThe stories of autism and life threatening food allergy are the same, with shared causes and overlapping symptoms. The “mixed bag” kids with life threatening food allergy are a mirror that, as dark as it is, brings with it millions of families equally worried about the health of their children.\n\nWith a growing awareness of the ground these communities share, my hope is that they will connect meaningfully to force change leading to prevention of these serious – and altogether avoidable – health issues.\n\n[i] Profet M, The function of allergy: immunological defense against toxins, Quarterly Review of Biology. 1991 Mar; 66(1):23-62. http://www.ncbi.nlm.nih.gov/pubmed/2052671\n\n[ii] Blaxill M and Olmsted D, Age of Autism (New York: Thomas Dunne, 2010).\n\n[iii] Sicherer SHet al, US prevalence of self-reported peanut, tree nut and sesame allergy: 11-year follow-up, Journal of Allergy and Clinical Immunology, 2010; 125(6): 1322-26. http://www.ncbi.nlm.nih.gov/pubmed/20462634\n\n[iv] Pelsser L et al, Effects of a restricted elimination diet on the behaviour of children with attention-deficit hyperactivity disorder (INCA study): a randomized controlled trial, Lancet, 2011; (377): 494-503. http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(10)62227-1/abstract\n\n[v] Neal C, “Tactile Defensiveness and Patterns of Social Behavior in Autism,” (Illinois: Wesleyan University, 1997). http://digitalcommons.iwu.edu/psych_honproj/66/\n\n[vii] Reuters News report, Peanut allergies seen on the rise, September 12, 2012. http://www.foxnews.com/health/2012/09/12/peanut-allergies-seen-on-rise/#ixzz28eyzSyF7\n\n[x] Altucher J, Save the children (and make money), The Wall Street Journal, August 10, 2009. http://online.wsj.com/article/SB124992390387319939.html\n• Heather Fraser is the author of The Peanut Allergy Epidemic: what’s causing it and how to stop it (NY, Skyhorse, 2011). She is a Toronto-based writer and holistic health practitioner. Her son, now 18, was diagnosed with peanut allergy in 1995. Find out more at heatherfraser.org and peanutallergyepidemic.com.\n\nReprinted with permission from the Autism File www.autismfile.com", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "The autism and allergy overlap", "url": "https://www.naturalhealthnews.uk/article/the-autism-and-allergy-overlap/", "type": "article", "description": "Autism Spectrum Disorder and food allergy rates have risen dramatically - and they often go hand in hand. Could widespread vaccination be the link?", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/03/peanuts.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["https://www.naturalhealthnews.uk/wp-content/uploads/2013/03/allergy1.jpg", "https://www.naturalhealthnews.uk/wp-content/uploads/2013/03/allergy2.jpg", "http://www.amazon.co.uk/dp/0345494512/ref=asc_df_034549451212363001?smid=A3P5ROKL5A1OLE&tag=hydra0b-21&linkCode=asn&creative=22206&creativeASIN=0345494512&hvpos=1o1&hvexid=&hvnetw=g&hvrand=3303797161925433537&hvpone=&hvptwo=&hvqmt=", "http://www.amazon.co.uk/Allergies-Autism-Infectious-Diseases/dp/1608763528/ref=la_B002P9CA2K_1_1?ie=UTF8&qid=1363247650&sr=1-1", "https://www.naturalhealthnews.uk/wp-content/uploads/2013/03/allergy3.png", "http://www.ncbi.nlm.nih.gov/pubmed/2052671", "http://www.ncbi.nlm.nih.gov/pubmed/20462634", "http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(10)62227-1/abstract", "http://digitalcommons.iwu.edu/psych_honproj/66/", "http://www.psyking.net/id36.htm", "http://www.foxnews.com/health/2012/09/12/peanut-allergies-seen-on-rise/#ixzz28eyzSyF7", "http://www.ncbi.nlm.nih.gov/pubmed/21993250", "http://online.wsj.com/article/SB124992390387319939.html", "http://www.heatherfraser.org", "http://peanutallergyepidemic.com", "http://www.autismfile.com/"], "authors": [], "publish_date": null}