{"result_id": "355010", "URL": "https://www.naturalhealthnews.uk/article/the-great-flu-vaccine-swindle/", "timestamp": "2023-04-25 18:21:51 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/the-great-flu-vaccine-swindle/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "The great flu vaccine swindle", "cleaned_text": "You probably saw the story today: scientists have told the UK government to stop ‘over-hyping’ and ‘over-promoting’ the flu vaccine.\n\nBut like good little soldiers most of these same scientists still recommended, according to the story in the Independent newspaper, “getting the jab as it is currently ‘the best we have’” – the implication being that it may still help prevent some deaths from the flu in vulnerable individuals.\n\nFirst of all, the figures for flu deaths are scandalously massaged in favour of vaccine promotion, as I pointed out seven years ago in a comprehensive critique of the flu vaccine.\n\nSecondly, let’s review what an analysis in the British Medical Journal said a few years back about the scientific research that underpins our enthusiasm for the flu vaccine.\n\nThe researchers looked at 259 comparative studies on flu vaccination and found that fewer than 1 in 5 of the studies could actually substantiate the conclusions they made. In other words, rather like the scientists who say in one breath that the flu vaccine is over-hyped and then tell people to go and get one – there is a huge mismatch between what the facts say and what the scientists say.\n\nAccording to the BMJ reviewers: “70% of the studies reported conclusions favourable to the vaccines, but only 18% showed complete concordance between data reported and study conclusions. Over half (56%) of studies were at high risk of bias, with only 4% being at low risk”.\n\nDoctors too busy to challenge the information\n\nGiven the crucial role that published research plays in informing doctors and scientists it is a very big problem indeed that over 80% of these studies were judged not to have “made the case” outlined in their conclusions.\n\nCommenting on the study the Complementary Medical Association, noted that with an estimated 7,287 items relevant to primary care published in these prestigious medical journals every month (studies, letters, and editorials) few healthcare workers have the time – or the skills – to carry out in depth critical appraisals of any of these published articles.\n\nMost doctors in the field rely on a brief – two minute! – scan of material to bring them up-to-date with ‘best practice’ and how to treat their patients. In most cases this means browsing the article’s ‘abstract’ or its ‘conclusions’.\n\nGenerally, the more prestigious the journal, the more trustworthy the findings have always been assumed to be. But when the source of finance for a trial is so deeply influential to its findings – again in spite of what the data actually says – this is an assumption that must be challenged.\n\nThe medical profession – and the media – is no less star struck than most teenagers when it comes to fame and renown. Studies published in these ‘prestigious’ journals get quoted and re-quoted in other scientific journals and at medical conferences as “proof” of the effectiveness of the pharmaceuticals being studied.\n\nMedia outlets use what are known as ‘impact factors’ to judge whether they will cover a medical story or not. The impact factor is a self-reinforcing ratings system whereby a journal’s rating rises according to how often its studies are quoted or referenced the media or other journals. Quality studies in low impact journals – and the recent Séralini study on tumours in GMO fed rats is a good example – often get ignored while sensational lies, which spread around the globe as easily as the flu virus, serve to enhance the impact factor and thereby the reputation of high impact journals.\n\nThankfully this dogma is changing and making those who stick to it look even more foolish than usual.\n\nReturning to the BMJ’s flu vaccine analysis, the authors of the study note that: “Studies partly or completely sponsored by industry, however, were published in more prestigious journals and are probably cited more, although their methodological quality and size were similar. Some of these findings might help to explain the continuation of a near global policy, despite growing doubts as to its scientific basis”.\n\nThe flu vaccine is one of medicine’s biggest swindles and the UK government should be absolutely accountable for the £120 million it squanders each year on its promotion. In the US the figure is thought to run into billions, by the way.\n\nHow about putting some of that money towards making sure everyone has enough nutritious food and adequate housing – the single biggest risk factors for succumbing to an illness like the flu – instead?\n• For suggestions on natural ways of avoiding colds and flu see our article Cold and Flu Prevention – Healthier Alternatives.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "The great flu vaccine swindle", "url": "https://www.naturalhealthnews.uk/article/the-great-flu-vaccine-swindle/", "type": "article", "description": "The flu vaccine is one of medicine's biggest swindles and the UK Government squanders £120 million a year promoting it", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2012/11/flushot.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.independent.co.uk/life-style/health-and-families/health-news/scientists-urge-ministers-tell-truth-on-overhyped-flu-vaccine-8336184.html", "http://theecologist-test.net-genie.co.uk/Investigations/Health/465351/the_flu_vaccine_a_shot_in_the_dark.html", "http://www.bmj.com/content/338/bmj.b354", "http://www.the-cma.org.uk/Articles/Almost-All-%28Flu-Vaccination%29-Studies-in-Prestigious-Medical-Journals-Have-Conclusions-That-Dont-Hold-Up-%28BMJ%29--4792/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC521514/", "http://www.bmj.com/content/319/7206/358.1", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1495716/", "http://www.bmj.com/content/335/7631/1202", "https://www.naturalhealthnews.uk/food/2012/09/multiple-tumours-found-in-rats-fed-on-monsantos-gm-corn/", "http://onlinelibrary.wiley.com/doi/10.1002/asi.22731/abstract", "https://www.naturalhealthnews.uk/article/cold-and-flu-prevention-the-natural-way/"], "authors": [], "publish_date": null}