{"result_id": "355015", "URL": "https://www.naturalhealthnews.uk/article/its-cold-flu-season-be-prepared/", "timestamp": "2023-04-25 18:21:56 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/its-cold-flu-season-be-prepared/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "It's cold & flu season - be prepared!", "cleaned_text": "The change in weather always brings challenges for your immune system, and that challenge often manifests itself as a cold or as a greater susceptibility to getting the flu.\n\nOf course, prevention is always better than cure, but if you get sick, cure is not so bad either.\n\nIn naturopathy as in so many other traditional disciplines, the foundation of prevention and cure is always diet and lifestyle, and I am probably reminding you of those things which you probably already know are “good for you”.\n\nOdds are, you are going to get at least one cold this winter, so I think it is helpful to have a few things on hand to help get back on your feet quickly.\n\nDrink plenty of water In colder weather we drink less water and more coffee and tea that causes more dehydration. Only 3% dehydration leads to a 10% decrease in metabolic efficiency.\n\nAvoid excess Sugar 75g of sugar (the amount in a pint of cola) inhibited the ability of white blood cells to engulf bacteria for 5 hours\n\nAdd garlic and onions (preferably raw) Compounds in the onion family have been shown to kill viruses, bacteria, parasites & yeast but they are more effective when eaten raw… so add a clove of chopped garlic or some chopped raw onion to a prepared soup or vegetables after cooking.\n\nTurbocharged foods for immune function eat regularly foods that are high in A, D, E, C and zinc. So, fish (especially fatty fish like sardines or salmon), oysters, liver (also pâté), beef or lamb, egg yolks, seeds, nuts, dark leafy greens, peppers (hot or sweet), citrus, colourful fruits.\n\nExercise regularly Keep up your normal physical activity and always cool down in a warm room\n\nTake a cold shower No, I am not kidding… Take a normal hot shower but always end with one minute of cold water. The cold water produces a flushing response throughout the body and you actually stay warmer for many hours after. Hint: I find it easiest when I put my head in the cold stream first and then the rest of my body.\n\nSupplements can help support the prevention of colds and flu. These include:\n\nVitamin C buffered with Calcium, Magnesium, Zinc & Potassium: 500 mg per day\n• Zinc Citrate or Picolinate: 15-20mg per day – only 20% of people (and 0% of vegetarians) get the RDA for Zinc in their diet\n• Vitamin D3: 10 mcg or 400 IU per day – too little or too much vitamin D makes us susceptible to viruses so a moderate amount daily is best – just like sunshine (too much vitamin D actually strips calcium from inside cell membranes and makes cells more susceptible to viral infection, especially the herpes family of viruses – this is why many people get a cold sore or herpes outbreak after laying in the sun all day – to prevent this take some additional calcium before sun-bathing)\n\nAll of the prevention measures above are also important in helping you to recover. In addition,but make sure to add:\n\nRest We tend to forget the obvious things, but if exhausted and fighting a cold or flu… rest. Sleep is critical for repair and if you feel horrible sleep can be difficult or impossible. In these cases I think that some over-the-counter pharmaceuticals can be very helpful, like Night Nurse or Benylin Cold & Flu Night. This may make me a heretic Naturopath, but better a rested and healing heretic than a sickly, puritanical, grouchy sick person…\n\nWet sock treatment This may sound like a long lost medieval torture but at the first sign of cold or flu it really works You’ll need:\n\nSoak feet in hot water for 5‐10 minutes, then dry. Wring out cotton socks and put on feet. Pull dry wool socks over the top of the cotton socks. Go to bed with socks on – your feet become VERY hot within a minute and stay hot until dry\n\nChicken soup Warm beverages in general help, but none help quite so much as chicken soup, especially home made. Use cooked rice or rice noodles instead of wheat noodles and add your favourite vegetables. Don’t forget to add the minced raw garlic just before serving.\n\nOnion breathing Chop one yellow onion and place in a small bowl. Drizzle about 1 tbl of honey over the chopped onion. Go to bed and place the bowl as close to your head as safely possible (on night stand or next to your pillow). You will breathe freely all night, but in the morning, you and the whole room will smell like onions! Bonus: In the morning, you’ll have onion‐honey syrup in the bottom of the bowl. Pour off in to a bottle and take a spoonful every few hours. It soothes chest and throat.\n• one cut up organic lemon (rind, seeds, everything) and\n\nAdd enough water to blend. Purée on high for 2‐3 minutes. Strain juice and return to blender. Add ¼ to ½ tsp. cayenne pepper and 1‐3 cloves of minced garlic and ½ tsp. of horseradish. Purée for another minute, then drink. If really ill, you can drink this three times a day. Most people notice a burst of energy 15 minutes after drinking.\n\nSupplements to support getting over colds & flu include higher doses of vitamin C and immune supporting herbs (astragalus, liquorice, atractylodes, siler, isatis, echinacea, etc) are important. Try also:\n• Vitamin A used to be known as the “anti-infection vitamin” before antibiotics were available it has been shown to shorten the duration of many viral infections.up to 15 mg or 50,000 IU twice daily for 1 week only. (WARNING: do not take if you are pregnant, nursing or trying to become pregnant – 3 mg per day is considered the safe limit for pregnancy).\n• Shea butter (available in many health food shops) is great for rubbing into nostrils and on nose, lips or other dry or chapped skin. It supports keeping nasal passages open and helps soothe skin unblocks (from rubbing facial tissues).\n• Elderberry, zinc & vitamin C pastilles can help with sore throat and immune response (available at most health food shops and pharmacies).\n\nThe critical question is, “Do vaccines help prevent influenza?” From all of the scientific evidence available, the answer appears to be…wait for it…wait for it…NO!\n\nThe Cochrane Collaboration (an organisation of over 30,000 volunteers dedicated to evidence‐based medicine) reviewed 50 clinical trials, representing over 70,000 people and their bottom line is that “there is no evidence to support the hypothesis that flu vaccines are useful in otherwise healthy people”.\n\nThere was no difference between vaccinated and non‐vaccinated people in risk for needing hospitalisation or in the number of days needed to be off work due to illness.\n\nThey also observed that only drug company‐funded studies showed benefits from vaccination. Nearly all of the publicly‐funded studies found no benefit whatsoever to the flu vaccine. The review concluded that there “is evidence of widespread manipulation of conclusions and spurious notoriety of the studies”. Perfidy!\n• None This article originally appeared in the October edition of\n• Dr. Michael Culp, MA, NMD is the Director of The Natural Health and Wellness Centre in London, an innovative multi-disciplinary medical clinic specialising in the treatment of chronic diseases and the promotion of optimal wellness.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "It's cold & flu season - be prepared!", "url": "https://www.naturalhealthnews.uk/article/its-cold-flu-season-be-prepared/", "type": "article", "description": "The change in weather always brings challenges for your immune system; here's how to help your body cope", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/10/winter-cold.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://summaries.cochrane.org/CD001269/vaccines-to-prevent-influenza-in-healthy-adults", "http://www.nhwc.co.uk/", "http://www.nhwc.co.uk/"], "authors": [], "publish_date": null}