{"result_id": "355009", "URL": "https://www.naturalhealthnews.uk/children-2/2013/01/survey-shows-unvaccinated-children-get-sick-less-often/", "timestamp": "2023-04-25 18:21:50 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/children-2/2013/01/survey-shows-unvaccinated-children-get-sick-less-often/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Survey shows unvaccinated children get sick less often", "cleaned_text": "Survey shows unvaccinated children get sick less often\n\nNatural Health News — It’s a controversial subject that usually provokes acrimonious arguments, and yet the results of an ongoing German survey suggest that children who are unvaccinated suffer fewer of a whole range of diseases.\n\nThe survey, which currently includes data on around 8,000 unvaccinated children, aged newborn to 19 years, shows vaccinated children have at least 2 to 5 times more diseases and disorders than unvaccinated children.\n\nThe data for unvaccinated children is compared to the national German KIGGS health study of the children in the general population. The complete data and study results are here.\n\nThe data (see chart right), first released in 2011, was collected from parents with vaccine-free children via an internet questionnaire hosted by the group Vaccine Injury and Andreas Bachmair, a German classical homoeopathic practitioner.\n\nThe independent study is self-funded and is not sponsored by any NGO or government health organisation with political and financial conflicts of interest. Bachmair relies on Google ads and donations for revenue.\n\nThe comparisons of the health of vaccine-free children with the health statistics of the general population are considered to be the same as comparing unvaccinated with vaccinated because vaccination is so ubiquitous.\n\nHowever, in response to requests from parents Vaccine Injury have started to collect data on vaccinated children in order to make a more exact comparison with unvaccinated children.\n\nAccording to Bachmair and his supporters, parents of unvaccinated children are obviously concerned about the health risks of vaccines, and are more likely to make other healthier choices such as feeding their children a much better diet and using more natural remedies and using fewer pharmaceuticals. This may introduce some bias into the results. Nevertheless the numbers are astonishing\n\nMost of the respondents to the survey have been from the US where half the US children suffer from chronic diseases and disorders and 15% are developmentally disabled. You’d think it would be to everyone’s advantage to find out what’s going on. Certainly what most children have in common today is a massive load on vaccinations – anywhere from 15-26 doses before their first birthdays\n\nIt seems amazing that no study has ever been done, but vaccine manufacturers have been steadfast in their refusal to fund such work. The only suggestion of a study in this area, that we could find, is a US study at Jackson State University, Alabama – and this study is also soliciting funds from the public to keep going. In the absence of official studies, the ongoing German survey provides valuable information to inform parents’ choices.\n• The German survey is ongoing and you if you have UNVACCINATED children and wish to take part use this link\n• If you have VACCINATED children and you wish to take part please use this link\n\nLet’s shame the public health system and Big Pharma into doing the right thing by our children. Instead of simply parroting the brainless mantra of “vaccines for preventable diseases” it may turn out that we should be having a conversation about how to avoid preventable vaccine-induced diseases.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Survey shows unvaccinated children get sick less often", "url": "https://www.naturalhealthnews.uk/children-2/2013/01/survey-shows-unvaccinated-children-get-sick-less-often/", "type": "article", "description": "An amazing German survey shows that children who are not vaccinated have better overall health than those who are", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/01/Vaccination.jpg", "article:published_time": "2013-01-14T18:31:59+00:00", "article:modified_time": "2013-01-14T18:53:45+00:00", "updated_time": "2013-01-14T18:53:45+00:00", "article:section": "Vaccines"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.vaccineinjury.info/vaccinations-in-general/health-unvaccinated-children/survey-results-illnesses.html", "http://www.vaccineinjury.info/", "https://www.naturalhealthnews.uk/wp-content/uploads/2013/01/Bachmair-Vaccine-Survey-2011.jpg", "http://journal.livingfood.us/2011/05/26/alarming-new-studies-50-of-u-s-children-have-chronic-illnesses-21-developmentally-disabled/", "http://pediatrics.aappublications.org/content/early/2011/05/19/peds.2010-2989.abstract", "http://www.vaccinationcouncil.org/2012/12/03/official-vaccinated-vs-unvaccinated-study-finally-being-done-please-read-and-contribute-suzanne-humphries-md/", "http://www.vaccineinjury.info/vaccinations-in-general/health-unvaccinated-children.html", "http://www.vaccineinjury.info/vaccinations-in-general/health-unvaccinated-children/health-vaccinated-children-survey.html"], "authors": [], "publish_date": "2013-01-14T18:31:59+00:00"}