{"result_id": "355011", "URL": "https://www.naturalhealthnews.uk/article/could-food-glue-additive-trigger-celiac-disease/", "timestamp": "2023-04-25 18:21:52 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/could-food-glue-additive-trigger-celiac-disease/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Could ' food glue' additive trigger celiac disease?", "cleaned_text": "Problems with gluten seem to abound these days. Intolerance, allergy, sensitivity, hypersensitivity. Who has what and how to sort it all out can be complicated.\n\nCeliac disease is an order of magnitude above simple intolerance, however. It is an autoimmune disorder, where gluten triggers the immune system to attack the gut. It is common, lifelong, and can seriously harm health – but nobody knows for sure what causes it.\n\nNow a review in Frontiers in Pediatrics says a common food additive could both cause and trigger these autoimmune attacks, and calls for warnings on food labels pending further tests.\n\nEnvironment causes – but only in some\n\nGluten-free diets have become popular despite little or no evidence of benefit for most people. But for the 1 in 100 with celiac disease, even a mouthful of bread can trigger an immune response that damages the small intestine, impairing nutrient absorption.\n\nExactly what causes this autoimmune reaction to gluten – a protein found in wheat, rye and barley – is uncertain. Specific mutations in an important immunity-related gene called HLA-DQ seem to be necessary for developing celiac disease, with one of two HLA-DQ variants present in virtually every sufferer – but insufficient, as these variants are also present in about 30% of the general population.\n\nAs a result, myriad environmental factors have proposed to interact with genetic risk to cause celiac disease. These span infections, food and toxins; vaccination, drugs and surgery. Most recently, food additives have been suggested to contribute. Among these, microbial transglutaminase – a bacterial enzyme heavily used in industrial processing of meat, dairy, baked and other food products – has emerged as a likely culprit, according to the new review.\n\nMicrobial transglutaminase is a kind of food glue used to improve food texture, palatability and shelf-life of packaged foods. It’s found in everything from cheese and dairy products to processed meats, bakery and bread products and even ‘edible films’. This additive functions like the transglutaminase produced in the body, which is known to be the target of autoimmunity in celiac disease.\n\nThere is a direct positive correlation between rising use of this industrial ‘food glue’ in bakery products and rising incidence of celiac disease in the last four decades, according to Lerner and co-author Dr Matthias Torsten of the Aesku.KIPP Institute, Germany. But if transglutaminase is produced normally in our tissues – and by our own gut microbes – what difference should a little more in our diet make?\n\n“This is mostly a question of scale,” argues co-author Aaron Lerner, visiting professor at the Aesku.Kipp Institute in Germany. “Our own transglutaminase has a different structure to the microbial sort, which allows its activity to be tightly controlled. And while the relatively indiscriminate microbial transglutaminase is produced by some of our normal gut fauna, the amount of the enzyme could be significantly increased when this microbial population is altered by factors like infection, antibiotics or stress – or, indeed, through consumption of industrially processed foods.”\n\nGluten is tough to break down completely. This is useful for helping baked goods to rise and keep their shape, but in celiac sufferers presents a problem.\n\n“The gluten protein fragments or ‘peptides’ that remain after digestion are highly susceptible to transglutaminase, which modifies them to make a variety of new peptides” Lerner explains.\n\n“These unusual peptides are particularly likely to resist further breakdown, and to be recognized as ‘foreign’ by HLA-DQ immune receptors inside the gut wall – but only in those carrying the HLA-DQ variants associated with celiac disease.”\n\nCompounding this, components of gluten also loosen the connections between cells lining the gut, allowing more gluten-derived proteins – as well as microbial transglutaminase – to breach this barrier and interact with immune cells.\n\n“Microbial transglutaminase itself could also increase intestinal permeability by directly modifying proteins that hold together the intestinal barrier,” adds Lerner.\n\nThis all begs the question: if it is gluten-derived proteins that stimulate immune cells, why does the immune response target transglutaminase? And are microbial and human transglutaminase recognized interchangeably by the immune system?\n\n“In one of our own studies, we tested antibodies from the blood of celiac patients. We found that more antibodies were active against complexes of transglutaminase bound to gluten fragments, than against either component alone. The anti-complex antibody count was also the best predictor of intestinal damage in these patients. This was true of both microbial and human transglutaminase complexes, for which there were similar antibody counts.”\n\nIn other words, microbial transglutaminase (bound to gluten fragments) could in fact be the target of the immune response in celiac disease – and the attack on our own transglutaminase merely a case of mistaken identity.\n\nMicrobial transglutaminase present in processed foods is a potential environmental cause of celiac disease. But according to Lerner, the jury is still out on how influential it is.\n\n“Ultimately all we have so far are associations between microbial transglutaminase and celiac disease. To test whether this enzyme causes or triggers immune damage in celiac disease will require experimenting with exposure in animal models, intestinal cell lines or biopsies.”\n\nNevertheless, with no known cure for celiac disease, treatment depends on preventive measures – namely, adhering to a gluten-free diet.\n\n“Until there is a clearer answer, we recommend transparency and vigilance with regards to labelling of foods processed using microbial transglutaminase.”\n\nIn Switzerland for example, such products must be labelled as unsuitable for persons with celiac disease.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Could ' food glue' additive trigger celiac disease?", "url": "https://www.naturalhealthnews.uk/article/could-food-glue-additive-trigger-celiac-disease/", "type": "article", "description": "Microbial transglutaminase - a kind of 'food glue' used in processed foods could trigger celiac disease in some sensitive individuals.", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2019/01/bigstock-Gluten-Intolerance-Concept-Yo-232645732.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["https://www.frontiersin.org/articles/10.3389/fped.2018.00389/full"], "authors": [], "publish_date": null}