{"result_id": "355002", "URL": "https://www.naturalhealthnews.uk/article/breastfeeding-multiple-benefits-for-your-baby/", "timestamp": "2023-04-25 18:21:42 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/breastfeeding-multiple-benefits-for-your-baby/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Breastfeeding – multiple benefits for your baby", "cleaned_text": "Just as your baby relied upon you for protection in the womb, she will rely upon you for some time to come for protection outside the womb.\n\nThe first and most important step in providing this protection is to breastfeeding for as long as possible.\n\nNo matter what formula manufacturers claim, no matter how healthy the baby in the magazine ad looks, and no matter how much some would like to believe it, artificial milk cannot provide anywhere near the full range of short- and long- term advantages that breast milk does.\n\nBreast milk is economical, always the right temperature and always ‘on tap’ and while you are breastfeeding your baby you are providing, among other things:\n• Good bacteria – bifidus growth factor is a helpful organism that guards against intestinal infection by discouraging the growth of yeast, bacteria and parasites in the intestinal tract. Bifidus can not grow in the intestines of formula fed babies.\n• Essential fatty acids – necessary for proper brain development and useful for killing off parasites such as Giardia lamblia a common cause of diarrhoea in infants.\n• Antioxidants – breast milk contains the full range to help your baby fight off infection and the effects of pollution. Breastmilk is also high in nutrients such as zinc, selenium and taurine as well as immune boosting chemicals such as immunoglobulins and interferon.\n• Immunity to several diseases that babies are routinely vaccinated against.\n• A better chance of survival for low birth weight and premature babies.\n• Reduced risk of gastrointestinal infections such as diarrhoea as well as protection against other illnesses such as intestinal tract infections, ear infections, colic and food allergies.\n• The building blocks for better intelligence. By the age of three months the IQ of babies who are breastfed is 3 points higher than formula fed babies. By six months the IQ of breastfed babies can be anywhere from 6 to 10 points higher. Breastfed babies also show better hand-eye coordination, visual development, language and social skills.\n• Natural birth control. If you are feeding in an unrestricted way you should not get pregnant during the six months after birth.\n\nVery often difficulties in breastfeeding are the result of healthcare providers’ failure to inform and, most importantly, support a new mother and her baby with breastfeeding-friendly practices. It’s not because of some physiological dysfunction. Other times women give up because they do not get the support form their families or partners that they need. Given support, the vast majority of mothers (more than 90%) can breastfeed without problems.\n\nEven with support not all women get breastfeeding ‘right’ the first time or even all the time. If problems persist the mother is sometimes told she is suffering from Insufficient Milk Syndrome.\n\nWhat few women realise is that there is no such thing as Insufficient Milk Syndrome – formula manufacturers dreamed up this advertising concept more than 20 years ago to boost sales.\n\nA woman’s body makes milk according to the baby’s demand. Filling your baby up with fluids and other foods this will decrease the baby’s demands on you and thus your milk supply.\n\nIf you follow traditional advice and “feed like a gypsy” (in other words as and when your baby demands) especially in the early days, you can’t go wrong. Your baby will naturally feed until it has what it needs.\n\nEnvironmental toxins are very often lipophlic, or ‘fat loving’. This means they tend to build up in the body’s fatty tissue. Since breasts have a high amount of fatty tissue these toxins can accumulate in the breast and from there be released into breast milk.\n\nThere has been a great deal press recently about toxins in breastmilk. Women who are considering breastfeeding their children have rightly expressed concern that the benefits of breastmilk may be negated by the presence of harmful chemical such as dioxins and PCBs.\n\nAccording to survey for World Health Organization (WHO) survey, published in the British Medical Journal, the “safe” daily intake of dioxins and PCBs is around 10pg per kg of bodyweight. Among breastfed infants the daily estimated intake of these chemicals is around 170 (picograms) pg per kg of bodyweight at two months and 39 pg at 10 months. Even so studies show that breastfed infants are not affected in the same way by these chemicals as their bottle-fed counterparts.\n\nSo how can we know that breastmilk is safe? Thankfully this is an area which has been studied, the conclusion being that while prenatal exposure to these levels of toxins has a definite negative effect on a baby’s health and development, exposure via breastmilk did not have the same dramatic effect.\n\nIn fact for babies affected by PCB exposure in the womb – which many scientists believe is the most damaging exposure – breastfeeding provides protection from neurological damage.\n\nThis does not mean that the issue of contaminated breastmilk is not a serious issue – it is. But along with contaminants, breastmilk has constituents which help fight toxic overload. The overwhelming opinion paediatricians and child health experts is that the benefits of breastfeeding still far outweigh the potential risk of ingesting chemicals.\n\nRemember also that a baby formula made with conventional tap water is likely to contain many harmful chemicals and heavy metals without conferring even a minute proportion of the benefits which breast milk has.\n\nHowever if you are still worried here are some things you can do to keep toxins out of your breast milk:\n• Adopt an organic lifestyle. If you don’t have pesticides in your body they cannot be transferred to you baby via your breastmilk.\n• Reduce your exposure to common household pollutants such as cleaners, disinfectants and toiletries. The chemicals in these can be inhaled and also quickly absorbed through your skin. When you can’t avoid using conventional household cleaners always wear rubber gloves and open a window to minimise exposure.\n• Don’t diet or fast while breastfeeding. Most toxic chemicals are stored in fat. These poisons are released in great numbers when you begin to lose fat and can accumulate in your bloodstream and breastmilk. Full time breastfeeding burns about 250 calories a day – the equivalent of a three-mile run. The longer a woman breastfeeds the less contaminated her milk can become. Breastfeeding uses up calories (i.e. burns up fat) and as toxic fat is burned up, this is replaced by non-toxic fat. Following an organic diet will help this process enormously.\n• Work some regular physical activity into your schedule. Some form of aerobic exercise can aid the release of toxins (via sweat) from your system. Another good way to rid your body of toxins is through regular deep breathing used in yoga and some forms of meditation or through a regular sauna.\n• Remember, everything you put in your body will get into your breastmilk. So limit or avoid casual use of medicines, caffeine, alcohol and foods with additives such as colourings, aromas, flavourings, MSG and aspartame. Each of these can have a dramatic effect on your baby’s developing immune system.\n• Once a week have a soak in a bath with epsom salts. This old fashioned remedy for aches and pains is also good for gently encouraging the release of toxins through the skin. Add a few drops of essential oils for a really pleasant bathtime.\n\nIf you choose to bottlefeed\n\nSeveral companies now produce organic infant formulas based on cows’ milk, as well as those based on soy or almonds. While these are most appropriate as follow on milks after you have stopped breastfeeding, or for mixed feeding after a few months of exclusive breastfeeding, they can also be useful for women who cannot or will not breastfeed.\n\nBottle feeding mothers need to be aware, however, that none of these supplies complete nutrition in itself and may also cause unexpected health problems. Some paediatricians have noted higher rates of childhood eczema associated with cow’s milk formula, higher rates of asthma with soya and diarrhoea related to almond milk formulas.\n\nIf you are using these types of formulas you might try rotating them so that your child is not exposed to any one type for too long. This will reduce the risk of an allergic or intolerance reaction.\n\nThere are other ways to make bottlefeeding safer:\n• Use an organic formula. This will reduce your baby’s exposure to contaminants present in conventional formulas.\n• Avoid formulas that contain added sugars or glucose.\n• Make formula up as you need it rather than storing large quantities in the fridge. This helps to avoid foodborne bacteria as well as the slow leeching of plasticisers into the formula\n• Do not heat plastic bottles in boiling water to heat the formula. When heated, the plastic in baby bottles can give off bisphenol-A, a hormone-disrupting chemical, which can contaminate the formula. Sterilising plastic bottles in this way also releases harmful phthalates.\n• Consider switching to tempered glass bottles that are unbreakable and completely free from harmful plasticisers and other toxins.\n\nFinally a recent study looking at the temperaments of breast-fed versus bottle fed babies did conclude that cry more, laugh less, and generally have “more challenging temperaments” than their formula-fed contemporaries.\n\nHowever, the scientist who led the study, Dr Ken Ong, pointed out: “Bottle-fed babies may appear more content, but research suggests that these infants may be over-nourished and gain weight too quickly. Our findings are essentially similar to other stages of life; people often find that eating is comforting.”\n\nIt may also be that modern mothers have unrealistic expectations about how often babies should cry and what demands a baby should be ‘allowed’ to make on them. These expectations are often fed by the media, but also by smaller family sizes which means that a woman’s first contact with a baby is often when she has her own. This makes good support and information from caregivers even more crucial.\n• Article adapted from Healthy, Happy Baby – The Essential Guide to Raising a Toxin-free Baby (Rodale), by Pat Thomas", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Breastfeeding – multiple benefits for your baby", "url": "https://www.naturalhealthnews.uk/article/breastfeeding-multiple-benefits-for-your-baby/", "type": "article", "description": "Exclusive breastfeeding for at least six months gives your baby the healthiest and best possible start in life", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2012/04/Mother-breastfeeding-baby.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://erj.ersjournals.com/content/39/1/81", "http://onlinelibrary.wiley.com/doi/10.1111/j.1523-536X.2007.00172.x/abstract", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2126784/pdf/9183197.pdf", "http://www.ncbi.nlm.nih.gov/pubmed/10910120", "http://www.ncbi.nlm.nih.gov/pubmed/12216999", "https://www.naturalhealthnews.uk/health/2011/11/doctors-say-air-fresheners-can-trigger-asthma-and-more/", "https://www.naturalhealthnews.uk/chemicals-2/2012/03/us-congress-to-review-toxic-cosmetics/", "https://www.naturalhealthnews.uk/health/2011/10/bpa-banned-in-france-%E2%80%93-vive-la-revolution/", "https://www.naturalhealthnews.uk/health/2012/04/high-levels-of-phthalates-raise-the-risk-for-type-2-diabetes/", "http://www.plosone.org/article/info:doi/10.1371/journal.pone.0029326", "http://goo.gl/Fdejb", "http://www.amazon.co.uk/Healthy-Happy-Baby-essential-toxin-free/dp/1905744242/ref=sr_1_33?ie=UTF8&s=books&qid=1270495141&sr=1-33"], "authors": [], "publish_date": null}