{"result_id": "355020", "URL": "https://www.naturalhealthnews.uk/article/dr-wakefield-to-bmj-retract-your-allegations-or-face-the-consequences/", "timestamp": "2023-04-25 18:22:02 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/dr-wakefield-to-bmj-retract-your-allegations-or-face-the-consequences/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Dr Wakefield to BMJ: retract your allegations or face the consequences", "cleaned_text": "Dr Wakefield to BMJ: retract your allegations or face the consequences\n\nDr Andrew Wakefield, whose controversial research into the link between the MMR vaccine and autism has been the subject of nearly a more than a decade of argument and debate, has refused to acquiesce to his critics. Early in January 2011, the British Medical Journal published a damning series of articles accusing Wakefield of fraud, saying his data was ‘fixed’.\n\nIn a PR Newswire statement, issued on January 13 Wakefield hit back: “I want to make one thing crystal clear for the record – my research and the serious medical problems found in those children were not a hoax and there was no fraud whatsoever. Nor did I seek to profit from our findings. I stand by the Lancet paper’s methodology and the results which call for more research into whether environmental triggers cause gastrointestinal disease and developmental regression in children. In fact, despite media reports to the contrary, the results of my research have been duplicated in five other countries (to see citations to studies, click here ).\n\nTwo weeks later Wakefield issued a further statement demanding the BMJ “retract these articles or face the consequences”.\n\nIn it he claims that he has in his possession “…documents that confirm beyond a shadow of a doubt that I did not falsify this data; that the finding of bowel disease in these children is real; and that these findings were accurately reported in The Lancet in 1998” and that these documents “…were available to Deer and the editors of the BMJ well in advance of their recent publication”.\n\nIn spite of this, says Wakefield, the BMJ ‘recklessly’ chose to ignore this evidence. Unbelievably, this saga has been going on since 1998 and in that time has come to represent the ugly face of the scientific and intellectual entrenchment of conventional, corporate science.\n\nIt has been costly in terms of Dr Wakefield’s reputation (he was struck off the medical register in 2010) and in terms of the money spent to pursue and destroy him. Some believe that the persecution of Andrew Wakefield has taken on the mantle of a ‘witch hunt”.\n\nIt has certainly has left many participants and observers on both sides very bitter. There are many frustrating aspects to this case, none the least of which is that criticisms of Dr Wakefield have been taken at face value, subjected to little or no analysis, while Wakefield’s repeated attempts to defend his work has been subject to obsessive forensic evaluation.\n\nDr Wakefield’s contention has long been that it is possible that the vaccine could trigger a catastrophic reaction in a child with an as yet unknown pre-existing vulnerability. What that potential vulnerability might be, and how it might be detected, remains unknown.\n\nUntil we understand the issue of vulnerability, the question of whether the triple vaccine is ‘safe’ will remain unanswered. Finding the answer to that would surely be of greater benefit to millions of parents and children than spending endless time, money and effort persecuting one man.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Dr Wakefield to BMJ: retract your allegations or face the consequences", "url": "https://www.naturalhealthnews.uk/article/dr-wakefield-to-bmj-retract-your-allegations-or-face-the-consequences/", "type": "article", "description": "Doctor who exposed MMR risks stands by his data and challenges medical establishment’s continued denial of his findings", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2011/01/Measles_virus.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://www.prnewswire.com/news-releases/statement-from-dr-andrew-wakefield--no-fraud-no-hoax-no-profit-motive-113454389.html", "http://tinyurl.com/4hrdt5y", "http://www.naturalnews.com/031117_BMJ_Dr_Andrew_Wakefield.html", "http://www.spectator.co.uk/melaniephillips/3346281/the-witchhunt-against-andrew-wakefield.thtml"], "authors": [], "publish_date": null}