{"result_id": "355017", "URL": "https://www.naturalhealthnews.uk/article/the-darker-side-of-soya/", "timestamp": "2023-04-25 18:21:58 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/the-darker-side-of-soya/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Soya - how the world's healthiest food is making us sick", "cleaned_text": "Soya – how the world’s healthiest food is making us sick\n\nWhether you know it or not, and whether you intended to our not, you’ve probably eaten soya today.\n\nWithin a few short decades soya has infiltrated our daily diets to a spectacular degree. Believe the marketing hype and this ‘traditional’ plant-based food, which is sold in a variety of different forms, not only fights cardiovascular disease and even cancer, but helps you live longer.\n\nIn 1999 the US FDA approved the inclusion of health benefit claims for products containing at least 6.5 grams of soya, giving a big boost to the soya food industry. Literally thousands of products such as soya milk, butter and cereal began to appear on supermarket shelves and the soya craze quickly spread internationally.\n\nToday food industry experts estimate that some form of soya, usually the protein isolate, is in more than 60% of all processed food, which means that every single day most of us eat soya without ever realising it.\n\nIf you eat conventionally reared meat you are eating soya, which is widely used as animal feed in intensive livestock operations. Soya flour is used in bread; soya oil is in margarine and is the main component of the ubiquitous ‘vegetable oil’ found in a variety of food products.\n\nSoybean concentrate is used to bind foods together and boost protein content, and soya lecithin, the emulsifier E322, is one of the most widely used food additives. It is found in health drinks, yoghurts, ice creams, meat substitutes, bakery goods, sweets, drinks, breakfast cereals, ice cream, margarine, pasta, processed meats and even infant formula.\n\nSo big is the marketing spin around soya that an increasing number of people deliberately try to include more soya in their diets in the form of low fat or vegetarian foods, especially meat and and milk substitutes, as well as daily supplements and diet drinks.\n\nThe health hype for soya is generally based around the fact that Oriental peoples have eaten it for millennia and have lower rates of cancers of the breast, ovary and testicles than we do in the West.\n\nThat’s all true, but in our desperate desire to embrace the exotic East we ignore the fact that the Japanese, and Asians in general, have much higher rates of other types of cancer, particularly cancer of the oesophagus, stomach, liver and pancreas.\n\nAll or nothing\n\nIn the food business there is a simple maxim that keeps us buying and eating. If a little is good for you, a lot must be even better for you. Time and time again we see that this is not true, and in the case of soya it may even be dangerous.\n\nCertainly soya – that is the traditional fermented soya as opposed to the junk food, highly processed products that predominate in the marketplace – has some proven benefits.\n\nIt contains, for instance, isoflavones, plant estrogens, which in small amounts may have cancer preventing properties. It is low in fat and is a reasonable source of protein. In the US food labels are allowed to claim that soya is ‘heart healthy’.\n\nBut as a food source, in addition to benefits, it also has multiple limitations.\n\nSoya, for instance, is low in calcium and B vitamins, low levels of which can contribute to osteoporosis (see below for more). Traditional fermentation of soybeans significantly reduces phytates, and also deactivates hemagglutinin and trypsin inhibitors, while leaving health-promoting substances like isoflavones intact. As a result, soya products like tempeh and miso can be very beneficial. Non-fermented products are an entirely different matter, however.\n\nIn our society, once we find something we perceive as ‘good’ the marketplace takes over, encouraging us to have – or rather to buy – more and more. We mega-dose in the belief that if a little is good for you, a whole lot must be even better. As a result we eat soya in the West in quantities and in ways that are simply not healthy.\n\nFor a very long time, in traditional Eastern cultures, soya wasn’t considered fit to eat. Instead it was used as mulch and compost for crops. Only after people learned to ferment soya was it considered suitable for human consumption.\n\nToday little has changed. Only after long fermentation, or extensive processing, including chemical extractions and high temperatures, are the beans, or the soya protein isolate, suitable for digestion when eaten. Non-fermented soya is not so much a food as a supplement and therein lies the problem with our love affair with soya.\n\nWe now know that a diet high in soya is a diet high in plant estrogens. Research studies in both humans and animals have found that isoflavones in soya can have a profound effect raising levels of estrogen to significantly. While proponents claim that plant estrogens are ‘safer’ because they are natural – this is simply not true; high levels of circulating estrogen can be a cancer risk – whatever the source.\n\nIt might be worth the risk of soya had an unquestionable record of health benefits, but here too the data are mixed and like many profitable products there have been accusations of bias and lack of transparency about who funds soya studies. In the US, for example, the United Soyabean Board – whose mission is to build demand for US soybeans around the world – offers hefty research grants to scientists or research into soya and human health.\n\nFor all the studies touting its benefits, there are just as many that produce worrying findings.\n\nIn August 2005 a report for Agency for Healthcare Research and Quality, at the US Department of Health and Human Services reviewed data from 200 studies into the relationship between soya consumption a number of health outcomes. A wide variety of soya products were studied in this very large review, including foods such as soybeans, soya flour, soya milk, tofu, miso, tempeh, natto, and okara; isolated and textured soya protein that is added to foods; and soya-derived isoflavone supplements.\n\nWhen it came to improving blood pressure and levels of high-density lipoprotein (HDL, known as ‘good’ cholesterol) soya consumption did not produce any significant effects.\n\nFor menopause-related symptoms, there was a net reduction in hot flush frequency ranging from 7-40%. However, the review noted that the trials were mostly poor quality, which made definitive conclusions difficult. No other menopausal symptoms were studied.\n\nThe evidence review also found insufficient data to suggest that soya had an effect on bone health, cancer, kidney disease, endocrine function, reproductive health, neurocognitive function, or glucose metabolism.\n\nAside from minor gastrointestinal problems reported in some short-term studies, consumption of soya products was not associated with adverse effects. However, the reviewers noted that long-term safety data are lacking.\n\nLikewise, while there may be a smattering of studies to suggest some short term benefits – for instance in menopausal symptoms – from eating soya there are many more studies showing harm.\n\nIn her book The Whole Soya Story, nutritionist Dr. Kaayla Daniel highlights studies linking soya to immune disregulation, thyroid dysfunction, malnutrition, digestive distress, cognitive decline, reproductive disorders and infertility as well as cancer and heart disease.\n\nShe notes also the rise in soya allergies and has produced a shocking list of the extraordinary number of everyday products that make use of soya including cast iron cookware, vaccines and fake fire logs. Soya, it seems, has become just another industrial product.\n\nSoya contains high levels of estrogen mimics known as isoflavones, which can disrupt hormone function in both men and women. High levels of circulating estrogens are a risk for certain types of estrogen dependent cancers for instance of the breast, ovaries and testicles. Animal studies have linked high consumption of isoflavones with infertility and immune system\n\nHuman studies are mixed, but some evidence does suggest that moderate soya consumption can have a protective effect against breast cancer. But it’s not all good news. Other evidence suggests that when women consume soya in infancy it can actually raise the risk of later breast cancer.\n\nIn addition, a study of young adults 20 to 34 years of age who had been involved in feeding study using soya formula as infants found that the women had longer and more painful menstrual periods then those who were not given soya formula.\n\nThis calls into question the wisdom of the current trend for soya-based infant formula milk (especially when breastfeeding for the first six months of life is a better solution to avoid or deal with cows’ milk intolerance, and boost immunity).\n\nThe use of soya-based formulas is still a very new experiment in human health. Soya formula is currently given to around 25% of infants in the US and about 5% of infants in the UK. This soya milk still contains isoflavone, exposure to which may impact on future fertility and reproductive development. The UK Government has advised parents not to use soya-based formula without medical supervision, yet there is nothing to prevent parents using soya formula, neither are there any warnings on the packs.\n\nHow much estrogen are they getting? According to the American Journal of Clinical Nutrition investigators reported that circulating concentrations of isoflavones in infants fed soya-based baby formula were 13,000 to 22,000 times higher than plasma oestradiol (that is naturally produced estrogen) concentrations in infants fed baby formula made with cow’s milk. Oestrogen in doses above those normally found in the body can cause cancer. \n\n\n\nMen are at risk from this hormone overload too. Evidence from the Harvard School of Public Health in Boston, found that men who regularly ate soya had significantly lower sperm counts, an effect also seen in animal studies.\n\nOur enthusiasm for all things soya also means that we ignore the fact that all soya is not created equal. Traditional fermentation of soybeans significantly reduces some of their harmful properties which can include:\n• Allergens. Soya allergies are on the rise as soya consumptions goes up. These days allergies to soya proteins – the symptoms which include rashes, diarrhoea, vomiting, stomach cramps and breathing difficulties – are almost as common as those to milk.\n• Phytates. These substances can block the uptake of essential minerals – such as calcium, magnesium, iron and especially zinc – in the intestinal tract. All beans contain phytic acid, but soybeans have higher levels than any other legume. Oriental children who do not consume fish or meat products to counterbalance the effect of their high-phytate, soya- and rice-based diets have been shown to suffer nutritional deficiency illnesses as stunting, rickets and other developmental problems.\n• Enzyme inhibitors. Soya contains potent enzyme inhibitors, which block the action of trypsin and other enzymes needed for protein digestion. Normal cooking does not de-activate these substances, which can also cause serious gastric distress and reduced protein digestion and can lead to chronic deficiencies the uptake of essential amino acids such as methionine and leucine, as well as isoleucine and valine. These are all needed to combat stress, avoid depression, synthesise new body protein and maintain a healthy immune system.\n• Hemagglutinin. Soya products also contain another chemical, hemagglutinin, which promotes clumping of red blood cells. These clumped red cells are unable to fully take up oxygen and carry it via the blood stream to the body’s tissues, and organs. Hemagglutinin has also been observed to act as a growth depressant. Although the process of fermenting soybeans does de-activate hemagglutinin, cooking and precipitation do not.\n• Anti-nutrients. Soya inhibits the uptake of essential amino acids such as methionine and leucine, as well as isoleucine and valine. These are all needed to combat stress, avoid depression, synthesise new body protein and maintain a healthy immune system.\n• Antithyroid agents. The plant estrogens in soya can also cause an underactive thyroid and are implicated in thyroid cancer. In infants, consumption of soya formula has been linked to autoimmune thyroid disease.\n\nAnd then there is the man-made contamination. To make soya protein isolate – the high protein derivative of soya that is used in snacks, infant formulas, protein bars, breakfast cereals, baked goods, ice creams and yoghurts – soybeans are first mixed with an alkaline solution to remove fibre, then precipitated and separated using an acid wash and, finally, neutralised in an alkaline solution.\n\nAcid washing in aluminium tanks leaches high levels of aluminium into the final product. As a result, soya-based formula can have over 1000% more aluminium than conventional milk based formulas.\n\nWhat all this means is that while soya products like tempeh and miso can be beneficial if eaten in moderation, non-fermented soya products such as tofu and soya milk are much less beneficial.\n\nBad for the environment too\n\nFinally, soya is also an environmental concern. Huge tracts of rainforest are being cut down to feed our greed for this ‘healthy’ food. And to improve yields farmers are encouraged to grow genetically modified varieties which have their own devastating impacts.\n\nA very large percentage of soya – over 90% – is genetically modified and soya also has one of the highest percentages of contamination by pesticides of any of the foods we eat (you can read more about this in the GMO Myths and Truths Report, published by Earth Open Source, here)\n\nTo avoid pesticide contamination we are told to eat organic. But apart from the fact that organic soya doesn’t do much to help rainforest destruction, the bad news is that GM soya has been found in a range of food items labelled organic or GM-free.\n\nCompanies only have to declare GM contents only over 0.9%, whereas the Soil Association standard is 0.1 % for organic products.\n\nHowever a 2004 study at the University of Glamorgan, published in the British Food Journal, found that one fifth of soya-based products on sale at health-food shops and supermarkets contained as much as 0.7% of GM material. The products included vegetarian burgers, cheese substitute, soya milk, vegetarian sausage mix, soybeans and soya flour.\n\nSupporting the soya industry also supports companies that take farming land away from those who most need it. A 2011 report by the International Land Coalition (ILC) concluded that today, biofuels – made from soya, palm oil and sugarcane – are now the major driver for large-scale purchases of farmland or ‘land grabbing’ in the global south, with almost 53% of the 71 million hectares cross-referenced in the report, being used for biofuels.\n\nIn Africa, the impact of biofuels is even stronger with 66% cent of land purchases used for biofuels. In comparison, the figure for land purchases for growing food was only 15%.\n\nIt seems like heresy in a world in love with soya – but it is possible to have a healthy diet and never eat soya at all. Not buying into the highly distorted mythology around soya may also be better for our planet as well.\n\nAnd yet given the way we have allowed it to infiltrate the food system – it would now take a monumental effort to exclude it entirely from your diet – a situation that could threaten our health and certainly makes a mockery of the idea of informed consumer choice.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Soya - how the world's healthiest food is making us sick", "url": "https://www.naturalhealthnews.uk/article/the-darker-side-of-soya/", "type": "article", "description": "Before you drink that chai soya latte or that 'healthy' soya diet drink get the facts straight; soya just isn't that good for you - or for the planet", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/04/Edamame-beans.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2268721/", "https://researchfunding.duke.edu/detail.asp?OppID=4504", "http://archive.ahrq.gov/downloads/pub/evidence/pdf/soyeffects/soy.pdf", "http://articles.mercola.com/sites/articles/archive/2008/07/17/the-whole-soy-story-the-dark-side-of-america-s-favorite-health-food.aspx", "http://drkaayladaniel.com/cork-cast-iron-and-cupcake-liners-the-soy-ling-of-america/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2981011/", "http://www.ncbi.nlm.nih.gov/pubmed/11497534", "https://www.naturalhealthnews.uk/article/breastfeeding-multiple-benefits-for-your-baby/", "https://www.naturalhealthnews.uk/health/2012/05/breastfeeding-boosts-immune-system-development/", "http://pediatrics.aappublications.org/content/121/5/1062.full", "http://ajcn.nutrition.org/content/68/6/1453S.full.pdf", "http://humrep.oxfordjournals.org/content/23/11/2584.full", "http://earthopensource.org/index.php/5-gm-crops-impacts-on-the-farm-and-environment/5-2-myth-gm-crops-decrease-pesticide-use", "http://www.soilassociation.org/frequentlyaskedquestions/yourquestion/articleid/2356/what-steps-are-you-taking-to-ensure-that-gm-contamination-will-not-occur-in-organic-foods", "http://www.emeraldinsight.com/journals.htm?articleid=870742", "http://www.theecologist.org/News/news_round_up/745752/biofuels_jatropha_still_linked_to_land_grabbing_and_displacement_of_farmers.html"], "authors": [], "publish_date": null}