{"result_id": "355006", "URL": "https://www.naturalhealthnews.uk/children-2/2012/07/pharma-giant-merck-faces-two-lawsuits-alleging-fraud-over-mumps-vaccine/", "timestamp": "2023-04-25 18:21:47 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/children-2/2012/07/pharma-giant-merck-faces-two-lawsuits-alleging-fraud-over-mumps-vaccine/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Pharma giant Merck faces two lawsuits alleging fraud over mumps vaccine", "cleaned_text": "Two of former Merck employees have filed a lawsuit against the company claiming that it falsified test results for its mumps vaccine making the vaccine appear much more effective than it actually is.\n\nOn the basis of this information, they say, the company convinced the federal government to purchase hundreds of millions of dollars worth of potentially worthless vaccines.\n\nThe lawsuit was filed in 2010 under the False Claims Act by virologists Stephen Krahling and Joan Wlochowski, who say that they “witnessed firsthand the improper testing and data falsification in which Merck engaged to artificially inflate the vaccine’s efficacy findings“.\n\nThe details of the case have been sealed from the public for two years whilst the US government considered whether to participate in the lawsuit. The government has now declined be involved (but has reserved the right to become involved later).\n\nThe case was finally unsealed in late June and the former employees to now move forward with their claims against Merck.\n\nIt should be noted that the UK’s National Health Service also uses Merck’s MMR vaccine –which contains the allegedly ineffective mumps vaccine.\n\nIn a second lawsuit, filed at the same time as the unsealing of the first, a federal anti-trust class action was filed against Merck by Alabama-based Chatom Primary Care.\n\nChatom allege that Merck falsely claims its mumps vaccine is 95% effective and that Merck has known for a decade that its mumps vaccine is ‘far less effective’ than it tells the government, and that it falsified test results and sold millions of doses of ‘questionable efficacy’, flooding and monopolising the market.\n\nBy falsifying claims about the effectiveness of the vaccine Merck “deterred and excluded competing manufacturers,” who would enter the risky and expensive vaccine market only if they believed they could craft a better product, Chatom says in its complaint.\n\nMerck is the only manufacturer licensed by the FDA to sell the mumps vaccine in United States, and if it could not show that the vaccine was 95% effective, it risked losing its lucrative monopoly, according to the complaint.\n\nChatom claims that’s why Merck went to great lengths, including “manipulating its test procedures and falsifying the test results,” to prop up the bogus figure, though it knew that the attenuated virus from which it created the vaccine had been altered over the years during the manufacturing process, and that the quality of the vaccine had degraded as a result.\n\nStarting in the late 1990s, Merck set out on a sham testing program with the objective of “report[ing] efficacy of 95 percent or higher regardless of the vaccine’s true efficacy,” the complaint states.\n\nUnder this Protocol Merck did not test the vaccine’s ability to protect children against a “wild-type” mumps virus, which is “the type of real-life virus against which vaccines are generally tested,” the complaint states.\n\nInstead, according to the complaint, Merck tested the blood of children who had been vaccinated with its products – which meant their blood contained Merck’s own attenuated strain of the virus.\n\nThat “subverted” the purpose of the testing regime, “which was to measure the vaccine’s ability to provide protection against a disease-causing mumps virus that a child would actually face in real life. The end result of this deviation … was that Merck’s test overstated the vaccine’s effectiveness,” Chatom claims.\n\nMerck also added animal antibodies to blood samples to achieve more favourable test results, though it knew that the human immune system would never produce such antibodies, and that the antibodies created a laboratory testing scenario that “did not in any way correspond to, correlate with, or represent real life … virus neutralization in vaccinated people,” according to the complaint.\n\nChatom claims that the falsification of test results occurred “with the knowledge, authority and approval of Merck’s senior management.”\n\nWhile parents who choose not to vaccinate their children are derided – for endangering their own children and others around them, Merck’s alleged actions raise a question mark about all childhood vaccines. All vaccines must go through the same approval process and all pharmaceutical companies face the same temptation to fudge results in order to gain lucrative contracts. It may well be that these cases are just the tip of the iceberg.\n\nAs we recently reported, judges in Italy and the US have found that the MMR vaccine did cause autism in two children.\n\nAt the same time another global drug company, Roche is under investigation by the European Medicines Agency for ignoring 80,000 adverse reactions, including 15,161 deaths to its Tamiflu vaccine.\n\nAnd, of course, GlaxoSmsithKline has recently been fined $3 billion ( £1.9 bn) for bribing doctors – which took the form of lavished hospitality and kickbacks on those who agreed to write extra prescriptions, including trips to resorts in Bermuda, Jamaica and California – and encouraging the prescription of unsuitable antidepressants to children. In particular Paxil – which is only approved for use by adults – was being pushed as an ‘off-label’ prescription for children and teenagers in spite of trials proving it was ineffective.\n\nThe original court documents filed in the US District Court of Massachusetts, by disgruntled former employees Gregory Thorpe and Blair Hamrick make hair-raising reading.\n\nAlthough shocking bribery, kickbacks, paying ‘independent’ spokespeople to hawk their products around, and ‘rewards’ for doctors who push drugs on the public is hardly new in the world of Big Pharma. Pfizer and Johnson & Johnson have both recently settled bribery cases. Others like AstraZeneca, Bristol-Myers Squibb, Merck and Eli Lily have likewise been investigated for bribery, untruthful marketing and pushing off-label prescribing. In 2004 Merck’s anti-inflammatory drug Vioxx, was famously withdrawn after it was shown the company misled the public about the associated risk of cardiovascular problems.\n\nIf these are examples of ‘business as usual’ in the pharmaceutical industry, then the veil has been lifted on a disturbing pattern: lie about product efficacy and then ignore adverse reactions, and rake in as much money as possible before anyone finds out.\n\nGiven that, consumers of healthcare have every reason to question why they should put their trust (and potentially the health of their children) in this process.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Pharma giant Merck faces two lawsuits alleging fraud over mumps vaccine", "url": "https://www.naturalhealthnews.uk/children-2/2012/07/pharma-giant-merck-faces-two-lawsuits-alleging-fraud-over-mumps-vaccine/", "type": "article", "description": "Two recent lawsuits allege Merck falsified data about the effectiveness of its mumps vaccine", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2012/07/baby-vaccination.jpg", "article:published_time": "2012-07-13T17:41:44+01:00", "article:modified_time": "2013-01-14T18:43:16+00:00", "updated_time": "2013-01-14T18:43:16+00:00", "article:section": "Vaccines"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.courthousenews.com/2012/06/27/47851.htm", "http://childhealthsafety.files.wordpress.com/2012/07/chatom-lawsuit-merck-mumps-ocrd.pdf", "https://www.naturalhealthnews.uk/chemicals-2/2012/05/italian-court-rules-mmr-vaccine-did-trigger-autism/", "http://www.reuters.com/article/2012/06/21/us-roche-europe-idUSBRE85K1NH20120621", "http://www.guardian.co.uk/business/2012/jul/03/glaxosmithkline-fined-bribing-doctors-pharmaceuticals", "http://www.quitam-lawyer.com/sites/quitam-lawyer.com/files/02.03.12%20-%20GSK%20--%207th%20Amended%20Complaint.pdf", "http://online.wsj.com/article/SB10001424052970203710704577050303870770014.html", "http://www.nytimes.com/2011/04/09/business/09drug.html", "http://blogs.wsj.com/corruption-currents/2011/11/07/astrazeneca-indicted-in-serbia-for-alleged-bribery/", "http://articles.latimes.com/2011/mar/19/business/la-fi-drug-kickbacks-20110319", "http://www.dailyfinance.com/2010/10/05/pharmaceutical-bribery/", "http://www.nytimes.com/2007/01/20/business/20drug.html", "http://www.healthyweightforum.org/eng/weight_loss_medication/vioxx-recall.asp"], "authors": [], "publish_date": "2012-07-13T17:41:44+01:00"}