{"result_id": "355003", "URL": "https://www.naturalhealthnews.uk/article/cold-and-flu-prevention-the-natural-way/", "timestamp": "2023-04-25 18:21:43 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/cold-and-flu-prevention-the-natural-way/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Cold and flu prevention - healthier alternatives", "cleaned_text": "Most of believe there are only four seasons; but actually there is a fifth that runs from November to February – the cold and flu season.\n\nChances are at some point in your life –and for some people at some point each year – you will catch a cold or come down with the flu. For healthy individuals the best medicine is rest, warmth and lots of liquids and this is the good medicine that most of us practise when we succumb to a cold or flu.\n\nWhile catching a cold or flu is not the end of the world it is often inconvenient and unpleasant. It is also, to some extent avoidable if you take preventative action.\n\nThis time of year, particularly, ‘prevention’ in the mainstream media seems to be all about getting your flu jab. While the newspapers and TV news shows are full of celebrity doctors singing the praises of the flu vaccine, the bottom line is that vaccination is a very ineffective way of keeping flu at bay. Any claimed effectiveness depends on a good match between the virus in the vaccine and the virus that happens to be circulating in the real world – something which vaccine manufacturers rarely get right.\n\nWhile many worry about the vulnerable elderly winter season can bring about a whole range of health complications, including higher cholesterol levels and worsening glucose control, which have nothing at all to do with viruses, but which can have an overall effect on health and immunity.\n\nIn fact, according to a report published in the British Medical Journal in which British scientists tracked the causes of excess winter deaths over the preceding 10 years, ﬂu accounted for less than three per cent of all excess winter deaths in the UK (a higher ﬁgure than in other developed countries). In this country ‘cold stress’ – lack of adequate heating indoors and lack of appropriate winter clothing when outdoors – was the bigger killer.\n\nA person’s income and education level also correlate closely to how vulnerable they are. So in many ways the aggressive vaccination programme is being used as a cultural cure all – addressing potential symptoms but never really getting to the heart of health problems.\n\nIt doesn’t prevent people getting the flu nor does it prevent vulnerable people from experiencing complications of the flu. Worse, according to the prestigious Cochran Review, those studies that say it does are industry funded, prone to bias and unreliable. The vaccine may even weaken your immune system and as many as 30-40% of elderly people do not respond to it . In adults and children with asthma or other respiratory problems, the vaccine may trigger breathing difficulties. Other adverse effects include optic neuritis and permanent blindness, vasculitis and joint problems, reversible paralysis and myelopathy.\n\nThere are plenty of things you can do to help keep yourself healthy in during cold and flu season – natural approaches that work with your body instead of against it. Try some of these first:\n\nAvoid sugar, especially if you feel you are coming down with something. Ingestion decreases immune function almost immediately, and may make the difference between fighting off a cold and succumbing to it. Sugar is present in foods you may not suspect like ketchup and fruit juice.\n\nGet enough sleep, it will keep you strong and ensure that your body has the power to fight off any potential invaders.\n\nCover your mouth and wash your hands Give everyone around you a break by heeding this simple advice. Cold and flu are spread chiefly by air. When you cough or sneeze vapour containing infectious microbes is expelled at over 120 miles per hour easily reaching most people in your immediate vicinity. Washing your hands with regular (not antibacterial) soap will also decrease the likelihood of spreading a virus to your nose, mouth or other people.\n\nVitamin C Not all studies agree, but the weight of the evidence does seem to point to a protective effect, reducing the incidence of colds by around 50% respectively. Those under heavy physical stress will particularly benefit. Aim for a minimum of 1000 mg daily – doses below this don’t seem to have much effect. Combining vitamin C with zinc may be particularly useful\n\nOther useful supplements include Vitamin A (8-12000 iu daily), which can reduce the incidence and severity of infection and illness; Vitamin E (200-400 iu daily), which boosts resistance to infections; and Co Q-10 (20-200 mg daily), which can compensate for immune deficiencies caused by ageing or disease. Probiotics, though not technically nutrients, do improve immune function. Supplements should contain at least 3 billion viable bacteria per capsule.\n\nEchincea is the king of herbs when it comes to colds and flu. In a recent study Echinacea purpurea tincture provided a 59% reduction in recurring cold infections in the Echinacea group compared with placebo. See our article A Botanical Boost to Immunity for more helpful herbs\n\nAdaptogenic herbs such as Siberian and Asian ginseng, astragalus, schisandra and rhodiola are believed to help keep various body systems – including the immune system – healthy and are often recommended to prevent colds and flu. See our article on the Chinese Adaptogenic Herbs.\n\nTake garlic regularly, it is antibacterial, antiviral and anti-fungal. Fresh is best, used either in cooking or added to other ingredients in a juicer. But supplements are also effective (and less smelly). In one recent trial, one capsule per day of a garlic supplement containing stabilised allicin for 12 weeks led to 63% fewer colds and 70% fewer days ill than those taking placebo. Look also for aged garlic supplements (AGE) which contain higher levels of certain antioxidant phenols than cooked or raw garlic and which has been shown to boost immunity.\n\nElderberry extract is anti-inflammatory and anti-viral. Preliminary research suggests that the 30-60 ml can shorten the duration and severity of flu symptoms.\n\nStress is the single biggest reason why otherwise healthy people come down with colds. Evidence shows you are much more likely to succumb to the common cold if you are stressed out. Do what you can to de-stress and consider boosting your intake of the B-complex family such as B6, B12 and folic acid – especially useful for stressed individuals. Aim for 25-100 mg as part of a complex.\n\nExercise improves circulation of immune complexes. Regular moderate exercise can lead to fewer colds and flu. But don’t overdo it since pushing yourself past your limits may have a paradoxical immune weakening effect.\n\nAdjust your home environment If you are getting chronic colds, consider whether your environment is affecting your immunity. Many symptoms which we associate with “bugs” are actually caused by food allergy and sensitivity as well as environmental toxins. Just eight foods – wheat, diary, eggs, citrus, fish and shellfish and something else – are responsible for 90% cent of all allergies. Chronic exposure to allergens can depress immune function.\n\nConsider also the temperature of your home during ‘cold and flu season’. A recent study found that a warm humid environment can make your nose feel more stuffy than a cool dry one. Turn down the heat and add an extra layer of clothing when indoors, and make sure you get plenty of fresh air daily even in winter.\n\nBee Healthy Propolis – the gummy substance collected by bees from leaf buds and tree bark –may be helpful in preventing and shortening the duration of the common cold in both children and adults. Propolis is rich in bioflavonoids that may be responsible for its reputed antiviral properties. Try taking 500 mg once or twice day to treat viral infections, sore throat, pain and fever associated with colds and flu.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Cold and flu prevention - healthier alternatives", "url": "https://www.naturalhealthnews.uk/article/cold-and-flu-prevention-the-natural-way/", "type": "article", "description": "November heralds the arrival of the 'fifth season'  - cold and flu season - but illness isn't inevitable if you follow this advice", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2012/11/Tissues.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://jech.bmj.com/content/57/10/784.full", "http://www.ncbi.nlm.nih.gov/pubmed/22698024", "http://www.ncbi.nlm.nih.gov/pubmed/20614424", "http://www.ncbi.nlm.nih.gov/pubmed?term=Hum%20Immunol%2C%201994%3B%2040%3A%20202-9", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2594117/?page=1", "http://www.ncbi.nlm.nih.gov/pubmed?term=Int%20J%20Tuberc%20Lung%20Dis%2C%201999%3B%203%3A%20756-61", "http://www.ncbi.nlm.nih.gov/pubmed?term=Int%20J%20Sport%20Med%2C%201996%3B%2017%3A%20379-83", "http://www.ncbi.nlm.nih.gov/pubmed/17636648", "http://www.ncbi.nlm.nih.gov/pubmed/22429343", "http://www.ncbi.nlm.nih.gov/pubmed/18038940/", "http://www.hindawi.com/journals/ecam/2012/841315/", "https://www.naturalhealthnews.uk/article/a-botanical-boost-to-immunity/", "https://www.naturalhealthnews.uk/article/your-guide-to-the-chinese-tonic-herbs/", "http://www.ncbi.nlm.nih.gov/pubmed?term=Adv%20Ther%202001%3B%2018%3A%20189%E2%80%9393", "http://www.springerlink.com/content/n3243gj167n5147r/fulltext.pdf.", "http://www.clinicalnutritionjournal.com/article/S0261-5614%2811%2900231-7/abstract", "http://www.ncbi.nlm.nih.gov/pubmed/19548290", "http://www.ncbi.nlm.nih.gov/pubmed/15080016", "http://www.ncbi.nlm.nih.gov/pubmed/20716708", "http://www.ncbi.nlm.nih.gov/pubmed/17071161", "http://www.ncbi.nlm.nih.gov/pubmed/9839084", "http://www.sciencedaily.com/releases/2011/10/111013184803.htm", "http://www.ncbi.nlm.nih.gov/pubmed?term=Rom%20J%20Virol%2C%201995%3B%2046%3A%20115%E2%80%9333", "http://www.ncbi.nlm.nih.gov/pubmed?term=Otolaryngol%20Pol%2C%201989%3B%2043%3A%20180%E2%80%934", "http://www.ncbi.nlm.nih.gov/pubmed?term=J%20Nat%20Prod%2C%201992%3B%2055%3A%20294-302"], "authors": [], "publish_date": null}