{"result_id": "355013", "URL": "https://www.naturalhealthnews.uk/article/qa-why-should-we-worry-about-heavy-metals/", "timestamp": "2023-04-25 18:21:54 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/qa-why-should-we-worry-about-heavy-metals/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Q&A: Should we worry about 'heavy metals'?", "cleaned_text": "Q&A: Should we worry about ‘heavy metals’?\n\nQ – I know there have been a lot of stories lately about toxic metals in our food and water and even in some consumer products. Surely since these are natural substances they have always been in our food and water to some extent. Why should we be worried?\n\nA – Yes it’s true that anything that comes out of the ground could theoretically contain what are known as ‘heavy metals’. But in a pre-industrial society we would have been exposed to these in really minute amounts. In our post-industrial society we generate increasingly more of these metals as a byproducts of other processes which means we are concentrating them in our air, soil and water, as well as getting them as contaminants in some consumer products at levels that we know are simply not safe over the longer-term.\n\nThe phrase ‘heavy metals’ is somewhat misleading since some toxic metals like aluminium are actually very light! But what most of these toxic metals do have in common is the ability to build up in the body over a period of time and it is the build-up that is linked to a wide range of health problems.\n\nCompelling evidence links exposure to these slow-motion poisons environmental toxins with emotional and behavioural problems, including violence, addiction, learning disabilities, hyperactivity, intolerance and lowered intelligence. Heavy metals are high on the list of personality-changing poisons.\n\nYou’ll encounter metals in tap water, air pollution, old paint, tobacco smoke, fish and shellfish, pesticides, medications such as antacids, but also childhood vaccines, IUDs, enamelled and aluminium cookware, dental fillings, copper pipes, the disinfectant used in public swimming pools, processed foods, and cosmetics and toiletries.\n\nScientists have believed that the higher the dose, the more toxic the metal becomes. But, because toxic metals are bioaccumulative – that is, stored in body tissues – it is believed that they need not be present in high concentration to produce adverse health effects.\n\nThe degree to which metals damage human health depends to a large extent on the form they take – either organic or inorganic. An inorganic metal is in its raw elemental state and is poorly absorbed by the body. Through ingestion and metabolism, it can be converted within the body to a more potent and poisonous form.\n\nOrganic metals have been combined (either by nature or in the lab) with some other carbon-containing substance, such as a petroleum derivative. The resultant complexes can increase the health risks associated with the metal itself, in part because the carbon molecule allows the metal to interact with more substances. In the body, this interaction is known as ‘oxidation’ and involves the production of free radicals. The higher the level of free radicals in the body, the greater the likelihood of illness.\n\nToxic metals are particularly harmful to the reproductive system. They can also interfere with its detox pathways, including the colon, liver, kidneys and skin. Some are also endocrine disrupters. The immune system’s function is compromised by the presence of toxic metals, which can also weaken our energy-production pathways. Because of this, metal toxicity is believed to be involved in disorders such as chronic fatigue or ME.\n\nToxic metals also appear to increase the acidity of the blood. When this happens, the body responds by drawing alkaline, in the form of calcium, from the bones to help restore the normal blood pH. When toxic metals are present, calcium may also be drawn to areas of damage and inflammation (such as joints and arterial walls).\n\nWhile this process acts like a bandage, patching up one problem area, it can create other conditions such as arteriosclerosis and arthritis. Also, without replenishment of calcium, the constant leaching of this important mineral from the bones can result in osteoporosis.\n\nOne well-researched area is the damage to the neurological system, particularly the brain. In addition, toxic metals interfere with uptake of essential nutrients such as magnesium, lithium, zinc, iron and several of the B vitamins. The resulting deficiencies have been linked to increased neurological damage.\n\nExposure to lead, even at low levels, for example, is associated with aggressive and anti-social behaviour as well as learning disabilities. Prenatal exposure to lead can also result in premature or low weights and small head circumference at birth – an early indication for learning or behavioural deficits. Chronic exposure to low levels of manganese are also linked to violent behaviour.\n\nIn fact, the effects of lead and manganese are synergistic, so individuals exposed to both show more profound effects than those exposed to either element by itself. Those with poor diets are likely to be more affected than those receiving adequate nutrition. Brain cells, for instance, absorb more toxic metals when diets are low in calcium, iron, zinc, vitamin D and other essential nutrients.\n\nEvidence also implicates toxic metals in a range of emotional and behavioural problems in children such as autism, dyslexia and attention-deficit hyperactivity disorder (ADHD), but also learning difficulties, including decreased concentration and organisational skills, speech, language and comprehension difficulties, and lowered intelligence. Adults are affected, too, as studies show higher rates of violence, dementia and depression among exposed individuals.\n\nThis means, as we have said before here at Natural Health News, that metal toxicity is as much a social problem as an environmental one – and this is an issue that not many observers have yet twigged on to. For example, while toxic metals may not be the whole answer to the problem of learning difficulties in children and increasing levels of violence in our society, they certainly appear to be an important piece of the puzzle.\n\nEqually, while some would argue that small decreases in intelligence are unlikely to be important, consider the knock-on effect of a general lowering of IQs by just five points. Played out across the entire population, this would mean that millions of people would be below the threshold of ‘average’ and be label-led ‘learning impaired’. The changes in social policy needed to meet such a decline should not be underestimated.\n\nRemoving heavy metals from the body is not straightforward – which is another reason to be concerned. Some practitioners recommend chelation for particularly bad cases, though this method is both pros and cons (see our article here for more and for other suggestions).\n• For more on pollution and chemicals see our Environment section.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Q&A: Should we worry about 'heavy metals'?", "url": "https://www.naturalhealthnews.uk/article/qa-why-should-we-worry-about-heavy-metals/", "type": "article", "description": "Toxic metals like lead and mercury are still present in our food, air, water and consumer products - in spite of strong evidence that they are harmful to human health", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2013/11/Toxic-metals.jpg"}, "tags": ["Q and A"], "tweets": [], "movies": [], "links": ["http://ecologist.testing.net-genie.co.uk/investigations/health/83069/asbos_vs_nutrition.html", "https://www.naturalhealthnews.uk/newsletter/your-brain-on-heavy-metal/", "https://www.naturalhealthnews.uk/article/qa-what-is-chelation/", "https://www.naturalhealthnews.uk/environmental/"], "authors": [], "publish_date": null}