{"result_id": "355007", "URL": "https://www.naturalhealthnews.uk/article/autismmmr-link-did-us-officials-fiddle-the-figures/", "timestamp": "2023-04-25 18:21:48 CEST+0200", "meta": {"description": "Reliable news and articles focusing on wellness, wellbeing, environment and sustainability; a unique Remedy Finder to guide you in your choice of herbs, homeopathy, aromatherapy and more.", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://www.naturalhealthnews.uk/article/autismmmr-link-did-us-officials-fiddle-the-figures/", "encoding": "utf-8"}, "image": null, "domain": "www.naturalhealthnews.uk", "title": "Autism/MMR link - did US officials fiddle the figures?", "cleaned_text": "Autism/MMR link – did US officials fiddle the figures?\n\nThe debate over a link between autism and vaccines is set to continue.\n\nIn case you missed it – and it hasn’t been well publicised here – a study published earlier this month concluded that African-American boys are more at risk for autism if they’re given the measles, mumps and rubella vaccine before the age of 2.\n\nThe study, which was funded by the Focus Autism Foundation, further alleges that that the Centers for Disease Control and Prevention (CDC) knew about the link in 2004 – and covered it up.\n\nThe allegation is based on a re-evaluation of the data as well as multiple interviews with one of the scientists who conducted the 2004 government-backed study.\n\nAlthough he originally declined to be named, the whistleblower has since been identified as William Thompson, a senior scientist with the CDC, where he has worked since 1998. Thompson’s ‘outing’ set in motion several events that have brought the otherwise overlooked analysis to international focus.\n\nIn 2004, scientists at the CDC’s National Immunization Program published their study in the journal Pediatrics. The researchers compared 624 children with autism, age 3 to 10, with 1,824 developmentally healthy children. Most of the children, according to the study, were vaccinated between 12 and 17 months of age in accordance with US protocols.\n\nThe CDC study authors found no link between the age children were given their first MMR vaccination and autism diagnoses. Nor, they reported, did they find a statistically significant increased risk for a particular racial group.\n\nThe raw data from the study was made available for other scientists to examine post-publication and the study itself, has been widely-cited to dispel an MMR-autism link.\n\nWhen Brian Hooker, author of the current an alysis and a biochemical engineer, began to analyse the data he found that African-American boys given the MMR vaccine before age 24 months were more likely to be diagnosed with autism.\n\nHooker said he believes the increased risk for African-American boys he found was not identified in the CDC study because the researchers, including Thompson, deliberately limited the number of participants they included in their analysis, which he said altered the results.\n\nThrough his lawyers Thompson has made a statement:\n\n“I regret that my co-authors and I omitted statistically significant information in our 2004 article,” Thompson said in a statement sent to CNN by his lawyer. “I have had many discussions with Dr. Brian Hooker over the last 10 months regarding studies the CDC has carried out regarding vaccines and neurodevelopmental outcomes, including autism spectrum disorders. I share his belief that CDC decision-making and analyses should be transparent.”\n\nHe goes on to say, however, the he believes children, regardless of any perceived risk factor, should continue to be vaccinated. He also says that Hooker had recorded these conversations without his consent, and had posted them online without his knowledge.\n\nIn one of these recordings available online Autism Media Channel, Thompson says “It’s the lowest point in my career that I went along with that paper…I went along with this, we didn’t report significant findings.”\n\nDon’t like the results? Change the study protocols\n\nThe allegation by Hooker is that when the scientists behind the CDC study started to find a link between autism and the MMR vaccine they changed the study protocol to eliminate that findings\n\nThe Director of the CDC Immunization Safety Office, Dr. Frank DeStefano, a co-author of the official study, has said in a recent telephone interview:\n\n“I stand by the research and the conclusions in our 2004 paper, and I’ll reiterate that the evidence, thus far, the weight of the evidence, is against a causal association between vaccines and autism.”\n\nHowever he also admits that he and his study co-authors changed their study analysis plan midstream, which resulted in reducing the statistical vaccine-autism link among black boys, albeit for what he called “good scientific reasons”.\n\nThese reasons seem to centre around the fact that , in his opinion, that the finding wasn’t biologically plausible.\n\nDon’t like the conclusions? Ban the paper\n\nIn the mean time, Hooker’s study has been removed from the public domain pending further investigation, according to the open access, peer-reviewed journal Translational Neurodegeneration in which it appeared.\n\nIn an online statement, the journal said the paper had been removed “because of serious concerns about the validity of its conclusions.”\n\nThe CDC researchers are standing by their original findings: that there is no link between autism and the timing of vaccination and there are no sub-groups of children who may be at particular risk.\n\nIn his statement, however, Thompson further admits:\n\n“My concern has been the decision to omit relevant findings in a particular study for a particular sub- group for a particular vaccine. There have always been recognized risks for vaccination and I believe it is the responsibility of the CDC to properly convey the risks associated with receipt of those vaccines.”\n\nThe CDC paper, in spite of these shocking revelations, has not been withdrawn.\n\nPerverting the course of science\n\nThis really is the nub of the issue. In deliberately ignoring significant findings, the CDC researchers have effectively discouraged further research, which might clarify who is at risk from vaccination.\n\nThis is an essential piece of information missing for both parents and practitioners. The notion that such information may be too frightening or complex for parents to handle, or is in some way a danger to public health, as many media outlets are reporting, denigrates us all and puts our health at risk.\n\nThe CDC has reiterated its belief that there is no causal link between the MMR and autism (or indeed any other health problem). However families in Italy, the UK (for both and autism and hearing loss), California and Maryland in the US (for an interesting analysis of the latter case, see here), have been awarded substantial damages for vaccine damage.\n\nThe debate continues because there is, it seems, still so much we do not know.", "opengraph": {"locale": "en_US", "site_name": "Natural Health News", "title": "Autism/MMR link - did US officials fiddle the figures?", "url": "https://www.naturalhealthnews.uk/article/autismmmr-link-did-us-officials-fiddle-the-figures/", "type": "article", "description": "A new study accuses a US government agency of altering its data before publication to hide a significant link between black children, the MMR vaccine and autism.", "image": "https://www.naturalhealthnews.uk/wp-content/uploads/2014/08/MMR-vaccine.jpg"}, "tags": ["Features"], "tweets": [], "movies": [], "links": ["http://pediatrics.aappublications.org/content/113/2/259", "http://www.morganverkamp.com/august-27-2014-press-release-statement-of-william-w-thompson-ph-d-regarding-the-2004-article-examining-the-possibility-of-a-relationship-between-mmr-vaccine-and-autism/", "http://vimeo.com/user5503203/review/103711143/91f7d3d4d8", "http://sharylattkisson.com/cdc-responds-to-allegation-it-omitted-vaccine-autism-study-link-576", "http://www.translationalneurodegeneration.com/content/3/1/16/abstract", "https://www.naturalhealthnews.uk/chemicals-2/2012/05/italian-court-rules-mmr-vaccine-did-trigger-autism/", "http://www.dailymail.co.uk/news/article-1307095/Family-win-18-year-fight-MMR-damage-son--90-000-payout-concerns-vaccine-surfaced.html", "https://www.naturalhealthnews.uk/chemicals-2/2012/08/panel-rules-mmr-vaccine-left-young-girl-partially-deaf/", "https://www.naturalhealthnews.uk/chemicals-2/2013/01/california-family-awarded-nearly-1-million-for-mmr-damaged-child/", "http://www.huffingtonpost.com/david-kirby/the-vaccineautism-court-d_b_88558.html", "http://www.huffingtonpost.com/david-kirby/government-concedes-vacci_b_88323.html"], "authors": [], "publish_date": null}