{"result_id": "356003", "URL": "https://www.onlineholistichealth.com/trace-minerals/lithium.html", "timestamp": "2023-04-25 18:22:08 CEST+0200", "meta": {"description": "What does Lithium do? I think the better question may soon be, “What doesn’t lithium do?”", "lang": "en", "keywords": "", "favicon": "https://www.onlineholistichealth.com/wp-content/uploads/2019/02/OHH-Fav.png", "canonical": "https://www.onlineholistichealth.com/trace-minerals/lithium.html", "encoding": "UTF-8"}, "image": null, "domain": "www.onlineholistichealth.com", "title": "Lithium", "cleaned_text": "Lithium is a trace mineral (alkali metal) much like sodium and potassium.\n\nIt is most known for its use in treating mental health disorders such as bipolar or manic-depressive disorder.\n\nResearchers now believe lithium to be an essential mineral.\n\nWhat does Lithium do?\n\nThis trace mineral has been used as a mood stabilizer for decades. It is used in the form of lithium salts such as prescription lithium carbonate or lithium citrate and non-prescription lithium orotate or lithium aspartate.\n\nClinical research has found lithium active in the following functions:\n\nOngoing research is finding lithium to be a key element in brain “anti-aging” due to its ability to increase brain cell mass, which in turn increases mental alertness and memory.\n\nA study done by The Lancet found, “Lithium exerts neurotrophic or neuroprotective effects“.\n\nWhat does that mean?\n• Neurotrophic refers to a family of proteins that induce the healthy development, function, and survival of neurons.\n• Neuroprotective refers to processes within the nervous system that protects neurons from degeneration.\n\nIncreased neuroprotective effects in brain cells prevent cell death caused by neurotoxins, free radicals, chemicals that deplete brain cells including alcohol and drugs, radiation, and dangerous stress-induced hormones such as cortisol.\n\nThere has even been evidence that lithium may enhance the proliferation and specialization of neural stem cells.\n\nThis proves to be exciting because we know that brain cells are lost during the aging process, and the action of lithium on these cells seems to replace the lost brain cells.\n\nResearch surrounding lithium and other disorders and diseases from migraine headaches to Grave’s disease is just beginning.\n\nConditions that Lithium May Help\n\nThe evidence is now showing that areas of low lithium content in the environment have dramatic effects on the population.\n\nTracking the amounts of minerals, toxins, and chemicals in an environment can be simply done by measuring the content found in hair, blood or urine. By studying the amount of lithium in the systems of people in different populations, a graph of behavior can be measured.\n\nResearch has shown that areas containing low amounts of lithium experience more cases of “neurosis, schizophrenia, psychosis, psychiatric ward admissions, homicide, suicide, burglary, and runaways.”\n\nThese kinds of trends have also been noted for other trace minerals lacking in the environment. For example, an increase in the incidence of arthritis and osteoporosis in areas lacking in the trace mineral boron.\n\nTypical dosages of lithium orotate range from 30 mg – 800 mg per day. The higher dosages are usually broken up into 3 dosages per day and are most often for those with bipolar or manic disorders, those recovering from alcoholism, or some of the other disorders listed in ‘Conditions that Lithium May Help’.\n\nIt is best to start with 1 tablet of 120 mg (~5 mg of elemental) 1 – 3 times per day. This is most often sufficient.\n\nHowever, especially in some bipolar or manic disorders, an increase to 2 tablets 3 times a day may prove to be more effective. In rare cases, up to a total of 8 tablets broken into 3 doses per day may be used until stable. After that, a lower dose can be used.\n\nFor maintenance, typically 1 tablet twice per day.\n\nFor more information, please see ‘Lithium Orotate: Misleading Research’ as well as all lithium articles listed at the bottom of this page. An excellent artilce to read for further lithium orotate research can be found at Lithium: The Untold Story Of The Magic Mineral That Charges Cell Phones And Preserves Memory.\n\nLithium orotate should never be confused with lithium carbonate.\n\nBased on research, Lithium carbonate should not be taken if you:\n• Take beta-blockers or other anti-hypertension drugs\n• There are many side effects\n\nLithium carbonate can be toxic; blood levels must be checked regularly.\n\nThe following is the rundown on Lithium orotate:\n• No blood tests are necessary\n• There are no known adverse side effects or drug interactions\n\nAn excerpt from ‘The Importance of Lithium Supplementation’ by Jonathan V. Wright, M.D.\n\nOver a decade ago, a woman visited the Tahoma Clinic on the advice of her psychiatrist. She was severely bipolar, requiring a maximum dose of lithium carbonate to keep her symptoms under control. Despite close monitoring of serum lithium levels to maintain a safe range, she was starting to show many signs of lithium toxicity, including hypertension, tremor, nausea, and protein in her urine. She and her psychiatrist had tried other medications, but none provided the control of her bipolar symptoms that lithium did. So she came to the Tahoma Clinic to see if there were any natural options for her. Fortunately, there was a simple solution. Without changing her lithium dose, the clinic doctor treating her asked the woman to start taking 1 tablespoon of flaxseed oil along with 800 IU of vitamin E (mixed tocopherols) three times a day. One month later, the woman’s blood pressure had normalized, her tremors and nausea were gone, and there was no further protein in the urine. And best of all, her bipolar symptoms remained under control. At that point, she was able to cut the flaxseed oil to 1 tablespoon daily along with 400 IU of vitamin E. Several years later, her lithium toxicity hasn’t returned. To be on the safe side, we always recommend that anyone taking lithium also take a teaspoonful or two of fish oils (or other essential fatty acid such as BIOMEGA-3) along with 400 IU of vitamin E (as mixed tocopherols) each day.”\n\nThis example involved toxic lithium carbonate, not lithium orotate and yet the toxic symptoms were still reversed and then prevented from returning with a simple few supplements that people should be taking every day anyway.\n• The Safe, Unique Mineral with Multiple Uses", "opengraph": {"locale": "en_US", "type": "article", "title": "Lithium", "description": "What does Lithium do? I think the better question may soon be, “What doesn’t lithium do?”", "url": "https://www.onlineholistichealth.com/trace-minerals/lithium.html", "site_name": "Natural Health Blog | Holistic Health Blog", "article:publisher": "https://www.facebook.com/onlineholistichealth", "article:author": "https://www.facebook.com/onlineholistichealth", "article:tag": "Lithium", "updated_time": "2020-04-11T13:59:24-05:00", "image": "https://www.onlineholistichealth.com/wp-content/uploads/2012/02/lithium.jpg", "image:secure_url": "https://www.onlineholistichealth.com/wp-content/uploads/2012/02/lithium.jpg", "image:width": "300", "image:height": "300", "image:alt": "lithium", "image:type": "image/jpeg", "article:published_time": "2012-02-09T17:42:56-05:00", "article:modified_time": "2020-04-11T13:59:24-05:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.onlineholistichealth.com/wp-content/uploads/2012/02/lithium.jpg", "http://en.wikipedia.org/wiki/Neurotrophic_factor", "http://en.wikipedia.org/wiki/Neuroprotective", "https://www.onlineholistichealth.com/boron/", "https://www.onlineholistichealth.com/lithium-orotate-misleading-research/", "https://www.greatplainslaboratory.com/articles-1/2017/1/23/lithium-the-untold-story-of-the-magic-mineral-that-charges-cell-phones-and-preserves-memory", "https://www.onlineholistichealth.com/lithium-orotate-misleading-research/", "https://tahomaclinic.com/2010/05/lithium-the-misunderstood-mineral-part-1/", "https://tahomaclinic.com/2010/06/lithium-the-misunderstood-mineral-part-2/", "https://www.onlineholistichealth.com/alzheimers/", "https://www.onlineholistichealth.com/safe-mineral/"], "authors": [], "publish_date": "2012-02-09T17:42:56-05:00"}