{"result_id": "357011", "URL": "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/", "timestamp": "2023-04-25 18:22:31 CEST+0200", "meta": {"description": "If you feel like your relationship is on shaky ground since the pandemic began, you’re not alone. How can you repair the damage from constant quarantine fighting? Here are eight techniques to try.", "lang": "en", "keywords": "", "favicon": "https://thecompleteherbalguide.com/wp-content/uploads/2022/12/cropped-logo3-32x32.png", "canonical": "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/", "encoding": "UTF-8"}, "image": null, "domain": "thecompleteherbalguide.com", "title": "How to Repair Your Relationship from Constant Quarantine Fighting", "cleaned_text": "How to Repair Your Relationship from Constant Quarantine Fighting\n\nThey say absence makes the heart grow fonder, and right now, you may wish your partner would take an extended holiday to Timbuktu. It’s not that you don’t love them, but too much togetherness during quarantine has you pacing around each other like a pair of alley cats scuffling over territory.\n\nIf you feel like your relationship is on shaky ground since the pandemic began, you’re not alone. How can you repair the damage from constant quarantine fighting? Here are eight techniques to try.\n\nWhat love language do you speak? According to Dr. Gary Chapman, everyone speaks one of five, and you and your partner can take a quiz to discover yours. Once you know what language your partner speaks, you know how to make them tick.\n\nThose who prefer acts of service will feel unloved if you don’t help with the household chores, and those who crave words of affirmation will react poorly to the silent treatment. If you know your partner values physical touch, you can show them you care by increasing spontaneous hugs.\n\nYou know that journaling is an ideal way to soothe your psyche — but it can also heal your relationship. You can use it to write down all the things you are grateful for in your partner and share them to increase closeness. Have you given thanks that they remain healthy? Since the pandemic began, there have been over 1 million reported cases and 50,000 deaths in the United States.\n\nYou can also use your journal to sketch plans. If you had to postpone your vacation because of the pandemic, you could start jotting down ideas for future excursions. This activity can bring you closer together by reminding you that you are partners in adventure.\n\nSometimes, it’s not so much what you say as to how you say it. You might say, “Put your dishes in the sink, please,” but if your partner has a more indirect communication style, they hear, “Don’t make me clean up after you again, you slob.” Take a communications style quiz to discover your preferred method and share it with your partner. This activity can help you avoid disagreements that arise from misunderstanding each other’s statements.\n\nWhen you spend nearly all your time in the house, you want your environment to look tidy and welcoming. However, many couples seethe with resentment over chores left undone instead of agreeing about who is responsible for what.\n\nOne way you can minimize arguments is to make a master chart of chores for you and your partner. When you do, include a set day for performing each task so you can maintain accountability. You might decide to tackle the laundry while your significant other vacuums on Saturday.\n\nIf you know you struggle with anxiety or substance abuse, don’t wage war alone. Enlist help by reaching out to your health insurance company and getting the help you need to recover. If you can’t venture out, new rules on telemedicine bring therapy to you.\n\nIf you don’t have insurance coverage, don’t give up hope. You can find online mental health support groups for nearly any issue. Each gathering has a unique vibe and personality, so if you don’t see much benefit from the first one you try, keep exploring.\n\nHave you ever said something you didn’t meanwhile in your cups? Many people have. With tensions as high as they are, why add fuel to the fire by indulging in alcohol or drug use in quarantine? If you enjoy a glass of chardonnay with dinner, that’s fine, but to preserve your happy union, stick to no more than one to two alcoholic beverages each day.\n\nIf you spend every second with another, it’s natural to begin to find their tics annoying. Maybe you never noticed how your significant other tossed back popcorn by the handful, spilling kernels hither and yon when you went to the theater. Now that every Friday involves Netflix, you find the quirk maddening.\n\nTake a little time alone. Maybe you lose yourself in a hot bath and a novel while your sweetie watches NASCAR. Make it clear that you aren’t taking “me time” to punish your partner, but to keep your relationship healthy.\n\nEven if you stay in, date night helps you feel closer to your partner by keeping the romance alive. Learn how to give each other a massage and mix up homemade relaxation blends with coconut oil and a few drops of your favorite essential oils. If you typically cook dinner as a team, let one partner kick back while the other puts on a meal from soup to nuts.\n\nStop the Bleeding from Constant Quarantine Fighting and Renew Your Relationship\n\nConstant fighting during quarantine can damage your relationship. Revitalize and heal your love by celebrating your union with a few thoughtful tips.", "opengraph": {"locale": "en_US", "type": "article", "title": "How to Repair Your Relationship from Constant Quarantine Fighting", "description": "If you feel like your relationship is on shaky ground since the pandemic began, you’re not alone. How can you repair the damage from constant quarantine fighting? Here are eight techniques to try. ", "url": "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/", "site_name": "Health and Natural Healing Tips", "article:publisher": "https://www.facebook.com/HerbalGuide/", "article:author": "https://www.facebook.com/HerbalGuide/", "article:published_time": "2020-07-20T15:32:27+00:00", "article:modified_time": "2020-12-15T14:40:59+00:00", "image": "https://thecompleteherbalguide.com/wp-content/uploads/2020/07/fighting.jpg", "image:width": "750", "image:height": "500", "image:type": "image/jpeg"}, "tags": ["LATEST UPDATES - MORE ON CORONAVIRUS"], "tweets": [], "movies": [], "links": ["https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/", "#", "https://thecompleteherbalguide.com/category/coronavirus/", "https://thecompleteherbalguide.com/category/coronavirus/latest-coronavirus-covid-19-updates/", "https://thecompleteherbalguide.com/category/marriage-sex-advice/", "https://thecompleteherbalguide.com/entries/family/infant-care-tips/", "https://www.5lovelanguages.com/quizzes/", "https://thecompleteherbalguide.com/entries/free-ebooks/sign-up-for-your-anti-anxiety-formula-guide-free-pdf-download/", "https://www.healthforcalifornia.com/blog/have-you-lost-your-job", "https://thecompleteherbalguide.com/entries/coronavirus/how-to-talk-to-teen-and-tweens-about-coronavirus/", "https://bodymind.com/why-a-list-of-household-chores-is-essential-for-couples-cohabiting-2/", "https://www.psycom.net/mental-health-support-groups", "https://thecompleteherbalguide.com/entries/interviews/relationship-changes-a-woman-s-journey/", "https://www.self.com/story/quarantine-date-ideas", "https://www.psychologytoday.com/us/blog/the-body-blog/201002/stop-fighting-relationship-repair-without-speaking", "https://thecompleteherbalguide.com/entries/dr-kathryn-foster/romance/", "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/?share=twitter", "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/?share=facebook", "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/", "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/", "https://share.flipboard.com/bookmarklet/popout?v=2&url=https%3A%2F%2Fthecompleteherbalguide.com%2Fentries%2Fcoronavirus%2Fhow-to-repair-your-relationship-from-constant-quarantine-fighting%2F&title=How%20to%20Repair%20Your%20Relationship%20from%20Constant%20Quarantine%20Fighting", "https://thecompleteherbalguide.com/entries/coronavirus/how-to-repair-your-relationship-from-constant-quarantine-fighting/"], "authors": ["staceyadmin"], "publish_date": "2020-07-20T15:32:27+00:00"}