{"result_id": "359003", "URL": "http://naturalhealthnews.blogspot.com/2011/01/shingles-natural-treatment-helps.html", "timestamp": "2023-04-25 18:22:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://naturalhealthnews.blogspot.com/favicon.ico", "canonical": "http://naturalhealthnews.blogspot.com/2011/01/shingles-natural-treatment-helps.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthnews.blogspot.com", "title": "Shingles: Natural Treatment Helps", "cleaned_text": "3 grams (3,000 mg) of lysine daily can shorten the duration and lessen the pain/itch. \n\n If you have developed shingles or have repeated outbreaks try 500 mg of lysine daily between meals as insurance after kicking the previous outbreak. Don't take lysine just because you had chicken pox as lysine can reduce arginine. \n\n \n\n In supplement form, high doses of lysine may raise and increase the risk of gallstones, so monitor and let your health provder know you are taking this. \n\n Dietary sources of lysine include meat, fish, dairy products, legumes and brewer's yeast (also B vits and B12). \n\n For more specific natural treatments contact us. \n\n Capsicum is listed in a table as being used for shingles, trigeminal, and diabetic neuralgia, when it is actually the US Food and Drug Administration-approved over-the-counter and prescription drug capsaicin, the vanillanoid compound Natural Health News: So here you have it folks! Lyrica for ... Lyrica, known generically as pregabalin, previously won FDA approval to treat partial seizures, pain following the rash of shingles and pain associated with diabetes nerve damage. The FDA warned that common side effects of the drug ... Shingles is readily treated and resolved with herbal compounds. Historically Black Walnut tincture was used to apply externally to the patches, although I have found that Valerian root tincture can be effective. ... is the same virus as chicken pox. The very painful patches can be treated naturally with valerian root and black walnut tincture. Additionally using St. John's Wort tincture acts as an anti-viral.\n\nThe numbers of newly vaccinated are surprisingly low, considering how much public attention a trio of new shots — which protect against shingles, whooping cough and cervical cancer — received in recent years. ...\n\nThe CDC seems alarmed about current vaccine refusals, like those for shingles, whooping cough and cervical cancer vaccines, which haven't met their numbers. (Great to be a statistic isn't it). Here's the turn-out for these vaccines so", "opengraph": {"url": "http://naturalhealthnews.blogspot.com/2011/01/shingles-natural-treatment-helps.html", "title": "Shingles: Natural Treatment Helps", "description": "For outbreaks, simple approach   500 mcg B Complex/B12 3 grams (3,000  mg) of lysine  daily can shorten the duration and  lessen the pain/it..."}, "tags": ["shingles", "natural health news", "natural treatment for shinglesl"], "tweets": [], "movies": [], "links": ["http://www.leaflady.org/amino_acids.htm", "http://naturalhealthnews.blogspot.com/2010/02/matters-of-heart.html", "http://naturalhealthnews.blogspot.com/2007/06/so-here-you-have-it-folks-lyrica-for.html", "http://naturalhealthnews.blogspot.com/2009/01/overlooked-health-consequences.html", "http://naturalhealthnews.blogspot.com/2008/11/varicella-outbreak-followed-by-forced.html", "http://naturalhealthnews.blogspot.com/2008/01/consider-vaccination-risks-above-all.html", "http://naturalhealthnews.blogspot.com/2008/02/vaccine-madness-continues.html"], "authors": ["Unknown"], "publish_date": null}