{"result_id": "359001", "URL": "http://naturalhealthnews.blogspot.com/2009/03/", "timestamp": "2023-04-25 18:22:47 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://naturalhealthnews.blogspot.com/favicon.ico", "canonical": "http://naturalhealthnews.blogspot.com/2009/03/", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthnews.blogspot.com", "title": "Natural Health News", "cleaned_text": "Thanks to my esteemed colleague, Jeff Rense , for providing this story.By Judit Kawaguchi The Japan Times3-22-9At the age of 97 years and 4 months, Shigeaki Hinohara is one of the world's longest-serving physicians and educators. Hinohara's magic touch is legendary: Since 1941 he has been healing patients at St. Luke's International Hospital in Tokyo and teaching at St. Luke's College of Nursing. After World War II, he envisioned a world-class hospital and college springing from the ruins of Tokyo; thanks to his pioneering spirit and business savvy, the doctor turned these institutions into the nation's top medical facility and nursing school. Today he serves as chairman of the board of trustees at both organizations. Always willing to try new things, he has published around 150 books since his 75th birthday, including one \"Living Long, Living Good\" that has sold more than 1.2 million copies. As the founder of the New Elderly Movement, Hinohara encourages others to live a long and happy life, a quest in which no role model is better than the doctor himself.Doctor Shigeaki HinoharaJUDIT KAWAGUCHI PHOTOEnergy comes from feeling good, not from eating well or sleeping a lot. We all remember how as children, when we were having fun, we often forgot to eat or sleep. I believe that we can keep that attitude as adults, too. It's best not to tire the body with too many rules such as lunchtime and bedtime.All people who live long - regardless of nationality, race or gender - share one thing in common: None are overweight. For breakfast I drink coffee, a glass of milk and some orange juice with a tablespoon of olive oil in it. Olive oil is great for the arteries and keeps my skin healthy. Lunch is milk and a few cookies, or nothing when I am too busy to eat. I never get hungry because I focus on my work. Dinner is veggies, a bit of fish and rice, and, twice a week, 100 grams of lean meat.Always plan ahead. My schedule book is already full until 2014, with lectures and my usual hospital work. In 2016 I'll have some fun, though: I plan to attend the Tokyo Olympics!There is no need to ever retire, but if one must, it should be a lot later than 65. The current retirement age was set at 65 half a century ago, when the average life-expectancy in Japan was 68 years and only 125 Japanese were over 100 years old. Today, Japanese women live to be around 86 and men 80, and we have 36,000 centenarians in our country. In 20 years we will have about 50,000 people over the age of 100.Share what you know. I give 150 lectures a year, some for 100 elementary-school children, others for 4,500 business people. I usually speak for 60 to 90 minutes, standing, to stay strong.When a doctor recommends you take a test or have some surgery, ask whether the doctor would suggest that his or her spouse or children go through such a procedure. Contrary to popular belief, doctors can't cure everyone. So why cause unnecessary pain with surgery? I think music and animal therapy can help more than most doctors imagine.To stay healthy, always take the stairs and carry your own stuff. I take two stairs at a time, to get my muscles moving.My inspiration is Robert Browning's poem \"Abt Vogler.\" My father used to read it to me. It encourages us to make big art, not small scribbles. It says to try to draw a circle so huge that there is no way we can finish it while we are alive. All we see is an arch; the rest is beyond our vision but it is there in the distance.Pain is mysterious, and having fun is the best way to forget it. If a child has a toothache, and you start playing a game together, he or she immediately forgets the pain. Hospitals must cater to the basic need of patients: We all want to have fun. At St. Luke's we have music and animal therapies, and art classes.Don't be crazy about amassing material things. Remember: You don't know when your number is up, and you can't take it with you to the next place.Hospitals must be designed and prepared for major disasters, and they must accept every patient who appears at their doors. We designed St. Luke's so we can operate anywhere: in the basement, in the corridors, in the chapel. Most people thought I was crazy to prepare for a catastrophe, but on March 20, 1995, I was unfortunately proven right when members of the Aum Shinrikyu religious cult launched a terrorist attack in the Tokyo subway. We accepted 740 victims and in two hours figured out that it was sarin gas that had hit them. Sadly we lost one person, but we saved 739 lives.Science alone can't cure or help people. Science lumps us all together, but illness is individual. Each person is unique, and diseases are connected to their hearts. To know the illness and help people, we need liberal and visual arts, not just medical ones.Life is filled with incidents. On March 31, 1970, when I was 59 years old, I boarded the Yodogo, a flight from Tokyo to Fukuoka. It was a beautiful sunny morning, and as Mount Fuji came into sight, the plane was hijacked by the Japanese Communist League-Red Army Faction. I spent the next four days handcuffed to my seat in 40- degree heat. As a doctor, I looked at it all as an experiment and was amazed at how the body slowed down in a crisis.Find a role model and aim to achieve even more than they could ever do. My father went to the United States in 1900 to study at Duke University in North Carolina. He was a pioneer and one of my heroes. Later I found a few more life guides, and when I am stuck, I ask myself how they would deal with the problem.It's wonderful to live long. Until one is 60 years old, it is easy to work for one's family and to achieve one's goals. But in our later years, we should strive to contribute to society. Since the age of 65, I have worked as a volunteer. I still put in 18 hours seven days a week and love every minute of it.Judit Kawaguchi loves to listen. She is a volunteer counselor and a TV reporter on NHK's \"Out & About.\" Learn more at: http:// juditfan.blog58.fc2.com", "opengraph": {"url": "http://naturalhealthnews.blogspot.com/2009/03/", "title": "Natural Health News", "description": "Now in it's 8th year online, based on 50+ years of study and use of Natural Health Care, and healthcare professional, the author of Natural Health News - the first natural news - brings expertise to today's health issues."}, "tags": ["Green Living", "natural news", "health care reform", "Humira headache", "BlogTalkRadio", "Merck", "carotenoids", "gardening", "printing money out of thin air", "independent news", "digital TV health risk", "hemoglobin", "natural care", "Vitamin D", "chronic pain", "natural animal care", "rense.com. saltrocks.org", "EMF", "simply4health", "the leaflady", "thermography", "Bach", "WEEP Initiative", "mammogram causes breast cancer", "grow organic food", "arthritis", "EHS", "Cilengitide", "natural health care", "AIDS", "Republic Broadcasting", "natural health ed", "microwave", "thyroid", "herbalYODA Says LIVE", "nutrition", "Leach", "women's health", "Alliderm", "fibromyalgia", "HIV", "blue light", "energy drinks", "Health Matters", "Flower Essence Society", "heart disease", "natural health expert", "prevent breast cancer", "increased heart rate", "These Orwellian Times", "Eletromagnetic sensitivity month", "hand washing", "aspirin", "vitamin A", "HB759", "natural health news", "awareness", "polypill", "cell phone danger", "Metrofarm", "Natural Notes on Health", "herbalYODA Says", "flower essences", "Fisher lab", "radiology", "HB 875", "Christine Gregoire", "consumer health", "honey", "Pink Himalayan salt", "cherries", "Natural Products Foundation", "iodine", "leg ulcers", "veterans", "high blood pressure", "WIFI", "cancer in dogs and cats", "MRSA", "pregnancy", "Food Chain Radio", "Thermomed", "rising cost of health care", "pet health", "Alli-C", "My Happy Garden", "tuna", "tuna calculator", "endocrinology", "herbalYODA's sportZtea", "organic living expert", "Butch Chancellor", "maggots", "2009", "Stacy Ritter", "supplements and health", "health insurance", "GammaSalt", "Healing Herbs", "oxygen", "cancer", "high fluoride content", "nascent iodine", "out-of-network billing", "TerraCycle", "learn natural health care"], "tweets": [], "movies": [], "links": ["http://www.rense.com"], "authors": ["Unknown"], "publish_date": null}