{"result_id": "359004", "URL": "http://naturalhealthnews.blogspot.com/", "timestamp": "2023-04-25 18:22:51 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://naturalhealthnews.blogspot.com/favicon.ico", "canonical": "http://naturalhealthnews.blogspot.com/", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthnews.blogspot.com", "title": "Natural Health News", "cleaned_text": "“It's a viral organism and at first it was only spread by fluid, body fluids,” he said. “So you had to come in contact with the body or get some of the fluids, serum or blood, in order to contract it. It was \n\n \n\n \"There's evidence now from a Canadian study that in fact it may be airborne and what they do is they separate animals and they infect one group of animals and see if it will spread to the isolated other ones that are exposed to the air, and it did spread,\" Blaylock said. \"Now the U.S. doctors are saying that they don't believe that, but the Canadian study was very well done and it's sort of irrefutable \n\n \n\n Quarantine is the only sure way to keep it from spreading, Blaylock said. But in Africa, where it has reached a public health crisis, people were not quarantined soon enough, allowing the disease to \n\n\n\n “When we first had Ebola appear in Africa, they did a pretty good job of quarantining and it didn't really spread,” he said. “But this time, they let it get out. Families were invading areas that they were told not to go into because they wanted to see their loved ones the last time, and they underestimated the virus itself because they were wearing these HazMat suits and protective gear, but the virus still spread to \n\n\n\n Blaylock said it is highly risky for the government to ship Americans who contracted Ebola while working in Africa back to the United States \n\n\n\n “One of the big mistakes they made is shipping these people back to the United States because they can share the virus two months later,” he said. “A carried situation, for instance, in the semen it's alive for two months after the patient recovers.” \n\n\n\n Blaylock, author of the “Blaylock Wellness Report,” said he does not trust the Centers for Disease Control and Prevention to protect the \n\n\n\n “I don't have confidence in the CDC,” he said. “They have numerous times shown that their interest is in money from different sources. They've made so many errors; they've shipped out a dangerous virus to researchers from the USDA that could have caused an epidemic of Bird Flu. So I don't have a lot of confidence in the CDC.” \n\n\n\n On the upside, according to Blaylock, should Ebola make its way to the United States, it is not likely to have the same 90 percent-100 percent mortality rate it does in Africa. \n\n\n\n “Almost all Africans are infected with parasites, parasites suppress the immune system,” he said. “So these people have poor dietary supplementation which makes their immune system weak. They have the parasitic infections which inhibit the immune system's ability to \n\n\n\n He suggests D3 vitamin supplements and a low-sugar diet since sugar is\n\nThe growing epidemic of Ebola in Africa is a big cause for concern among the general public. The media coverage of this aggressive illness is not much help. Though there is a truth to the aggressive and disturbing nature of Ebola, there is some hope nestled in our growing understanding of the infection. Although it has high mortality but we have to look at folks who survived, what was the protective mechanism in these folks? In this article we will look at the nature of this virus and what we can learn about protecting ourselves.\n\nFirst recorded Ebola outbreak originated in Democratic Republic of Congo in the year 1976.[1] Since then , there have been over 20 outbreaks in various countries in Central and Western Africa. The mortality rate among infected persons during these outbreaks has been 50-90%.[1] High mortality rate has made Ebola virus one of the most aggressive infectious agent known to people. The recent outbreak in West African countries of Guinea, Liberia, Sierra Leone, and Nigeria has been the largest in the short history since our introduction to this virus.[2]\n\nEbola is relatively rare infection among humans. Fruit bats of Africa are believed to the original host of the Ebola virus. Human infections like occur due to direct contact with blood or other body secretions of infected animals. “In Africa, infection has been documented through the handling of infected chimpanzees, gorillas, fruit bats, monkeys, forest antelope and porcupines found ill or dead or in the rainforest.”[1] Within the community, the infection spreads via human-to-human transmission. The routes of transmission are still limited to direct contact with blood and other body secretions of the infected or dead victims of Ebola.[3]\n\nUpon contraction of the Ebola virus, the illness begins with flu-like symptoms, body aches, fatigue, headaches, and fever. Some may also develop a bruising rash on the skin, described as a hemorrhagic rash. In the later stages, these individuals develop loss of appetite, severe stomach ache, diarrhea with or without bleeding, and vomiting.[4] Hemorrhage and loss of blood are the most devastating aspects of the infection and often result in fatality. The infection runs its course within 14-21 days.[5] During this time, if the virus does not kill the infected person, the immune system of the person is able to overcome the disease.\n\nResearchers have been able to shed a lot of light on how the Ebola virus affects the biology of the infected person. This may also shed some light on ways to defend against the infection. Ebola virus contains two very similar glycol-proteins (GPs); which form the interactive protein structure that appears on the surface of the virus.[5] The GPs bind to the receptor proteins located on the host human cells on various organs. Cells of the gastrointestinal tract, bloodstream, and immune system are the first to be affected by viral invasion. After invading the cell, virus over-takes the cell’s protein production and depletes the cell. Infection of circulating immune cells like monocytes and dendritic cells weakens the immune cells; because they are circulatory, these cells carry the virus to all parts of the body.[6] Viral activity also manipulates these cells to create high amount of inflammatory signaling molecules. In response to inflammation,\n\nendothelial cells of the blood vessels become more porous causing bleeding problems. The worst effects of the infection are seen on circulatory and immune system of the infected person. These effects result in the symptoms of diarrhea, vomiting, hemorrhage, and immune debility experienced by Ebola patients.\n\nThe Role of the Immune system and the Survival Factor\n\nOne arm of Ebola’s fatality weakens the immune system making it difficult for the body to mount a response. However, the body and the immune system are persistent for survival – research looking at the immune function of survivors and nonsurvivors is teaching us about nature’s best strategy to overcome. The first defensive response of the immune system is to recognize and bind to the viral proteins. This is a double-edged sword, because this is also the easiest way for the cell to become infected. The surveillance immune cells (B-cells) bind to virus and produce IgM antibodies to recruit other immune cells to neutralize the virus.[7] Antiviral T-cell lymphocytes become involved; these produce IgG antibodies that reinforce the defensive action against the virus. Production of IgM and IgG antibodies represent virus-specific signals for the immune system to recognize and eliminate the virus.\n\nStudies that compared immune systems of survivors with the immune function of non-survivors of Ebola illustrate the differences in immune activity. Among survivors of Ebola infections during a 1996 outbreak in Gabon, Sudan; it was found that these individuals had greater concentration of IgM and IgG antibodies7 and also had more sustained antiviral T-cell response. Comparatively, all of these were deficient among the non-survivors. The immune system of the non-survivors was slower to respond, thus sustained greater loss due to death of immune cells – this resulted in ultimate fatality.[7]\n\nIn a study of 2000-2001 Ebola outbreak in Gulu, Uganda; researchers looked at similar parameter of the immune system[8]. In this study, the researcher looked at the immune responses of blood samples from survivor and non-survivors of this outbreak. It was discovered that survivors had developed antibodies against various proteins on the virus. These antibodies were still active in the survivors after the infection had passed. In a 12 year follow-up study with the survivors, the immune systems still carried IgM antibodies against the viral proteins.[9] These individual still produced a significant immune response to injected viral proteins over a decade after exposure to the illness.\n\nThis group of studies and others like them are recognizing the central role of the immune system in survival. For an infection like Ebola, which has no apparent clinical cure, natural reinforcement of the immune system may represent an oasis of hope in the desert of fear and panic.\n\nPrevention is the best treatment: As far as we know, this virus is transmitted through bodily fluids and it is not air borne. You are not going to contract this virus in flying or sitting next to Ebola infected person, unless come in contact with blood, vomitus, stool, urine or get injected with infected needle. Proper infection control techniques will be highly effective in controlling this disease. Even once you are in contact with these bodily fluids, washing with soap can be highly effective in warding off this infection, unless you have open wounds on your skin.\n\nHealthy nutrition is the best way to keep your immune system boosted. Diets that are high in a variety of vegetables and fruits are most beneficial. Fruits and vegetables are packed with naturally occurring vitamins and minerals that support healthy enzymatic function in the body. A review of research indicates that fruits and vegetables in the diet support antioxidant, detoxification, immune activity and hormonal metabolism in the body.[10] Dietary mushrooms are source of polysaccharides like β-glucan, that are directly modulate activity of the immune system.[11] An average healthy diet must include up to 4-5 servings of a variety of vegetables every day; and 1-2 servings of fresh fruits every day.\n\nExercise is an important foundation of health. Exercising supports the immune system through its physiological and mechanical effects on the body. Exercise can help flush out infective agents and cancer-causing toxins by promoting elimination of waste through urine and sweat.[12] It improves circulation of in general – promoting circulation of immune cells and antibodies through all parts of the body. In a research study, moderate exercise performed over 12-15 weeks reduced the number of sick days by half.[13] On the other hand; excessive rigorous exercise can weaken the body’s defenses. Moderate exercise includes, 30-40 minutes of brisk walk 4-5 days every week.\n\nSleep is one the most healing aspects of daily life. It is the one time when the anabolic (building) functions in the body outpace the catabolic (destructive) functions in the body. Undisturbed sleep can be one of the most regenerative activities that an individual can have every day. Sleep is part of the sleep-wake cycle that helps to balance the circadian rhythm of hormones and physiological activity of the body. This aspect of sleep has a powerful regulatory effect on immune function of the individual;[14] More specifically, sleep has been shown to improve communication between immune cells and improve immunological memory.\n\nStress is a natural part of life that is an essential motivator survival and change. However, excessive stress and inadequate stress management can become detrimental to health. Just like a stretched rubber-band loses its elasticity over time, a stressed system loses its immunity as well. Chronic stress can make a weak immune system even weaker, increasing susceptibility to disease.[15] Simple stress relieving activity like exercise, deep breathing, yoga, and joyful recreational activity must be incorporated into daily life to induce effective transition into a relaxed state.\n\nHerbal support is the next line of protection that adds to the benefits of daily activity. Ayurveda offers a wide range of herbs called rasayana. According to the Ayurvedic theory, rasayana herbs are rejuvenative medicines that promote health at all tissue levels of the body. The traditional model of tissue formation teaches us that the components of blood related to nourishment like plasma (rasa) and red blood cells (rakta) are formed first. On the other hand, Ojas which represents components of the hormonal system, immune cells, etc. are formed at the end of the process of tissue formation. Rasayana herbs have the capacity to support healthy metabolism at all levels tissue formation – thus, promoting nourishment and protection.\n\nAmla, Emblica officinalis, is one of the more popular rasayana. It has been used as part of a traditional formula called Chyawanprash for over 2000 years. Amla is a very useful antioxidant and liver supportive herb. Antioxidant function of this herb has a regenerative effect on the immune system.[16] The liver supportive activity of Amla has been shown to restore anti-oxidant system of the liver and restore elevated liver enzymes to normal. It has been observed to protect liver damage due to toxins and protect development of liver cancer.17,18 Liver is the primary detoxing organ of the body. Optimal function of the liver reduces toxic burden and allows the immune system to deal with real threats.\n\nAshwagandha, Withania somnifera, is an excellent adrenal supportive herb that has tonifying effect on the whole hormone system. Ashwagandha contains glycoside compound of Ashwagandha have been observed to reduce stress on the adrenal gland and stimulate the thyroid gland activity.[19] This demonstrates the anti-stress activity and pro-metabolic activity of Ashwagandha. Both of these reinforce immune activity of the individual, indicated by the mobilization and activation of immune cells.[20] Ashwagandha has also been observed to reverse immune-suppression caused by steroid use.[21] Ashwagandha herb is one of the best hormonal and immune modulator offered by Ayurvedic tradition. In 1903 plague epidemic, people who were given Ashwagandha survived. Ashwagandha does not have strong antibacterial properties, but it does stimulate host defense.\n\nTurmeric, Curcuma longa, this common household spice is emerging as a miraculous anti-inflammatory agent. While healthy, controlled inflammation is a part of a normal immune response; excessive inflammation causes tissue damage and depletion of the immune system. Turmeric contains the compound curcumin, which is recognized for helping control inflammation as effectively as Non-Steroidal anti-inflammatory drugs (NSAID). In animal studies, Curcumin has been observed to be equal Ibuprofen to prevent inflammatory plaque formation in Alzheimer disease.[22] Curcumin does this without the risk of toxicity seen with NSAIDs. Additionally, Curcumin’s effectiveness has been demonstrated in chronic diseases, inflammatory bowel disease, obesity and other metabolic diseases.23,24,25 When unnecessary inflammation is brought under control this takes a lot of stress from immune system and the adrenal gland – this also protects from inflammatory tissue damage.\n\nAltogether, managing inflammation in this way makes the immune system more efficient.\n\nGuduchi, Tinospora cordifolia, is a versatile herb for supporting immune and liver function. Guduchi is traditionally used in wide variety of conditions for its combination of anti-oxidant, anti-inflammatory, immune modulating and liver supportive actions.[26] A review of research indicates that Guduchi produces Its anti-inflammatory effect through blocking the effect of inflammatory signals like histamine, bradykinin, etc.[27] Immune supportive activity of this herb is demonstrated in animal studies by elevation and circulation of B-cell and T-cell lymphocytes, which perform surveillance and elimination of infective agents.28,29 In a demonstration of its dual functions as liver and immune support, Guduchi treated amoebiasis in animals by reversing liver abscess.[29]\n\nIn the midst of worries of a global epidemic, natural medicine offers some very helpful and applicable strategies for protecting oneself. These are simple life-promoting daily activities that help the individual conform with nature. Blending with nature in this way is what allowed our ancestors to survive when there were no drugs available. Following the nature’s wisdom is the ideal way to bring balance and health; this is the first step to effective prevention.\n\n\"Truth and love must prevail over lies and hatred.\" Vaclav Havel, 1936-2011\n\nYou may find more on viruses and vaccines on Natural Health News using our search box\n\nPatients who are critically ill with Ebola have high nutritional requirements that need to be addressed. Nutritional feeding is critical to patient outcome. Natural Allopathic Medicine takes a different approach than contemporary medicine. Instead of using toxic pharmaceuticals that diminish the immune system by further driving down nutritional status we use we treat and cure through the fulfillment of nutritional law.\n\nWe do not need to develop expensive drugs waiting while millions potentially die. Right in the emergency room are already excellent medicines that doctors are familiar with that save lives every day. Nutritional medicine is safer and more effective than pharmaceutical medicine. Just ask an emergency-room or intensive-care-ward doctor right after he has injected magnesium chloride or sodium bicarbonate to save someone’s life.\n\nWith Ebola raging in Africa and threatening the rest of the world it is inexcusable that medical and health officials continue to frown on the use of un-patentable medicines like those mentioned above. The substances in the Natural Allopathic protocol for Ebola offer a power unequalled in the world of medicine that we can harness to save many lives of people infected with Ebola. However, some people would enjoy seeing millions if not billions of people die to reduce population down to a more manageable level. Others would rather stick with their professional pride or obedience to medical officials and let patients die than even think of what should work to decrease the death rate from Ebola. It really would be a shame if the medical world stands by and lets this pandemic take hold.\n\nThe secrets of emergency room and intensive care medicine holds the key to resolving Ebola. Magnesium salts, sodium bicarbonate (baking soda), iodine, selenium and vitamin C are concentrated nutritional medicinals that have been used in the direst of medical circumstances. They are widely available, inexpensive and safe to administer round the clock at high dosages.\n\nThe core of the Natural Allopathic protocol redefines the way emergency room and intensive care should be practiced on Ebola patients with proven fast-acting, safe, concentrated and mostly injectable nutritional medicines. If the Ebola infection truly gets out of hand, it is comforting for parents to know that they can legally administer these same medicinals if infected people are treated at home. All of the Natural Allopathic Medicines can be also taken orally or used transdermally (topically) to almost the same effect if treatment is started early enough.\n\nPeople who either choose home care or have no other option need to treat everyone in the home at the same time whether demonstrating symptoms or not. Waiting for the contagion to spread inside a family, or with health care professionals in hospitals and clinics, is unwise. The main idea is to get out in front of the virus.\n\nStopping Ebola, The Ayurvedic ApproachEbola Can Go Airborne - Russell Blaylock MDRobert Cathcart MDRead a new and informative article by my colleague Ken Stoller MDand http://www.bolenreport.com/Ebo%20Lie.htm Recall that 1996 book published by my colleague of many years titled \"Aids, Ebola, and Emerging Viruses\"?FYI: The US CDC is the patent holder for the ebola virus.See this page I developed years ago when the SARS outbreak had everyone in a terror, or so the CDC and FDA hoped. http://www.leaflady.org/immune_system_health.htm Part 1 - A different way of looking at Ebola", "opengraph": {"url": "http://naturalhealthnews.blogspot.com/", "title": "Natural Health News", "description": "Now in it's 8th year online, based on 50+ years of study and use of Natural Health Care, and healthcare professional, the author of Natural Health News - the first natural news - brings expertise to today's health issues."}, "tags": ["green beans", "natural news", "EHR", "forced vaccination", "diet soda", "breast health", "Ebola", "diabetes", "Dr Gayle Eversole", "leaflady.org", "B Vitamins", "natural treatment for virus", "virus", "fluoride", "pollution", "immune system health", "natural mental health", "orthomolecular medicine", "Vitamin D", "Dr. Gayle Eversole", "nutrients", "juice", "natural cancer care", "cholesterol", "possibility", "Alzheimer' s", "KISS", "thermography", "cancer", "herbs", "bean pod tea", "Rense.com", "Dr Sherri Tenpenny", "a natural news", "depression", "vaccines", "ultrasound", "Vita Mix", "string beans", "natural health news"], "tweets": [], "movies": [], "links": ["http://orthomolecular.org/resources/omns/v10n13.shtml", "http://www.liberianobserver.com/security/ebola-aids-manufactured-western-pharmaceuticals-us-dod", "http://www.globalresearch.ca/the-ebola-virus-pandemic-a-weapon-of-mass-destruction/5394976", "http://www.bolenreport.com/EbolaIndianProtocol.htm", "http://www.leaflady.org/urine_therapy.htm", "http://vitamincfoundation.org/www.orthomed.com/ebola.htm", "http://blogs.scientificamerican.com/molecules-to-medicine/2014/10/06/ebola-in-the-u-s-politics-and-public-health-dont-mix/", "http://www.incurable-me.com/#!ebola/csxo", "http://ayurvedicscience.com/newsletters/the-ebola-epidemic-strategies-for-prevention/", "https://us-mg6.mail.yahoo.com/neo/b/message?search=1&s=doc+art&startMid=0&sort=date&order=down&mid=1_0_AAznjkQAAALHU%2BA3dwAAAElzdNc&fid=Inbox#_edn1", "http://drsircus.us1.list-manage1.com/track/click?u=25b08cc8b5ebaf472984d04d0&id=c18406db63&e=0315b56721", "https://www.blogger.com/null", "http://drsircus.us1.list-manage.com/track/click?u=25b08cc8b5ebaf472984d04d0&id=f5cc04a9d5&e=0315b56721", "http://www.bolenreport.com/Ebo%20Lie.htm", "http://www.leaflady.org/immune_system_health.htm"], "authors": ["Unknown"], "publish_date": null}