{"result_id": "359005", "URL": "http://naturalhealthnews.blogspot.com/2015/03/more-on-negative-impact-of-electronic.html", "timestamp": "2023-04-25 18:22:52 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://naturalhealthnews.blogspot.com/favicon.ico", "canonical": "http://naturalhealthnews.blogspot.com/2015/03/more-on-negative-impact-of-electronic.html", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthnews.blogspot.com", "title": "More on the negative impact of Electronic Health Records", "cleaned_text": "I appreciate Dr. Tenpenny's words on the behalf of health. I have held this out for years as well and have been encouraging people to get a clear understanding of this issue.\n\nIn 2011, the Centers for Medicare & Medicaid Services (CMS) began a program to entice doctors and hospitals to incorporate the use of Electronic Health Records (EHR). The carrot? The promise of convenience, coordinated care, fewer medical errors, more efficient office visits, faster billing, improved access to medical records. Oh yeah, and they were told, “If you want to get paid, you must convert and bill electronically.”\n\nwere required for in a practice. Therefore, the government offered to encourage participation. The Medicare EHR Incentive Program offered to pay up to $44,000 over 5 years to cover the cost to implement a specific type of EHR, one that was certified to store and easily transfer structured data. The Medicaid EHR Incentive Program, offered to pay up to $63,750 over six years. In exchange, providers had to prove they were using the EHRs in a “meaningful way,” now simply referred to as “meaningful use”, or MU. The EHR programs were costly. The set up and implementation fees, which could bewere required forin a practice. Therefore, the government offeredto encourage participation. The Medicare EHR Incentive Program offered to pay up to $44,000 over 5 years to cover the cost to implement a specific type of EHR, one that was certified to store and easily transfer structured data. The Medicaid EHR Incentive Program, offered to pay up to $63,750 over six years. In exchange, providers had to prove they were using the EHRs in a “meaningful way,” now simply referred to as “meaningful use”, or MU.\n\n13 were required and 5 were could be selected from a menu of 9 criteria. Beginning in 2015, the number of core objectives increased to 20 and physicians are now required to report 9 out of 64 total clinical quality measures (CQMs). Here is a sort list of CQMs reported to the government: The CMS incentive programs came with a stipulation: data must be reported back to CMS. In 2014, providers had to meet the Stage 1 requirements, which included documenting13 were required and 5 were could be selected from a menu of 9 criteria. Beginning in 2015, the number of core objectives increased to 20 and physicians are now required to report 9 out of 64 total clinical quality measures (CQMs). Here is a sort list of CQMs reported to the government:\n\nOne of the Stage 2 meaningful use core objectives is that hospitals and providers to a public health registry or to the immunization information system (data banks). In other words, if the state’s system can accept vaccine records, the data must be sent.\n\nSo, what happens if doctors and hospitals do not comply with these reporting requirements? Beginning in 2015, and each subsequent year, Medicare and Medicaid will decrease reimbursement by 1% per year, up to a maximum of 5%\n\nThe EHR has turned out to be very different than advertised. Big Government, Big Data and Big Health Insurance promised convenience, efficiency and coordinated care. What are they instead? A Big Fat Lie. The truth is, these systems were created to spy on billing, and put government in control of doctors. They have nothing to do with improving patient care.\n\nYour doctors may not have known how bad the government-mandated EHRs were going to be when they enrolled in 2011, but certainly they know how bad they are now.\n\n61 percent would not encourage a career in the medical field due to the impact of decreasing reimbursements, billing and collection hassles lifestyle choices. (And I would add, doctors are leaving due to fear of government retribution and the loss of the doctor-patient relationship.) Is it any wonder that, according to projections by the Association of American Medical Colleges, the nation anticipates a shortage more than 90,000 physicians by 2020 and 130,000 physicians by 2025? In a recent61 percent would not encourage a career in the medical field due to the impact of decreasing reimbursements, billing and collection hassles lifestyle choices. (And I would add, doctors are leaving due to fear of government retribution and the loss of the doctor-patient relationship.)\n\nI actually saw this coming.\n\nThat’s why we still use paper records. We protect your privacy… and we do not administer vaccines.\n\nIn a stark reminder of growing costs, the government has released a new estimate that healthcare spending grew to a record 17.3% of the U.S. economy last year, marking the largest one-year jump in its share of the economy ...", "opengraph": {"url": "http://naturalhealthnews.blogspot.com/2015/03/more-on-negative-impact-of-electronic.html", "title": "More on the negative impact of Electronic Health Records", "description": "  I appreciate Dr. Tenpenny's words on the behalf of health.  I have held this out for years as well and have been encouraging people to get..."}, "tags": ["Dr Gayle Eversole", "EHR", "Dr Sherri Tenpenny", "forced vaccination", "a natural news", "natural health news"], "tweets": [], "movies": [], "links": ["http://www.informationweek.com/healthcare/electronic-health-records/ehr-deployment-costs-approach-$30000-per-doctor/d/d-id/1102574?", "http://www.cms.gov/Regulations-and-Guidance/Legislation/EHRIncentivePrograms/index.html?redirect=/ehrincentiveprograms/", "http://blog.cms.gov/2015/01/29/cms-intends-to-modify-requirements-for-meaningful-use/", "http://www.cms.gov/Regulations-and-Guidance/Legislation/EHRIncentivePrograms/Downloads/EP_MU_TableOfContents.pdf", "http://www.beckershospitalreview.com/hospital-physician-relationships/physicians-unlikely-to-encourage-young-people-to-enter-the-field-survey-finds.html", "http://tenpennyimc.com/", "http://naturalhealthnews.blogspot.com/2010/04/saving-billions-without-electronic.html", "http://naturalhealthnews.blogspot.com/", "http://naturalhealthnews.blogspot.com/2009/03/high-cost-and-waste-us-health-care.html", "http://naturalhealthnews.blogspot.com/", "http://naturalhealthnews.blogspot.com/2009/06/falsifying-medical-records.html", "http://naturalhealthnews.blogspot.com/", "http://naturalhealthnews.blogspot.com/2010/02/health-costs-on-steroids.html", "http://naturalhealthnews.blogspot.com/", "http://naturalhealthnews.blogspot.com/2009/02/today-with-katherine-albrecht.html", "http://naturalhealthnews.blogspot.com/", "http://naturalhealthnews.blogspot.com/2010/10/electronic-medical-records-more-fraud.html", "http://naturalhealthnews.blogspot.com/", "http://naturalhealthnews.blogspot.com/2010/06/electronic-medical-records-hundreds-of.html", "http://naturalhealthnews.blogspot.com/"], "authors": ["Unknown"], "publish_date": null}