{"result_id": "360007", "URL": "http://naturalhealthezine.com/mandatory-vaccinations-from-the-government/", "timestamp": "2023-04-25 18:22:58 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://naturalhealthezine.com/favicon.ico", "canonical": "http://naturalhealthezine.com/mandatory-vaccinations-from-the-government/", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthezine.com", "title": "Protect yourself against Mandatory Vaccinations from the Government", "cleaned_text": "You probably have heard a little bit about the government’s plans to initiate mandatory vaccinations for the Swine Flu Virus. While it seems like something that can only happen in movies, it is very close to being executed…\n\nThe United States Emergency Medical Powers Acts and Federal legislation, including the Patriot Acts I, II and III, BARDA and others provide for mandatory vaccination or drugging. No exemptions (religious or otherwise) are provided. Those who refuse will be classified as felons at the State level, subject to immediate incarceration and quarantine of indefinite length in jails or other facilities reserved for such “vaccine refusers.” In a frightening “Big Lie” propaganda move, those who doubt the effectiveness of unproven, uninsurable vaccines are being called ” Vaccine Resisters” and being equated to a new form of “terrorism.” That means that untested, potentially lethal vaccines and dangerous drugs like Tamiflu could be forced upon people who do not wish them and who would face incarceration or worse if they choose not to accept them. The CDC has said that there would be no exemptions and that there would be “a certain amount of human wastage”. Instead, we demand the right to Self-Shield in our own homes!\n\nWatch the video to find out more…\n\nWhat You Can Do NOW!!\n\nWe must make this demand that the government respect our rights become “viral” through your efforts and result in many hundreds of thousands of messages to decision makers, on the State and Federal levels! You can fill complete the form below and we will send it to your congressional and state representatives. You can also forward this request to your friends and family.\n\nClick this link to respond to government leaders", "opengraph": {"locale": "en_US", "type": "article", "title": "Protect yourself against Mandatory Vaccinations from the Government", "description": "You probably have heard a little bit about the government's plans to initiate mandatory vaccinations for the Swine Flu Virus. While it seems like something that can only happen in movies, it is very close to being executed...", "url": "http://naturalhealthezine.com/mandatory-vaccinations-from-the-government/", "site_name": "Natural Health Ezine", "article:published_time": "2009-07-21T18:26:42+00:00", "article:modified_time": "2009-07-31T15:56:44+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["http://salsa.democracyinaction.org/o/568/campaign.jsp?campaign_KEY=27275", "http://naturalhealthezine.com/where-to-buy-bulk-spices-and-herbs/", "http://naturalhealthezine.com/where-to-buy-bulk-spices-and-herbs/", "http://naturalhealthezine.com/how-do-you-eat-a-pomegranate/", "http://naturalhealthezine.com/how-do-you-eat-a-pomegranate/", "http://naturalhealthezine.com/stuffed-green-peppers-recipe/", "http://naturalhealthezine.com/stuffed-green-peppers-recipe/", "http://naturalhealthezine.com/natural-remedies-for-vericose-veins/", "http://naturalhealthezine.com/natural-remedies-for-vericose-veins/", "http://naturalhealthezine.com/natural-antifungals/", "http://naturalhealthezine.com/natural-antifungals/", "http://naturalhealthezine.com/home-garden-natural-repellants/", "http://naturalhealthezine.com/home-garden-natural-repellants/"], "authors": [], "publish_date": "2009-07-21T18:26:42+00:00"}