{"result_id": "360008", "URL": "https://naturalhealthezine.com/tulsi-health-benefits2/", "timestamp": "2023-04-25 18:22:59 CEST+0200", "meta": {"description": "A look at some of the wonderful health benefits of Tulsi...", "lang": "en", "keywords": "", "favicon": "http://naturalhealthezine.com/favicon.ico", "canonical": "https://naturalhealthezine.com/tulsi-health-benefits2/", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthezine.com", "title": "Tulsi Health Benefits", "cleaned_text": "There’s an herb that is not well known yet to the Western world, but it’s becoming more popular. It’s bound to gain more recognition the more we get to know the health benefits of the herb. It’s called Tulsi , or Holy Basil. Tulsi has been around for thousands of years and is highly honored in India for its amazing healing properties. Tulsi health benefits provide more than just healing abilities. Health benefits such as boosting the immune system, enhancing stamina, and promoting a healthy metabolism can prevent sickness from occurring. Tulsi health benefits are vast. Let’s take a look at just a few of the advantages it provides.\n\nThe healing power of Tulsi is astounding. Chewing the leaves can clear out phlegm and mucus from bronchial tubes. The leaves of Tulsi are an expectorant, meaning it helps to eliminate the mucus that builds up in the lungs. This makes it a great herb for anyone suffering from a slight cough, bronchitis, or a chest cold.\n\nThe leaves of Tulsi can also strengthen the stomach and can enhance digestion. Tulsi can aid in the healing of the common cold, sore throats, and fever. Drinking Tulsi tea in a liter of boiling water can help reduce a temperature. The juice that is found in the herb’s leaves is what makes the fever reduction possible.\n\nTulsi can be useful in treating other respiratory ailments, such as asthma and influenza. A mixture of Tulsi leaves, ginger, and honey can be an effective treatment for these issues. And a mixture of Tulsi leaves, table salt, and cloves can give fast relief to the flu.\n\nThe Holy Basil helps to strengthen the kidneys. Kidney stones may be passed quicker by drinking the juice found in the leaves of Tulsi mixed with honey. Tulsi is a mild diuretic and a detoxifier and can help reduce levels of uric acid concentration within the blood. The main cause of kidney stones is a build up of this uric acid. Since Tulsi is a mild diuretic, it can help to pass the stone quicker than normal.\n\nHeart disease is one of the leading causes of death in the United States. Anti-oxidants, such as vitamin C and eugenol, are found in Tulsi and protects the heart from free radical damage. The herb also helps with lowering cholesterol levels. Stress can also cause issues with the heart. Stress can increase blood pressure, which can put strain on the heart. Drinking Tulsi tea can help sooth raw nerves and help to lower stress levels. Blood pressure can be lowered by drinking tea with this herb.\n\nTulsi can keep teeth strong and healthy. If you dry the herb’s leaves in the sun, then mash them into a powder form, it can be used to brush your teeth. Just add a little water to the powder and it turns into a sort of paste. Instead of adding water, you can also add mustard oil and create a paste with that. This herbal toothpaste can maintain your teeth, help to alleviate bad breath, and can be used to massage the gums to prevent gingivitis. It can also be used to help teeth disorders such as pyorrhea.\n\nSore eyes and night blindness can be remedied by Tulsi. These eye disorders are caused by a lack of vitamin A. Placing two drops of the juice from the leaves into each eye can help alleviate these issues. Or you can fill a bowl with water and let the leaves soak in it for a while. Wash your eyes out with this water and it should reduce the soreness. Drinking Tulsi tea regularly can protect the eyes from free radical damage, and can reduce your chance of getting glaucoma, macular degeneration, cataracts, vision defects, and opthalmia.\n\nThese are just a handful of Tulsi health benefits. Other advantages include the following:\n• Anti-carcinogenic to help fight against cancer and tumors\n\nThe list just keeps going. This is definitely one herb to be on the lookout for. The health benefits are seemingly endless.", "opengraph": {"locale": "en_US", "type": "article", "title": "Tulsi Health Benefits", "description": "A look at some of the wonderful health benefits of Tulsi...", "url": "https://naturalhealthezine.com/tulsi-health-benefits2/", "site_name": "Natural Health Ezine", "article:published_time": "2010-07-16T15:14:25+00:00", "article:modified_time": "2010-07-26T16:08:59+00:00", "image": "https://www.assoc-amazon.com/e/ir?t=chriscom07-20&l=ur2&o=1"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.amazon.com/gp/redirect.html?ie=UTF8&location=http%3A%2F%2Fwww.amazon.com%2Fs%3Fie%3DUTF8%26x%3D0%26ref_%3Dnb%5Fsb%5Fnoss%26y%3D0%26field-keywords%3DTulsi%26url%3Dsearch-alias%253Daps&tag=chriscom07-20&linkCode=ur2&camp=1789&creative=390957", "http://www.amazon.com/gp/redirect.html?ie=UTF8&location=http%3A%2F%2Fwww.amazon.com%2Fs%3Fie%3DUTF8%26redirect%3Dtrue%26ref_%3Da9%5Fsc%5F1%26keywords%3Dmustard%2520oil%26qid%3D1277147189%26rh%3Di%253Aaps%252Ck%253Amustard%2520oil&tag=chriscom07-20&linkCode=ur2&camp=1789&creative=390957", "http://www.flickr.com/photos/one_and_only_me/", "https://naturalhealthezine.com/breakfast-foods-with-protein/", "https://naturalhealthezine.com/breakfast-foods-with-protein/", "https://naturalhealthezine.com/the-numerous-health-benefits-of-yoga/", "https://naturalhealthezine.com/the-numerous-health-benefits-of-yoga/", "https://naturalhealthezine.com/what-do-food-cravings-mean/", "https://naturalhealthezine.com/what-do-food-cravings-mean/", "https://naturalhealthezine.com/5-tips-on-how-to-lose-belly-fat-naturally-and-safe/", "https://naturalhealthezine.com/5-tips-on-how-to-lose-belly-fat-naturally-and-safe/", "https://naturalhealthezine.com/elderberry-for-flu/", "https://naturalhealthezine.com/elderberry-for-flu/", "https://naturalhealthezine.com/best-fresh-cranberry-relish-recipe/", "https://naturalhealthezine.com/best-fresh-cranberry-relish-recipe/"], "authors": [], "publish_date": "2010-07-16T15:14:25+00:00"}