{"result_id": "360011", "URL": "http://naturalhealthezine.com/the-difference-between-rose-and-rose-geranium/", "timestamp": "2023-04-25 18:23:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "http://naturalhealthezine.com/favicon.ico", "canonical": "http://naturalhealthezine.com/the-difference-between-rose-and-rose-geranium/", "encoding": "UTF-8"}, "image": null, "domain": "naturalhealthezine.com", "title": "The Difference Between Rose and Rose Geranium", "cleaned_text": "Roses and rose geraniums are not the same flower; although they both have health benefits, roses and rose geraniums have different botanical names, belong to different plant families and are composed differently. Here is a short profile of each type of plant species, highlighting the difference between a rose and a rose geranium.\n\nThere are many, many species of roses but the main species of roses that are used for medicinal purposes are Damask rose (Rosa damascena) and cabbage rose (Rosa centifolia). Despite popular belief, not all roses are fragrant.\n\nBoth Damask rose and cabbage rose belong to the Rosaceae plant family. Roses vary in size, shape and color, depending on their species or cultivar, but in general, roses have five petals, five sepals, pinnate leaves and prickles (thorns). A rose might be a small bush, a climber, a miniature or a tree. Both Damask rose and cabbage rose are used for medicinal purposes.\n\nThe rose has a long history of medicinal and cosmetic use; the ancient Egyptians were known to use rose in skincare. The ancient Romans had an arduous love affair with roses and used roses lavishly at banquets, parties and for cosmetic purposes. Several French queens adored roses, including Napoleon’s wife, Josephine de Beauharnais (1763 – 1814) and Queen Marie Antoinette of France (1755 – 1793); Marie Antoinette had natural perfumes and oils made for her by her personal perfumer, Jean-Louis Fargeon (A Scented Palace, Elisabeth de Feydeau).\n\nAccording to historical literature, the rose has been used for digestive complaints, menstrual disorders, fever, skin problems, headaches and tension (The Illustrated Encyclopedia of Essential Oils, Julia Lawless).\n\nToday, rose is used as an essential oil in aromatherapy (skincare, PMS, poor circulation, insomnia, stress and as an aphrodisiac), in salad dishes and as a tea (rose hips) (The Aromatherapy Garden, Julia Lawless).\n\nRose geranium is known botanically as Pelargonium graveolens. It belongs to the Geraniaceae plant family. Rose geranium is a perennial shrub with pointy, serrated leaves and small, pink, aromatic flowers. Like rose, there are many species and cultivars of geranium (in a variety of colors) but it is Pelargonium graveolens which is used medicinally.\n\nRose geranium has a rose-like aroma and, as an essential oil in aromatherapy, it is often used to either adulterate rose oil or as a substitute for rose oil. However, both plants are botanically different.\n\nTo further add to the confusion, it is herb Robert (Geranium robertium) that has historically been used for medicinal purposes; herb Robert can also be referred to as geranium. Both herb Robert and rose geranium have similar medicinal uses such as for inflammation, menstrual difficulties and hemorrhoids. As always, be aware that the use of the plant is different to the use of the essential oil extracted from the plant because of the different chemical composition of the oil.\n\nRose geranium essential oil is used for skin care, poor circulation, PMS and stress.\n\nBoth rose and rose geranium have similar medicinal uses. However, the plant species are different in appearance and botanical name. In aromatherapy, rose oil is a lot more expensive than rose geranium, so make sure you know which oil you are actually purchasing before you use it.\n\nMany plant species are confused because of the common use of English names in preference to the use of their botanical name. It is more important than ever when using plants medicinally to know which plant you are actually using, the plant family to which they belong and their medicinal uses to avoid any potential dangers in use.", "opengraph": {"locale": "en_US", "type": "article", "title": "The Difference Between Rose and Rose Geranium", "description": "Roses and rose geraniums are not the same flower; although they both have health benefits, roses and rose geraniums have different botanical names, belong to different plant families and are composed differently. Here is a short profile of each type of plant species, highlighting the difference between a rose and a rose geranium. Botanical Profile […]", "url": "http://naturalhealthezine.com/the-difference-between-rose-and-rose-geranium/", "site_name": "Natural Health Ezine", "article:published_time": "2012-01-12T16:05:20+00:00", "article:modified_time": "2012-01-13T00:36:42+00:00", "image": "http://naturalhealthezine.com/wp-content/uploads/2012/01/Rose.jpg"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.flickr.com/photos/az1172/", "http://naturalhealthezine.com/the-health-benefits-of-pomegranate-juice-antioxidants/", "http://naturalhealthezine.com/the-health-benefits-of-pomegranate-juice-antioxidants/", "http://naturalhealthezine.com/different-types-of-vitamins-and-their-uses/", "http://naturalhealthezine.com/different-types-of-vitamins-and-their-uses/", "http://naturalhealthezine.com/6-steps-to-better-health/", "http://naturalhealthezine.com/6-steps-to-better-health/", "http://naturalhealthezine.com/advantages-of-organic-food/", "http://naturalhealthezine.com/advantages-of-organic-food/", "http://naturalhealthezine.com/natural-spring-cleaning-products/", "http://naturalhealthezine.com/natural-spring-cleaning-products/", "http://naturalhealthezine.com/natural-goose-repellent-how-to-keep-geese-out-of-your-yard/", "http://naturalhealthezine.com/natural-goose-repellent-how-to-keep-geese-out-of-your-yard/"], "authors": [], "publish_date": "2012-01-12T16:05:20+00:00"}