{"result_id": "361017", "URL": "https://naturalon.com/top-10-natural-ways-increase-white-blood-cell-count-immune-system/view-all/", "timestamp": "2023-04-25 18:23:29 CEST+0200", "meta": {"description": "You can naturally increase your white blood cell count by making sure you consume sufficient amounts of the following 10 foods and/or vitamins and minerals.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/top-10-natural-ways-increase-white-blood-cell-count-immune-system/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Top 10 Natural Ways to Increase Your White Blood Cell Count", "cleaned_text": "When you feed your immune system, you improve its fighting power. Your immune system and white blood cells work together to fight infections. White blood cells are produced in our bone marrow. A normal white blood cell count is somewhere in the area of 5,000 to 10,000 white blood cells per microliter of blood. Persons with less than 3,500 are considered to a low count, also called neutropenia. Numbers of less than 1,000 are considered to be dangerously low and an indicator that the person is at great risk of developing an infection of some kind.\n\nYou can naturally increase your white blood cell count, which in turn improves your overall immune system, by making sure you consume sufficient amounts of the following 10 foods and/or vitamins and minerals. If you find you pick up every little cold or flu bug that goes by, you can turn things around naturally. Keep reading to find out the 10 natural ways to improve your white blood cell count and immune system into high gear.\n\nAlthough this little vitamin doesn’t get the press that vitamin C does, it’s one of the most important antioxidant and immune boosters around.\n\nVitamin E naturally stimulates the production of what are known as “killer cells.” These are cells that seek out and kill off germs and cancer cells. Vitamin E also improves the production of B-cells. These are cells from your immune system that produce antibodies that will kill bacteria. Vitamin E supplements may actually reverse of the decline in immune system response that is often seen in the elderly. The Harvard School of Public Health studies about 87,000 nurses and found that vitamin E supplements cut the risk of heart attacks by an incredible 50 percent!\n\nIt’s not that hard to get 60mg of vitamin E each day from your diet. Seeds and grains will get you most of what you need, but most people find it difficult to consistently get that 60mg every single day, and if you smoke, don’t exercise, or drink more than your share of alcohol, you will need between 100 to 40mg each day to keep your immune system strong. Taking supplements is a good idea for most people.\n\nThis little-thought-of mineral is vital for the production of white blood cells that fight infection. Zinc also helps them fight much more aggressively.\n\nZinc increases the number of killer cells and allows white blood cells to release more antibodies in their fight against the bad guys. Studies show that zinc supplements slow the growth of cancer and increase the number of infection fighting T-cells. One thing about zinc, however, is that you can overdo it.\n\nConsuming more than 75mg per day actually inhibits immune function. Aim to get most of your zinc from your diet. 15 to 25mg is sufficient for most people.\n\nSelenium can help build up your white blood cells, according to the University of Maryland Medical Center, and some other studies show that selenium itself can help fight infections.\n\nOne study showed that when elderly persons took both selenium supplements and zinc, their immune systems responded better to the flu vaccine than those who only consumed a placebo.\n\nGreen tea is absolutely packed full of antioxidants – that makes it a great detox tea as well. It supports the immune system and helps your body fight infection.\n\nOne study shows that green tea replicates some viruses, which means you won’t lose as many white blood cells fighting the virus itself.\n\nGreen tea encourages your body to produce more white blood cells.\n\nOne of the top vitamins that will improve your immune system in a jiffy. There has been more research done on the effects of vitamin C and your immune system than any other vitamin or nutrient around. Vitamin C is found naturally in almost all fruits and is very inexpensive in supplement form. In fact, you can find vitamin C fortified just about anything if you look around a bit.\n\nVitamin C improves your immune system by increasing your body’s production of white blood cells and antibodies that fight viruses and bacteria. It also increases the levels of interferon, the antibody that coats the surfaces of your cells and stops viruses from entering them to begin with.\n\nNow contrary to popular myth, you don’t have to take massive amount to get a boost in your immune system. Around 200mgs per day will do the trick and you can generally get that, and sometimes more, simply from eating plenty of fruits and vegetables during your daily diet. If you do choose to take supplements, spread the dosage out during the day so you don’t end up peeing it all away.\n\nBeta-carotene will increase the number of natural killer cells, T-cells, combined with being a powerful antioxidant that cleans up those nasty free radicals that cause our bodies so much damage and premature aging.\n\nStudies show that foods that have beta carotene can lower your risk of heart attack and stoke as well. Find out health benefits of carrots.\n\nOmega-3 fatty acids, which are found in fatty fish such as salmon and mackerel, along with flax oil, improve your immune system by increasing something called phagocytes. Read more about omega-3 foods.\n\nThese are white blood cells that literally eat up bacteria. Perhaps this is why grandmothers everywhere used to insist on that awful tablespoon of cod liver oil each night! Essential fatty acids protect the body also from damage that occurs should the body over-react to an infection. One study found that when children were given just a half a teaspoon of flax oil each day, they experienced fewer colds and other respiratory infections.\n\nIncreasing your daily intake of vitamin A will increase the number of lymphocyte white blood cells in your body.\n\nThese cells attack and kill foreign invaders as well as cancer cells.\n\nYour body does produce some vitamin A, but a good supplement will add to your immune fighting capabilities.\n\nOver and over studies show that persons who consumed probiotics, such as the kind in yogurt, had stronger immune systems than those who did not. Probiotics appear to improve and boost your white blood cell count.\n\nSEE ALSO: If I am Eating Right, Do I Still Need Supplements?\n\nGerman researchers conducted a study that was published in the Clinical Nutrition and it showed that when they gave half of 500 healthy adults probiotic supplements over a three month period, the group who received the supplements had fewer cases of the cold and its symptoms, such as itchy throat, stuffy nose, body aches, and minor headaches, as well as having high white blood cell counts.\n\nIt seems as if garlic shows up on every “top 10” healthy list, doesn’t it? Well, there are plenty of good reasons why. Garlic promotes the ability of white blood cells to fight off the bad guys and stimulates other immune cells into action.\n\nA study in 2002 showed that when rats were fed garlic, they had significant increases in their overall white blood cell count. The properties in garlic that seem to improve the immune system lie in its sulfur compounds such as sulfides and alllicin.\n\nGarlic is also an antioxidant that cuts down on the build-up of free radicals in the blood. Cultures that have garlic rich foods have lower rates of intestinal cancers. Avoid these mistakes when using garlic medicinally.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/11/bigstock-Vitamin-E-2015683.jpg", "locale": "en_US", "type": "article", "title": "Top 10 Natural Ways to Increase Your White Blood Cell Count", "description": "You can naturally increase your white blood cell count by making sure you consume sufficient amounts of the following 10 foods and/or vitamins and minerals.", "url": "https://naturalon.com/top-10-natural-ways-increase-white-blood-cell-count-immune-system/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "nutrition", "article:section": "Health News", "article:published_time": "2015-02-23T18:03:32+00:00", "article:modified_time": "2016-04-23T08:06:55+00:00", "updated_time": "2016-04-23T08:06:55+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/11/bigstock-Vitamin-E-2015683.jpg", "image:width": "650", "image:height": "433"}, "tags": ["health", "nutrition", "body"], "tweets": [], "movies": [], "links": ["https://naturalon.com/top-10-best-teas-for-detox-and-cleansing/", "https://naturalon.com/make-your-own-vitamin-c-supplements/", "https://naturalon.com/top-health-benefits-carrots/", "https://naturalon.com/33-full-of-omega-3-foods-infographic/", "https://naturalon.com/eating-right-still-need-supplements/", "https://naturalon.com/10-home-remedies-stuffy-nose-relief/", "https://naturalon.com/all-benefits-of-garlic-infographic/", "https://naturalon.com/avoid-mistakes-using-garlic-medicinally/", "http://www.cancer.org/treatment/treatmentsandsideeffects/complementaryandalternativemedicine/herbsvitaminsandminerals/zinc", "http://umm.edu/health/medical/altmed/supplement/selenium", "https://tspace.library.utoronto.ca/bitstream/1807/2230/1/md02016.pdf", "https://naturalon.com/addicted-chap-stick/", "https://naturalon.com/top-reasons-eating-oatmeal/"], "authors": [], "publish_date": "2015-02-23T18:03:32+00:00"}