{"result_id": "361004", "URL": "https://naturalon.com/top-ways-to-protect-yourself-from-any-virus-or-bacteria/view-all/", "timestamp": "2023-04-25 18:23:10 CEST+0200", "meta": {"description": "Now that winter is officially upon us ( 7 feet of snow on the East Coast seems official enough) you will be seeing lots of advertisements for flu", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/top-ways-to-protect-yourself-from-any-virus-or-bacteria/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Top Ways to Protect Yourself from Any Virus or Bacteria", "cleaned_text": "Now that winter is officially upon us ( 7 feet of snow on the East Coast seems official enough) you will be seeing lots of advertisements for flu vaccines, even though there is plenty of scientific evidence that they simply don’t work and that they contain toxic ingredients. Read more about what you don’t know about the flu vaccine can hurt you.\n\nBut you can skip the flu shot and the flue (colds, too!) by following a few simple rules that will keep your immune system in tip top shape. You can also avoid many bacterial infections, such as bronchitis and ear infections, with some common sense lifestyle habits.\n\nMost people catch a cold or flu from hand to hand contact, or from public areas. For example, someone who has a cold sneezes into their hand, then they touch a handrail or doorknob that you touch or you shake hands with them soon afterwards.\n\nThe important thing to remember is that, even though you have been exposed to a cold or flu virus, it doesn’t mean that you are destined to get sick!\n\nWhen your immune system is working at its optimum it’s fairly easy for your body to fight off the virus without ever getting sick. Why do so many people get sick, then? Because they have impaired immune systems and they don’t practice healthy lifestyles.\n\nThe top lifestyle factors that cause your immune system harm or suppress it:\n• Sugar – Think of sugar as fertilizer for pathogenic bacteria, yeast, and fungi. About 80 percent of your immune system lies in your digestive system and when you encourage and feed the bad bacteria, you are setting yourself up to get sick. Read how to stop shugar train.\n• Vitamin D Deficiency – Studies show that those who have the lowest levels of vitamin D also tend to get the most colds and flu viruses. Studies also show that those who have normal levels of vitamin D also recover faster when they do get sick.\n• Sleep Deprived – We live in a go, go, go world with so much to do that we rarely get the sleep our bodies need to repair themselves.\n• Insufficient Exercise – Your body needs exercise to stay healthy. Exercise triggers an increase in immune system cells that will attack any invader.\n• Stress – This is a vastly underrated factor. Stress predisposes you to bacterial infections and will make whatever sickness you have worse. Lear more how to reduce stress.\n\nBe sure you address the items above so that you can strengthen your immune system. In addition to the above steps, you need to eat a healthy diet. Foods that will help strengthen your immune system response:\n• Fermented foods such as pickles, sauerkraut, kimchee, and miso\n• Mushrooms, in particular, maitake, shiitake, and reishi mushrooms\n\nAlso, don’t forget to drink plenty of water and green tea. Yes, green tea! This type of tea has powerful antiviral compounds that can help to fight cold and flu viruses. One study showed a connection between the consumption of green tea and a lack of incidence of flu among school age children. Of the 2,000 children surveyed, those that drank between one and 5 cups of green tea per day had much lower reported rates of cold or flu infection.\n\nSupplements are also a great idea, but only in conjunction with a healthy diet and the elimination of the immune suppressing habits discussed above. Some people think that they can eat junk food, sleep about 5 hours, and go to their stressful jobs and, when they get a cold or the flu; they think a few vitamin C tablets will “cure” them. It simply doesn’t work that way! However, if you are eating right, getting your rest, some exercise, and getting your vitamin D, then the following supplements will go a long way:\n• Oregano Oil – The higher the concentration of carvacrol, the more effective it will be. Oregano oil is a powerful antimicrobial.\n• Olive Leaf Extract – This is a natural, non-toxic immune system builder that has been used for centuries by the Ancient Egyptians and Mediterranean cultures.\n• Vitamin C – A strong antioxidant that offers really powerful support to your immune system. You can take several grams every hour until you feel better. Stop or cut the dose if you develop diarrhea.\n• Propolis – A resin from bees and one of the most powerful, broad-spectrum antimicrobial compounds on this planet.\n• Herbal Tea – In addition to green tea, another powerful herbal tea is made from mixing ginger, elderflower, boneset, linden, yarrow, and peppermint. Drink it hot and, if you do have a cold or flu, drink it often. This will cause you to sweat, which helps to remove the virus from your system.\n\nIf you should get sick, remember that antibiotics will not work against the cold or flu virus and there is very little your doctor can do for you. However, should you develop a secondary infection from a cold or flu; an antibiotic will help with that. You should see a doctor if you develop the following symptoms:\n• Fever of over 102 for more than 2 days\n• Green nasal discharge, especially with severe pain around the eyes\n• Shortness of breath or an uncontrollable cough\n\nAll of the above are signs of a serious infection and you should see your doctor as soon as possible.\n\nHowever, if you take the steps listed above, you should be able to kick any cold or flu before it takes ahold of you. Enjoy winter, skip the flu shot, and skip the flu, take care of your immune system and it will take care of you.\n\nSong et al. Antiviral effect of catechins in green tea on influenza virus. Antiviral Res 68:66–74 (2005).\n\nSong et al. Biological evaluation of anti-influenza viral activity of semi-synthetic catechin derivatives. Antiviral Res 76:178–85 (2007).\n\nYamada et al. Gargling with tea catechin extracts for the prevention of influenza infection in elderly nursing home residents: a prospective clinical study. J Altern Complement Med 12(7):669–72 (2006).\n\nNieman et al. Quercetin reduces illness but not immune perturbations after intensive exercise. Med Sci Sports Exerc 39(9):1561–9 (2007).", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/04/flu.jpg", "locale": "en_US", "type": "article", "title": "Top Ways to Protect Yourself from Any Virus or Bacteria", "description": "Now that winter is officially upon us ( 7 feet of snow on the East Coast seems official enough) you will be seeing lots of advertisements for flu", "url": "https://naturalon.com/top-ways-to-protect-yourself-from-any-virus-or-bacteria/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "natural remedies", "article:section": "Interesting", "article:published_time": "2014-12-05T19:18:40+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/04/flu.jpg", "image:width": "650", "image:height": "434"}, "tags": ["how to", "cold and flu", "natural remedies"], "tweets": [], "movies": [], "links": ["https://naturalon.com/what-you-dont-know-about-the-flu-vaccine-can-hurt-you/", "https://naturalon.com/how-to-avoid-the-holiday-sugar-train/", "https://naturalon.com/how-to-fight-with-vitamin-d-deficiency-infographic/", "https://naturalon.com/8-new-functional-life-hacks-to-reduce-stress/", "https://naturalon.com/switch-to-grass-fed-meat-5-reasons-why-you-should/", "http://biodefense.com/Pandemic-Preparedness-Episode-06.html", "http://www.sustainablebabysteps.com/antiviral-herbs.html", "http://www.ncbi.nlm.nih.gov/pubmed/17569205", "http://www.ion.ac.uk/information/onarchives/vanquishingviruses", "#", "https://naturalon.com/not-all-bacteria-are-bad-this-one-will-see-you-through-the-flu-season/", "https://naturalon.com/10-virgin-coconut-oil-benefits-infographic/"], "authors": [], "publish_date": "2014-12-05T19:18:40+00:00"}