{"result_id": "361005", "URL": "https://naturalon.com/12-effective-home-remedies-to-ease-and-heal-whooping-cough-pertussis/view-all/", "timestamp": "2023-04-25 18:23:11 CEST+0200", "meta": {"description": "Pertussis, more commonly known as whooping cough, is a very contagious bacterial infection caused by the bacterium pertussis, which infects the lining of", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/12-effective-home-remedies-to-ease-and-heal-whooping-cough-pertussis/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "12 Effective Home Remedies To Ease And Heal Whooping Cough (Pertussis)", "cleaned_text": "Pertussis, more commonly known as whooping cough, is a very contagious bacterial infection caused by the bacterium pertussis, which infects the lining of the respiratory system.\n\nThis disease spreads quickly via airborne particles from the coughing and sneezing of an infected person. This disease tends to infect small babies and toddlers, but anyone can actually get this disease.\n\nAfter exposure, it takes between seven and 10 days for symptoms to develop, although it has been known to lie dormant and not appear for more than 30 days. It begins very much like the common cold with sneezing, a low fever, and a runny nose, but later turns into terrible coughing spells that end in a high pitched “whoop” sound, which is the affected person literally gasping for air. Many victims vomit from the force of the cough.\n\nInfants six months and younger are at the greatest risk of contracting this disease. They also have the greatest risk of dying from it. The vaccine is your best defense from contracting this terrible disease; however, even the vaccine is not 100 percent effective.\n\nThe whooping cough vaccine, which you have probably seen written on a vaccination card as “DTaP,” is a series of five shots. These shots cannot be fully administered to infants. Most children receive all five shots by the time they are four years old. Whooping cough can still affect adults who have been fully vaccinated, and it affects children as well. Approximately five percent of all vaccinated children will still develop whooping cough. However, it is important to note that this means that 95 percent of those vaccinated will not develop whooping cough. No matter how you look at it, getting a pertussis vaccination entails a risk, but getting whooping cough also carries considerable risk, especially for infants.\n\nIf your infant or child should develop what you believe is whooping cough, you should take them to your local emergency room right away. Babies younger than three years of age will probably need hospitalization. For older children and adults, see your doctor as quickly as possible.\n\nAfter you see your doctor, we have a list of 12 home remedies that have been used for ages before there were antibiotics or vaccines to help ease symptoms and speed healing.\n\nYou will already have more mucus than you can handle with whooping cough, so avoid foods that tend to increase the production of mucus, such as eggs, flour, sugar, milk, and other dairy products. Focus on eating more light foods such as soups with plenty of garlic, vegetables, and herbal teas. Homeopathic remedies include Drosera for coughing fits that involve vomiting or gagging or Cuprum for coughing fits that are followed by huge gasps for air or any type of difficulty breathing.\n\nGinger is a terrific expectorant that can help with most types of respiratory infections including whooping cough. Ginger has antibacterial compounds that can help to kill off this disease along with immune strengthening compounds that encourage your body to fight the bacteria on its own and recover faster. Drink three or four cups of ginger tea each day. You can also sweeten the tea with raw, organic honey. Another method is to mix one tablespoon of fresh ginger juice and one tablespoon of raw organic honey and consume this three times each day.\n\nTo ease the raw and sore throat that comes from whooping cough, stay well hydrated and use some wild cherry bark lozenges. This is not a good choice for children, as they can choke on them if they have a coughing fit, but for adults, these can go a long way towards numbing the pain and easing the soreness. These are readily available in almost all health food and natural stores.\n\nThis common spice has antiviral and antibacterial compounds that can help to treat whooping cough. It is especially effective on dry coughs, which are common with this disease. This is a super anti-inflammatory spice that can help ease lung and throat irritation while its immune boosting compounds help your body fight the infection naturally. Mix one tablespoon of raw, organic honey and half a teaspoon of turmeric powder. Consume twice each day for best results. You can also consume turmeric in a supplement, but speak with your doctor first about the right dosage for you.\n\nFor the treatment of dry, hacking coughs, Ayurvedic medicine recommends saffron. Although this spice can be a bit pricey, it has powerful antibacterial compounds that actually kill the bacteria causing this disease. Saffron is also an expectorant, which loosens phlegm so you can breathe easily. Steep five or six saffron threads in half a cup of very hot water for five minutes. Drink two or three times each day for a minimum of seven days for relief from symptoms and to cut this disease down to size.\n\nGarlic is a powerful antibiotic that can really help fight whooping cough. It might taste strong, but it is one of the best choices you can make to fight this disease. Add plenty of fresh garlic to your soups and broths. Consume one teaspoon of freshly squeezed garlic juice two or three times each day for a seven day period to fight this disease. You can also make breathing easier by adding a tablespoon of chopped garlic to a small pot of boiling water. Turn off the fire, and cover your head and the pot with a towel and breathe in the steam. This remedy is not suitable for small children; however, you can give small children one teaspoon of garlic syrup twice each day. To make garlic syrup, mince one pound of garlic. Put two cups of distilled water and two cups of apple cider vinegar in a large container. Now add the garlic and let sit for a minimum of four hours. Strain into a glass container and mix in 1.5 cups of raw organic honey. Read more how to use garlic medicinally.\n\nThis naturally relaxing herb can help ease the spasms that cause the coughing. Chamomile also has anti-inflammatory and immune-improving compounds that can ease symptoms and help the body recover more quickly. Drink two or three cups of chamomile tea each day. Add a tablespoon of honey if you have a sore or raw throat.\n\nRaw, organic honey contains some of the most powerful antibacterial compounds on earth. It also has antiseptic compounds that can ease symptoms and help to fight the bacteria causing the infection. Add a tablespoon of raw, organic honey to some herbal tea. You can add half of a teaspoon of cinnamon mixed with one tablespoon of honey, and consume this before bed to help you sleep better. Honey has been used for hundreds of years to stop infections, ease coughing, and soothe sore throats.\n\nAlmond oil, and the nuts themselves, can also help with pertussis. Almonds have immune boosting compounds and powerful antioxidants which naturally fight disease. Mix 10 drops of fresh onion juice with 10 drops of fresh ginger root juice. Mix this into five drops of almond oil and consume three times each day for 14 days. You can also soak about seven to 10 almonds in water overnight. Gently remove the skins and grind the almond meat until it is a fine paste. Add one teaspoon of butter to this paste, and consume one teaspoon three times each day for seven to 14 days. You can also make a soothing chest rub by mixing five drops of eucalyptus or rosemary essential oil into one tablespoon of almond oil, then rubbing this mixture on the chest area. Repeat as needed.\n\nYes, the same spice you use for lasagna is also an effective way to treat respiratory infections. Oregano has expectorant, antibacterial, and antispasmodic compounds that can go a long way toward fighting whooping cough. Boil a small pan of water, and add six drops of pure oregano oil. Cover your head and the pan with a towel and breathe in the steam to ease coughing fits. Repeat as often as necessary. You can also mix 10 drops of oregano oil with two tablespoons of olive oil or coconut oil, and rub this mixture on the chest to ease coughing. If you love the taste of oregano, drink two or more cups of oregano tea each day.\n\nSEE ALSO: Top 11 Completely Natural Remedies to Calm a Cough\n\nLicorice root is another herb that has been used for centuries to treat coughs and sore throats. It coats the throat to help protect it from the persistent coughing of pertussis. It also helps remove mucus from the respiratory system. You can mix half a teaspoon of licorice root powder with a teaspoon of raw, organic honey and consume three times each day for seven days. Alternatively, you can drink licorice root tea two or more times each day. Licorice root is also available in a supplement, but speak with your doctor to ensure you are getting the proper dose.\n\nLemon juice is also helpful for those with pertussis. The acidic nature of lemon juice will cut through the mucus while its antibacterial and antiviral compounds will help the body fight the infection. Lemons are also high in vitamin C, which supports the immune system. Add lemon juice to your herbal teas, or mix equal parts of lemon juice and raw, organic honey and consume this three times each day.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/10/bigstock-Young-woman-has-a-flu-Coughin-71995672.jpg", "locale": "en_US", "type": "article", "title": "12 Effective Home Remedies To Ease And Heal Whooping Cough (Pertussis)", "description": "Pertussis, more commonly known as whooping cough, is a very contagious bacterial infection caused by the bacterium pertussis, which infects the lining of", "url": "https://naturalon.com/12-effective-home-remedies-to-ease-and-heal-whooping-cough-pertussis/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "how to", "article:section": "Health News", "article:published_time": "2015-11-23T19:19:50+00:00", "article:modified_time": "2015-11-24T15:11:57+00:00", "updated_time": "2015-11-24T15:11:57+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/10/bigstock-Young-woman-has-a-flu-Coughin-71995672.jpg", "image:width": "650", "image:height": "434"}, "tags": ["how to", "healing", "atural remedies"], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pubmed/24961836", "https://naturalon.com/12-health-benefits-of-ginger-7-seems-crazy-but-its-true/", "https://naturalon.com/avoid-mistakes-using-garlic-medicinally/", "https://naturalon.com/much-know-honey-kitchen/", "https://naturalon.com/top-11-completely-natural-remedies-to-calm-a-cough/", "https://www.cdc.gov/pertussis/outbreaks/trends.html", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2348654/?page=1", "http://umm.edu/health/medical/altmed/condition/pertussis", "http://cid.oxfordjournals.org/content/early/2012/03/13/cid.cis287", "https://naturalon.com/eat-local-video/", "https://naturalon.com/moby-vegan-video/"], "authors": [], "publish_date": "2015-11-23T19:19:50+00:00"}