{"result_id": "361003", "URL": "https://naturalon.com/how-you-have-become-contaminated-and-dont-even-know-it/", "timestamp": "2023-04-25 18:23:09 CEST+0200", "meta": {"description": "The truth is that every single American is affected with numerous toxins. We are going to tell how you have become contaminated and don’t even know it!", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/how-you-have-become-contaminated-and-dont-even-know-it/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "How You Have Become Contaminated And Don’t Even Know It!", "cleaned_text": "How You Have Become Contaminated And Don’t Even Know It!\n\nYou are quite possibly reading this headline and thinking “Me? Contaminated? With what? It’s simply not possible!” We hate to break it to you, but the truth is that every single American is affected by numerous toxins, including heavy metals.\n\nThe vast majority of our food is contaminated with GMO’s, herbicides and pesticides, which have devastating effects on our immune systems and the digestive tract. Our air is saturated with chemtrails. Which, if you believe the rumors, is a government sponsored geoengineering program that is supposed to protect us from the effects of global warming. Those clouds you see streaking across the sky? No matter how clean and organic you eat, you can’t avoid the outside air. Those clouds are little white toxic warehouses, filled with things like strontium, barium, and aluminum. Then there are the toxic cleaners, everyday household products such as perfumed laundry soap, and our personal care products which put toxins directly into our blood via our skin.\n\nDon’t think for one minute that these things cannot harm you. Environmental toxins can literally destroy your good health. Human beings are literally being attacked by some of the biggest corporations on the planet: Corporations such as Monsanto which produce disease causing toxic chemicals and GMO products. Environmental toxins increase our risk of developing things like Parkinson’s disease, Alzheimer’s disease, other types of dementia, and other autoimmune diseases, to name a few.\n\nResearchers and scientists know that heavy metals are found inside every single American, including newborn children. Toxic metals such as cadmium, lead, and mercury, can block the natural flow of neurotransmitters in the brain, which can cause problems such as depression and brain fog. An accumulation of these metals can cause us to lose energy and even the motivation to live a healthy, normal life. Heavy metals and other environmental toxins literally poison the life right out of you, triggering a premature death.\n\nNo, we are not being overly dramatic.\n\nLet’s look at studies. The American Academy of Pediatrics reviewed 18 scientific studies in 1995 and found that lead toxicity can lower a child’s mental capabilities. For every 10 ug/dl increase in the level of lead in the blood, there was a lowering of the IQ in children by as much as 7 points. Keep in mind that this is less than a one thousandth gram of lead they are talking about.\n\nHeavy metal toxicity will destroy your thyroid function, cardiovascular health, and your hormone balance while destroying your body’s ability to absorb nutrients from the food you eat. You might want to think about this the next time you are offered a toy from China (coated in lead based pain), a vaccine, or a GMO ear of corn.\n\nAlthough it is true that our body is naturally designed to detoxify itself, Mother Nature never intended us to have to deal with this level of environmental toxins!\n\nHaving a healthy digestive system can help to protect you from viruses, parasites, and bad bacteria but when the body is overloaded with too many toxins and heavy metals, we can develop “leaky gut syndrome”, which will lead to chronic inflammatory diseases as well as autoimmune problems.\n\nOur planet is being poisoned. Our air, water, soil, and therefore, food supply, is all being filled with toxic chemicals and too many people remain uninformed or uncaring about the untested and truly dangerous things that are being added to our everyday life. Our modern day lifestyle truly makes you sit back in wonder at how the human race has survived as a species up until this point.\n\nREAD ALSO: Top 15 Contaminated Fish You Shouldn’t be Eating\n\nPerhaps we won’t much longer. How can anything survive that poisons itself?\n\nBe careful, friends! Don’t eat poison, don’t drink it, and be very aware of the chemicals you are exposing you and your family to on a daily basis.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2015/12/bigstock-Danger-55146602.jpg", "locale": "en_US", "type": "article", "title": "How You Have Become Contaminated And Don’t Even Know It!", "description": "The truth is that every single American is affected with numerous toxins. We are going to tell how you have become contaminated and don’t even know it!", "url": "https://naturalon.com/how-you-have-become-contaminated-and-dont-even-know-it/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "side effects", "article:section": "Health News", "article:published_time": "2018-05-16T15:48:37+00:00", "article:modified_time": "2018-05-16T17:15:16+00:00", "updated_time": "2018-05-16T17:15:16+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2015/12/bigstock-Danger-55146602.jpg", "image:width": "900", "image:height": "600"}, "tags": ["be aware", "side effects", "GMO"], "tweets": [], "movies": [], "links": ["http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3654245/", "https://naturalon.com/if-gmos-are-safe-and-healthy-then-why-doesnt-big-agra-want-them-labeled/", "https://naturalon.com/proof-we-are-being-sprayed-with-toxins-via-chemtrails/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3464032/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC4055906/", "https://naturalon.com/natural-compounds-to-improve-thyroid-function/", "https://naturalon.com/top-5-reasons-why-your-digestive-system-is-out-of-whack/", "https://naturalon.com/top-10-apocalyptic-risks-to-the-survival-of-the-human-race/", "https://naturalon.com/top-10-contaminated-fish-you-shouldnt-be-eating/", "https://naturalon.com/the-dangers-of-this-one-ingredient/", "http://www.ncbi.nlm.nih.gov/pubmed/20943052", "http://www.ncbi.nlm.nih.gov/pubmed/25776008", "http://www.ncbi.nlm.nih.gov/pubmed/24793421", "https://naturalon.com/13-amazing-reasons-use-apple-cider-vinegar-health-infographic/", "https://naturalon.com/10-natural-foods-to-speed-the-metabolism-faster-than-it-can-store-fat/"], "authors": [], "publish_date": "2018-05-16T15:48:37+00:00"}