{"result_id": "361012", "URL": "https://naturalon.com/top-10-contaminated-fish-you-shouldnt-be-eating/view-all/", "timestamp": "2023-04-25 18:23:22 CEST+0200", "meta": {"description": "It used to be that eating seafood and fish regularly was a pretty safe nutritional bet. Fish was packed with protein, healthy monounsaturated fats,", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/top-10-contaminated-fish-you-shouldnt-be-eating/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Top 15 Contaminated Fish You Shouldn't be Eating", "cleaned_text": "It used to be that eating seafood and fish regularly was a pretty safe nutritional bet. Fish was packed with protein, healthy monounsaturated fats, omega-3 fatty acids, all those good things (read more about benefits of fish oil). Unfortunately, due to our continued poisoning of the environment and the Fukushima power plant meltdown, many fish are now loaded with unsafe levels of mercury and radiation.All fish, every single fish on this planet, have some level of mercury; however, some have much higher levels than others.\n\nTake a look at our list of the top 15 most contaminated fish on the market today. Avoid eating these or eat them in very small quantities, unless you are an expectant mother, in which case, avoid these fish entirely. However, we will list the best fish to eat at the end of this article, too, so keep reading!\n\nThis means any type of meat eating shark such as Longfin Mako, Shortfin Mako, Blacktip, or common Thresher shark. Because sharks are at or near the top of the food chain, they consume other types of fish as their main source of food. This means whatever mercury and contaminates are in the fish they eat accumulate in the bodies of sharks.\n\nIt’s ironic that many people eat shark products such as soups, health drinks, pill supplements, and even shark steaks, believing that shark is a healthy meat. In fact, this terrible misconception is so prevalent that one of the world’s largest insurance companies added shark steaks, while at the famous Taste of Chicago food fest, as one of their recommendations as a “healthy” food. In fact, if you read the numerous studies available on this subject, there is absolutely no scientific evidence that eating shark, or taking supplements in any way, will provide any medicinal benefits whatsoever.\n\nThis is another very large fish that eats other contaminated fish as their natural diet.\n\nAlthough swordfish is hugely popular, this beautiful, tropical fish has been found to contain some of the highest levels of mercury among all larger sized edible fish. These fish contain high levels of a very strong neurotoxin called methyl mercury. This toxin can easily cross the placenta in pregnant women, and has the potential to damage the nervous system of the unborn fetus.\n\nSEE ALSO: 10 Ways Mercury is Toxic to the Body\n\nRecent studies have shown that excessively high blood levels of mercury can be traced to high or frequent consumption of swordfish. One study was performed in San Francisco and involved 123 subjects who eat 30 different types of fish. Those with frequent consumption of swordfish had the highest blood mercury levels that were over and above the maximum amount recommended by the National Academy of Sciences as well as the United States Environmental Protections Agency.\n\nThis voracious predator is definitely on the no-no list. Even though the Florida Department of Health Secretary Robert G. Brooks believes that it’s “virtually impossible” to get enough mercury from this fish because they are caught far out in the ocean, he’s wrong. Mercury builds up in the body. The findings are consistent and King Mackerel contain high levels of mercury.\n\nResearchers suspect that mercury, which comes mainly from industrial sources such as waste incinerators, the manufacturing of chlorine, and coal plants, is being spread through the air and eventually ends up in the water.\n\nThe longer the lifespan of the fish, as well as the larger it grows, the more mercury that fish will accumulate in their lifetime. King Mackerel have a migratory path that runs from South Florida to North Carolina.\n\nKing Mackerel, sometimes called Kingfish, are a common part of sport fishing. Although some authorities feel that it’s safe to eat this fish if it’s less than 33 inches long and weighs 10 pounds or less.\n\nThere are a great variety of this species of fish, and the EPA makes no distinction between them. So when they warn people, especially small children, women, and pregnant women, to avoid eating it, you better just skip all varieties to be safe.\n\nAtlantic tilefish, a yummy predator that ranges from the Gulf of Mexico to New England, appears to be OK, but unless you know for certain exactly which species you are eating, you are better off just writing this one off.\n\nTilefish, despite the warnings about excessive mercury contamination, is often seen on restaurant menus. Tilefish are popular because it’s a mild tasting, white meat fish that has a flavor similar to crabs or lobsters and tends to be a little sweet.\n\nTuna is a tricky one to keep track of, as some species seem to be OK, while others are downright scary. Albacore Tuna contamination runs around the middle of the scale so if you are a tuna lover, eat no more than six ounces of this fish every week.\n\nThere are two types of canned tuna: solid or chunk white, which is albacore tuna, and chunk light. Almost all canned white tuna is albacore tuna. The mercury levels are almost three times higher than canned light tuna. It gets confusing, so use the following list as a guideline:\n• Canned White (albacore) – It’s suggested that children between 6 and 12 can eat up to 9 ounces per month. Women should eat no more than three 6 ounce portions per month, and men can eat three 8 ounce portions.\n• Canned Light – This is a safer choice but look out for cans that are marked as “gourmet” or “tonno” tuna, as these come from the larger yellowfin tuna and have much higher mercury levels.\n\nThis is another mackerel that’s contaminated, and like the King Mackerel, it’s due to its large size. The Atlantic Spanish Mackerel is another migratory fish that goes to the Northern Gulf of Mexico in springtime and returns to south Florida, then the Western Gulf of Mexico in the fall. Even with this migratory pattern, they can be found from the Yucatan of Mexico all the way to the Cape Cod of Massachusetts.\n\nSpanish Mackerel are actually related to tuna. They can grow to three feet in length and because they live more closely to the shores, they can easily become contaminated by mercury that is being released into the ocean via slow moving coastal rivers.\n\nOrange roughy, which are part of the slimehead family (sounds tasty, right?) can take as long as 40 years to reach full maturity. Amazingly, these fish can live as long as 150 years! This means that, besides being easily overfished, they have many years to accumulate mercury and other toxins into their flesh. Orange roughy live in the deep waters off the Western Pacific Ocean, Eastern Atlantic ocean, South Africa, New Zealand, Australia, and the Eastern Pacific off Chile. Although they are actually a deep brick-red color, their flesh fades to a yellow orange after death, hence their name.\n\nBecause of their very long lifespan, orange roughly can accumulate huge amount of mercury within its flesh. Regular consumption of orange roughy can have seriously adverse effects on your health. On top of that, compared to other fish, orange roughy is not a good source of omega-3 fatty acids, so you would be wise to choose another type of fish. Make safer choices from the “safer” list at the end of this article.\n\nThis is another fish that is tricky. It is a great low fat, protein rich source of those omega-3 fatty acids, but it can be full of dangerous toxins including PCBs, pesticides, and, of course, mercury. Blue fish can become contaminated from storm run-off, agricultural chemicals, and industrial discharges, but they can also be contaminated when they eat natural toxins of some varieties of bacteria, and algae.\n\nYOU MIGHT ALSO LIKE: 4 Powerhouse Foods You’re Not Eating but Should Be\n\nMercury is a natural element in nature that never, ever, breaks down or decomposes. It’s a pollutant that often comes from industrial factories. Mercury binds to the protein in fish, so it’s found in every part that humans consume. Fish that are caught in watersheds with mercury warnings should be removed, and predators, because they eat smaller fish, tend to have higher levels of mercury and other types of contamination than smaller fish, such as sardines.\n\nAs if it’s not bad enough that this fish is contaminated with higher levels of mercury than the United States, and most other countries, feel is dangerously unsafe, they have also been hunted to the brink of extinction. If you see Chilean Sea Bass listed for sale, it’s either a different type of fish with an erroneous label, or it has been caught illegally. In fact, Greenpeace states that, unless fishing practices change, and people stop eating this fish, Chilean Sea Bass could become extinct within five years’ time.\n\nBy the way, there technically is no Chilean Sea Bass. This is a marketing makeover name because many people, especially Americans, find its true name a bit distasteful. Chilean Sea Bass are actually called Patagonian Toothfish.\n\nMercury does more than accumulate in fish; it also accumulates in the human body. This bioaccumulation in seafood carries over to human beings, where it can result in mercury poisoning. In human controlled studies of the ecosystems of fish, which are generally done for market production of a wanted species of seafood, results clearly show that mercury rises through the food chain from the fish that consume plankton, which are eaten by larger fish, which are consumed by even larger fish. Each succession of fish absorbs the mercury that came from each fish that was consumed by the previous fish.\n\nPacific Ocean perch is commonly served in many restaurants as well as being caught by sports fishermen.\n\nWe don’t mean the catfish that your Uncle Joe catches on Sunday afternoons down at the local lake. We are referring to imported catfish. Almost 90 percent of the catfish that is imported to America comes from Vietnam, where they commonly use antibiotics that have been banned for use in the USA. In fact, the two types of Vietnamese catfish that are commonly sold in the US, Swai and Basa, really aren’t catfish at all, at least not by government standards, which means that these fish aren’t held up to the same inspection laws that other imported catfish are.\n\nIf your Uncle Joe can’t catch enough catfish to keep you satisfied, be sure that you buy domestic, farm-raised catfish, which, for the most part, is responsibly farmed and super plentiful, so it should be inexpensive as well. You could also try Asian carp, which tastes very much like catfish and is also super plentiful.\n\nIt gets confusing sometimes, whether to eat fish from the Pacific or the Atlantic, but it really does make a difference. Everyone feels badly about adding this to the “do not eat” list, because New England fishermen rely on this fish for their economic livelihood, but besides being contaminated with mercury, the chronic mismanagement of this fish by the National Fisheries Services has placed this fish just one step above making the endangered species list. Until this fish species recovers its numbers, eat Pacific cod, which is still extremely plentiful and not nearly as contaminated.\n\nIf you love good old fashioned fish and chips (and almost all of these recipes use cod) then opt for Pacific cod. Tastes the same and is a better healthy choice. If you regularly use frozen fish sticks or fish fillets, read the label and choose Pacific cod until the International Union for Conservation of Nature’s Red List of Threatened Species says that Atlantic cod is safe to consume once more.\n\nAmerican Eel is sometimes referred to as silver eel or even yellow eel. This fish, which is most commonly found in sushi restaurants, found its way here due to high levels of contamination from both mercury and PCB’s. Unfortunately, this tasty fish is also suffering from more than just pollution, but overfishing as well. If you love the taste of eel, avoid the poisons and contamination and choose either Atlantic caught squid, or even Pacific caught squid, as both taste almost exactly the same, but are plentiful and have low contamination levels. Mercury can impair the nervous system and brain development, especially in infants, young children, and developing fetuses.\n\nAlthough the 2011 Food Safety Modernization Act was supposed to help the FDA better monitor fish farms and imported fish to be sure that they meet certain standards, lack of funding means this may or may not happen, so you will need to do some research on your own and avoid dangerously contaminated, overharvested fish such as American Eel.\n\nAtlantic flatfish include such fish as sole, halibut, and flounder that are caught off the Atlantic coast of the US. These, like many of the fish from the Atlantic Ocean, are heavily contaminated due to industrial waste as well as being overfished. In fact, these fish populations are as low as 1 percent of what is thought to be necessary for sustainable, long term fishing, according to the Food and Water Watch. Consider eating other fish that have the same mild flavor and white flesh, such as tilapia or Pacific halibut.\n\nAlthough you might consider eating imported fish (more than 85 percent of fish consumed in America is imported) many other countries do not have the same standards for fish as the US does, which means imported fish can have banned antibiotics and pesticides such as DDT in the meat. The FDA cannot possibly test every single fish that comes into the country, so only a very small fraction is ever tested.\n\nOK, so it’s not swimming yet, but fish eggs could be fish one day if left alone! Most of the caviar consumed in the US comes from wild caught sturgeon or beluga, which have been overfished for years. In fact, these species are also being threatened by an increase in the production of dams, which pollute the water in which these fish live. All types of caviar come from fish that take many years to mature, which means the population take years to recover. Rather than consume imported caviar, read the labels and choose eggs that come from American Lake Sturgeon or Shovelnose (sometimes called American Hackleback) Sturgeon from the Mississippi river. Yes, even the eggs of contaminated fish contain chemicals, heavy metals, and pesticides.\n\nYou can reduce your risk of becoming contaminated by varying your seafood choices. When you do this, you minimize overexposure to any particular contaminant that one species might contain. Alternately, you could buy from a local fishery who buys direct from distributors. They can often answer questions about the fish or fish eggs that they are buying. A trusted source is always better than relying on a government agency when it comes to food safety.\n\nIf you are looking for the safest fish to eat, try some of the following:\n• Red Snapper from the Gulf of Mexico\n\nRemember that all fish contain mercury, but you can still have your fish and eat it too if you make your choices from the list above.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/10/bigstock-Roasted-Swordfish-43050751.jpg", "locale": "en_US", "type": "article", "title": "Top 15 Contaminated Fish You Shouldn't be Eating", "description": "It used to be that eating seafood and fish regularly was a pretty safe nutritional bet. Fish was packed with protein, healthy monounsaturated fats,", "url": "https://naturalon.com/top-10-contaminated-fish-you-shouldnt-be-eating/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "VI", "article:section": "Health News", "article:published_time": "2014-10-13T19:25:01+00:00", "article:modified_time": "2016-03-28T17:34:00+00:00", "updated_time": "2016-03-28T17:34:00+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/10/bigstock-Roasted-Swordfish-43050751.jpg", "image:width": "650", "image:height": "437"}, "tags": ["be aware", "healthy food", "health statistics", "VI"], "tweets": [], "movies": [], "links": ["https://naturalon.com/8-unique-benefits-of-fish-oil-infographic/", "https://naturalon.com/15-of-the-best-fish-you-can-eat-for-your-health/", "https://naturalon.com/10-ways-mercury-is-toxic-to-the-body/", "#", "https://naturalon.com/4-powerhouse-foods-youre-not-eating-but-should-be/", "#", "#", "https://naturalon.com/fast-food-calories-infographic/", "https://naturalon.com/want-better-health-turn-down-that-ac-at-night/"], "authors": [], "publish_date": "2014-10-13T19:25:01+00:00"}