{"result_id": "361002", "URL": "https://naturalon.com/top-10-toxic-things-that-are-poisoning-your-kids/view-all/", "timestamp": "2023-04-25 18:23:07 CEST+0200", "meta": {"description": "Do you know that our children are being exposed to invisible toxins every day of their lives? Find out the top toxic things that are poisoning your kids.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/top-10-toxic-things-that-are-poisoning-your-kids/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Top 10 Toxic Things That Are Poisoning Your Kids", "cleaned_text": "Everyone wants the best for their children but many of us don’t realize that our children are being exposed to invisible toxins every day of their lives. They are going unnoticed and usually appear harmless on the surface. Once you find out the hidden dangers that our little ones are coming in contact with on a regular basis, we may begin to understand where all of the allergies that were not recognized years ago have come from.\n\nIt’s one thing to be unaware of the possibility of hidden toxins and poisons, but once you know which products are responsible you should seriously reconsider exposing your kids to them in the future.\n\nWhen you see what is really in the number one children’s gummy vitamins, The Flintstones, you will be surprised. Certainly, Fred and Wilma would never have given such a product to Pebbles! Besides a few genetically-modified organisms (GMOs), the list of ingredients includes aluminum, sugar, aspartame, and artificial colors that have been derived from petroleum products. The fact that they are in a gummy form to help kids take them easier cancels out any actual health benefits they may offer. Ask your doctor, pharmacist, or health food manager if they can recommend a natural vitamin for your kids.\n\nWe have managed to raise our children with a palate that can only accept chicken nuggets, colas, chocolate milk, and anything fried. Many children not only don’t like, or eat, fruit and/or vegetables on a regular basis, some can’t even name 7 out of 10 fruits or vegetables that you can find in a regular grocery store. To say that the “meat” that is used at most fast food restaurants is toxic is an understatement. The World Health Organization has declared that processed meats are “carcinogenic to humans.” Several years back it was discovered that McDonald’s had a mystery ingredient in their hamburgers that was orange and unidentifiable. There has never been a better time to seek out organic food as well as farm to table restaurants.\n\nIn order to cut down on the calories that a sedentary child in today’s society consumes, many parents let their children drink soda. The only thing worse is diet soda. Regular colas and other sodas will leave a child obese, prediabetic, and possibly with cancer. Most have begun puberty earlier than their parents did. Bottled water, or even sparkling water with a little bit of fruit juice added, is a much better choice.\n\nThese products are not safe for adults so it is amazing that some parents allow their children to consume diet sodas. First of all, they don’t even quench your thirst and second, the fake sweeteners are addictive and continue to make you crave sweets. Many of these sweeteners are on the market for a long time before they are pulled off the shelves. They have been known to cause heart attacks, high blood pressure, cancer, diabetes, and strokes, as well as childhood obesity.\n\nLarge pharmaceutical companies are in business to keep us status quo rather than cure us. If you become cured, you will no longer need their products and could quickly put an end to their business. Such is the case for the medications that are suggested for children with attention deficit hyperactivity disorder, or ADHD. The medications have been advertised as “safer than aspirin,” when in fact they are just as addictive and dangerous as oxycodone and morphine. Other approaches to this condition should be attempted before succumbing to such a serious medication.\n\nNot only are cleaning products getting more powerful, some can become extremely toxic if combined with other products. Many of these toxins continue to float through the atmosphere of our homes. This is especially true after the windows have been cleaned, the bathrooms have been sterilized with bleach products, and the dirt and grime that has built up in your oven has finally been removed with a product that is not meant to be inhaled and must be applied with rubber gloves.\n\nYou would think that anything that would be applied to a baby would have to be deemed safe. Think again. The talc that is used to make baby talcum powder contains asbestos. Asbestos has been proven to cause cancer. The powder that the Johnson and Johnson company uses has talc in it. They have had to pay out millions of dollars to users who ended up with cancer. One of the larger claims was $70 million dollars given to a woman who proved she ended up ovarian cancer after using the product.\n\nThe debate over whether fluoride in our drinking water can be harmful to children or possibly beneficial to their teeth has been going on for years. A major university (Harvard) proved that water that contained fluoride was linked to mental disorders and ADHD. The fluoride that is added to the water contains a toxic waste material called hydro-fluorosilicic acid. It is a byproduct that comes from the companies that make fertilizer, nuclear products, aluminum, and steel.\n\nThere is a laundry list of toxic ingredients that can be found in most clothing detergents. Children who wear clothing using these products end up with allergies, chronic sore throats, rashes, and constant issues with their sinuses. Switch to an organic cleaner that doesn’t have any artificial colors or fragrances.\n\nREAD ALSO: The Biggest Cancer Causing Food Ever (Your Kids Unfortunately Love It)\n\nMaking sure our kids don’t get sick from their clothing and toys is two-fold. Many of the clothing, bedding, and blankets requiring flame retardants use formaldehyde which is toxic. Many toys, mostly made of plastic, consist of toxic materials and any products that are imported from other countries often are still using lead-based paints. Check labels carefully when purchasing toys or clothing for little ones. You may have to pay a little more but it will always be worth it in the long run.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2015/03/bigstock-Burger-Fast-Food-7057037.jpg", "locale": "en_US", "type": "article", "title": "Top 10 Toxic Things That Are Poisoning Your Kids", "description": "Do you know that our children are being exposed to invisible toxins every day of their lives? Find out the top toxic things that are poisoning your kids.", "url": "https://naturalon.com/top-10-toxic-things-that-are-poisoning-your-kids/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "side effects", "article:section": "Health News", "article:published_time": "2017-01-27T13:00:00+00:00", "article:modified_time": "2017-01-29T17:44:43+00:00", "updated_time": "2017-01-29T17:44:43+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2015/03/bigstock-Burger-Fast-Food-7057037.jpg", "image:width": "650", "image:height": "433"}, "tags": ["be aware", "side effects", "kid's health"], "tweets": [], "movies": [], "links": ["https://naturalon.com/common-symptoms-of-mold-poisoning-is-it-in-your-home/", "https://www.ncbi.nlm.nih.gov/pubmed/25099544", "https://naturalon.com/essential-tips-for-parents-of-a-child-with-adhd/", "https://naturalon.com/top-21-unique-creative-ways-use-baby-powder/", "https://www.ncadd.org/about-addiction/drugs/prescription-drugs", "https://naturalon.com/the-biggest-cancer-causing-food-ever-your-kids-unfortunately-love-it/", "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3033429/", "https://www.ncadd.org/about-addiction/drugs/prescription-drugs", "https://naturalon.com/surprising-magnesium-deficiency-symptoms-best-ways-avoid-video/", "https://naturalon.com/best-superfood-berries-health-infographic/"], "authors": [], "publish_date": "2017-01-27T13:00:00+00:00"}