{"result_id": "361019", "URL": "https://naturalon.com/the-secret-to-avoiding-the-flu-without-a-vaccine/view-all/", "timestamp": "2023-04-25 18:23:32 CEST+0200", "meta": {"description": "The cold and flu season is off to an early start this year. Everywhere you go, you see ads and mainstream media reports that urge you to get your flu", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/the-secret-to-avoiding-the-flu-without-a-vaccine/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "The Secret to Avoiding the Flu Without a Vaccine", "cleaned_text": "The cold and flu season is off to an early start this year. Everywhere you go, you see ads and mainstream media reports that urge you to get your flu vaccine. These shots are being heavily promoted by governments of developed countries around the world and are very controversial at the very least. There are many studies that show, however, that the flu vaccine is not only dangerous, but it’s certainly not the most effective way to protect yourself from the flu.\n\nThe Flu Vaccine is Your Lease Effective Option\n\nOnly about 10 per cent of all circulating viruses are stopped by the flu vaccine. Even under the best of conditions, where the vaccine completely matches the current virus, 33 healthy adults need to be vaccinated to avoid one set of influenza symptoms.\n\nIn average conditions, 100 people need to be vaccinated to avoid one set of influenza symptoms. Researchers have also found that the vaccine did not affect the number of people hospitalized but it did cause one case of Guillain-Barre syndrome for every one million vaccinations.\n\nIs Garlic as good, or better, than Tamiflu?\n\nGarlic has long been acknowledged for its healing powers, especially against infectious diseases like cold and flu, most likely because of its immune boosting effects. IN a study done by the Cochrane group, those who took garlic daily for three months had fewer colds than those who took a placebo. This was a very small study but still shows better results than the results achieved with the much advertised drug Tamiflu.\n\nSome patients with Tamiflu are at increased risk of bacterial infections when they use this drug. There have also been adverse events reported with the use of Tamiflu such as serious skin reactions, pediatric death, and neuropsychiatric events. Needless to say, no one who took garlic would ever experience side effects such as these.\n\nIf you love garlic, try making a healthy garlic soup recipe. If garlic isn’t your thing, take a high quality supplement.\n\nUnderstanding the Causes of Influenza Can Prevent Them\n\nColds and flus are caused by a wide variety of viruses, not bacteria. The following video offers an excellent quick education on flu viruses, their transmission, along with common flu symptoms.\n\nThe most common way for viruses to spread is hand to hand contact. Remember however, that even if someone does “pass” on their virus to you it does not mean that you will come down with the illness. If your immune system is at its operating peak then it should be quite easy for you to fight off the virus without ever getting sick.\n\nThe actual reason you get sick is due to an impaired immune system, not necessarily exposure to the virus. Common lifestyle factors can suppress your immune system such as:\n• Lack of exercise. Find out 30-minute program for healthy you.\n\nA Cochrane Database Review of the medical research on zinc found that when taken within 24 hours of the first symptoms, zinc can cut the amount of time you have a cold by about 1 day. Zinc was also found to reduce the severity of symptoms. Although the review did not recommend any specific dose of zinc, other studies show that between 50 to 65 MG a day was beneficial.\n\nIt’s important to note that zinc is not recommended for anyone with chronic health condition, such as a lowered immune function, asthma, or any other chronic illness.\n\nWhen you first feel the symptoms of a cold or flu it is important to immediately avoid all sugars and processed foods, this includes artificial sweeteners as well. Sugar causes harm to your immune system.\n\nAvoiding all sugar includes fructose from fruit juice and all types of grains as they break down to sugar in the body. It’s also important to drink plenty of pure water.\n\nFoods that will help your immune system at this time include raw, grass fed organic milk, organic vegetables, garlic, turmeric, oregano, cinnamon, cloves, mushrooms, coconuts, and coconut oil, and raw, organic eggs from free range chickens. Read about main superfoods.\n\nIs it True that Chicken Soup Helps?\n\nAbsolutely, the answer is YES. Chicken soup helps against cold and flu symptoms. It contains a natural amino acid which can thin the mucus in your lungs so you can expel it more easily. Processed, canned soups won’t work as well as the homemade version so make up a fresh pot yourself. Be sure to make the soup hot and spicy with plenty of pepper.\n\nAn Excellent Plan against the Cold and Flu – Vitamin D can prevent your body from allowing the cold or flu virus to invade it to begin with. Contrary to the flu vaccine, this advice has been gaining scientific validation. Some go so far as to say that evidence shows that cold and flu may actually be symptoms of a vitamin D deficiency. Dr. John Cannell, founder of the Vitamin D Council, was one of the first to introduce the idea that vitamin D deficiency may actually be an underlying cause of influenza, which would help explain its apparent benefits as a flu combatant. Research on vitamin D is moving swiftly, sometimes making it hard to stay current on the latest advancements.\n\nFirst, sun exposure is still the best way to improve vitamin D levels. An average adult dose required to attain a healthy level of vitamin D is approximately 8,000 IU’s per day.\n\nThere is a growing body of research evidence that shows vitamin D is absolutely critical, not only for good health, but for disease prevention. If you take supplements, be sure to take vitamin K2. Vitamin K2 helps move calcium into the areas of the body where it is needed most, such as your bones and teeth, while removing it from areas where it isn’t needed, such as arteries and other soft tissue.\n\nA vitamin K2 deficiency is what brings on symptoms of vitamin D toxicity. So be certain that you are taking both of these supplements together for good heart health and strong bones.\n• Vitamin C is a powerful antioxidant. Use a natural form such as acerola.\n• Oregano Oil. Carvacrol is the most active ingredient in oregano oil. The higher the concentration, the more effective it is.\n• Medicinal mushrooms such as shiitake, reishi, and turkey tail.\n\nA healthy immune system can defeat invading pathogens. How does one go about improving and/or supporting your immune system?\n\nAn overall healthy lifestyle is your first line of defense. Every part of your body, including your immune system, works better when protected from environmental damage and bolstered by healthy living strategies such as:\n• Avoid stress or find ways to handle your stress, such as mediation or yoga.\n\nProbiotics are the good bacteria found naturally in raw, unpasteurized milk products and yogurt. These help regulate the digestive system, assisting the body in the removal of toxins and adding a boost to the immune system.\n\nSome research has suggested that people with low selenium levels are at a higher risk of certain cancers and seem to have a lower immune response system.\n\nExperts have known for quite some time that vitamin A has an important part in infections. Vitamin A deficiency is associated with an impaired immunity and an increased risk of infectious disease.\n\nA recent study involving healthy individuals over 65 has shown that increasing vitamin E intake to 200 mg increased antibody responses. Read more about vitamins in foods.\n\nCarefully review and read the evidence against flu vaccines and seriously consider using all natural immune boosting lifestyle choices as your first choice against the cold and flu virus.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/04/flu.jpg", "locale": "en_US", "type": "article", "title": "The Secret to Avoiding the Flu Without a Vaccine", "description": "The cold and flu season is off to an early start this year. Everywhere you go, you see ads and mainstream media reports that urge you to get your flu", "url": "https://naturalon.com/the-secret-to-avoiding-the-flu-without-a-vaccine/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "vitamins", "article:section": "Health News", "article:published_time": "2014-06-28T10:45:08+00:00", "article:modified_time": "2014-06-30T17:40:31+00:00", "updated_time": "2014-06-30T17:40:31+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/04/flu.jpg", "image:width": "650", "image:height": "434"}, "tags": ["health", "how to", "vitamins", "cold and flu", "vaccination"], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"//www.youtube.com/embed/nd9i7DkieKw\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/nd9i7DkieKw"}], "links": ["https://naturalon.com/30-minutes-to-a-healthier-happier-you-infographic/", "https://naturalon.com/7-main-superfoods-infographic/", "https://naturalon.com/vitamins-in-foods-infographic/", "http://www.health.harvard.edu/flu-resource-center/how-to-boost-your-immune-system.htm", "http://blogs.Health24.com/vitaminpete/optimized-nutrition-flu-vaccine-alternative/", "http://articles.mercola.com/sites/articles/archive/2013/02/07/vitamin-d-testing.aspx", "https://naturalon.com/how-to-fight-with-vitamin-b-12-deficiency-infographic/", "https://naturalon.com/7-exercises-you-dont-have-to-do-anymore/"], "authors": [], "publish_date": "2014-06-28T10:45:08+00:00"}