{"result_id": "361009", "URL": "https://naturalon.com/ebola-vaccine-pioneer-jokes-about-use-of-genetically-engineered-virus-to-cull-human-population/", "timestamp": "2023-04-25 18:23:18 CEST+0200", "meta": {"description": "A recent bombshell of a story appeared a short time ago in the Truth Stream Media that suddenly seems to make some of the Ebola rumors and revelations.", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/ebola-vaccine-pioneer-jokes-about-use-of-genetically-engineered-virus-to-cull-human-population/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Ebola Vaccine Pioneer Jokes about use of Genetically Engineered Virus to Cull Human Population", "cleaned_text": "A recent bombshell of a story appeared a short time ago in the Truth Stream Media that suddenly seems to make some of the Ebola rumors and revelations. This story carries a video, with the head of The Biodesign Institute for Infectious Diseases and Vaccinology, Dr. Charles Arntzen, answering general questions. Then he answers one about how Ebola could effectively kill of billions of humans in a plan to depopulate the earth. His answer, although he tries to play it off as a joke, is not the least bit funny.\n\n“Should there be 8 billion people in this world? Is there a limit on the number of people our planet can sustain? How do we go about this lightly? Should be concern ourselves with feeding 8 billion people in the first place or should we use natural forces of carrying capacity to limit population growth? “\n\nDr. Arntzen, who has developed a vaccine currently tested only on mice, responds:\n\n“ Has anyone seen “Contagion?” That’s the answer! Go out and use genetic engineering to create a better virus. Twenty five percent of the population is supposed to go in “Contagion.” “\n\nYou can see him on the video here:\n\nHowever, the slaughter of nearly 2 billion people with a virus that has been genetically modified is simply not funny.\n\nOnly those who are involved in tainting vaccines, the bioweapons of infectious diseases, and have some inside knowledge, would openly laugh about the murder of 2 billion people. This is too close to home as global leaders often talk about using vaccines to help reduce the “excess” population. To these people, killing off 2 billion people would be their idea of “saving the planet.”\n\nEven Bill Gates one stated in public that the proper use of vaccines could help to decrease the human population by as much as 15 percent. Google this, and although it’s been pulled from various websites over the years, you will find the video of him saying these exact words. When you see him speak these words, you will have no doubt that Bill Gates advocates using vaccines in order to reduce the populace. He isn’t joking about it either!\n\nHowever, Dr. Artzen goes further than Bill Gates does. He states that scientists who work with genetic engineering should work at creating a “better virus” so that billions of humans can die. It appears that, in his mind, a “better virus” that causes the suffering and death of billions of people is a good thing.\n\nWhen you see these people speak on television, always keep in mind that this is exactly how these people think and that this man is just one of many such people who are working and developing vaccines against Ebola. This could be the reason why, should this vaccine be developed quickly enough, and should this virus continue to spread, it will be forced upon the American people.\n\nEven as this article is being written, the Ebola vaccine has been given the approval to be “fast-tracked” and President Obama has signed an executive order allowing the quarantine of infected individuals.\n\nThe Ebola vaccine has been put on the fast-track in preparation for a vaccine campaign that will be mandatory, perhaps even with the possibility of quarantining those who might be infected at gunpoint; all of these things now law via this new executive order President Obama recently signed.\n\nWhat they are not telling you about this new executive order is that it allows people to be forcibly detained and quarantined, even if they are only showing minor symptoms of any type of respiratory illness. This means if you simply cough or begin sneezing in public, government officials can take you away and put you in a FEMA quarantine facility. You won’t be isolated, however, so there’s an excellent chance you could be infected by the other sick people they place in there with you.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/08/Arntzen-Genetic-Engineering-Create-Better-Virus.jpg", "locale": "en_US", "type": "article", "title": "Ebola Vaccine Pioneer Jokes about use of Genetically Engineered Virus to Cull Human Population", "description": "A recent bombshell of a story appeared a short time ago in the Truth Stream Media that suddenly seems to make some of the Ebola rumors and revelations.", "url": "https://naturalon.com/ebola-vaccine-pioneer-jokes-about-use-of-genetically-engineered-virus-to-cull-human-population/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:section": "Breaking News", "article:published_time": "2014-08-09T13:11:18+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/08/Arntzen-Genetic-Engineering-Create-Better-Virus.jpg", "image:width": "640", "image:height": "360"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe src=\"//www.youtube.com/embed/stGT6NcxVRQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"/>", "src": "//www.youtube.com/embed/stGT6NcxVRQ"}], "links": ["http://www.naturalnews.com/046347_Ebola_vaccine_genetically_engineered_virus_depopulation.html", "https://naturalon.com/what-happens-when-you-stop-smoking-infographic/", "https://naturalon.com/21-questions-about-ebola-government-propaganda-corruption-and-bioweapons/"], "authors": [], "publish_date": "2014-08-09T13:11:18+00:00"}