{"result_id": "361006", "URL": "https://naturalon.com/top-12-herbs-and-spices-to-get-you-through-the-flu-season/", "timestamp": "2023-04-25 18:23:13 CEST+0200", "meta": {"description": "We are right on the verge of the cold and flu season and sometimes, no matter how hard we try, we still catch a bug. If you have kids in school, ride", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/top-12-herbs-and-spices-to-get-you-through-the-flu-season/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Top 12 Herbs and Spices to Get You Through the Flu Season", "cleaned_text": "We are right on the verge of the cold and flu season and sometimes, no matter how hard we try, we still catch a bug. If you have kids in school, ride public transportation, or work with the public, chances are doubly good that you will get at least one virus this year. Health authorities are going to be pushing their mercury and preservative laden vaccine, as they always do, but you should avoid those toxic injections if at all possible.\n\nThere are plenty of things you can do to avoid getting sick such as frequent hand washing, drinking a lot of fluids, be sure you get your rest, keeping your immune system in tip top shape, and eating a healthy diet, but on top of all that, there are things right in your own kitchen that can help see you through a bout with the flu.\n\nRead on about the top 12 spices and herbs you can use to kick the flu bug this year and skip the vaccine.\n\nWe put these two together because almost everyone has this in their kitchen cabinets and both have powerful anti-inflammatory compounds. Turmeric has numerous health benefits, including antioxidant, antiviral, antibacterial, antifungal, anticancer compounds combined with plenty of antioxidants. Cinnamon is also a great antibacterial that you can use every day in a wide variety of foods.\n\nAdd a half a teaspoon of cinnamon to a pot of coffee for a tasty, but simple way to get a dose of antibacterial compounds in your belly before the day begins. Turmeric supplements can be taken in supplement form before the flu actually strikes, to help improve the immune system and give your body the strength it needs should you get hit with the flu.\n\nIn a study done in 2009, rats there were given curcumin rich turmeric were better able to fight off the flu than those who did not receive any turmeric. This was published in the journal Emerging Infectious Diseases.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/04/turmeric.jpg", "locale": "en_US", "type": "article", "title": "Top 12 Herbs and Spices to Get You Through the Flu Season", "description": "We are right on the verge of the cold and flu season and sometimes, no matter how hard we try, we still catch a bug. If you have kids in school, ride", "url": "https://naturalon.com/top-12-herbs-and-spices-to-get-you-through-the-flu-season/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "natural remedies", "article:section": "Health News", "article:published_time": "2014-11-22T19:45:18+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/04/turmeric.jpg", "image:width": "650", "image:height": "433"}, "tags": ["how to", "cold and flu", "natural remedies"], "tweets": [], "movies": [], "links": ["https://naturalon.com/10-healthy-eating-myths/", "http://www.huffingtonpost.com/andrew-weil-md/turmeric-health-have-a-happy-new-year_b_798328.html", "https://naturalon.com/true-facts-about-headaches-infographic/", "https://naturalon.com/top-12-herbs-and-spices-to-get-you-through-the-flu-season/2/", "https://naturalon.com/top-12-herbs-and-spices-to-get-you-through-the-flu-season/view-all/"], "authors": [], "publish_date": "2014-11-22T19:45:18+00:00"}