{"result_id": "361021", "URL": "https://naturalon.com/aluminum-in-vaccines-now-linked-to-alzheimers-disease/view-all/", "timestamp": "2023-04-25 18:23:36 CEST+0200", "meta": {"description": "If you have ever known anyone with Alzheimer’s disease, you know what a cruel killer it is. Fairly quickly your loved ones don’t know who you are, who", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/aluminum-in-vaccines-now-linked-to-alzheimers-disease/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Aluminum in Vaccines Now Linked to Alzheimer’s Disease", "cleaned_text": "If you have ever known anyone with Alzheimer’s disease, you know what a cruel killer it is. Fairly quickly your loved ones don’t know who you are, who their spouse is, where they are living, how old they are, they often forget their own names, and have hallucinations so vivid that they cannot be reasoned with.\n\nBut what are we doing about this terrible disease? With all the millions and millions of dollars that have been spent trying to find a cure, we still aren’t even sure about the reason behind it. In the meantime, millions of people are diagnosed with this terrible disease every single day.\n\nThere have been numerous studies lately, however, that show a definite link between aluminum and Alzheimer’s disease. Heavy metal toxins can kill as easily as poison.\n\nWe don’t hear much about a tiny gland in the center of the brain called the pineal gland, but this tiny gland is vital for our mental and physical health. When this gland becomes overburdened by heavy metals and/or calcified by fluoride, it becomes hard and cannot function.\n\nKeep in mind that aluminum accumulates in the body so when you hear people tell you that vaccines have such as tiny amount of aluminum that it is inconsequential to our health, remember that NO amount of metal is a safe or inconsequential amount. Excessive amount of iron can lodge themselves in your heart and cause heart damage or heart disease. Aluminum can cause Alzheimer’s, and mercury in your brain can cause autism spectrum disorders. Lead can deposit itself in your bones and interrupt the production of red and white blood cells.\n\nMany pharmaceuticals are coated with synthetic food colorings. These are petroleum based dyes that are known carcinogens which often contain antifreeze, ammonia, and petroleum produces.\n\nBesides the link to Alzheimer’s, aluminum poisoning can cause memory problems, epilepsy, dementia, autism, mental retardation, and damage to the central nervous system. Research has shown that just 4 PPM of aluminum can cause blood to clot, which can cause strokes and Alzheimer’s disease.\n\nSome studies have shown that the brains of those who died from Alzheimer’s disease had higher than normal amounts of aluminum. Although aluminum is a natural element found in the Earth’s crust, it is now found in just about everything we use and buy and consume. We consume this metal when we cook in aluminum pots and pans, we drink from aluminum containers, we rub this dangerous metal right into our blood stream when we use deodorants and other beauty products that contain aluminum, we store food, water, and coffee in aluminum pots or containers, we consume antacids that are loaded with aluminum, and other pharmaceuticals are full of this mineral or are coated with this mineral, and then, the icing on the cake of this matter, some of us willingly inject ourselves and our children with mercury-laced vaccines, sometimes every single year (in the case of flu shots).\n\nMost of this, however, is not really new. We have known for decades that aluminum is a known neurotoxin. This information is simply suppressed or glossed over in the interests of big business.\n\nOne new study performed in the UK at Keele University showed that individuals who were exposed to aluminum in their workplace later died from Alzheimer’s disease. See early warning signs of Alzheimer’s.\n\nAnother study showed that 16 years after an industrial accident in the UK dumped 20 metric tons of aluminum sulphates into the local drinking water, there were many studies showing that elevated aluminum levels in persons who lived in the area. These same subjects had a wide range of neurological problems.\n\nBy the way, you don’t need to work at a factory to get overdoses of aluminum; you can get a nice whiff of aluminum every time you breathe in someone’s second hand cigarette smoke. Inhaling aluminum vapors or dust sending these metal particles right into your bloodstream, which means they will then travel to your bones and brain.\n\nMany researchers are now accepting as fact that aluminum has some sort of key role in the development of Alzheimer’s disease and dementia. Due to the mounting evidence, it’s fairly obvious that the accumulation of aluminum from the numerous sources we are exposed to is contributing to Alzheimer’s disease. Read more about dangerous link between aspartame and Alzheimer’s.\n\nAn average American adult consumes about 7 to 9 mg of aluminum each day in their food and lesser amounts from drinking water and air, this according to the CDC. About 1 percent of this aluminum will be absorbed by your body, with the remainder flushed out through your digestive tract, assuming of course that your digestive system is working properly.\n\nIf you think aluminum isn’t that much of a problem, consider these insidious ways that we come into contact with it:\n• Vaccines: Influenza, hepatitis A and B, pneumococcal (pneumonia), Gardasil, diphtheria, tetanus, pertussis, and many others all contain aluminum\n\nSEE ALSO: Top 10 Household Items Known to Cause Cancer\n\nOf course, cooking foods in aluminum simply makes the matter worse. Even cooking with aluminum foil increases the concentration of aluminum in foods. Aluminum is as toxic to your brain and central nervous system as cigarette smoke is to your lungs.\n\nOnce aluminum enters your body, it moves around quite easily via your blood stream, taking a piggyback ride through the body’s iron transportation system. It can cross barriers that are intended to keep out other toxins. This means aluminum easily passes through the blood-brain barrier.\n\nAluminum in vaccines is quite possibly even more of a threat to our health than the mercury they contain. The number of vaccines that contain aluminum and are given to our children has more than quadrupled over the past 30 years. In 1970, children received only 4 aluminum containing vaccines during their first 18 months. Now, children receive about 17 vaccines. This problem becomes obvious when you realize that, in one school study, about 90 percent of the children developed ADHD, and toxicity profiles show that all the children had massive amounts of aluminum in their bodies.\n\nWith Alzheimer’s rates going through the roof, it’s fairly obvious that we are paying a heavy price for our overexposure to aluminum. Once this metal is inside your system, your body has a difficult time expelling it.\n\nThis metal has no biological purpose in the body. None. This means it does not serve any purpose, so the less aluminum you can take in, the better off you will be.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/03/vaccination.jpg", "locale": "en_US", "type": "article", "title": "Aluminum in Vaccines Now Linked to Alzheimer’s Disease", "description": "If you have ever known anyone with Alzheimer’s disease, you know what a cruel killer it is. Fairly quickly your loved ones don’t know who you are, who", "url": "https://naturalon.com/aluminum-in-vaccines-now-linked-to-alzheimers-disease/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "vaccination", "article:section": "Health News", "article:published_time": "2015-04-11T19:17:10+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/03/vaccination.jpg", "image:width": "650", "image:height": "433"}, "tags": ["be aware", "side effects", "Alzheimer's", "vaccination"], "tweets": [], "movies": [], "links": ["http://www.sciencelab.com/msds.php?msdsId=9922844", "https://naturalon.com/10-early-warning-signs-of-alzheimers/", "https://naturalon.com/dangerous-link-found-between-aspartame-and-alzheimers/", "https://naturalon.com/top-10-household-items-known-to-cause-cancer/", "https://naturalon.com/flu-vaccine-contains-more-mercury-than-allowed-by-law/", "http://www.jmedicalcasereports.com/content/8/1/41/abstract", "http://www.nvic.org/Downloads/4507NVIC11x17HIRES.aspx", "http://www.ncbi.nlm.nih.gov/pubmed/16098089", "https://naturalon.com/best-12-herbs-to-support-healthy-eyes/", "https://naturalon.com/forget-the-macarena-lets-do-the-monsanto-major-detox-diet/"], "authors": [], "publish_date": "2015-04-11T19:17:10+00:00"}