{"result_id": "361020", "URL": "https://naturalon.com/shocking-10-foods-americans-eat-that-are-banned-in-other-countries/view-all/", "timestamp": "2023-04-25 18:23:34 CEST+0200", "meta": {"description": "Most Americans assume that if the FDA has approved a food or dairy product, then it’s perfectly safe to eat. This is a dangerous assumption friend! Now", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/shocking-10-foods-americans-eat-that-are-banned-in-other-countries/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Shocking 10 Foods Americans Eat that are BANNED in Other Countries!", "cleaned_text": "Most Americans assume that if the FDA has approved a food or dairy product, then it’s perfectly safe to eat. This is a dangerous assumption friend! Now it’s true that the FDA passed some new regulations to keep the fresh food supply safer, however, for some reason known only to the FDA, they continue to allow certain foods to be sold in the U.S. that are banned in other countries.. The sad truth is, America is the richest country in the world yet, and its food is incredibly inferior to that of other countries. An American nutritionist, Mira Calton, and her husband, Dr. Jay Calton, traveled to more than 100 countries to study more than 150 ingredients and food products that are forbidden by other governments due to their damaging effect on human health. Here is a list of the top 10 foodstuffs and ingredients that are banned in many other countries but allowed in the USA.\n\n\n\n This is a calorie and cholesterol free fat substitute made by Procter and Gamble to make fat free snacks such as potato chips and French fries. There have been several reports of terrible intestinal reactions to this products including cramps, severe diarrhea, and leaking bowels. It also keeps the body from absorbing vitamins such as A, D, E, and K, so much so that the FDA demands that these vitamins be added to any product that contains Olean.\n\nThis product is banned in the UK and Canada.\n\n\n\n The drug ractopamine began being used by livestock ranchers when they heard that researchers discovered it made mice grow significantly more muscle. When used in pigs and cattle this drug reduces the fat content of meat. Ractopamine is used in approximately 45 per cent of pigs, 30 per cent of grain fed cattle, while the numbers for chickens and turkeys are unknown.\n\nUp to 20 per cent of the ractopamine fed to these animals remains in the meat after butchering. This drug is banned in more than 160 countries across Europe, Russia, mainland China and Taiwan.\n\n\n\n Most people have no idea that some popular sports drinks, citrus flavored sodas, along with a very popular soda called Mountain Dew, contain a synthetic chemical by the name of BVO (brominated vegetable oil). The original patent for this chemical is for use as a flame retardant. This chemical captures iodine in the body and can lead to serious complications from iodine insufficiency.\n\nThis chemical is banned in Europe and Japan.\n\n\n\n Chicken feed contains arsenic based drugs because they make the animal grow faster and give the meat a pink color, which most people will assume means the meat is “fresher”. The FDA approves of this additive because these products contain organic arsenic which is less toxic than the known carcinogen of the inorganic variety. However, reports have come to light stating that organic arsenic can transform into the dangerous carcinogen inorganic arsenic. Elevated levels of this compound have been found in supermarket chickens.\n\nThis food additive is banned by the European Union.\n\n\n\n A lot of people think that of farm raised salmon as such a nice concept. They picture the wild salmon living free, swimming in the cool, wild rivers while the farmed salmon are swimming in nice, fresh, clean pools, something similar to goldfish. This is simply not the case.\n\nSalmon in the wild get that beautiful red color from the natural carotenoids in their diet. Farmed salmon are raised on grains, which is not their normal food source, plus antibiotics. This leaves the fish with a very ugly grey color to their meat. Knowing that people will be reluctant to consume grey meat, farmed fish are fed a synthetic chemical called astaxanthin, which is made from petrochemicals. This substance is not approved for human ingestion because it is toxic.\n\nIt seems, however, that the FDA thinks it’s OK to feed it to fish that humans will consume. Both Australia and New Zealand ban farmed salmon. Avoid farm raised salmon by looking first at the meat. Wild salmon naturally is bright red and is very lean. The white stripes you see in the meat are streaks of fat; wild salmon has very thin lines. If the fish is light pink with thick bands of fat, it is a farmed salmon.\n\n\n\n Almost all papaya from Hawaii are genetically engineered to be resistant to various viruses, most especially the ringspot virus. There is a lot of evidence lately that shows how animals who are fed these genetically mutated foods, such as corn or soy, are afflicted by various disorders such as damage to multiple organs, tumors, birth defects, intestinal damage and premature death.\n\nMany animals are showing almost complete sterility by the third generation. Since GM foodstuffs have only been around about 10 years it’s going to take quite some time to calculate the human toll these products have taken. These papayas are banned by the entire European Union.\n\nChoose your fruit carefully. If you want to enjoy papaya, buy it from another country, not from Hawaii, or better still, look for papaya that is organically grown.\n\n\n\n Recombinant bovine growth hormone, rBGH, is frequently used in dairy cows in the US. This hormone is a synthetic version of the real one’s cows naturally produces and it’s used to increase milk production. This chemical is banned by more than 30 nations because of its health dangers including prostate cancer, colorectal cancer, and breast cancer.\n\nAlthough decades of evidence about the dangers of this chemical abound, the FDA refused to admit that it is a health hazard even though dairy products containing rBGH is banned in Australia, New Zealand, Israel, EU, and Canada.\n\n\n\n Almost every piece of bread you consume, whether it is a sandwich, bagel, hot dog, or hamburger bun, has been baked with potassioum bromate as an additive. Baking companies claim they need to add it to make the dough stronger to withstand the pressure from bread hooks, however, studies have shown that potassium bromates can cause kidney damage, thyroid problems, and damage to the nervous system.\n\nThe International Agency for Research on Cancer categorizes this additive as a possible carcinogen. Potassium Bromate is banned in Canada, China, and the EU.\n\n\n\n Preservatives and food colorings are among some of the more than 3,000 ingredients added to foods that are commonly sold in the US, including foods for infants and children. Most of these are banned in other countries due to research that shows they can be toxic and have dangerous health effects. Red 40, yellow 5, yellow 6, and blue 2 are the most popular dyes used even though numerous research studies have shown that these additives cause cancer and birth defects when tested on lab animals.\n\nDyes and other additives are banned in Norway, Austria, and the UK. The European Union requires a warning notice on items containing dyes.\n\n\n\n These two preservatives are extremely common and can be found in everything from cereal to gum, butter spreads to beer; even though BHA is well known to cause cancer in rats and BHT can cause organ system toxicity. The UK bans BHA in infant foods.\n\nBoth BHA and BHT are banned in parts of the European Union and Japan.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/03/2.jpg", "locale": "en_US", "type": "article", "title": "Shocking 10 Foods Americans Eat that are BANNED in Other Countries!", "description": "Most Americans assume that if the FDA has approved a food or dairy product, then it’s perfectly safe to eat. This is a dangerous assumption friend! Now", "url": "https://naturalon.com/shocking-10-foods-americans-eat-that-are-banned-in-other-countries/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "popular", "article:section": "Health News", "article:published_time": "2014-03-09T20:57:15+00:00", "article:modified_time": "2014-06-28T09:15:23+00:00", "updated_time": "2014-06-28T09:15:23+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/03/2.jpg", "image:width": "420", "image:height": "470"}, "tags": ["be aware", "popular"], "tweets": [], "movies": [], "links": ["https://naturalon.com/top-20-of-the-unhealthiest-healthy-foods-ever/", "https://naturalon.com/10-dangerous-food-procedures/"], "authors": [], "publish_date": "2014-03-09T20:57:15+00:00"}