{"result_id": "361015", "URL": "https://naturalon.com/why-does-the-american-government-have-a-patent-on-the-ebola-virus/", "timestamp": "2023-04-25 18:23:27 CEST+0200", "meta": {"description": "As the Ebola crisis continues its out of control spiral, some interesting facts have recently arisen. It appears that the Centers for Disease Control and", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/why-does-the-american-government-have-a-patent-on-the-ebola-virus/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Why Does the American Government Have a Patent on the Ebola Virus?", "cleaned_text": "As the Ebola crisis continues its out of control spiral, some interesting facts have recently arisen. It appears that the Centers for Disease Control and Prevention (CDC), Monsanto, along with the Department of Defense (DoD) could all make a nice profit from the Ebola crisis, especially should it come to America, oh, and yes, did they mention that these vaccines have been under development for the past 10 years.\n\nSome feel that, if even one case of Ebola should hit American shores, that there will be mandatory vaccines, and the CDC will be in for windfall profits should this happen. The CDC owns the patent on the original strain of the Ebola virus (which they supposedly discovered back in the 70’s) as well as all Ebola strains that might come up in the future.\n\nIt really makes one wonder, exactly how does someone patent something that is natural? You can’t put a patent on vitamin C or oxygen, but you can patent a virus? Now if you created the virus, of course you are entitled to a patent but ….wait a minute. Is it possible that this virus was created, not naturally occurring? It is something to consider.\n\nLet’s get back to the subject at hand. This patent, says that the CDC has complete ownership of the Ebola virus, which means it can ask for royalties on the sales of any vaccines that might be produced. The Department of Defense is also in on this little scheme, since it has a contract with Tekmira pharmaceuticals, the company that is in charge of making the vaccine.\n\nThis isn’t something new, however, since the government has been working along with multinational corporations to develop vaccines for Ebola since before 2006, which is way before this current outbreak occurred. There is another interesting party in this little scheme, Bill Gates. Isn’t it interesting that he has also given more than 50 million dollars to the United Nations to fight the current epidemic in Africa?\n\nSounds so nice, doesn’t it? A beautiful humanitarian effort to help with the current crisis? That would be nice if it were true, but this fight is more of a commercial exertion than a genuine heartfelt desire to help the people of Africa. Monsanto and Bill Gates, along with others, are actually putting in a little seed money to begin the development of a product, while the media, and even the government, just play right along, hyping up this current event in order to generate a demand for this product. Imagine what could happen, if, at exactly the right time, an Ebola outbreak was to happen, and Americans find out that they can be “protected” with a vaccine? What would they pay to get this “protection” for themselves and their loved ones? Imagine how the money would roll in!\n\nRight now, both the National Institute of Health (NIH), along with the CDC, is pushing this Ebola vaccine. Now the CDC has the patent on the virus itself but the NIH has the patent for the vaccines. Now the NIH has gotten together with the Vaccine Research Center, which is a division of the National Institute of Allergy and Infectious Diseases (NIAID), along with Crucell, which is another company that develops vaccines, to produce an Ebola Vaccine in the immediate future.\n\nBelieve it or not, this agreement goes back more than 10 years. In fact, Crucell went into Phase one clinical trials for this vaccine back in 2006. Now the NIH, along with the NIAID, awarded Crucell with even more money to continue the development of a filo-virus vaccine that is not only meant to work with Ebola, but with other viral infections that also cause severe hemorrhagic fever.\n\nThis would explain why the CDC and the NIH are bringing Ebola patients to the USA to “treat” them. Once these patients enter the US, they are the intellectual property of the CDC and the NIH.\n\nSEE ALSO: “Bogus” Ebola Cures? What the FDA and Mainstream Media Aren’t Telling You\n\nYou might find it interesting to note that although the CDC has said in the past that there was no need to worry about Ebola getting out of control in the USA since it is only transmitted via bodily fluids but if this is the case, how exactly have two doctors and a CDC health worker contracted this virus? In fact the CDC has released a six page action plan on exactly how they believe the Ebola virus should be handled, and they are warning hospitals to “prepare now.” Why should be prepare for something that can’t get out of control? Something doesn’t add up.\n\nPerhaps this information will make things more clear. One analysis recently published that more than 6,000 people fly from Nigeria to the United States every single week. Nigeria, one of the hardest hit countries, in which 90 percent of those infected die from this virus. Now these potentially infected persons also fly all over the world, to many developed nations such as Canada, France, China, the UK, and the United Arab Emirates. One guess where people in these countries fly to most often? Yep, America. With an estimated 21 day incubation period, and no screening procedures that would stop people from flying from infected countries into the US, it’s actually not a matter of if Ebola will break out in the US, but simply a matter of when.\n\nEveryone really should prepare themselves because the American military has been told to take orders from Homeland Security, where they will establish quarantine procedures and your local Sheriff and police will actually end up taking their orders from the Pentagon. Maybe this is why we have seen such as militarization of our local police. Even they are preparing for the Ebola outbreak, which is, by now, inevitable.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/08/Lab-Scientists-Ebola-Virus-Microscope.jpg", "locale": "en_US", "type": "article", "title": "Why Does the American Government Have a Patent on the Ebola Virus?", "description": "As the Ebola crisis continues its out of control spiral, some interesting facts have recently arisen. It appears that the Centers for Disease Control and", "url": "https://naturalon.com/why-does-the-american-government-have-a-patent-on-the-ebola-virus/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:section": "Breaking News", "article:published_time": "2014-09-23T19:12:09+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/08/Lab-Scientists-Ebola-Virus-Microscope.jpg", "image:width": "640", "image:height": "360"}, "tags": [], "tweets": [], "movies": [], "links": ["https://naturalon.com/bogus-ebola-cures-what-the-fda-and-mainstream-media-arent-telling-you/", "http://www.economicpolicyjournal.com/2014/08/us-government-holds-ebola-virus-patent.html", "http://www.thecommonsenseshow.com/2014/09/16/the-cdc-admits-the-usa-is-on-the-verge-of-a-major-ebola-outbreak/", "https://naturalon.com/10-alzheimers-early-symptoms-infographic/", "https://naturalon.com/immune-compromised-americans-have-little-resistance-against-ebola/"], "authors": [], "publish_date": "2014-09-23T19:12:09+00:00"}