{"result_id": "361013", "URL": "https://naturalon.com/vaccinate-not-vaccinateagainst-dementia/", "timestamp": "2023-04-25 18:23:25 CEST+0200", "meta": {"description": "When trying to decide whether or not to receive vaccines, you are likely thinking of children getting vaccinated against things like measles, mumps, or", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/vaccinate-not-vaccinateagainst-dementia/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "To Vaccinate Or Not…Against Dementia?", "cleaned_text": "When trying to decide whether or not to receive vaccines, you are likely thinking of children getting vaccinated against things like measles, mumps, or chicken pox. You may even think about the seasonal influenza vaccine. What these all have in common is that they are infectious diseases caused by a virus or bacteria. But, what if vaccines could protect against things we currently consider chronic conditions – things like diabetes, dementia, and heart disease? Recently, researchers have begun making exciting strides in this area, particularly in terms of dementia, a disease affecting about 47 million people worldwide.\n\nVaccines work by training the body to recognize and fight off specific viruses or bacteria. This is typically done by including a weakened or inactive part of the virus or bacteria into the vaccine. This is not enough to cause sickness, but it is enough to train the body’s immune system to recognize and fight off the virus or bacteria. So, how could this possibly work in chronic conditions? How could we vaccinate against something that doesn’t start out as a virus or bacteria? This has been a focus of researchers for many years. However, just recently researchers from the United Kingdom and Switzerland have made exciting progress. Their study published in the May 2017 issue of Nature Vaccines suggests an exciting discovery – there may one day be a vaccine which can prevent dementia! This new discovery was similar to a study published by researchers from California’s Institute of Molecular Medicine in the July 2016 issue of Scientific Reports.\n\nThough, these two studies varied slightly in their exact formulas for the vaccine, the way they worked was similar. In each study, the vaccine aimed to work by training the body’s immune system to fight beta-amyloid plaques. The plaques are essentially clusters of protein found in the brain of individuals with Alzheimer’s disease. By teaching the body to fight off, and potentially even clear out some of these plaques, it may be able to ward off dementia. One exciting aspect of these studies is that they indicated the vaccine may be effective even in older age. This is particularly great news. If the vaccine is approved, it is feasible that it could be given to individuals who will be reaching old age in the next few years. That is, we will not have to give the vaccines to children for them to be effective. If this vaccine becomes a reality, society will reap the benefits long before 80 years goes by!\n\nThe bad news is that this vaccine has not been tested on human subjects. Each of these studies was conducted on mice. However, this may be the first step on a path to key medical discoveries and possibly even preventing dementia and Alzheimer’s disease!\n\nThe World Health Organization (WHO) estimated that there are almost one million individuals around the world who are living with dementia. What’s even more startling is that it is estimated that 10 million new cases of dementia will occur every year! As the global population continues to grow older, this estimate will likely climb even higher. But, if researchers continue to make scientific advances that will allow for early detection and prevention, maybe, we can bring these numbers down! And maybe, in the next few years you really will be deciding if a vaccine against dementia is or is not the right option for you!", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2017/11/bigstock-211222828.jpg", "locale": "en_US", "type": "article", "title": "To Vaccinate Or Not…Against Dementia?", "description": "When trying to decide whether or not to receive vaccines, you are likely thinking of children getting vaccinated against things like measles, mumps, or", "url": "https://naturalon.com/vaccinate-not-vaccinateagainst-dementia/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "health", "article:section": "Health News", "article:published_time": "2017-11-08T15:00:00+00:00", "article:modified_time": "2017-12-16T14:13:04+00:00", "updated_time": "2017-12-16T14:13:04+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2017/11/bigstock-211222828.jpg", "image:width": "900", "image:height": "658"}, "tags": ["health", "dementia", "age"], "tweets": [], "movies": [], "links": ["https://naturalon.com/wp-content/uploads/2017/11/bigstock-Female-doctor-hand-holding-syr-211396192.jpg", "https://naturalon.com/research-says-this-one-thing-does-work-for-dementia-prevention/", "http://www.who.int/mediacentre/factsheets/fs362/en/", "https://www.ncbi.nlm.nih.gov/pubmed/27363809", "https://naturalon.com/50-healthy-salad-recipes-every-season-infographic/", "https://naturalon.com/mold-plenty-of-ways-to-keep-it-from-reoccurring/"], "authors": [], "publish_date": "2017-11-08T15:00:00+00:00"}