{"result_id": "361010", "URL": "https://naturalon.com/what-you-dont-know-about-the-flu-vaccine-can-hurt-you/view-all/", "timestamp": "2023-04-25 18:23:19 CEST+0200", "meta": {"description": "There is a huge amount of controversy surrounding the flu vaccine as of late. It used to be a simple matter of going to the doctor, getting the shot, pay", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/what-you-dont-know-about-the-flu-vaccine-can-hurt-you/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "What You Don’t Know About The Flu Vaccine Can Hurt You", "cleaned_text": "There is a huge amount of controversy surrounding the flu vaccine as of late. It used to be a simple matter of going to the doctor, getting the shot, pay your bill, and walk away. Recently, however, it has come to light that the ingredients contained within this vaccine are potentially more dangerous than getting the flu itself.\n\nOr is it? There’s the controversy. For some, getting the flu causes major complications and possibly even death. During the 2012-2013 flu season it was found that the vaccines effectiveness was only 56 per cent across all age groups? In those over 65 years of age, it was only 9 per cent effective. Those really aren’t great odds, are they? While death or disability from a flu vaccine isn’t as rare as the media would have your believe.\n\nWhat is a person supposed to think when you see famous people, such as New York Mayor Rudy Giuliani, make an appearance on the television, get a flu shot, and then tell you that this is the best way to stay healthy and it will ward off symptoms that might be confused with anthrax infection. What? Is terrorism even getting in the middle of our flu shots? Let’s try to sort through this maze so you can make an informed decision.\n\nAccording to most doctors, this is a list of those who should definitely receive the flu vaccine:\n• Persons with asthma, heart disease, kidney disease, or any other long term serious health problem.\n• Anyone with an auto immune disease, immune defect, cancer, transplant, or HIV/AIDS.\n• Pregnant women who will be in their second or third trimester during flu season.\n• People who live in dorms or other types of crowded living spaces.\n\nIt’s also important that people know exactly what is in the vaccine. It’s difficult to make an informed decision if you don’t know what is involved. Here are the ingredients in a typical flu vaccine:\n• Egg protein (cell culture) This is used to grow the virus and make the vaccine.\n• Formaldehyde. This is used to kill the virus however; formaldehyde is a powerful chemical and is listed as a carcinogen.\n• Thimerosal/mercury. (preservative) Mercury is a deadly poison and extremely toxic to the body. It is used a flu vaccine to prevent contamination.\n• Penicillin. (antibiotics) This is used to prevent bacterial contamination.\n\nMercury and formaldehyde are definitely substances that do not belong in the human body. There are much more natural ways to improve your chances of NOT getting the flu.\n• Wash your hands frequently and thoroughly. This is the number one way to avoid the flu and all over virus infections.\n• Heal your gastrointestinal tract. Your stomach is the main center of your immune system. Make sure you get sufficient amounts of the “good” bacteria that help your immune system work. Take at least 25 billion units of probiotics daily.\n• Reduce your consumption of sugar and alcohol\n• Get sufficient amounts of vitamin D. Exposure to the sun is helpful but it’s very difficult to get enough sun in the winter. Take at least 8,000 IUs of vitamin D per day.\n• Get 8 to 9 hours of sleep each night. Sleep is when your body repairs itself and fights off germs and viruses.\n• Address stress and get regular exercise. Read also about herbs that heal.\n\nWith all the uncertainty surrounding the ingredients in flu shots, combined with your own risk factors, getting a flu vaccine is no longer a simple decision. Stay healthy and choose wisely.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/04/flu-vaccine.jpg", "locale": "en_US", "type": "article", "title": "What You Don’t Know About The Flu Vaccine Can Hurt You", "description": "There is a huge amount of controversy surrounding the flu vaccine as of late. It used to be a simple matter of going to the doctor, getting the shot, pay", "url": "https://naturalon.com/what-you-dont-know-about-the-flu-vaccine-can-hurt-you/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "vaccination", "article:section": "Health News", "article:published_time": "2014-07-02T19:54:34+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/04/flu-vaccine.jpg", "image:width": "650", "image:height": "408"}, "tags": ["be aware", "health", "vaccination"], "tweets": [], "movies": [], "links": ["https://naturalon.com/10-herbs-that-can-heal/", "http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2693360/", "http://articles.mercola.com/sites/articles/archive/2013/10/22/flu-vaccine-effectiveness.aspx", "http://content.time.com/time/nation/article/0,8599,182448,00.html#ixzz2sTiklYfq", "https://naturalon.com/7-prenatal-yoga-poses-infographic/", "https://naturalon.com/the-secret-doctors-know-about-cleaning-your-arteries/"], "authors": [], "publish_date": "2014-07-02T19:54:34+00:00"}