{"result_id": "361007", "URL": "https://naturalon.com/10-super-foods-from-ancient-times-that-promote-health/view-all/", "timestamp": "2023-04-25 18:23:14 CEST+0200", "meta": {"description": "Our modern way of life comes with many useful, cool technological advances as well as time saving conveniences. Our ancestors would certainly be both", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/10-super-foods-from-ancient-times-that-promote-health/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "10 Super Foods from Ancient Times that Promote Health", "cleaned_text": "Spread the Word to Friends And Family By Sharing this Article.\n\nOur modern way of life comes with many useful, cool technological advances as well as time saving conveniences. Our ancestors would certainly be both confused and in awe of the way we live today. It makes one wonder if they would even be able to recognize some of the food we eat today. (Fruit roll up anyone?)\n\nAmericans consume many processed foods that, while filling, are sorely lacking in many essential nutrients and it shows in our endless chronic health conditions. Here is a list of the top 10 health foods that our ancestors ate as a part of their overall healthy diet that contributed to their health.\n\nSweet potatoes were sent to Europe via Christopher Columbus but they were eaten throughout Central America for thousands of years before that. Sweet potatoes are unrivaled in their levels of vitamin A, which is vital to the health of our eyes, skin, and hair.\n\nThey also provide a good source of other vitamins and minerals such as vitamin C, copper, fiber, vitamin B6, manganese, and potassium. That’s a whole lot of healthy goodness in one little vegetable!\n\nBone broth from grass fed cows or free range, organic chicken bones is extremely nutritious and is almost unheard of in today’s American diet. Bones should be boiled from between as few as six to as many as 40 hours will release minerals into the broth that the body can easily absorb.\n\nBone broth contains a multitude of antioxidants, vitamins, as well as essential minerals.\n\nThis is the original super food for people who experience food sensitivities, autoimmune responses, bacterial overgrowth in the small intestine, and other digestive problems.\n\nChia seeds have more than twice the protein of any other grain or seed!\n\nChia seeds also have more than 5 times the calcium in milk as well as an essential trace mineral, boron, which is important in helping the body absorb calcium.\n\nThey contain both omega-3 and omega-6.\n\nThis tiny seed packs a whole lot of health into one little package!\n\nBesides being great for your hair and skin, coconut oil has such a long list of health benefits; it’s hard to know where to start!\n\nCoconut oil has antimicrobial, antifungal, antibacterial as well as antioxidant properties which can help everything from kidney problems, high blood pressure, bone strength, improved immune response, and proper digestion, just to name a few!\n\nIf you haven’t tried coconut oil, add it to your diet today!\n\nFind out other uses for coconut.\n\nUnfortunately, most of the cattle in America are grain fed, GMO grain to be exact, and pumped full of antibiotics, vaccines, and growth hormones.\n\nIn the past, cows were allowed to roam freely in pastures, eating various grasses.\n\nMeat from grass fed cows have twice the conjugated linoleic acid per serving as grain fed cows, as well as more omega-3’s, and DHA.\n\nHigher levels of conjugated linoleic acid have been connected to a reduced risk of heart disease, cancer, and easier weight loss.\n\nThis fermented tea has been around for more than 2,000 years.\n\nIn ancient China it has been called the “Immortal Health Elixir.”\n\nThis tea is super rich in B vitamins, which not only increase your energy levels but also decrease inflammation in the body.\n\nSince kombucha is fermented it has probiotics which improve both immunity and digestion. This is sold in health food stores or make your own at home!\n\nMaca is a root from Peru and is sometimes called “Peruvian Ginseng”, and although it is not an actual member of the ginseng family, because it has been used for hundreds of years as a way to increase stamina and energy.\n\nMaca is said to be an aphrodisiac and can improve both fertility and sexual performance.\n\nMaca offers many health benefits such as relief from fatigue, symptoms of menopause, as well as infertility.\n\nAntioxidants are found in many fruits and vegetables but according to a study done by Tufts University, green tea has higher antioxidants levels than blueberries or spinach.\n\nA certain form of antioxidants called catechins are found only in green tea and are perhaps the most potent of all antioxidants and therefore have the most potent cancer fighting abilities.\n\nGreen tea is also rich in chlorophyll, which is a natural detoxifying agent. Although green tea has natural form of caffeine, not to worry! This is a healthy type of caffeine that is actually good for your body, so drink up!\n\nSee also tea selection and brewing guide.\n\nThis is an ancient dish from Korea that is a mix of fermented vegetables and spices.\n\nIt is well known in Korea for its healing benefits and research has shown kimchi lowers both blood pressure and body weight.\n\nThere are other research studies that show that kimchi can reduce atherosclerosis as well as autoimmune responses.\n\nKimchi is easily made at home but if you buy some at the store is sure to look for brands that don’t contain added sugar or salt.\n\nYou may have heard about these delicious little berries recently.\n\nThey are absolutely loaded with healthy nutrients! Besides containing all 18 amino acids, goji berries have more beta carotene than carrots, more iron than spinach, as well as tons of vitamin C. Goji berries also have many trace minerals as well as being packed with antioxidants.\n\nThese little berries pack a lot of healing power as studies have shown they can improve Tcell function, improve appetite, decrease the signs of aging, as well as improving sleep patterns.\n\nRead more why you should sleep.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/06/Red-Dried-Goji-Berries-In-Wood-36877141.jpg", "locale": "en_US", "type": "article", "title": "10 Super Foods from Ancient Times that Promote Health", "description": "Our modern way of life comes with many useful, cool technological advances as well as time saving conveniences. Our ancestors would certainly be both", "url": "https://naturalon.com/10-super-foods-from-ancient-times-that-promote-health/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "superfoods", "article:section": "Health News", "article:published_time": "2014-07-12T19:54:12+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/06/Red-Dried-Goji-Berries-In-Wood-36877141.jpg", "image:width": "600", "image:height": "399"}, "tags": ["healthy food", "superfoods"], "tweets": [], "movies": [], "links": ["https://naturalon.com/other-uses-for-coconut-infographic/", "https://naturalon.com/tea-selection-and-brewing-guide-infographic/", "https://naturalon.com/why-you-should-sleep-infographics/", "http://www.huffingtonpost.com/tag/kombucha-health-benefits", "http://vegvivaciously.blogspot.mx/2011/08/8-ancient-superfoods-that-promote-good.html", "https://naturalon.com/everything-about-food-labels-infographic/", "https://naturalon.com/eat-these-12-miracle-foods-and-blast-fat-away/"], "authors": [], "publish_date": "2014-07-12T19:54:12+00:00"}