{"result_id": "361018", "URL": "https://naturalon.com/flu-vaccine-contains-more-mercury-than-allowed-by-law/", "timestamp": "2023-04-25 18:23:31 CEST+0200", "meta": {"description": "Before you know it, flu season will be upon us and with it all those dreadful warnings: “Get Your Flu Shot Today! Protect Yourself!” The CDC suggests that", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/flu-vaccine-contains-more-mercury-than-allowed-by-law/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Flu Vaccine Contains More Mercury than Allowed by Law", "cleaned_text": "Before you know it, flu season will be upon us and with it all those dreadful warnings: “Get Your Flu Shot Today! Protect Yourself!”\n\nThe CDC suggests that all adults 65 and older get a flu shot every year since complications from the flu itself could be deadly. Most Americans get vaccinated somewhere between Halloween and Thanksgiving since they don’t want to be sick during the holidays! And it’s also oh so easy to get a flu shot now, you don’t even have to go to the doctor, just head out to your local pharmacy at Walgreens, Target, or Rite Aid!\n\nEnough with the fear mongering already! Why don’t they tell you the truth about flu shots? Flu shots contain mercury, one of the deadliest substances on the planet. No amount of mercury is safe but they don’t tell you that. Government and Big Medicine brush off those facts as a wild conspiracy theory but they don’t tell you that study after study shows that even trace amounts of Thimerosal ( which contain mercury) , the substance they use to keep the vaccine from becoming contaminated, can be harmful, even deadly.\n\nIn case you didn’t catch the latest lab test results, seasonal flu vaccines, which are routinely pushed onto children and pregnant women, contain unbelievably high levels of mercury, a well-known neurotoxin. This study was done by the Natural News Forensic Food Lab. Vials of the flu vaccine provided and produced by GlaxoSmithKline were discovered to have as much as 51 parts per million of mercury. This is 25,000 times higher than the legal maximum allowed for drinking water.\n\nMercury is perhaps one of the most poisonous substances known to man and yet, pregnant women, young children, and the elderly are encouraged to get their mercury injections right away, every single year.\n\nWhen you demonstrate this type of solid data, which goes against the official government position about vaccines, you will be met with angry denial from the medical community who insists that either these small amounts of mercury are completely safe or that it’s no longer being added to vaccines. This later statement is a lie that continues to harm the American people, especially our children.Read also about what you don’t know about flu vaccine.\n\nRead the truth for yourself. Printed on the official drug insert for Flu Laval, the vaccine that was tested by Natural News, the vaccine does contain mercury. It states that the vaccine contains “Thimerosal, a mercury derivative, is used as a preservative.” By the way, it also states that it contains formaldehyde. Yuck.\n\nStill, even with all these toxic contaminants, young children, the elderly and pregnant women are being injected every single year by the millions. It doesn’t matter that all of these ingredients are well-known neurotoxins and that formaldehyde is a known carcinogen, Americans are still encouraged to line up and get your flu shot because you need it!\n\nYOU MIGHT ALSO LIKE: The Secret to Avoiding the Flu Without a Vaccine\n\nThe strangest thing here is that the government admits that mercury is toxic in any other source except when it comes to flu shots. The mercury contained in vaccines is OK, but not if you find it any place else or in something else. What The Heck?! How does this possibly make sense? Why is it that mercury in dental fillings is a big no-no but its ok to be injected with it? The Obama administration is trying to shut down all coal plants because they “blast mercury into the air”. Also, there are numerous warnings telling pregnant women to avoid eating canned tuna fish as it contains mercury. So, don’t eat tuna fish so we can line you up and inject you with mercury instead? Something stinks in Washington and it’s not tuna fish, my friends.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/04/flu-vaccine.jpg", "locale": "en_US", "type": "article", "title": "Flu Vaccine Contains More Mercury than Allowed by Law", "description": "Before you know it, flu season will be upon us and with it all those dreadful warnings: “Get Your Flu Shot Today! Protect Yourself!” The CDC suggests that", "url": "https://naturalon.com/flu-vaccine-contains-more-mercury-than-allowed-by-law/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "vaccination", "article:section": "Health News", "article:published_time": "2014-09-06T18:43:07+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/04/flu-vaccine.jpg", "image:width": "650", "image:height": "408"}, "tags": ["be aware", "vaccination"], "tweets": [], "movies": [], "links": ["https://naturalon.com/mercury-dental-fillings-scary-facts-infographic/", "https://naturalon.com/what-you-dont-know-about-the-flu-vaccine-can-hurt-you/", "https://naturalon.com/the-secret-to-avoiding-the-flu-without-a-vaccine/", "http://www.naturalnews.com/045705_flu_vaccine_mercury_heavy_metals.html", "http://www.naturalnews.com/043040_flu_shots_mercury_propaganda.html", "https://naturalon.com/mediterranean-diet-plan-infographic/", "https://naturalon.com/why-using-toilet-seat-liners-is-pointless/"], "authors": [], "publish_date": "2014-09-06T18:43:07+00:00"}