{"result_id": "361008", "URL": "https://naturalon.com/top-10-all-natural-anti-viral-compounds/view-all/", "timestamp": "2023-04-25 18:23:16 CEST+0200", "meta": {"description": "It’s almost that time of year; no, not Christmas, flu season. Soon after the kids go back to school, health authorities start pushing flu vaccinations", "lang": "en", "keywords": "", "favicon": "/wp-content/uploads/2014/03/favicon.ico", "canonical": "https://naturalon.com/top-10-all-natural-anti-viral-compounds/view-all/", "encoding": "UTF-8"}, "image": null, "domain": "naturalon.com", "title": "Top 10 All Natural Anti-Viral Compounds", "cleaned_text": "It’s almost that time of year; no, not Christmas, flu season. Soon after the kids go back to school, health authorities start pushing flu vaccinations like they are giving away Halloween candy.\n\nIf your immune system is not in tip top shape, you tend to come down with every little bug that comes along. Nutrients in our food help support our immune system and can increase our resistance to viruses but why not try some natural herbs and treatments that kill viruses and can actually shorten the duration of the illness?\n\nTake a look at the top 10 completely natural remedies that kill viruses so you can forget about that flu shot and its dangerous chemical additives.\n\nVarious forms of silver have been used medicinally since ancient times. In fact, from 1900 until about 1940 silver was used in mainstream medicine to treat a wide variety of ailments.\n\nJust recently there has been a renewed interest in the use of silver. What exactly is colloidal? This means that it’s a suspension of ultra-fine, super tiny particles that don’t settle nor dissolve, not even with changes in the concentration amount. Modern supplements of colloidal silver are a suspension of these fine silver particles in pure water. Read more about colloidal silver miracle.\n\nSilver is believed to work by interfering with the enzymes that allow bacteria, fungi, and viruses to utilize oxygen. Clinical trials that involve injections of silver dramatically reduced the activity of the HIV virus in those suffering from AIDS. There have yet to be any clinical trials involving oral administration of silver but there are numerous personal accounts of its effectiveness in regards to hepatitis C.\n\nThe flower Echinacea (Echinacea purpurea) has been used by the Native Americans for hundreds of years for medicinal purposes. It’s known to support the immune system and has a direct antiviral action.\n\nClinical trials involving the roots and flowers have been shown to reduce the duration, as well as the severity, of symptoms in patients with flu, viral bronchitis, and the common cold. You have most likely seen Echinacea for sale in your health food store because it’s known to work so well. Taken at the first sign of an infection, this flowering herb can greatly help speed up the healing process. It’s at its most effective when it is taken as a tincture over several months.\n\nDon’t take Echinacea before you discuss it with your doctor if you have an auto-immune disease or any type of immune dysfunction. Echinacea is a super alternative to flu shots. Take it as a tea or as supplements and be sure you keep a supply on hand for the flu season.\n\nIn numerous double-blind, placebo involved, controlled trials, zinc have been shown to be very effective against the common cold.\n\nZinc acetate, as well as zinc gluconate lozenges, has been found to reduce the severity of cold symptoms as well as shorten the overall duration of the cold. Cold sores, which are caused by the herpes simplex virus, also respond well to topical applications of zinc. Using zinc monoglycerolate in one study caused complete healing of cold sore lesions in more than 70 percent of patients, Zinc oxide, however, only healed 9 percent of subjects.\n\nFrom these studies it’s fairly obvious that the form of zinc used can make all the difference. The most healing and powerful form of zinc available to the body is zinc acetate and zinc gluconate. There are other forms of zinc such as picolinate, citrate, and orotate, but they don’t work nearly as well. If your zinc supplement dries out your mouth due to binding with the salivary proteins, you know you are taking the right type. Find out natural ways how to increase zinc.\n\nThis herb has been cultivated for probably more than 5,000 years. It’s been used for medicinal purposes since the days of the pharaohs. It’s been used as a folk remedy to help protect and stop the symptoms of colds and flus. Lab studies show that garlic has antibacterial, antifungal, and antiviral compounds.\n\nAlthough garlic has hundreds of beneficial properties, the most important one of these is alllicin, which is also what gives garlic its strong odor. You can get the best health benefits of garlic by slightly crushing one or two cloves and swallowing them but if you simply can’t stomach that, you can always add fresh, organic garlic to your food and take supplements. The alllicin in garlic produces sulphur compounds, such as allyl sulphides, vinyldithins, and ajoene.\n\nGarlic products stating that they come from “aged” garlic lack alllicin but might still have some anti-viral properties. Studies done in labs show that garlic killed the common cold virus, but remember that they were using fresh garlic.\n\nThis is a twofold treat because it’s a food as well as a remedy. The common black elderberry (sambucus nigra) seems to be very effective against the flu virus. More than 90 percent of 15 patients involved in a double blind clinical trial who took 60 ml extracts showed a large reduction in symptoms after just two days and a complete recovery in only three day.\n\nThis is very interesting when you note that the control group took 6 days to even shown an improvement in symptoms. The subject who took elderberry extract also had higher levels of influenza antibodies in their blood than the control group. This means that elderberry extract increased the immune response system. Another, independent study done in Norway showed that the use of elderberry extract reduced the duration of the flu by 4 days.\n\nIt’s thought that elderberry extract disarms the tiny spikes on the surface of the virus, which disarms the flu virus. Elderberry also contains flavonoids, including quercetin, which is also believed to be involved in the healing actions of elderberry.\n\nYes, oregano, that same herb you put in your spaghetti! Besides tasting yummy, it fights bacteria and viruses. In fact, oregano is probably one of the best anti-viral herbs around. Oregano essential oil can be taken in a capsule form to kill viruses and speed healing. If you wish to use oregano oil on the body, use a carrier oil, such as almond oil, to prevent irritating your skin.\n\nOregano oil is super beneficial for a variety of illnesses including coughs, bronchitis, asthma, respiratory infections, mouth ulcers and other types of oral infections, cold sores, gallbladder infections, Lyme disease, sore throats, and tonsillitis, just to name a few. Many people use oregano oil for gastrointestinal issues, even for killing and removing parasites from the body! For all kinds of respiratory problems, you can’t beat some oregano oil in a diffuser.\n\nKeeping some fresh oregano for tea, or oil for topical use, would be a good idea for everyone’s medicine chest.\n\nThese Mediterranean trees were most likely cultivated in Crete about 3500 BC. The health promoting benefits of this tree and its fruit go far beyond the oil that we associate with heart health.\n\nOlive leaves contain a very bitter substance called oleuropein. Oleuropein has one component called elenoic acid, which has been shown to be a strong inhibitor of various viruses in lab tests. Elenoic acid contains a calcium salt, which destroyed every virus it was tested for including herpes, influenza, coxsackie, and polio viruses. It appears to work by stopping the viruses to replicate themselves. Hamsters used in studies have also shown that olive leaf reduces the level of a certain type of influenza and stopped its spread to the lungs.\n\nBudapest conducted an uncontrolled clinical trial with more than 500 patients and came to the conclusion that olive leaf extract was quite effective in treating a wide variety of illnesses. 115 out of 119 subjects with respiratory infections, along with 120 out of 172 subjects with viral skin infections, such as herpes, experienced an extremely quick and full recovery after taking olive leaf extract.\n\nThe SARS epidemic promoted a search for an active compound that would treat viral diseases such as SARS. The Institute of Medical Virology in Frankfurt had researchers test four pharmaceuticals against a compound found in the root of licorice plants for the treatment of coronavirus from SARS patients.\n\nThe Lancet published the results, which showed that licorice out performed all of the four drugs in so far as inhibiting the virus. Licorice greatly reduced the virus’s ability to reproduce itself as well as inhibit the virus from penetrating healthy cells. Licorice has also been shown to stop the reproduction of HIV in lab studies.\n\nIt might also have a beneficial effect on AIDS patients, at least in clinical trials. One study gave subjects with acute viral hepatitis 2.5 grams of licorice three time daily and found that it was far superior to other antiviral drugs, such as inosine poly-IC. Licorice tea is perhaps the easiest way to take this helpful anti-viral herb.\n\nAlthough this herb remedy is best known for its help with depression, it’s also been used traditionally to help stop the pain of sciatica and neuralgia, and to heal wounds.\n\nThe two active compounds in St John’s Wort, hypericin and pseudohypericin, are very active against what is known as enveloped viruses. This type of virus actually tears off cell membranes and hides inside, as a means of fooling antibodies. HIV, hepatitis C, and the herpes virus are all enveloped viruses. The active compounds in St Johns wart don’t appear to be fooled by these enveloped cells and destroy them while leaving healthy cells intact.\n\nThis type of antiviral activity seems to be greatly enhanced by exposure to sunlight, if you take St John’s Wort, be sure to get some time in the sun also for added benefits. St. John’s Wort should not be taken with certain other types of medication or foods so before you try this treatment, check with your doctor.\n\nThis is another popular antiviral herb that has been around for hundreds, if not thousands, of years. Native to Peru, this plant has been used to treat a wide variety of illness, everything from stomach problems to cancer.\n\nSince the early 1970’s, cats claw has been researched throughout Germany, Peru, England, and many other countries. This herb is now one of the top selling remedies in the United States. Besides being a potent antiviral, cat’s claw is also antibacterial and antifungal. The bark and roots of this plant have been well documented for boosting the immune system. Other compounds in cats claw works to kill viruses, bacteria, and other types of pathogens or microorganisms that can cause disease.\n\nCat’s claw has also been found to inhibit healthy cells in the body from becoming cancerous.\n\nYou can buy this herb at any health food store in a tea form, capsule, or tincture.", "opengraph": {"image": "https://naturalon.com/wp-content/uploads/2014/04/virus-close-up.jpg", "locale": "en_US", "type": "article", "title": "Top 10 All Natural Anti-Viral Compounds", "description": "It’s almost that time of year; no, not Christmas, flu season. Soon after the kids go back to school, health authorities start pushing flu vaccinations", "url": "https://naturalon.com/top-10-all-natural-anti-viral-compounds/", "site_name": "NaturalON - Natural Health News and Discoveries", "article:publisher": "https://www.facebook.com/naturalon", "article:tag": "natural remedies", "article:section": "Health News", "article:published_time": "2014-11-14T20:20:04+00:00", "article:modified_time": "2014-11-14T20:30:35+00:00", "updated_time": "2014-11-14T20:30:35+00:00", "image:secure_url": "https://naturalon.com/wp-content/uploads/2014/04/virus-close-up.jpg", "image:width": "650", "image:height": "433"}, "tags": ["natural remedies", "herbs", "healing"], "tweets": [], "movies": [], "links": ["https://naturalon.com/colloidal-silver-the-antibacterial-antifungal-antiviral-miracle/", "https://naturalon.com/natural-ways-to-increase-zinc-7-super-foods-and-helpful-tips/", "https://naturalon.com/all-benefits-of-garlic-infographic/", "http://www.alive.com/articles/view/18469/oil_of_oregano", "https://www.wikihow.com/Get-Health-Benefits-from-Oregano-Oil", "http://umm.edu/health/medical/altmed/herb/cats-claw", "#", "https://naturalon.com/true-facts-about-napping-infographic/", "https://naturalon.com/doing-a-detox-is-imperative-are-you-doing-it-right/"], "authors": [], "publish_date": "2014-11-14T20:20:04+00:00"}