{"result_id": "362001", "URL": "http://www.all4naturalhealth.com/general-health-discussion.html", "timestamp": "2023-04-25 18:23:41 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "http://www.all4naturalhealth.com/general-health-discussion.html", "encoding": "UTF-8"}, "image": null, "domain": "www.all4naturalhealth.com", "title": "A General Health Discussion -- Introduction to", "cleaned_text": "Introduction to All4NaturalHealth.com - A general health discussion on how important health is, and how our modern day lifestyle is destroying it. I wish to kick things off with a rather lengthy general health discussion - simply because there is so much to talk about on this very important subject.\n\n\n\n\n\n Disclaimer First things first -- before I embark on my general health discussion, I have to state that the information put up on this website are my views and opinions. These, of course, are not baseless, and are derived from the knowledge and information I have obtained from numerous books, other websites, videos, CDs, people I have spoken with, as well as my own usage and experimentation. There is so much information out there, and sometimes they are contradictory, so then, what is right, and what is wrong? What to do, what to eat, and what not to? I agree that it can get very confusing. Sometimes, I feel as though the more I read, and the more I supposedly \"know\", the more confused I get. Do note, however, that there is no clear-cut black and white in any arena, and certainly not in the area of health. Experts differ and disagree all the time. Even within the realm of natural healing, many disagree on the definition of \"natural\". Some experts say we need meat, others say all the nutrients we need can be found in plant foods. Some say people from different blood groups need different diets, others say that is rubbish. Some say soy is good, some say it's horrible. Some say sun exposure causes skin cancer, others say lack of sunshine causes cancer instead. Some even say drinking too much water is bad for us! Sometimes, there is a middle-ground we can arrive at. At other times, it just depends on which side of the fence you are on, and which argument you want to believe. Importantly, take everything you read, hear or find out about with a pinch of salt. Keep in mind the fact that probably nobody - not doctors, not naturopaths or herbalists, and especially not people who are trying to sell you something - is telling you the full truth. This is because nobody knows everything, and everyone is biased and has their own vested interests. Do your own research, use your common sense and intuition, and exercise your personal judgment. Don't even believe everything that I have to tell you! Whatever is written on this website must NOT be construed as any form of medical or professional advice. Rather, please take them as suggestions. If something is on this website, it is because I am sufficiently convinced that they work, either through my own experiences, or that of others. The suggestions presented on this website are what I believe in. I have, in fact, personally tried many of the supplements, herbs, protocols, methods, electrical devices and therapies talked about on this website, as I travel my own natural health journey. I always stress the importance of taking personal responsibility for one's own health. Part of that entails trawling the world of information and differing viewpoints out there and then making choices for yourself. After that, you try, and change, if necessary, before arriving at some sort of protocol which you stick to. The important thing is to learn to TAKE CHARGE of your health, and not leave it in the hands of others. Learn to make choices and make changes, to try things. Crucially, learn to LISTEN TO YOUR BODY and what it tells you. A lot about health is how you FEEL! Remember, ultimately, this is your journey! \n\n\n\n\n\n My writing style One more point I wish to touch on before starting proper on my general health discussion is regarding my writing style on this website. I will try to bring as much information as possible to you using simple and friendly language. While I WILL try to bring forth some evidence, I will NOT be interested in making my articles appear \"scholarly\", with an endless stream of scientific citations. Why? Firstly, I feel that this would make for an easier read; such citations can clog up an article. Secondly, as described elsewhere on this website, I feel that \"science\", as defined today, is very much limited. It is not possible to put in place the stringent experiment conditions, as demanded by the definition of \"science\", nor is it possible to divorce scientific studies from vested interests. While I do show interest in the results of research studies, I also pay very much attention to the experiences of people. Lastly, I am not going to try too hard to convince people of anything. You see, for people who do NOT believe in the POWER of natural health and healing, virtually no amount of anecdotal or \"scientific\" evidence can convince them. On the other hand, for people like me who truly believe, no amount of discrediting carried out by groups with vested interests can shake my confidence, nor change my choices. We are works of nature, a part of nature, and nature is FULL of miracles. The only way to achieve true health and healing is THROUGH nature and the natural means she has provided for us.\n\n\n\n\n\n Back to the general health discussion Now, back to the general health discussion I was talking about. While this general health discussion is long, I do hope you will give it a read and consider some of the points made. I believe you have come to All4NaturalHealth.com because you are seeking answers, either for yourself or a loved one, on how to combat disease or to attain good health naturally. I have had quite a number of general health discussions with people. From those general health discussions, I get a sense of what the prevailing attitudes and mindsets today are. From my experience when having such general health discussions with people, no amount of preaching can easily drum into them the importance of good health, a good diet and positive living habits. They usually continue to indulge in their daily dose of harmful foods and habits and, for the majority, it is usually only when they are hit with grave illness, often a serious one such as cancer, that they begin to look for solutions. And people, me included, are experts at ignoring our bodies' many cries for help. One can suffer from years of chronic pain, constipation, headaches, weak immunity, etc, and just ignore them, and then feel so surprised when one finds out one has developed a serious chronic disease. Well, how about those years of unheeded warnings? \n\n\n\n\n\n General health discussion point no. 1 -- taking good health for granted I find health to be such a paradox. Such is the psychology of good health, when we have it, we take it for granted -- big time. We only start to take notice and some action after we lose it, or are in the process of losing it. During this time, we make all sorts of promises and resolutions. But once we get it back, we often return to our old ways. Sounds familiar?\n\n\n\n\n\n General health discussion point no. 2 -- reliance on medical drugs and unwillingness to make big changes When I talk about one's health, I cannot help but stress the importance of taking personal responsibility. But the world today seems to think and operate very differently. Many people just want medicines and drugs to solve their health problems, without changing their lifestyle at all. Now, on this website, many changes are advocated to improve one's health. These include dietary, lifestyle and attitude changes. Many people would be unconvinced. They feel that it's way too extreme to have to make so many changes. When I talk about lifestyle and dietary changes during general health discussions with them, people would usually say they think this is too extreme, and that they believe in moderation. \n\n\n\n\n\n General health discussion point no. 3 -- the scales are heavily tipped against good health! Moderation? Let me tell you the truth -- there is nothing moderate about our modern day lifestyle anymore. Our world today is scarily toxic. Every day, every waking and sleeping minute, we are bombarded with all sorts of toxins, from the air we breathe, the foods we consume, the water and beverages we drink, to the cleaning agents we use, all the mind-churning media and entertainment, and all the stress, negative attitudes and depressing emotions we carry around. We have already allowed things to move towards the NEGATIVE EXTREME. The bad guys are already winning. We need to cut them down and then start stocking up on the good guys! Let us not bullshit ourselves. Are you doing the harmful things in moderation too?\n• When you go to a party, perhaps you down 15 glasses of Tequila without thinking twice, without realizing that your overworked liver has become so intoxicated that you actually lose consciousness, and have a bad hangover for the next 24 hours.\n• Perhaps you party all night, but do not think it is excessive.\n• When you are sitting on a couch in front of a TV, perhaps you eat several packets of potato chips, as well as a mixture of other junk food, and you don't get up from your butt to move around for maybe 5 hours, and that's alright.\n• Perhaps when you are at a fast food restaurant having a long chat with an old friend, or when you are in a hurry, you grab a few burgers and several cups of Coke, without thinking of how nutritionally deficient these foods are, not to mention how fattening and harmful they can be.\n• When you are slicing that huge and delicious piece of steak, perhaps you aren't thinking about your cholesterol, your heart, your arteries, your kidneys and your liver.\n• When you up late working hard and being all stressed out, and you develop a bad headache, perhaps you pop some aspirin, think everything is now alright, and continue working till dawn, without thinking that your poor body needs a rest, and that you have just taken maybe ¼ or 1/8 of a fatal dose of drugs.\n• When you go to a medical doctor and he gives you many packs of pills and capsules in various colours, shapes and sizes, drugs which are toxic to your liver and do crazy things to your health and metabolism, perhaps you obediently swallow those little poisons without considering what they are doing to your body.\n• When you are waiting for the bus or for a friend, or when you are feeling stressed or unhappy, perhaps you smoke 30 sticks of cigarettes at a go, without thinking that a thousand over chemical poisons in those sticks aren't moderate at all.\n• When you cover your skin with sunscreen or perfume or moisturizer or soap, wash your hair with shampoo and brush your teeth using toothpaste, you do not realize that your skin absorbs stuffs, and that these agents you use are filled with hundreds of harmful chemicals, many of which are carcinogenic.\n• Perhaps you get so relaxed on your couch or in your air-conditioned room, that a little movement and walking, a little exercise becomes too uncomfortable.\n• Perhaps you could hate someone, be very angry at someone, or be jealous of someone, and it never crosses your mind that the only person you are killing is yourself.\n• This list goes on... \n\n Now, you did all that without thinking twice, without thinking it was too drastic or an overdose, without sparing a thought for side effects and the long-term damage you are doing to your health and body. No, these things are really okay; they are \"normal\", and not excessive or harmful at all. When it comes to pasta, fries, chips, cigarettes, beer, meat, sodas, chemical soaps, detergents and perfumes, anger and hatred, sugar, preservatives and pesticides in food, etc, the word \"moderation\" doesn't come to mind at all. \n\n\n\n\n\n General health discussion point no. 4 -- we seem to worry about doing too much of the things which are good for health! But when it comes to taking things which are a lot more natural, a lot less harmful to your body, and will in fact help clean up and strengthen it, helping it heal itself, you take a double-take. You cringe, you ponder, you hesitate, you question. You say it's an overdose, it's not natural, and it could be harmful with toxic side effects. You feel you have to consult your doctor, because, you know, 2 glasses of herbal tea or 5 glasses of carrot juice a day might be excessive, or even an overdose -- you know, your liver might collapse from those herbs and vegetables. You know, sunlight causes skin cancer, you say, so it's not wise to get a little sunshine -- you better stay indoors or use sunscreen. Exercise? Maybe once a month, or even once a year. When it comes to the good stuff, the healthy things, \"Everything in moderation\", you say. From my general health discussions with people, I find that this attitude is very common. And I find it to be another ONE of the MANY huge ironies when it comes to health. \n\n\n\n\n\n General health discussion point no. 5 -- we think modern medicine is so advanced... but is it? Another point which I get out of my general health discussions with people is that they think conventional medicine is very advanced and would be able to take care of any illnesses which might surface. Now, one of the core principles of natural health and healing is to harness the body's self-healing powers. Another is to not do harm to the body in any way. Conventional medicine today fails badly to adhere to these basic principles. Many drugs and vaccines which are dished out freely today are in fact very harmful to the body, mostly in the long run, but some also immediately so. The most marked example is chemotherapy -- it is a wonder that it can be considered and termed a \"treatment\" at all; to me, it is just brutal savagery, nothing less. In addition, many surgeries performed are done so unnecessarily, and many lives are maimed or ended at the operating table. Many diagnostic procedures, such as X-rays and mammograms, are also themselves disease-causing. Natural health and healing ideas and methods have existed for thousands of years. Yet, somehow, the modern world seems to have evolved into a paradigm whereby health and healing are associated with hospitals, clinics, X-rays, medical doctors and drugs. Most people think that, if you are sick, you need to 'see a doctor or specialist and take medication'. It is unwise to try and treat yourself, so to speak. Unfortunately, many people today also think that, because medical science is supposedly so advanced, they can eat whatever they want, live however they like, and be fine just by visiting the doctor and popping some pills each time they fall ill. This is a huge myth. Seriously, do you honestly believe that you can eat all kinds of nonsense, breathe in polluted air, drink contaminated water, not exercise, not rest well, stress yourself out, have negative attitudes and emotions, and think that is a man-made chemical or series of such chemicals which can cure you? Surely we are smarter than that. \n\n\n\n\n\n General health discussion point no. 6 -- the state of health and medicine today is that the first world is filled with chronically sick people The abovementioned mindsets are not funny. In fact, they are very dangerous. Because these kinds of mindsets, and to some extent ignorance, are playing a big part in the spiraling rates of chronic degenerative conditions, soaring medical and insurance bills, and higher dependency on drugs and surgery. Sadly, from my general health discussions with people, I find that such mindsets are rather common. The reality is that modern medicine doesn't cure a person of such diseases. One either dies, or is kept alive and put through continuous surgeries and drug consumption to manage the disease symptoms. Oh yes, and in the process, one's pockets get severely burnt too. If I'm not wrong, medical bills are a major cause of bankruptcy. I have to let you know, if you didn't already, that conventional medicine today has no answers at all when it comes to chronic degenerative conditions like cancer, heart disease, kidney disease, etc. In fact, doctors often don't even KNOW what causes many diseases. Statistics also show that medical doctors in the United States, on average, live shorter lives than the regular American. How much would you trust your car (and your body is a very invaluable vehicle of yours!) with a car mechanic who always doesn't know what is wrong with your car, and whose own car keeps breaking down? Scary, isn't it? \n\n\n\n\n\n General health discussion point no. 7 -- in most people's minds: \"Why the need to make changes? I'm healthy now, ain't I?\" In my general health discussions with people, I get the sense that there is a widespread sense of complacency when it comes to health. Well, you are currently healthy, or at least seemingly so, because your body is doing a good job of dealing with all these environmental toxins. But let me tell you, the balance of power is slowly and surely being shifted, a little bit every day. Chronic, degenerative conditions usually take years, even decades, to develop. For example, if you find a tumor on your body, do you think it grew overnight? No way. It took a long time to get to a size where it becomes visible. And, even before that, the conditions in your body which allow the tumor to grow (e.g. toxic buildup, weakened immune system) had probably been around for years too. Do realize that, based on our modern day diets and lifestyle, the statistics for all the major diseases are very grim -- in the case of cancer, we are fast accelerating towards 1 in every 2 persons developing it in his or her lifetime. And that's only one disease, in a whole host of killer ones. Now, once a disease takes root -- cancer being perhaps the most common and most feared one -- the decline usually starts gaining momentum. While our bodies have adapted slowly to the contamination they face, like fish in a dirty pond, they have their limits, and sooner or later they DO crumble. Do you REALLY want to wait till that day to start panicking and changing? Have you ever been involved in a tug of war, or tried to push a very heavy object, such as a bed or cupboard? At first, it is very difficult to gain the upper hand, or to get the cupboard moving, because of this thing called inertia. But once you start winning, once the cupboard starts moving, things start to accelerate and sail along. Again, I have to say, I find it very difficult to push this point home in my general health discussions with people. The fact is, the earlier you change, the better your odds of living a long, healthy life. You could be one of the smarter ones. \n\n\n\n\n\n General health discussion point no. 8 -- next question: \"Why the need to make SO MANY changes then?\" By making as many changes as we can, we reduce the likelihood of some negative lifestyle habits negating the good effects of the positive ones. By doing so, we also allow the positive effects to all rub off one another, creating powerful results in the end. By strengthening the foundations of our house as much as we possibly can, we can then be more sure that it can stand firm against the wind, the waves and even during a storm. \n\n\n\n\n\n General health discussion point no. 9 -- analogy of Health being akin to currency wealth As you can probably tell by now, I love using analogies in helping me to make my point in various general health discussions I have with people, and the following is another one which I liken health to. Imagine that your wealth was contained in a stack of currency bills, perhaps a stack of a thousand $1,000 bills, totaling a million dollars. If someone took half of or even the whole stack of bills away, you would know it pretty quickly. But your health is more like a huge pile of coins, perhaps ten million 10-cent coins (also totalling a million dollars). Every few hours, someone is taking a few coins away, but you hardly notice. By the time you do, you would have lost a big chunk of your 'wealth' (in this case your health)! And we are contributing to the process of coins draining away with our poor everyday living habits, our nutritionally lacking diets, and the large amounts of toxins and poisons we are putting into our bodies every day. Health, or ill-health, is the result of many, many little things we do, as well as those that we don't do; foods that we eat, as well as those that we don't eat; what we think and feel, etc. Every little bit counts! \n\n\n\n\n\n General health discussion point no. 10 -- the irony of premium engine oil Building on the car analogy I had used earlier, would you use substandard engine oil on your car, if you knew that this oil would worsen its performance, make it breakdown more often, and shorten its lifespan, just because this oil is cheaper and perhaps smells better than premium engine oil? Doesn't your body deserve its premium engine oil, in the form of top quality foods and good living habits? You can always buy a new car, but you CAN'T buy a new body. This is yet another irony I find of people today -- we would take good care of our houses, cars, electronics, and spend tons of money on these contraptions, but when it comes to our precious and irreplaceable bodies, we treat them like dirt, and give it substandard and cheap foods and living habits. We destroy our health in the search for money, and then we desperately spend our money in a bid to regain our health. It is so ironic and sad, yet often also laughable. \n\n\n\n\n\n General health discussion point no. 11 -- our bodies are wise AND powerful! Honestly, looking at the toxic state of our world and lives today, and the way we ill-treat our bodies, it's NOT a wonder to me that we get struck with killer diseases; conversely, it's actually a wonder to me that our bodies manage to hold out for so many years, so many decades, before FINALLY crumbling!! Many people are depressed due to the high disease and death rates today. They live in fear, or in pain, or both. These people also believe that there is absolutely nothing they can do to prevent or battle serious diseases. This is another HUGE myth. Don't underestimate your body, your immune system. For example, a person exposed to toxic radiation from a nuclear plant or leak takes years, even decades, to develop cancer or to have deformed children. Can you imagine how powerful our immune systems are, and how much they can adapt to changing conditions? Also don't underestimate your body's wisdom. Every single day, every minute, every second, your body is doing a million things to keep you alive, to keep you functioning, and to keep you as healthy as possible. But it needs help, because it can only work with the tools and fuel that it is given. Know that you have the power to make simple changes to improve your health greatly. Our bodies have the blueprint for perfect health, and all we have to do is to provide the correct conditions for it to exercise that blueprint, that intelligence. \n\n\n\n\n\n General health discussion point no. 12 -- if our bodies are able to STOP disease, they can also HEAL from disease! And our bodies have the innate ability to heal itself from ANYTHING, if the right conditions are put in place, and there is still enough time (e.g. one is not hours from death). This fact has been proven by thousands of people worldwide who were declared terminally ill but went on to live long and healthy lives. This is one of the more important points that I would like to make in this general health discussion. Your body CAN heal!\n\n\n\n\n\n General health discussion point no. 13 -- Natural Health and Healing works! An attitude I get from some people during our general health discussions with regard to healing modalities outside of conventional medicine, is that these methods are quackery and voodoo from days of yore. As though the value of water, herbs, foods, sunshine and traditional healing arts suddenly lose their value. Well, some might say natural health and healing is unscientific, or unproven, or that it only contains anecdotal information. As far as I'm concerned, however, there is only information -- that of sick people getting well after changing their diets and lifestyles! In my mind, alternative medicine and natural healing approaches are inexpensive. They are mostly (there are always bogus ones) safe and effective, as proven by hundreds, in some cases thousands, of years of wide use by various populations throughout the world. There is more wisdom about health and healing in these approaches than there is in our so-called \"high-tech\" and modern system of conventional medicine today. There is a wealth of information out there. I have come across literally hundreds of different books, authors, webmasters, herbalists, naturopathic doctors, even medical doctors etc who have helped others or themselves heal of supposedly incurable diseases. I believe a lot of them, because most of them have no vested interests. For example, what does someone have to gain by telling you that some sunshine is good for you? Can he make a cent off you? On the flip side, companies which sell sunscreen lotions have A LOT to gain by telling you that sunshine is totally NOT good for you. In embracing and practicing natural health and healing, we don't need to know HOW everything works. We just need to know what CREATES HEALTH, and follow them. This is really the good news on health! For example, do we KNOW exactly how sunlight, water, the seed, the soil, the nutrients in the soil, etc, interact and develop to one day grow into a big tree? No, we don't. Not even the smartest or most educated scientist or doctor does. But you see, we don't necessarily need to know how the seed turns into a tree. We just know that God (if you don't believe in God, how about saying \"Nature\" instead?) designed it so. We know that when you plant a seed, and provide all the right ingredients, more often that not, a tree will appear. Not 100% always - after all, what is certain in life? - but often enough. And the tree will one day bear fruit, and produce thousands of seeds! We also know that planting a leaf, an aspirin, or a potato chip will NOT grow a tree. In planting a tree, we just sow the seeds and watch it flourish. The first step towards creating powerful health, reversing disease, is that YOU must BELIEVE! And then, take action to plant that seed. Soon after, the tree of health will appear, and you will be able to reap what you sow.\n\n\n\n\n\n General health discussion point no. 14 -- another question: \"But don't we want to enjoy life?\" People want to live for today! At this point of this particular general health discussion I've embarked on, let me make myself clear. I fully understand that many things in life -- the food, the late nights, the partying, the alcohol, maybe even the cigarettes -- are too enjoyable to give up, or so it seems. I want to enjoy life too. But let me give you a new perspective of what it means to \"enjoy life\". If you could: live longer; be free from pain and disease; live with more energy each day, to be able to do more of the things you want to, and to do them better; be more productive in whatever you do; have better clarity of mind; have a positive and bright mind and spirit; have the energy well into your later years to be able to play with your grandchildren; have better sex drive; be fitter and enjoy sports more; etc - this list could go on, and thereby enable you to REALLY live this life to the fullest, wouldn't you want it? The way I see it, if I could do all of these, now that would REALLY be enjoying life! To me, you NEED health for good life. Heck, to me, health IS good! I see having the gift of good health as already a fantastic way to enjoy life. And, many of the natural health and healing habits, methods and programs can actually be quite enjoyable, fun and exciting too. For example, one can actually whip up some very delicious and healthy dishes using only vegan and natural ingredients. Good health is an investment. Yes, you need to spend time and effort to work towards it, to obtain it. But having it accords you a great return, many fold! I sincerely believe it will be worth it in the long run. \n\n\n\n\n\n General health discussion point no. 15 -- reality: the choice is yours. When it comes to health issues, it's your choice, really. Life, after all, is about choices, and we make thousands of them every day. Do you WANT to be healthy? Almost certainly it's a yes. But are you willing to work for it, to make changes? Maybe, maybe not. Many people only change after being sick, some after being seriously ill, even being on the brink of death. Do you want to be like that too, or perhaps you could be one of the smarter ones, who make changes BEFORE anything strikes them. YOU have a choice. Having hopefully given you some new perspectives to health, this is pretty much the main point of this entire general health discussion. You can be part of the mainstream who excessively abuses their bodies through processed and harmful foods, dehydrating and sugar-loaded beverages, cigarettes, cleaning agents formulated with a whole list of chemical toxins, etc, or you can be part of the group who decides to embark on a whole new positive life journey. Think about it. There are thousands, millions of people who flock to the doctor daily. They have all sorts of chronic degenerative conditions. They get drugs. They are repeat customers. They feed the profits of the drug cartels. You can choose to be one who is part of that group, who shuffles in and out of the doctor's office and pops a dozen chemical pills a day to keep your pain away and you alive. But remember that these people usually don't get well. Those who DO get well are those who find out that modern day life is nutritionally depleted and bombards our bodies with all sorts of toxins, and who decide to change these aspects of their lives. You can continue to live in fear, because our modern lifestyles are really just a walking time bomb waiting for diseases to hit and explode. Or you can decide to regain some degree of control over your health. Change is a radical word. Most of us can't be bothered. I can understand that. After all, Macdonald's, ice cream, Coke, Pepsi, potato chips -- these are all too delicious to give up. Lying on the couch for 8 hours straight is way more comfortable then moving and sweating in the sun. But remember that drugs and surgery heal nothing, and only by making lifestyle changes can we experience true and deep health and healing. Remember also that, while we are free to decide, we will have to live with the consequences of our choices. The choice is yours, and also mine. Once again, I emphasize that this is the main point of this general health discussion. The choice is yours. \n\n\n\n\n\n General health discussion point no. 16 -- the spiritual perspective I will now take this general health discussion away from the physical aspect, and a little towards the spiritual realm. For those of us who believe in God, the way I see things is such -- now that I kind of know what is good and what is bad for my body, it is then my responsibility to do my best for it. Most of us agree that committing suicide is wrong, and is a sin. But knowing full well that certain foods and living habits are destroying our God-given bodies, yet we knowingly continue in these lifestyles, sometimes even indulging in them -- is this not abusing your own body; is this not also committing suicide, albeit more subtly and at a slower rate? We condemn certain so-called sinful things vehemently, yet we also make justifications and excuses for ourselves when it comes to things we like. Double standards, isn't it? In my opinion, taking care of your body and spirit is a very good way to glorify your Creator. And even for those who do NOT believe in God, I still feel you owe it to yourself, as well as your loved ones, to live as healthy a life as you possibly can. \n\n\n\n\n\n General health discussion point no. 17 -- about All4NaturalHealth.com This website is put up, partly to try to convince people to choose to embrace a healthier way of living, and partly to help those who have decided that they want to enjoy or improve life through natural ways to health. The general health discussion on this page serves as an introduction to the website, while the pages this general health discussion page links to would talk a little more about good health and other health issues. Through bite-sized pieces of simple information on natural health and healing on the rest of the website, I hope to help set people on the road to natural health. Despite the harmful effects of prescription medication, the reality is that it will never be possible to put the drug companies out of business, because there will always be many people who seek quick fixes and symptomatic control over lifestyle changes. The health revolution, as with all other revolutions, has to begin from the bottom up. The vision I have is for everyone to have the opportunity to make the choice of taking personal responsibility for his or her own health, as well as the knowledge to do so. The internet helps in bringing truth and information to more people. The mission of All4NaturalHealth.com to help in achieving my vision, therefore, is to educate people on the \"other side\" of health -- on natural health and healing and on natural health alternatives. Through this website and its accompanying platforms, I hope to raise awareness on natural health and natural living, and to bring to readers the benefits of an improved lifestyle, so that people can make informed choices concerning their health. Through this, there will hopefully be as many healthy people in this world as possible. All4NaturalHealth.com is also a reflection of my personal health journey, a journey away from pain, discomfort and disease; towards vibrant health and vitality; and towards better QUALITY and QUANTITY of life. \n\n\n\n\n\n General health discussion point no. 18 -- so, say you have decided to change. Say, after reading this general health discussion, you kind of want to try making some changes. What next, then? In embracing a lifestyle of natural health and healing, it is first and foremost of paramount importance that you start to take personal responsibility for your own health. Read, talk to people, listen, discuss, ask. Learn. All4NaturalHealth.com will be able to help. You have to realize that, in health, there isn't a 100% one-size-fits-all approach. Nobody knows your own body better than you do. You will thus have to customize your own lifestyle to your own unique needs and preferences through a certain degree of experimentation. To do this, you will also have to learn to listen to your body. Creating health is simple, but it sure isn't easy. In fact, it is sometimes hard work, and it definitely takes perseverance, discipline and determination, since temptations are everywhere. Do realize that, often in natural health and healing, a holistic approach must be taken, and it's not just about taking one substance or doing one thing to cure a condition or obtain perfect health. Often, you have to do as much as you can. This is simply because the organs and systems in our bodies are very highly interlinked. Do also realize that, in using natural health and healing methods, you sometimes have to feel worse, before getting better. This is known as a \"healing reaction\", or a \"detoxification reaction\". Don't give up easily. To encourage yourself, from time to time, reread the general health discussion on this page to remind yourself of why you are on this health crusade. Also reread the pages accompanying this general health discussion. \n\n\n\n\n\n Concluding this general health discussion Finally, let me round off this general health discussion with an attempted inspirational conclusion. Living a healthy lifestyle isn't easy, and there will be many temptations and challenges to face. You may well slip and fall -- I do all the time -- but get up and continue on this journey. I honestly don't think you will regret it, because the results -- endless health and vitality, better QUALITY and QUANTITY of life -- are well worth it. Any small positive change you can make is better than no change at all, so don't give yourself excuses. Remember, Health is the Ultimate Wealth! I hope you enjoyed this general health discussion. Now, start sowing the seeds of health today!\n\n\n\n \n\n\n\n More thoughts on Health and Good Health\n\n\n\n Read my discussion and thoughts on \"what is good health?\" \n\n \n\n If, having read my introductory general health discussion, you are looking for some indicators of your current level of health, then these signs of good health should give you a rough idea. \n\n \n\n And if, after reading my general health discussion, you are still unconvinced as to why it is worth it to invest in your health, or just want to know what difference a healthy body can make, then read my take on some good health benefits and the importance of good health. \n\n \n\n Many people search in vain for THE missing ingredient for good health. Why is that so? Read my opinion on this. \n\n \n\n \n\n Links to other opening Sections on All4NaturalHealth.com\n\n\n\n After reading my introductory general health discussion, are you interested to find out more about natural health? If so, read the page About Natural Health Alternatives / Natural Health and Healing and the articles it links to, to get a crash course on natural health, and the reasons why you should embrace it. This section will give you a better overall picture of what natural health entails. \n\n \n\n If, after reading this general health discussion, you do not have much time and need some quick and dirty tips on how to be healthier, then read the page Good Health Habits to learn the basics of living a healthy lifestyle. That page will be perfect for you. \n\n \n\n \n\nTweet \n\n\n\n \n\n\n\n \n\n\n\n Get Quality Natural Health Supplements at Reasonable Prices. $5 or $10 discount for new customers\n\n \n\n\n\nGet natural, herbal and \n\nhomeopathic remedies for hundreds of \n\nhealth conditions and ailments. GO. \n\n\n\n Return from this page A General Health Discussion -- Introduction to All4NaturalHealth.com to All 4 NaturalHealth... attaining good health naturally... Home Page", "opengraph": {"site_name": "All4NaturalHealth.com", "title": "A General Health Discussion -- Introduction to All4NaturalHealth.com", "description": "A general health discussion which talks about various common mindsets and ironies regarding the subject of health, offering some new perspectives on how we could look at things. Health is wealth!", "type": "article", "url": "http://www.all4naturalhealth.com/general-health-discussion.html"}, "tags": [], "tweets": [], "movies": [], "links": ["http://www.all4naturalhealth.com/what-is-good-health.html#INV", "http://www.all4naturalhealth.com/what-is-good-health.html#VisitorPages", "http://www.all4naturalhealth.com/what-is-good-health.html", "http://www.all4naturalhealth.com/signs-of-good-health.html", "http://www.all4naturalhealth.com/good-health-benefits.html", "http://www.all4naturalhealth.com/missing-ingredient-for-good-health.html", "http://www.all4naturalhealth.com/natural-health-alternatives.html", "http://www.all4naturalhealth.com/good-health-habits.html", "https://twitter.com/share", "http://www.iherb.com/?rcode=rib416", "http://www.nativeremedies.com/ailment-disease-list-remedy.html?img=828&kbid=12323", "http://www.nativeremedies.com/ailment-disease-list-remedy.html?img=828&kbid=12323", "http://www.all4naturalhealth.com", "http://www.all4naturalhealth.com/iherb-coupon.html", "http://www.all4naturalhealth.com/help/rss.html", "http://www.all4naturalhealth.com/natural-health.xml", "https://feedly.com/i/subscription/feed/http://www.all4naturalhealth.com/natural-health.xml", "https://add.my.yahoo.com/rss?url=http://www.all4naturalhealth.com/natural-health.xml", "https://my.msn.com/addtomymsn.aspx?id=rss&ut=http://www.all4naturalhealth.com/natural-health.xml", "https://www.bloglines.com/sub/http://www.all4naturalhealth.com/natural-health.xml", "http://www.iherb.com/?rcode=rib416", "http://www.nativeremedies.com?kbid=12323&img=nativeremedies.gif", "http://www.nativeremedies.com?kbid=12323&img=native8-120x90.gif", "http://www.all4naturalhealth.com/iherb-coupon.html", "https://twitter.com/share", "https://www.facebook.com/HealthTJOL"], "authors": [], "publish_date": null}