{"result_id": "363001", "URL": "https://corona.plasma-laurentides.org/en/rapport-scientifique-du-virus-corona", "timestamp": "2023-04-25 18:23:43 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://corona.plasma-laurentides.org/en/rapport-scientifique-du-virus-corona", "encoding": "UTF-8"}, "image": null, "domain": "corona.plasma-laurentides.org", "title": "KF-Iran Covid-19 Document Scientifique – Corana Help", "cleaned_text": "You find the original document following this link.\n\nThis report had been written by:\n\nCoronavirus disease 2019, commonly referred to as COVID-19, is an infectious disease caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) that had its outbreak in December 2019 in Wuhan city, China, and has resulted in an ongoing global pandemic of 2020. Since the end of 2019 the virus has mutated 9x as of today (August 3, 2020).\n\nA report released by the Ministry of Health’s Office of Research and Technology from Iran, entitled “Epidemic Virus Corona 2019” shows that there is still no way to fight this virus directly. 56 cases with chemical drugs from common medicine and 52 cases of non-chemical interventions from herbal medicine and modern medicine, individually and in combination, have been used with none or very limited results.\n\nThe new Space Plasma Technology has shown the viruses can be completely depleted of their energy without any side effect, with a full recovery and repair of damaged cells in the body.\n\nAll living entities from atoms to cells to stars and galaxies are first of all magrav (magnetic gravitational) fields, and this is how they get attracted and position themselves in a given environment with respect to other cells or entities.\n\nAs energy packs, viruses can travel the universe unhindered like any other magnetic ray. When they arrive in the atmosphere of this planet, they attach themselves to the amino acids, the building blocks of all life on this planet. Their structural affinity with amino acids facilitates their encounter with the human cells, where they form a matter structure on top of the cell. This happens through the interaction of the magrav fields of the virus with the cell’s magrav fields. All matter including viruses are created througout the universes by the interaction of 3 components:\n• None Unspecific energy packages originating from the centre of the Unicos; they represent the “basic material”\n• None The purpose or intent emitted from the Soul\n• None The dynamic environment composed of the rays and with the rays and fields of the Earth\n\nHere is the detailed process of the formation of matter including the virus:\n• None The interaction and friction of the two celestial bodies’ fields create plasmatic field packages (energetic structures)\n• None The interaction of these packages with the inertia of the Earth converts these plasmatic envelops to matter:\n• None getting pulled towards the planet. On their way they interact with the inertia of a given element of the planet present in that location. This leads to the creation of that element in the matter state from that package of plasma.\n\nThe same behaviour is at work in manifesting the virus in the matter state. The plasmatic MaGrav fields of viruses (A) are attracted like a magnet by a body cell (B) through the amino acid affinity. The interaction with MaGrav fields of the cell leads to the virus’ manifestation in the matter state on the top layer of the cell in the body (C). This is where it forms the crown, the Spike Glycoproteins, and other features (D).\n\nThe Coronavirus fields, having taken hold of the cell, create a condition to pull other fields in. Thus the virus feeds itself due to its heavier gravitational field; when he reaches its maximum environmental field strength, it can multiply, leading to the creation of the second virus cell. As this process repeats itself very rapidly, the Coronavirus takes hold of the whole environment of the organ, and subsequently, the body.\n\nThis new combined atmospheric condition made up of the cell and virus is stronger than the field of the individual cell and the field of the individual virus. The combination of the two creates a barrier shield force that does not allow antibiotics or current matter state-based chemicals that are pharmaceutically developed to either reach the cell, to diminish the effect of Coronavirus on the cell, or to deplete the energy of this shield. This explains that with amino acid-based strength medicine, for example, antibiotics, we cannot break through these new strong fields.\n\nHowever, there are herbs that carry a magrav field similar to that of the virus. That is the reason why some natural traditional medicines have shown success with Coronavirus and other viruses too. The use of GaNS plasma technology with traditional herbal medicine has been tried in China, initiated by the national security of China, in Guangzhou and Shanghai institutes with great success.\n\nI n plasma physics we have discovered that the larger plasma always feeds the smaller plasma of the same strength, to bring it into balance with itself and be able to make a twin system. That twin system can guarantee the survival of both the larger and the smaller plasma. If we continuously introduce a smaller plasmatic environment to the environment of the virus, we will slowly deplete the energy of the virus and make it ineffective.\n\nHowever, because of the law of conservation of energy, we cannot fully deplete the energy of the virus. These fragmented new packages of energy do not have the force and characteristics of the original virus’ magrav fields; so they can not spread throughout the body.\n\nAt the same time these weaker field viruses can be used to feed the physiological cells of the body. In this way they can become available sources for faster recovery of the surrounding cells or the body in general. So the virus keep on living within the environment of the body, but at a harmless strength. If the low energy virus can be kept within the structure of the body for long enough, then the body will have the time to develop an immunity that protects the body from any new incoming viruses of the same strength.\n\nA new material has been developed using nanotechnology and the conversion of atoms to single nano plasma molecules: a Gas in Nano State or GaNS. This new material is stable at room temperature and normal atmospheric conditions.\n\nThe single-molecule plasma is considered to be a weak plasmatic field environment that can be used specifically for the depletion of the MaGrav fields of any virus. These GANS materials can be tailored to any virus MaGrav strength.\n\nLaboratory tests done in Austria on GaNS and GaNS waters have shown that they are effective in stopping the growth of bacteria; they are more efficient than the present antibiotics.\n\nThe beauty of the GaNS plasma technology is that it can be produced at home and used by ordinary people. The effect of the treatment can be seen, in some cases in less than one hour; and complete reversal of infections can happen in less than three days.\n\nThe GaNS Plasma Technology mimics how our body works.\n\nThe inside of the human body is in a plasmatic magnetic field vacuum condition; one of the highest level vacuum systems in the universe. Everything inside this environment is in an energetic state and behaves as a GaNS. Any element which is taken out of the body will immediately interact with the inertia of the planet and convert themselves in the matter state.\n\nConsequently, any technology that would be efficient under the conditions inside the body, has to be working on the energetic or GaNS level. All the elements inside the body work, interact, and exchange energy in a plasmatic condition. For example, the interaction of the three layers of the plasma in the nano state leads to the creation of the three layers of skin on the tangible level.\n\nThe new GaNS plasma technology produces materials in the same water/salt environment that we find in the body. That’s why the GaNS transfers energy from the plasma to the matter state in the same way as the elements inside the body. Plasma materials are produced in two steps:\n• None first a material, usually a metal, is nano-coated using\n\nIf the GaNS is then transferred into a vacuum condition in the body of the man, it will behave in the same way as all the natural elements inside the body. In creating aqueous solutions of varying salinity ratios, the body creates the different tissues like bones, organs, blood, skins, etc. The GaNS plasma technology replicates the creation of any tissues occurring in the body of the man.\n\nWhen GaNSes are added into a pure water, they will transfer their energy, information and strength to the molecules of the water. Thus these GaNS waters, or Liquid Plasma can be used to transfer the energy, information or structure of the GaNS into the body.\n\nOur body is healthy when all its parts and functions are in a condition of balance or homeostasis. When this equilibrium is disturbed, our body is in a condition of dis-ease. In order to treat any medical condition, we only have to rebalance the body. This rebalancing happens naturally when the affected body parts are placed between two GaNS mediums of different concentrations. The mediums (patches) create a plasma gradient in the form of a torus enveloping the unbalanced body region. The field flow inside the torus takes away what is not needed and gives what is missing, thus re-establishing balance.\n\nW e are actually able to show the interaction of two GaNS concentrations when we place them inside two ping-pong balls into water which we freeze. After freezing we can see the plasmatic force fields as white lines; they resemble the lines produced by iron filings in the vicinity of a magnet. On the image you see another spherical shape appearing between the two balls (red arrow). This third plasmatic magnetic field created by the interaction of the plasmatic fields of the GANSes from the two balls, is what we are commonly call the soul of the system, where the two balls are interconnected through their fields.\n\nThis third sphere is also known as zero-point field where all the fields of the two balls are in balance. If the box is kept long enough in the freezer this ball will begin a life of its own as an independent entity. This ball contains the full spectrum of the field strengths of all the elements in both balls as well as the field strength of their interaction.\n\nThere is another way to liberate the plasma balancing field: if we are able to create a pulsation in the plasma similar to the heartbeat in our body. The amplitude and the frequency of the heartbeat leads to the release of the GaNS energy; in this case the gradient is not necessary. This is the secret of the creation and maintenance of life on this planet and in the universe, where everything has a heartbeat, the Earth, the body of the man or a tree.\n\nThe GaNS production units always develop a very thin layer of fatty substance which accumulates on the surface of the water. These are natural GaNS amino acids. The GaNS production units mimic how the amino acids are created on the surface of the oceans of the planet. These amino-acids then lead to the creation of life through their interaction with different elements and salts of the oceans. If these GaNS amino acids mix with Iron in the oceans, it leads to the creation of hemoglobin. If mixed with Magnesium, it leads to the creation of chlorophyll for plants. If mixed with a lighter salinity, it leads to saltwater fish and animals. If mixed with a higher level of Magnesium, higher salinity, and Carbon Dioxide (CO2), it leads to the creation of white meat. If this GANS amino acid mixes with Magnesium, Copper, and Zinc, it leads to the creation of the neural system and red muscle tissue.\n\nTo deal efficiently with the Corona virus the Keshe Foundation had to develop a specific combination of nano coated and blank materials in specific shapes submerged in a specific salt water solution (Sodium Chloride salt, NaCl). The GaNS produced in that way has the same energetic signature as the Coronavirus. The latter being of a higher strength will transfer its energy to the GaNS in order to bring it in balance with its own strength. This process will eventually lead to the depletion of energy for the Coronavirus.\n\nThe Coronavirus has shown to have the MaGrav field strength of Calcium. Thus he is able to manifest calcium from its’ energy form into the matter state; this process is called “calcification” and it happens in every part of the body where the Corona virus attaches itself. By applying the GaNS plasma water to the region of the Coronavirus infected cells which have calcified, we are able not only to deplete the energy of the virus, but also to reverse the calcifications.\n\nM.T. Keshe has released, as a gift to the Chinese community on the Chinese New Year, January 24th, 2020, a newly designed GANS production system. This system can develop all the elements needed for the decalcification of the lung tissues and reduction of the energy of the Coronavirus at the same time. This design is known as “1Cup1Life #1”.\n\nIt consists of a single cup, filled with water containing ordinary 15% Natrium Chloride (NaCl) salt. Inside the cup there is a 1x nano coated Copper spiral in the center, one pure bare Copper spiral (purity >99.99%) and one pure bare Zinc flat plate (purity >99.995%) positioned opposite one another. The selection of spiral-shaped and flat-shaped materials in the cup creates different elements and different magnetic fields of GaNS plasmas, efficient in the interaction with the Coronavirus. The combination of GaNS materials produced in the 1Cup1Life, can be seen in Table 1 (semiquantitative XRF analysis of Isfahan University Laboratory).\n\nThe 1Cup1Life #1 is suitable to treat tissues infected by the Coronavirus in the lung, brain and nervous system (known as white tissue).\n\nAs the Coronavirus mutated and gained access to other organs like the kidneys, stomach, liver, reproductive organs, skin, blood, etc. (mainly what is known as soft red tissue), M.T. Keshe introduced the 1Cup1Life #2. In the second cup the zinc plate has been replaced by a Copper plate.\n• None The first production and tests of\n• None Coronavirus was announced by the Chinese government; as they had found a successful solution to the swine fever one year earlier.\n• None January 24, 2020: M. T. Keshe devised a new system known as “ to the Chinese nation through a live recorded video showing how to make and use it; so that e self and their families to overcome the virus.\n• None February and March 2020: the Chinese national security apparatus tested the G NS provided by the Keshe Knowledge Seekers team in China, separately and in a mixture with Chinese herbal medicines, in medical university hospitals in China and confirmed the GANS plasma as a solution for the Coronavirus.\n\n Subsequently, the Chinese army, in collaboration with the Chinese Knowledge Seekers started the production of large amounts of GANS water for cleanup and eradication of viruses in Wuhan city, China.\n• None February 2020: The outbreak of Coronavirus reached Iran, ranking second after China in the number of new cases and deaths per day. Iranian Knowledge Seekers organized themselves into a very efficient movement to provide help, support, and information on how individuals can create their own over 90 000 families and groups in Iran. had a major effect on the reduction of deaths and the spread of the disease in Iran.\n\n Iranian health officials the use of the GaNS technology.\n\n (before they had 1-2 deaths per day) and cured more than 100 infected people in 14 days.\n• None Mahallat City has a population of 50,000 inhabitants and has been disinfected with the G the city has been\n• None ue to this success, M. T. Keshe in conjunction with the National University in Iran and Iranian officials released this paper to jointly support all other world nations to engage in the same process. With the use of this technology, every nation can support its citizens to overcome this virus without the need for vaccination or chemically produced medicine. The solution will create the base for long-term support for any future viruses which may manifest themselves over time.\n\nThe cost of saving a life using GaNS plasma technology as a natural process is less than 10 USD and it can be adjusted to be used on any potential future outbreak of viruses.\n\nYou can find the details for the making of 1C1L #1 and #2 on the Keshe Foundation wiki pages and on the website of Plasma-Laurentides.\n• None using plate in the spine\n• None Diabetes. There is a possibility of low blood sugar and therefore the need for insulin or pills may be reduced. level needs to be monitored\n\nIn these mentioned cases, the use the GaNS or GaNS plasma waters, or any of the below-presented protocols is at your own risk and responsibility.\n• None and two daily dosages of Magnesium in the form of tablets, powder, or liquid. The mix usually\n\nNote: The GaNS waters used on the skin must be produced according to the certification and methods used by Keshe Foundation.\n\nWarning: Never consume the GaNS itself or use it directly on the skin. Only use the clear water on top of the settled GaNS.\n\nFollow the links to read the corresponding articles:\n\n 1. Testing\n\n 2. Prevention of Corona Infections\n\n 3. Processing Corona infections\n\nHow the GaNS technology is used in Iran\n\nThe beauty of this technology is its absolute simplicity; it can be taught online, so even people dying at home could make it and save their lives.\n\nIn the beginning of the pandemic, many people were send home because there was not enough space in the hospitals. People had to help themselves and volunteers began to create a nation-wide network via social media channels to create groups where people could find help. At the peak of the crisis, there were over 36 000 people registered and over 3 000 people online every day at any time. People could follow links to find the procedures on how to make everything at home, how to support themselves, their families and their community. Dr. Asadi, the doctor heading this volunteer movement, personally saw over 600 patients/day, all of them successfully recovered.\n\nThe support team of volunteers also delivered the GaNS plasma waters and ready-made 1Cup 1Life to people’s homes within hours; and a dedicated support team made more than 15 videos showing step by step in how to produce the material, clean it, and apply it as a solution to overcome Coronavirus. The work of the Keshe Foundation in Iran has made such a big difference as hundreds of lives have been saved by people for the people.\n\nPeople with mild symptoms, like a common cold, didn’t need hospitalization. The Liquid Plasma 1Cup1Life# for drinking, inhalation and spray was generally sufficient as a treatment. Occasionally co-amoxiclav was used where indicated by the particular protocols. As a result, all patients recovered 100%.\n\nModerate cases of infection: \n\n Moderate cases showed symptoms of lung infection with calcification; patients suffered from respiratory distress but were conscious and alert. They were treated with Liquid Plasma 1Cup1Life#1 with GaNS for inhalations and patches.\n\nAbdominal pain and infections with fever or headache were treaded with GANS plasma mixture 2 pads that were applied to the affected area.\n\nPatients in the final stage, hospitalized in very bad general condition, medically induced coma, intubation, etc. All tests were done in the hospitals using MRI, CT scan, X-ray, together with the revolutionary GaNS plasma technology in combination with blood test results. The latter can indicate presence and damage done by the Coronavirus in the lungs, heart, brains, blood, and abdominal organs. Even most advanced cases could be saved from a certain death.\n\nAll the applied treatment protocols are described in detail in the summary of the Scientific paper II.\n\nMany people took the trials in their own hands and shared their results in the national trials; reporting their results to the doctors and other members of the public health system. Subsequently the Iranian National Defence university ran a 200-patient clinical trial with 90% of the patients recovering within days. The hospitals, who have been allowing the GaNS technology to be used, have not registered losses of patients or medical staff since.\n\nThe hospital in the city of Mahallat, for example, the only hospital publicly accepting the use the GaNS technology, has brought the virus under control. The pandemic has been eradicated subsequently in the whole city of 50 000 with the help of the municipality. This success has been announced on the national television in Iran.\n\n\n\nThe overall success of this nationwide clinical trial is 90+%.\n\nThe MTT experiments show a possible toxicity of a substance for the human cells. In this case the experiments showed the following results:\n• None NS up to a concentration of 40%, either injected, topically applied, are safe and non-toxic for human cell\n• None oncentrations of 50-60%, cell viability is still above 50%\n• None oncentrations above 60%, the cell viability decreases and falls below 50%, but not below\n• None It is important to understand NS itself are not toxic in any of the concentrations.\n\nDr. Asadi commented: “My advice as a doctor is that, based on my experience, it is best to start with GaNS water, which is very healthy. Me and a lot of researchers have been using in oral and pure form and with a 100% dose for the last 2 years. We have seen nothing but successful treatment and health. It has not had the slightest side effect for us and our patients.”\n\nForeseeing the development of the Coronavirus\n\nThe Coronavirus, because of his affinity to calcium is specially attracted to the human brain because it has a high level of calcium content. Consequently the virus could affect the memory center and other parts of the human brain and mind.\n\nTherefore it is very vital for all the societies to immediately deal with the calcification in the body. An efficient way to do this, is to use Liquid Plasma 1Cup1Life in direct intravenous injections. This protocol will also proof helpful to fight future cancers caused by calcium nucleation, an effect of all members of the COVID family of viruses.\n\nDue to his nature as a package of energy, the Coronavirus does not only transmit directly by touching, breathing, food, or water. The virus can transfer itself in the form of energy from an infected environment into the body of the man. This phenomenon has been unknown, and it is for the first time that we see such a field transfer of an entity into the body.\n\nTherefore, it is essential to pay attention to protect the environment from this virus. Once established in a given environment the Corona can rapidly spread and kill. It is utmost important that the governments take the GaNS disinfection systems (photo) into consideration as they can deplete the energy of the virus and its mutations from the public areas and environments (hospitals, trains, schools, offices, etc.).\n\nAfter examination of the technology by the scientists in Tehran National Defense University, the technology is now deployed directly in public places, such as mosques, streets and hospitals.\n\nIn the wake of calcification in the lung, it is possible that liquid accumulates inside the lung or pleura, due to too rapid decalcification which only leaves water behind. It is important not to disturb the body by puncturing it out or touch it in any other way. Let the body take care of it; and help with lowering the GaNS concentration to max 5%.\n\nIf you observe liquid accumulation between the stomach inner lining and the tissues behind, reduce the Liquid Plasma dosage to max 5% and let the body absorb the liquid in his own time. Do not interfere.\n\nThe separation of tissue layers and subsequent accumulation of liquid accompanied by pain has been observed in women’s reproductive system (ovaries, fallopian tubes, womb, and vagina). Change the protocol to Liquid Plasma 1Cup1Life#1 and #2 without GaNS.\n\nThe remainder of the documents displays a host of connected detailed research documents (mostly on the interaction of GaNS waters and GaNS itself with various bacteria and viruses). As I have too little competence to understand these reports, I leave it to the interested reader to work through the material in the original form.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["https://ln2.sync.com/dl/6ce20d720/wnbpz5eh-dtaab4ry-j4kqzvq9-kufz7qf8", "https://ln2.sync.com/dl/6ce20d720/wnbpz5eh-dtaab4ry-j4kqzvq9-kufz7qf8", "https://en.kfwiki.org/wiki/KF_Wiki", "https://plasma-laurentides.org/en/1cup1life-fabrication/", "https://plasma-laurentides.org/tests-pour-les-infections-du-corona/", "https://plasma-laurentides.org/protocole-de-prevention/", "https://plasma-laurentides.org/protocoles-du-traitement-du-corona/"], "authors": [], "publish_date": null}