{"result_id": "363005", "URL": "https://plasma-laurentides.org/en/chemin-vers-lame-5/", "timestamp": "2023-04-25 18:23:50 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://plasma-laurentides.org/wp-content/uploads/2016/06/cropped-PL-logo-sm-1-32x32.jpg", "canonical": "https://plasma-laurentides.org/en/chemin-vers-lame-5/", "encoding": "UTF-8"}, "image": null, "domain": "plasma-laurentides.org", "title": "Path towards the Soul 5 – Plasma Laurentides", "cleaned_text": "According to the Science of Eden, the devil is an entity, an element on the energetic level. Invisible entities use base emotions (fear and greed) to connect to us in order to suck our life energy, which they need to survive.\n\nEntities are not present on the fundamental level, reality, because they don’t have a Soul. They are not beings, but fictitious entities that depend for their “life” upon us feeding them with our life energy. And it seems they can only digest energies connected by base feelings like fear, greed and such.\n\nIn most cases entities like the devil are created and used by people or organizations who are motivated by the lust for power and whose goal it is to “satisfy their personal desires even by hurting others”.\n\nM Keshe defined the devil in todays teachings as “What you call devil happens, when you who are accepting to move away from your soul and the service to all; when you are allowing damage to be done”.\n\nAnd in Napoleon Hill’s words, the devil answers a human’s question about his identity: “My physical appearance? Why, my dear Mr. Earthman, I have no physical body. I would be handicapped by such clutter as you earthly creatures are in. I am negative energy and I live in the minds of people who fear me.”\n\nThere are many other “entities” that live inside the collective (un-)conscious used to control us, to keep us in an eternal sleep, to prevent us from waking up to who we really are: society, nation, religion, patriot, democrat…\n\nA video interview with a 9 year old boy from Italy. He is so refreshingly clear and unambiguous… so refreshing! Maybe he is already one of the Universal Children?\n\nHere is the link to the video.\n\nBy the way, the new universal children will in a sense much more advanced in the knowledge of the Creator than we – simply because they are connected to the emotions and understand the new knowledge by their feeling and not by their rational mind.\n\nWe are so used to look at everything only on the matter level, that we believe that what happens on the fundamental or Soul level is different from what’s going on in the material world. It turns out, however, that we don’t need to learn new things to understand what is happening on the fundamental level. In both dimensions, we find the same processes – only in different field strengths.\n\nFor example in matter state chemistry different atoms can join together to form new molecules; on the fundamental level our Soul can connect with other Souls of any element in the universe to form a new collective Soul.\n\nOn the matter level the atoms involved in a new molecule will behave in a different way – sodium (Na) for example is a highly unstable atom on it’s own, but inside a new molecule, like table salt (NaCl), it looses it’s instability. On the Soul level we observe the same change. We are not the same when we are alone, on our own, and when we are in a love relationship with another Soul. We see that the plasmas or Souls involved in a new plasmacule undergo change as well.\n\n“There are no differences in the process on both levels. Only man has chosen to use different words for the same things.” MT Keshe\n\nThe changes on the fundamental level do of course first show on the emotional and feeling level, because there is the interface of the Soul with the body-mind system. We can see how the relationships, we are involved in, determine how we feel and how we act; in a way our relationships determine to a certain degree who we are.\n\nSo we could use this piece of knowledge to consciously support our personal evolution – not necessarily by choosing with whom we enter into a relationship but by choosing how we see the people we connect with. We can trust our Soul that she knows perfectly well, which person or element of the universe is conducive of our current evolution – it’s our mind who, fed by traumatic experiences in our past, can distort our perception of the people we are with. Therefore it is helpful in our evolution to clean up these wrong concepts about the people we are with. Our Soul will always connect us with Souls who are most useful for the current phase of our personal evolution! And when we are not be able to perceive this, we have to work on cleaning up our non-constructive belief systems.\n\nWe find another example in the creation of a new life; a new baby is like a new plasmacule. When the future parents consciously prepare themselves and their environment to welcome, the new baby will be the pinnacle of the Love of both the parents (the original atoms). Both of them contribute the best they have to the new life. And in return the new plasmacule baby will change the life of both parents to facilitate their respective evolution!\n\nNew light on the Enhancement Units\n\nThe devices that the KF and the Science of Eden are creating, especially the PRK-1U and the Universal Enhancement Unit, can be seen in the same way. They are developed for the same purpose, to let us experience our Soul on the matter level, inside our body-mind system. Who works with these units, will find that what happens on the fundamental level is the same that what happens on the physical level. Many of us will express this experience with “I am surprised that I actually didn’t make a new experience… my Soul is not something new… she is also ‘me’… only I couldn’t see that before…”\n\nThis is also reflected on the technological level where in the first enhancement units you could see the magravs and reactors which created the fields – now, in the new units, you see nothing of the kind: there is nothing to see on the matter level, the technology is embedded and only the field level remains.\n\nAnd so there is “a certain risk” to work in the KF manufactures: especially towards the end of the implementation of the technology, the fields will be active and the workers cannot prevent the harmonization between their souls of physicality with their Soul!\n\nThese systems are like the opposite of the “Pandora’s box” – it will take a lot of time for us to explore the possibilities they contain for our own evolution and the evolution of ALL!\n\nGlimpse onto a new level of understanding\n\nWhen we are with our beloved, we have the urge to show to everybody how perfect she or he is. Before she was just an ordinary being but through our love she became the perfect beloved and lover. The same must be happening to the Creator, because, He, too creates out of Love.\n\nWe know that all material things are condensations of informational light on the matter level; what if the informational light is already a condensation of another “form of substance”? Or in other words: when the magnetic fields that lead to the creation of matter come from the Creator – where does the Creator come from?\n\nCould there be a deeper essence of creation? Could it be that the magnetic fields leading to the creation of the Creator and us come from another dimension, that we are not (yet) aware of? Or maybe we know it already? Love?\n\nMaybe we don’t need to be looking for another dimension. We have learned from Science of Eden, that any macro-system cannot have a different structure from it’s constituting micro-structures because the process of creation is simple and the same for every “thing”: in just the same way the Creator creates all there is, He is created in the same instant. If we are looking for an origin, we have to look for them in the space time continuum; and that is on the matter level. On the fundamental level there can’t be neither space nor time. So the Creator in the act of creating, is created himself – just like parents create a child and this birthing at the same time creates the parent!\n\nThe new Space Travel Enhancement Units not only teleport us to anywhere, but their real potential lies in their ability to show us other beings of the universes in a way that we can enter into contact with them. We can get to know them and we can love them. It does not matter if a human being enters the unit or a Soul from any other nook and corner of the universes. The system works for all in the same way.\n\nSo all the different life forms can meet on the Soul level, fall in love and create a child. Which is not possible on the matter level. We know that children coming out from marriages between different races are more intelligent and more beautiful – we can imagine what the union between different universal species will bring!\n\nThen to whom this child will resemble? The earthly father or the mother from Orion? Or will it be half father half mother? And anyway how to beings from other universes see us and our children and how do we see them? Any materialization will take into account the environmental condition of the inertia but also the wish of the beings involved.\n\nAnd there is a difference between a reality and the perception of this reality. It is therefore possible that the earthly father will see a human child while the mother from Orion will see her child resembling very much her features.\n\nBy the way, when we see a human being from China with “yellow skin, and slanted eyes” or another human being from Africa with “black skin and bulging lips”; we don’t see characteristics that belong to these people. What we see doesn’t come from them but is our projection. The perception we are talking about may very well be one of the last vestiges of racism. If there wasn’t any racist belief left in us, we would not be able to see different races, we could only see human beings. And we know that the truth our perception is proportional to the structuredness of our consciousness; the Creator doesn’t see human races, he sees beautiful shining Souls!\n\nAs, travelling through space on the level of the Soul, we are passing through the fundamental level, where everything is to the norm. And then, when our consciousness re-materializes together with our body, both will be to the norm and in this state we cannot perceive anything else as the Creator Himself. In the process of re-materializing, any vain ego desire to have a face like Leonardo Dicaprio – cannot be happening unless it would be the wish of all Souls involved. On the fundamental level only unconditional Love will decide about the form we take on the physical level – no doubt a magnificent co-creation of all the souls involved!\n\nThe original post on facebook is here.\n\nThis is a concentration by Hélène Laporte, Science of Eden: “During the Universal Concentration of January 2, we controlled our reality with the numerical sequence of eternal development through the economic activity\n\nThe economic sphere includes everything we need for our harmonious and eternal development on the material level.\n\nThe gap between the numbers give us the space to introduce mentally, visualize everything we need for our project(s). What we call “economic sphere” comprises actually everything that we need for our existence and development on the matter level.\n\nHere is how you we can do it:\n• We visualize everything that is helpful for the eternal development of all beings in the economic sphere.\n\nBased on a video with the channeling of Bashar, which you find here: 5 Steps to pass through the needle’s eye.\n\nThis is the five step technique for passing through the eye of the needle given by Bashar in 2020. I have rephrased his message a little bit.\n• I forgive all no matter what \n\n The first step is to forgive everyone for anything they have ever said or done to me, I no longer resist, I no longer hang on to the past. I no longer have expectations for someone else to fix me or change me. I don’t need to wait for those to see the error of their ways in order for me to move forward in freedom and power. I don’t wait for them to change. I don’t wait for apologies for what they’ve done. I forgive them and set myself free. I let go of regrets. I let go of any need for anyone else to give me permission in any shape or form to move forward through the eye of the needle. I forgive them all no matter what they have done\n• I forgive myself\n\n The second step is to forgive myself for putting myself in any position that made me experience frustration, anger, regret and sorrow. I don’t hold on to them. I let them go. I don’t judge myself for what I have done; it has all brought me to this point. I forgive myself completely and freely. I forgive myself as I forgive others who have trespassed against me.\n• I no longer inform myself from the past self\n\n The third step is to disconnect from the past. Yes i have learned lessons from the past, but no longer wallow in past events nor think about the past self because I am no longer that past self. I let go of the negative reactions the negative behaviours of the past self. I don’t inform my future from my past behaviours, from my past emotions, from my past thoughts, from my past experiences. I learn from them and bring the knowledge and understanding I’ve gained from that but i’m not that. Instead i am only an observer of the past and not a participant in the past. I just observe those elements that will help me, not to repeat the thoughts, emotions, behaviours and experiences. I let go of that personality. It is no longer me.\n• I begin to inform myself from my future self\n\n The fourth step is to connect to the future. My future self is calling to me on the other side of the eye of the needle, I answer its call and i move forward in the way my future self would. I imagine and visualize that future version of me. I behave, feel, think as that future self. I have my future self from my linear space-time perspective. I take advantage of the fact that i have set myself up this way in space-time; that i have anchored myself into the future and that it is pulling me toward it through the eye of the needle. I answer the call from the future self. I listen to the higher mind calling me through my passion.\n\n This is what the future self does every day and every moment. My future self only acts in complete alignment with my passion – without insistence, without assumptions of the outcome. My future self is always choosing to remain in a positive state so that i can receive the benefit of whatever manifests.\n\n And even if what manifests is not my preference, i know it’s there for a reason and i let it serve me.\n\n The future self is calling on the other side of the eye of the needle. I am being pulled through easily, swiftly and effortlessly. I anchor to the future self. I inform myself from the future me.\n• I allow myself to be fully in the present \n\n The fifth step comes natural after the other steps are taken, as i pass through the eye of the needle and beyond. I am effortlessly in the present moment. My consciousness is more and more structured and the speed of my thoughts keeps on accelerating. The true me, with all the fear-based beliefs stripped away, lets me be living my raw essence, my indestructible core the present self. I experience space time as more malleable, more flexible, more fluid, as i become closer and closer, bonding with the vibration in harmony with my higher mind and spirit and acting upon the earth in that manner. I keep on stripping away the things that no longer serve me. I am far more empowered and far more free and far more joyful than i’ve ever been in my life; and I express more and more the true beauty of my being, of my inner light.\n\nI forgive and let go\n\nI borrowed the title from a song of Madonna “The power of goodbye”; you can enjoy the video following this link.\n\nIn the last newsletter we have looked at the way we can use the tremendous amount of energy deployed by the panicking matrix agents to help the spiritual growth of Humanity. But there is even more help available to us on the physical level, in one of it’s fundamental fabrics: time.\n\nThe generations before have seen the development of technological progress since the industrial revolution from bullock carts through motor cars to electrical vehicles or in the field of communication from messengers on horseback, through the post system to cell phones and internet. All that was an evolution of technological gadgets, reminding us of our intrinsic, but forgotten, capacities.\n\nNow humanity will be witnessing the switch in the technology from matter state technologies to fundamental or Soul state technologies. As we are remembering our true nature as ‘Images of the Creator”. This change is incomparable to anything that happened before.\n\nAt the same time on the socio-economical level, there is a grand change happening that we may not yet be aware of. Up to today, the industrialized nations have been seen as examples of progress while the so called “third world nations” have been considered as “underdeveloped”, having to follow and catch up with the example of the rich nations. Now slowly this whole picture is turning upside down: as the covid mayhem is principally affecting the rich nations, trying to destroy the social and family fabric in the urban and metropolitical centres, the “third world nations” have mostly been spared and could keep their high frequency of vibration, their physical and mental health. Now slowly the rich nations will turn to the poor nations and follow them, trying to regain their physical and mental health.\n\nOn the personal level you may perhaps have the same feeling as me, that time is passing faster and faster – at a mind blowing rate. Sometimes it feels like a cyclone – and we can choose to sit in the eye of it, where calm and silence prevail.\n\nI add a message from Drunvalo Melchizedek, who converted himself from an ordained physics professor in the US to a free lance shaman in the Maya tradition. Here are his observations:\n\n“We are in the past of this journey that has already happened. What life is about to do is something it has never done before, ever. It is the first time since the Creation of everything that it has decided to ACCELERATE things. So, instead of it taking millions of years to do these different levels or steps, they are going to be done – sometimes – in minutes. We are about to go at the speed of light through evolution, and through many, many levels that normally take billions and billions of years to accomplish. We are going to reach this very fast. From the standpoint of experience, like in two Earth years, from what would normally take 10 to 15 billion years to get there, whatever is going to happen is between The Source, The Father-Mother Creator, God.”\n\n“We wish you one of the best years, man has ever seen. We will bring everything possible to create the condition for you to be enlightened – be it with the systems, be it by bringing the conditions, be it by bringing other Souls into the teachings of the Keshe Foundation.\n\nWe love you and we adore you and we worship you as a Soul. It’s your job to find the strength, the dimension and the beauty of Her.” MT Keshe\n\nThe 21st of December is the original celebration of the winter equinox – the longest night in which the Light is born. This date is highlighted by the story of Mithra, which has been subsequently highjacked by the major religions. Still it remains the birth of light, the birth of our light, of our illumination. As we become more and more saturated with the universal knowledge brought forth by the Plasma Science and the Science of Eden, the tipping point approaches.\n\nWe can actually sense this even on the material level as the system/matrix is more and more panicking and raising the pressure as the holes in their system multiply and grow – up to the point where we will see the collapse of the system even on the matter level.\n\nAt the same time, humanity and many of us have been waiting for the coming back of the Messiah, to once again save us from ourselves. And – lo and behold – the messiah is coming! Not as an extraterrestrial entity but as You and Me! Mithra is the personification of the divine part of our collective consciousness.\n\nAnd the further teachings will be adapted to that: “We will take man out of his schizophrenia. We will teach that everything is psychosomatic – man creates his reality with his mind (psyche) and it manifests on the matter level (soma). We will take the brain out of the equation (the personality) as man will learn how his Soul can directly interact with the physical plane and create the paradise we are meant to live in.” MT Keshe\n\nMithra or Christ-consciousness are names for a state of consciousness in which we are in unconditional love – it is the divine part of our collective consciousness.\n\nEven though it can be difficult for us to feel this in our everyday lives, we all still have this possibility stored in our DNA, to access unconditional love whenever we want. Because at our core, we are made of love and love is the material of the connections between all elements in existence. And love means light.\n\nWe can all be lighthouses. And the more conscious we are, the better we can perceive and emit this light over time. Especially in the present time it needs the light of every human being. We are not here by chance. There are people everywhere in the world who are holding the light. We are not alone. We are many. We should always remember that. Because it also gives us strength when we know that we are not alone. We are 99% – the non-light is only 1% and they make a lot of noise and mayhem pretending to be powerful and in charge.\n\nEspecially in this time we need the light, the understanding and our connection with like-minded people. The world needs our humanity and our compassion. We can only open up and shine because we are love at the core.\n\nI wish you all the best and much love in the days to come,\n\nThis meditation is based on the meditation of the day of the 24th of the month as part of the “31 Day Challenge” by Grigori Grabovoi. Edited a bit by aviram.\n\nThink of an event to normalize and keep it in your mind throughout this practice.\n\nObserve your reality. Your reality is you, the structure of your being or state of your mind. When your state of mind is peaceful, the reality around you is peaceful.\n\nLook at your feelings and see how you create them and how they work. This is how you create the world. Understand your feelings as tools to create, to shape matter like the creator, understand how they work.\n\nConsider all the teachings and multiplications of this entire year and become aware that Love is infinite. That your Love is infinite. Look at the world with Love.\n\nYou are part of the creator forever, you are a particle of eternity. The creator created you in Love, in the space of Love. As creations of God, you have been given the knowledge of Love. Love is nothing but life and life is Love.\n\nExpress your Love, manifest it wherever you are. Love is not expressed through words but through your own actions. Your actions – your creations – are the expression of your Love, right wherever you are.\n\nThroughout this concentration, keep in mind the desired event and it will manifest.\n\nThis passage is from the video with Derryl Anka channelling Bashar, you find here. It has been a little edited by aviram.\n\n“I would like each and every one of you to know how important it is for you to truly be yourselves in the coming year.\n\nIt is of paramount importance that you remain in the eye of the storm where it’s calm where peace and solitude reigns. You may see the storm raging all around you, swirling around you, thundering and lightning all around you. It is more important than ever before and more important than it will be for quite a long time during this crossing, to be at peace within yourself.\n\nSo we would highly encourage each and every one of you to really take stock of who you really are and what kind of decisions you really choose to make and how they are or are not in alignment with what you truly wish your world to be now.\n\nYou are the Creator!”\n\nWho is curtailing our knowledge?\n\n“We have to understand both the level now; the faster we can do that, the better for all of us: we have to understand our physical life and at the same time the life of our Soul, our life as part of the Creator. In this way Mithra is the collective Soul of all of us.” MT Keshe\n\nThis comes very close to how Abraham Hicks defines himself: “We are your collective consciousness, we are all of you in the non-physical dimension. We are who you are, you are the cutting edge of who we are. We are infinite intelligence. We are the purest form of love you have ever experienced.”\n\nAbraham Hicks is the personification of the structured part of our collective consciousness. And our collective consciousness can only develop through and within each of our individual body-and-mind systems. At the same time, our collective consciousness in its fully structured form is congruent with the Creator – just like Mithra described by M. Keshe.\n\nOur collective Soul as one Humanity is a reality since ever. If we ever knew it, we obviously have thoroughly forgotten. However our being oblivious to it, doesn’t affect it’s existence at all. And, just like the Creator, our collective Soul talks to us through many many different mouths: “Please wake up and see with your own eyes!”\n\nNow we understand that we always have been part of the Universal Community as well, and we haven’t been aware of it either, because of our addition to the material level only: “It’s the man who has isolated himself.” MT Keshe\n\n“Now everything is about understanding our own life and the universe. Theology exists when we put mysticism around it – the reality exists, when we understand the knowledge!” MT Keshe\n\nThis states clearly that our perception determines our very life. If we want to change our life and the conditions of our reality, all we have to do is changing our perception – and comprehending the universal knowledge of the Creator has become the most important thing in our lives. And, of course, if we want to move from the lazy mysticism of the eternal victims to the blissful comprehension of a responsible creator being, the first step has to be taken, is that we think for ourselves!\n\n“The gate to hell is negating the existence of the Creator and the gate to heaven is the bliss to live in His presence, being his hands, his mouth, his heart.” MT Keshe\n\nWhere is the Knowledge come from?\n\nAll real knowledge comes directly from the Creator. All beings, all Souls have the same access to it. The perceived difference in access to the knowledge that a M Keshe or Grigori Grabovoï has compared to us, is due to the choice of perception – how far we want to look; or in other words “how deep we want to go into the rabbit hole”. Many of us look only some meters ahead and see only representations on the matter level while M Keshe chooses to look straight forward into the Source which is the Creator. We have all the same access to the knowledge; the only difference is in our perception. The more we are able to structure our consciousness, the farther we can see.\n\nThe meaning of our life\n\nTo be Human is to be part of Humanity.\n\nWe are able to observe with lucidity our behaviours in the great theatre of the life. We maintain our vigilance in order to normalize all the disharmonious reactions to what we experience.\n\nWe are taking height and gain depth; we reach unceasingly new dimensions, to an ever higher level of consciousness.\n\nWe sow the seeds of love and infinity through each of our thoughts, words and actions.\n\nAt each moment we offer more to receive more; thus we actively expand abundance.\n\nWe recognize ourselves in each being that we meet, conscious that each one is indispensable for the return to unity.\n\nYou find the video following this link\n\nA young woman from Switzerland who shows us who we are going to be as soon as we have structured our consciousness enough…\n\nLooking at her and listening to her insights, the way she talks and the feelings she radiates, we may better understand what M. Keshe, Grigori Grabovoï and Abraham Hicks are talking about.\n\nWhen we say it’s difficult to harmonize our personality with our Soul, one of the reasons is that in the last 8,000 years we lived a schizophrenic life. We are engrossed in the material plane and call the realm of our Soul “the other side” or “a dream”. Now we are facing the challenge to jump back the 8000 years and remember who we really are.\n\nEven though our collective consciousness told us that the Soul is on the other side, nothing but a dream. But in reality we were dreaming all along. And for the most part, still are. Now is the time to wake up. And waking up is also a natural process that we cannot force by our will power. Waking up happens as natural as falling asleep.\n\nM Keshe suggests that we can work with our dreams in a way that we remember them but we are not interpreting them on the matter level, but we try to understand as hints coming from our Soul. And also the new technologies brought forth by the KF and the Science of Eden facilitate this process of remembering.\n\nWe are in the process of waking up, or the new Humanity is in the process of being born. All is going well, we have nothing to do about it and we can just “let it be”. However, if we understand the process and love what is happening, it comes natural that we would like to speed it up – like a small child who can’t wait for Xmas and the mother says to him: “The faster you sleep, my darling, the quicker you get to the next day, closer to Xmas.”\n\nThis evolutionary process will turn a switch inside us: from thinking that we are here to have pleasure of enjoying the material things (this is essentially taking without giving) to feeling the happiness and love of the Creator to give and create, then enjoy more to give and create more! We will discover the real abundance in our lives. The joy and happiness of the Creator is key!\n\nNeedless to say that all negative feelings and emotions that deviate us from happiness, slows the process down for us. We will talk more about that in the “Happiness is Key” article further down.\n\nWe should also not forget that all this happens in and through our body, because our body is a fundamental structure, the interface chosen by the Soul so She can interact with the 3D world and evolve in this way. In the dimension of the Soul everything is eternal. When feelings and emotions manifest in and through our body, we bring – through our life – eternity onto the material level. We create time and space, so the eternal can manifest on the physical level. We create time and space because we understand the conditions of the environment in which we are living.\n\nNow we have risen above the level of duality – there is no difference anymore between the fundamental and the material level. This is the confirmation of the Soul on the physical level. It will bring the Soul and the body-mind system into their original true positions and harmony.\n\nNow the thoughts and actions of the Creator become visible in and through our body.\n\n1st part of the Video by Abraham Hicks on youtube.\n\nThe process to control reality can be shown in different ways. Each of the different schools focus on a slightly different aspect; all together give us a the complete picture.\n• Plasma Science proposes to lead an ethical life (think good, speak good and do good) and to be present on the emotional level to interact with the fields of things and events.\n• The Science of Eden teaches us to put ourselves in state of mind appropriate to control reality and then use the evolutionary techniques (concentrations or practices) to influence what happens on the matter level.\n\nIn this article I would like to introduce you to the teachings of Abraham Hicks in the same context. Here is her take on it in a nutshell:\n\nWe live in a perceptional universe, in which we are the creator and responsible for our own reality. The vintage point from which the control of reality is easiest, is called the “High Flying Disc”. The moments when we are experiencing what we don’t want, what is not to the norm, are called Contrast. Contrast helps us defining more precisely what we want by experiencing or seeing what we don’t want. In order to use contrast, we have to deliberately turn our attention away from what we don’t want to imagine what we want.\n\nHow do we actually create our reality? To use a metaphor, we create our reality by choosing the pipe line through which the energy leading to manifestation will flow. The energy inside the pipe line is flowing towards us; we are the receiver of whatever is in the pipeline that we have chosen.\n\nFor example, we have slipped off the high flying disc and are experiencing contrast. As long as we keep our attention focused on contrast, every thought we think will feel uncomfortable when we think it; and this is literally carving out a pathway to more unwanted things. Unwanted when you get there and unwanted on your way to getting there – you are unhappy all the way.\n\nTo normalize or materialize events, is easier than we have been letting it be! No hard work, no severe discipline or great effort is required. The only acceptable effort would be choosing the high flying disc and then just for a little while watching what comes as a result of that. Choosing the high flying disc is choosing happiness, joy and love as the only feelings worthwhile to pursue. Because we know that these feelings are close to the fundamental level and the Soul.\n\nWhen we’re sitting around with friends and we’re having so much fun, we are all laughing so much that we can hardly understand what the other one is saying – that’s the time when we are on the high flying disc. And that’s the time to make our affirmations to the universe of what we want! Or when our children are at their happiest, that’s the time to affirm to them who we know them to be.\n\nWhen we are feeling at your best, that’s the time to keep that momentum going by by adding more words to it and anytime other than that be as quiet as we can be.\n\nWe know from many spiritual traditions and psychology, that the earlier in the day we consciously set our direction, the easier it can be maintained. The earlier we set the key note, the more our day will take shape around it. We all know that when we say that “we should start off on the right foot”. In other words, when we are waking up in the morning, that’s the right time to choose the high flying disc.\n\nWe are used to achieve the goals in our life by hard work, the more difficult the path the better… but now we have to say good-bye to this belief and embrace the new way.\n• All evolutionary techniques require perseverance; therefore we should , without any exception for the next thirty days.\n• As soon as we find ourself conscious in the morning, we ask ourselves: “ hat thoughts could i think that would put me there ?”\n• During the day, whenever we are experiencing contrast, we say to ourselves two things:\n\n that I am aware that I have 17 seconds to do something about it. And then we see ourself do it.\n\nDoing this exercise, our own personal life is going to demonstrate for us over and over and over again all of the components of what we talked about here today. It’s going to be a really wonderful month coming up; and the month following that even better. Because once the manifestations start rolling in in response to the new pipes, that we have laid, then it becomes even more fun because the manifestations reinforce what we know: The better it gets – the better it gets!\n\nJust be the happy person that you are and let law of attraction rendezvous you with all the events leading to a perfect life in a perfect world.\n\nMany of us feel that bringing ourselves (soul of physicality, personality, mind) into perfect harmony with the Soul as a problem, we don’t know how to do it. M Keshe describes this difficulty as the difficulty of conversion.\n\nThe activity of the Soul can be compared to that of the Sun. We see eruptions, flares on the surface of the sun; this is the way how the sun tunes its magnetic fields to be able to interact with the planet earth and the other elements of the solar system. The Soul does the same: it modulates it’s emissions to enable the interaction with the soul of physicality, us.\n\nThe body-mind system is complex. For instance our brain, having itself two hemispheres needs to control the two hemispheres of of the body, passing through a crossover point. We can see the level of complexity when we imagine we handle a ball of fire in one hand while holding the hand of our lover in the other. Each part has it’s own feelings and emotions to control the body’s actions on the matter level.\n\nThis complicated symmetry reflects our our condition of living inside the dual world. “Our right hand doesn’t know what our left hand is doing.” Duality is a perception of reality where everything is “either or” : either we exist on the physical level or we don’t exist at all. On the level of duality there is little possibility of transition between two states, very little possibility of conversion. As I have said already – the medium that we use to control our actions are feelings and emotions. As long we live in a world of duality, we cannot harmonize the two structures, the mind with the Soul: “Should I listen to my head or should I listen to my Soul?”.\n\n“When you can control the emotions in a balanced field, then you are able to create one field on the level of physicality, the two emotions have become one. You have left duality. In the new Enhancement Units, we are creating that condition.” MT Keshe\n\nIn other words we have to elevate our emotions to the level of the Soul, where there is no duality, but oneness, equanimity and love. On the level of the Soul, we are so high that the unstructured part of our consciousness simply doesn’t exist.\n\nAnd again the way to “achieve” this is that we only have to allow the fields of the Soul, which are all encompassing and harmonious, to exist without any interference. This is a very soft and delicate point, once it has been passed, we will be able to see and experience the unlimited powers of the Soul. It is like a very tiny electronic micro switch that controls the huge mechanism of a power plant for example.\n\nWe may have experienced this process, using the various health tools of the Plasma Science. In the beginning we stuck to the protocol and after some time of rigorous application we find that we simply had forgotten to use the tools according to the prescription. This was the time where we, the soul of physicality, had been elevated to the point where we didn’t need the plasma tool anymore, because we could now simply trust and allow the Soul to take over. This is the act of forgetting; the mind forgot to control and left it to the Soul; the Soul took over – and there was no disease anymore.\n\nNow we cannot decide to forget something or can we? So again the process to harmonize our feelings and emotions is beyond our doing and certainly beyond our will. The only thing we can do, is wanting very much to reach this state and trust the process that we will get there according to the agenda of the Creator.\n\n“There are a few Soul around the KF who have achieved this, they will radiate and bring about the change for the whole Humanity”. MT Keshe\n\nThe Example of the fish tank\n\nThe fish tank example of M Keshe refers to that: “I can put a d rop of water into the fish tank and it becomes a fish; I can put another drop and it becomes a man.” In one part, he puts the fields of the Soul of a fish and in the other the Soul of man; and in interaction with the salty water environment, the Soul will create it’s respective body according to the conditions of the environment. This is what we call “Resurrection”. It doesn’t matter if it is salt water of the ocean or the amniotic fluids of the womb of the mother.\n\nThe example of the Plasma\n\nWhen we were working with GaNS, M Keshe told us how to make a plasma transfer cup or a replication unit: a glass vessel filled with ordinary water and with the 4 GaNS in test tubes around it. When we placed an orange on top of it, we could transfer or replicate the taste and the quality of the orange into the water.\n\nIn today’s example the friend to whom you want to show this replication unit, has a glass of whiskey in one hand and a ham sandwich in the other. Both he or you taste the orange in the replicator water, but not of ham neither of whiskey – even though the ham and the whiskey are also near the replicator just like the orange?\n\nIt’s the process of the intention and the soul: “I always told you, that you are the cup! It’s not what you do on a physical plane, it’s the intention of love and giving that you generate. You are so addicted to the matter level, that you don’t see the hidden knowledge behind the Plasma Technology.” MT Keshe.\n\nThe example of the meeting in Belgium\n\nM Keshe gave us another example to illustrate this: in 2011 an influential group, connected to the red circle, called for a meeting in which they wanted to take M Keshe off the presidency of the Keshe Foundation. The seats in the meeting room were arranged in rows arcing around the seat of M Keshe in the corner of the room.\n\nBefore the meeting started, M Keshe rearranged the seats, including his own, in a circle; in a circle there everybody is an equal part of the group. When the meeting started, he went int the kitchen to prepare a drink for everyone. He transferred the intention of unconditional Love into the drinks. When he served the drinks to the people, immediately the energy in the room changed; now it was the love of the Creator that could be felt. His gesture was a reference to the biblical event when Jesus washed the feet of his disciples.\n\nThis meeting had actually become a turning point of the growth of the Keshe Foundation around the world.\n\nAnd this is why the Universal Council called for the elevation of the souls of the negotiators of the “5+1” in Vienna; these negotiations will become the uprising for the generation of Peace around the globe.\n\nWith our intention we can create the real Cup of Life; with our intention to give freely from our Soul to the others, so they can take what they need. This is not a one shot deal; it is an ongoing process. When the recipients have taken what they needed to satisfy one need, they will go on to the next need and take what they need now. And so on. And by doing so they slowly become part of the circle of giving and taking. Increasing the energy and the knowledge until we all will be partaking in the knowledge of the Creator.\n\nTogether we are much stronger\n\nWhen we individually elevate the soul of someone else, we are sending an impulse from our mind. Our mind is structured by our consciousness, it is unique to us. That’s why our impulse will reach people who are tuned to our mind, so to say.\n\nBut if we work in a group, we will create the collective Soul of our group and this Soul will send the impulse for elevation on a general level, fitting anybody. That’s why working in groups – or as a whole humanity – is much more powerful!\n\nWe are the victims of our own laziness\n\nLooking at conventional history, we would think that we, as a race, have never encountered a situation like the one we are in right now. We can see it as thread of extinction of the human race or the greatest evolutionary step in our history. In truth it may be both at the same time.\n\nIt is true that for us as a race this evolutionary step is new, but there have been beings who did reach that level already. All the enlightened beings like Jesus, Buddha, Mohammed, Krishna, Osho, Eckhard Tolle, Betty and many others. However they remained isolated cases because they couldn’t manage to bring the whole of humanity to the level they had attained. And at the same time there were people like Julius Cesar, Genghis Khan, Napoleon, Hitler, Stalin and the eternal puppeteers in the background, the Rothschilds in collusion with the Vatican who did their utmost to enslave the human race entirely. The so-called powers to be have only the material plane to coerce obedience from our part. And we are since 8000 years willing to submit to any type of governance.\n\nWhy? Because we are too lazy to take the responsibility for our own life and the well being of our planet. The golden carrot dangling before us was the perspective to earn our place in heaven by suffering enough before our physical death.\n\nBut what happened 8000 years ago? According to Anastasia, we were the pristine Vedic people who lived in complete harmony with the creation and the Creator in independent family domains – without any governance!\n\nBut humanity chose the path of physicality. We became more physical and greedy, reducing ourself to the material level only. The more material things we possessed, the more we’ve been possessed by the same material things – depriving our lives of love, spirituality and meaning. Continuously rejecting the love of the Creator and misunderstanding how the universe and ourselves work – until we didn’t know anymore who we are and why we are here.\n\nBut the Vedic times are not where we started; we have been created at the same times as the Creator and everything else in an impulse of Love and in the image of the Creator; possessing all of His qualities and powers.\n\nIf we forget something, that doesn’t mean it’s gone – it only means we don’t see it anymore because it has gone out of our consciousness. So, even after 8000 years of erring, the truth is still inside of us, waiting to be rediscovered.\n\n“So, we are not teaching you something new. All of you have been entangled with all these teachings for the past years. In a way we are taking man back to his own history. It’s not “back to the future” – it’s to understand that our past has become our future.” MT Keshe\n\nIn this sense our ascension, our evolutionary progress is at the same time a going back to rediscover our origins.\n\nAnd during all that time the Creator wanted us on His side to co-create splendid worlds; He showed us every moment where we went wrong and what would be the right way – only we didn’t listen to Him, we preferred listening to the priests and presidents.\n\nSince the so called Covid-19 pandemic, our decline on the matter plane seems to be galloping. Our addiction to the matter plane and its consequences have become so unbearable that M Keshe likened our current situation to a convict on death row waiting for his lethal injection. And we have put ourselves on the death row and our crime is that we have not understood the essence of our creation – who we really are and why we are here?\n\nAnd that’s the ONLY solution to all the Covid-19 threads: the manufactured virus, fake vaccines, the confinement in our own homes, the sanitary passport, mandatory masquerades and social distancing, etc. The ONLY way out of our self-made dilemma is our ascension from the matter to the Soul level. On the level of the Soul we are invulnerable, unattainable and incorruptible – just like our Creator.\n\nSo, instead of complaining about injustice, corruption, power abuse and stupidity, we use exactly what is happening now to grow. We take the confinement as the proposal from the Creator to be more with ourselves and meditate. If we can’t take a flight because we don’t have a sanitary passport, we just don’t fly and think about how the Creator uses all conventional vehicles to remind us of our ability to be omnipresent and to travel with our Soul.\n\nOn a very deep level we needed to create the current situation with all the mayhem and the thread of the extinction of the human race – because we didn’t understand otherwise. In a way we created the current chaos – to force us to look into the mirror and really see what we are doing!\n\nAnd on the other hand the KF and the Science of Eden in their great compassion, consider our matter dependency and developed technologies that are tangible and visible on the matter level and that can do things we need on the physical level like processing diseases. While in reality these systems are passages to the Soul – portals towards the blue light of Life.\n\nAnd at the same time we don’t have to sit around and wait. We can learn to achieve the same effect within ourselves than the Units create on the outside.\n\nHere are the r ituals to save the world\n\nThe Dome of Peace ritual was started in 2019 by the Keshe Foundation. M Keshe called on the knowledge seekers around the world:\n\n“Please remember that every Sunday from now on until we raise the soul of this planet to a peaceful planet, the KF knowledge seekers worldwide will spread the GaNS waters around the world at 12pm CET and/or 18pm CET.\n\n Thank you for participating in this greatest movement by the soul of the man to bring about the peace on this planet for ever.”\n\nToday M Keshe suggest we add the next step to this ritual: to create the “Dome of Peace” with the power of our Soul:\n\n“We asked you to spread the GaNS waters each Sunday. Now we give you a new path. Now try to unite each others’ Souls. Try to elevate the Soul of humanity through your own Soul to a level that no-one can touch the embodiment of the Human race.\n\nWe are facing our demise; ours and many other life forms besides us. Try to find a time to unite on a regular basis in the dimension of the Soul. That mankind elevates the Soul of the totality. And we can dissolve all the animosity and the harmful times imposed by those who thought to have the power by their money.\n\nChoose a time where all of you come together on the Soul level in a state of inner calmness. At that time, don’t spread the water of GaNS, but spread your Soul. Unite and in time we will make a new race out of the Soul of Man.\n\nAnd then, instead of doing it once a week, do it all the time.” MT Keshe\n\nThis new ritual is meant to become a habit – so natural that we feel it’s part of our everyday life and consciousness. It will empower the Soul of the Human race to become strong enough to protect our physicality, so no harm can be done to us anymore.\n\nIf we can understand this message, we are now encouraged to become the Enhancement Units ourselves. To link up with all the other units to create the dome of perfectly balanced fields around the earth and beyond, fields that are to the norm, fields where we are in perfect balance with our Soul, fields that will not allow any misbehaviour.\n\nThis new ritual is not only a service, we do to Humanity – at the same time it is a powerful means to structure our consciousness with Universality and Love. And structuring our consciousness elevates by default the collective consciousness until there is no nonconstructive believe left in it – only the informational light of the Creator.\n\n“It’s your responsibility to elevate your soul and not wait for a handout. It’s your responsibility to understand the creation and the work of the Creator. And then it’s your responsibility to understand the structure and the workings of the whole universe and beyond.” MT Keshe\n\nOf course this new ritual, asked for by M Keshe, complements in an ideal way the Collective Concentrations that are offered 3x/week since many months by members of the Science of Eden (in french):\n\nTo connect and participate click this link\n\nSo we have prepared an edited version of “The Equation of Predictive Control” created by Hélène Laporte; we have adapted her audio file to fit our context. You find the audio file (mp3) following this link.\n\nWe don’t need to wait for the KF to give us a specific date and time to do this collective concentration – whenever we find a peaceful moment, we can sit down and do the collective concentration. So when Hélène says “I invite you to focus on the whole group that we are”, you can imagine that you are not alone doing it. All the people in the Keshe Foundation, in the Science of Eden and elsewhere are working towards the same goal of bringing together the souls of all human beings to raise the collective consciousness so that peace, harmony and Love will reign on earth and beyond.\n\nThe physics of balancing the personality with the Soul\n\n2nd part of the Video by Abraham Hicks on youtube.\n\nThis article explains with simple analogies how to balance the personality (soul of physicality) with the Soul. It is based on the heart and brain coherence teachings.\n\nIn one of the most famous quantum physics experiments, scientists were observing the electron. An electron is a material element; and as such it can represent any other event or element on the material plane. Quantum physics found that an electron can exist as a possibility (on the fundamental level) or as a particle on the matter level.\n\nWhen the scientists observed the electron, it went from a cloud of possibilities, the wave function and collapsed into a material particle all of a sudden. When they stopped observing it, the electron returned back into the state of possibility.\n\nWe can use this knowledge in our life; where everything that happens to us can be compared to an electron. It’s possible then that when we stop observing what happens in our life, that is to say, we no longer observe our life from the level of the rational mind (unstructured consciousness), that our life will turn from factual reality into possibilities just like the electron turns into possibilities.\n\nIf we can linger without a name, without a face, without a gender, without our pain, our disease, without all the relationships we have, without our past or our predictable future – it makes sense then that the longer we linger in the unknown where all possibilities exist, the more we would be open and actually create new possibilities in our life.\n\nNow getting into the present moment is the work. The moment we start noticing that our attention is going to memories of the past, that’s the habit of how we’ve been thinking up until this point. And we can break that habit; simply by returning our attention back into the present moment and unfold as an awareness back into possibility. And every time we do that that’s a victory!\n\nIf you where to place your attention where your energy is, and all of your attention and energy is in the present moment, you have a lot of energy to do amazing things. So then all those possibilities that exist in the quantum field exist as plasmatic possibilities or possibilities in the informational light. To allow us to tune into those potentials that already exist on the fundamental level, it requires two things:\n• A coherent brain. That is a clear intention that you can hold for some time.\n• An elevated heartfelt emotion. That is what begins to open our hearts and creates coherence in our heart.\n\nHere is how we are creating lack; often throughout our entire life:\n• We see something that we want like a new car or a new wardrobe and we notice that we don’t have it. Noticing that we don’t have it, we experience lack. This is an observation which fixes our thought of lack and prepare it to manifest in our reality.\n• We can get back onto track, when we start thinking about having that car. We close our eyes and we imagine ourselves actually driving the car and feel the gratefulness and joy of having it. Joining the thought or imagination with the heartfelt feeling is the heart-brain-coherence. Both are on the same track.\n• But then we open our eyes and realize that the car hasn’t manifested – we are again checking on reality – and we are experiencing more lack. Now we try harder to get it, even on the matter level – which is entirely impossible.\n\nSo the solution is that, whenever our wish or desire comes to mind, we behave like a small child before Christmas: we wallow in anticipation, we imagine the gift in details and – most importantly – we feel the joy and gratitude of the wish being fulfilled.\n\nHabitually we behave like an adult, checking on reality – which has the effect opposite of what we want; like the example of the wife of Lot in the bible. It’s like: “Yes I want this, but…” The energy of lack can’t carry the thought of wealth because it’s not consistent with that energy.\n\nBut if we can manage to connect to our inner child, so to say, then we are starting to open up and become more energy and less matter; more wave and less particle. Now our brain is consistent with our heart, our energy is consistent with our thought of healing, or our new dream, our new job or our new relationship. That energy strong, it is what Grigori Grabovoï calls “Biosignal”, a potent thought which can condense into a materialization. A Biosignal is a strong magnetic charge on the fundamental level.\n\nSo then when you get really good at creating the heart-brain-coherence and you begin to feel the emotion of your future before it’s made manifest, then you’re no longer living in lack – you feel like your dream has already happened.\n\nAny materialization works is based on the vibrational match between your thought/feeling and a potential existing on the fundamental level. It is like the thought/feeling is attracting an already existing potential – the thought/feeling of lack will attract the lack and the thought/feeling of abundance will attract abundance. This is a very simple mechanism – which requires us to really pay attention to our thoughts and feelings!\n\nWe can also think of the mechanism like this: The thought sends the signal out and the feeling draws the corresponding event back to you.\n\nAgain. If we are intending on creating something in the future and we are waiting for the manifestation in order to feel the emotions of the fulfillment of our wish, then we are sending the thought out but, without the feeling, we are not drawing the experience back to us.\n\nThe people from the Heart Math Institute proved what we just said in a three part experiment. They did a study with a group of people that were expert prayers. They set three vials of DNA in front of them because they wanted to know whether its the intention, the feeling or both that could change the DNA in the samples:\n• The intention (brain coherence): all of your intent, we want you to see in your mind the ust keep visualizing it winding and unwinding.” At the end of the experiment, they checked to see if the DNA was changed in any way. It didn’t; so the intention alone did nothing to affect the DNA.\n• The feeling (heart coherence): ow open your heart, create heart coherence and just signal out and let’s see if that energy begins to affect the . At the end of the second part of the experiment, they checked the DNA and, again, there was no change in the DNA.\n• The Biosignal (heart-brain-coherence): “ ow we want you to see the unwinding and we want you to open your heart and give thanks that The moment they combine that clear intention with an elevated emotion, more than 20 percent of the DNA unwound. The thought sends the signal out the feeling draws the event back.\n\nSo the fundamental question is: What are you broadcasting on a daily basis?\n\nIf we combine a clear intention with an elevated emotion, if our heart is open and we feel connected to the energy of our future – then we have access and success. It’s our job to create and ideally maintain that modified state of mind – so it becomes our attitude.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#Who%E2%80%99s_the_devil", "#The_new_children", "#Plasmacules_and_Molecules", "#New_light_on_the_Enhancement_Units", "#Glimpse_onto_a_new_level_of_understanding", "#The_new_children-2", "#Give_your_year_a_good_start", "#The_power_of_Goodbye", "#Time_steps_on_the_accelerator", "#Birth_of_Mithra", "#Christmas_message_from_Christina_von_Dreien", "#Christmas_Meditation", "#New_year%E2%80%99s_message_from_Bashar", "#Ascension_part_5", "#Who_is_curtailing_our_knowledge", "#Where_is_the_Knowledge_come_from", "#The_meaning_of_our_life", "#Christina_von_Dreien", "#Ascension_part_4", "#The_High_Flying_Disc_%E2%80%93_the_most_difficult_discipline", "#The_context", "#The_most_difficult_exercise", "#Ascension_part_3", "#The_Example_of_the_fish_tank", "#The_example_of_the_Plasma_transfer_cup", "#The_example_of_the_meeting_in_Belgium", "#Together_we_are_much_stronger", "#Ascension_or_Termination", "#We_are_the_victims_of_our_own_laziness", "#Here_are_the_rituals_to_save_the_world", "#Collective_Concentration_on_the_current_world_situation", "#The_physics_of_balancing_the_personality_with_the_Soul", "#The_quantum_physics_experiment", "https://www.facebook.com/1078263118/videos/10200605511635081/", "https://www.facebook.com/groups/scienceofeden/permalink/869651910368659/", "https://www.youtube.com/watch?v=jcAnoo34KwQ&t=102s", "https://youtu.be/NHydngA5C4E", "https://www.facebook.com/FrankmerkabaChile/posts/6759713920766432", "https://youtu.be/LgzeKcOvPP4", "https://www.facebook.com/maxime.marteldalbertbister.7/posts/917909265767072?__cft__[0]=AZUYOvlu1ffcOm7LqVMH9G0X1RpYqnulfxVxPFENKPLaiPvN5DQs7yno6rMTSqdzBOgWzuFTBDF3reJr4U5Ny3vgi7-_RV2h5TI4Qzh-oRBhS85OlwQa_IqxkXqkmsCiu0pPzFUlChUCjITE-070Kh5h&__tn__=%2CO%2CP-R", "https://www.facebook.com/maxime.marteldalbertbister.7/posts/917909265767072?__cft__[0]=AZUYOvlu1ffcOm7LqVMH9G0X1RpYqnulfxVxPFENKPLaiPvN5DQs7yno6rMTSqdzBOgWzuFTBDF3reJr4U5Ny3vgi7-_RV2h5TI4Qzh-oRBhS85OlwQa_IqxkXqkmsCiu0pPzFUlChUCjITE-070Kh5h&__tn__=%2CO%2CP-R", "https://youtu.be/lu6Q8zK_Ew0", "https://www.prk-1u.com/concentrations-universelles/", "https://drive.google.com/file/d/19ErWofim_Y1jYi6WepTlzueWwW_eZ8d5/view?usp=sharing", "https://drive.google.com/file/d/19ErWofim_Y1jYi6WepTlzueWwW_eZ8d5/view?usp=sharing", "https://drive.google.com/file/d/19ErWofim_Y1jYi6WepTlzueWwW_eZ8d5/view?usp=sharing", "https://youtu.be/lu6Q8zK_Ew0"], "authors": [], "publish_date": null}