{"result_id": "363002", "URL": "https://plasma-laurentides.org/en/chemin-vers-lame-2/", "timestamp": "2023-04-25 18:23:45 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://plasma-laurentides.org/wp-content/uploads/2016/06/cropped-PL-logo-sm-1-32x32.jpg", "canonical": "https://plasma-laurentides.org/en/chemin-vers-lame-2/", "encoding": "UTF-8"}, "image": null, "domain": "plasma-laurentides.org", "title": "Path to the Soul 2 – Plasma Laurentides", "cleaned_text": "UC teaching by Birgit, Ucs german, #1 and #2 from 1Nation1Planet #140\n\nAll of us living on this wonderful planet earth, are connected to each other through our energy fields, the frequencies we send out through our energy centres or chakras. These fields create a network around the Earth which could be called Morphogenetic Fields. Morphogenetic fields have been discovered by Rupert Sheldrake; “morphogenetic” means “generating forms”; these fields generate all we see around us. These fields contain everything that any human being ever thought, felt, said, and did.\n\nEach of us is individually connected to the morphogenetic fields; we constantly contribute to them and we can also tap into them for information.\n\nIt is evident, as the morphogenetic fields are generated by our minds, they contain both constructive information, that help us evolve; but also unstructured information that hinders our process of growth.\n\nThe unstructured part of the morphogenetic fields are often hard to detect because they are unconscious. The unconsciously reproduced negative collective beliefs keep us trapped into some kind of hypnotic, deluded state.\n\nHow did we get into the trap?\n\nAt the moment of birth all is still fine as it is our Soul that has chosen to enjoy the earthly realms, initiates the birthing process. But as soon as we come in contact with our peers, parents and teachers etc do we internalize their beliefs, opinions and so on. Ordinarily even well meaning parents and teachers do not see children as extensions of the Creator, but small ignorant beings who need to be educated. This attitude does more harm than good. Their intentions are of course good but their lack of knowledge prevents them to provide a truly supportive environment conducive to the individual path of any child to get close to the Creator.\n\nNegative influences continue to be poured into the minds during adult life through institutions of society like, kindergarten, schools, universities, corporations etc. As these institutions are not based on love and enlightenment, they generally continue to impress collective belief systems on the individuals. These influences are aggravated by peer pressure and the “power of the media” with their glorification of sensationalism and distraction.\n\nHow to get out of the collective hypnosis?\n\nThe way out is the way in.\n\nOnly inside of us can we find the path that reminds us who we really and truly are: We are divine, light-full, beloved and complete Soul beings. What do we need to get there? Only our conscious decision. As soon as we have made this decision, our Soul will help us in any way to quickly reach there.\n\nLearn to live your own truth without fear.\n\nFeel free to do what you really want.\n\nLove yourself as you are.\n\nOn this path, how uncomfortable it may seem in the beginning, we will quickly see that we are never alone. In fact we will see that the very concept of loneliness is a misunderstood all-one-ness: we are a Soul and through our Soul we are one with the Soul of the Creator and also with all other Souls. We see now that we can only feel lonely if we don’t understand that.\n\nIt is our ego that is built and maintained by the belief systems; we could say that whenever we buy into the non-structured information, we create and maintain our ego. We could say that what we call “ego” is the unstructured part of our consciousness. As such it is habitually in misalignment with the Soul following so called “private” or personal interests.\n\nAs the Soul is on the fundamental level and the body on the matter level, the emotions make the bridge between them. The positive emotions are on the Soul side on the bridge and the negative emotions are on the material side. Emotions are one of the ways our Soul can communicate with us on the matter level. That is why we can use emotions as our GPS to know whether we are in alignment with the Soul or not.\n\nWe have the choice to live on the “bright side of life” being guided by our Soul fully trusting her and spending our days in taking care of what is good for all. Or we can also be led by negative emotions like fear, disappointment or anger to live on the “dark side” of the ego.\n\nSo with our internal GPS we can immediately detect whether we are dealing with constructive information or in the grip of non-constructive information.\n\nUnderstanding our Soul and the process of Creation\n\nIf we can find pleasure in structuring our mind and consciousness, in understanding who our Soul is and how the Universe works; the ego disappears because it has nothing to define itself against. The process of understanding lets us naturally grow out of the confinement of our ego!\n\nImagine your ego as a muscle packed impressive guardian in front of a door; behind the door lies paradise, peaceful, tranquil and for ever happy. The guard has been hired by you to not let anybody in – including yourself.\n\nNow that you are evolving and knowing that paradise is your true home, you approach the guard and say: “I wish to thank you for your services as the guard of this entrance. You did a good job. I now want to let you go because there is no need for a guard anymore; things have changed and the entrance to paradise is now free for all. I thank you again and wish you all the best.” Smile and see yourself pass though the gate.\n\nThe Universe is always loving\n\nThe Universe is always loving,\n\nalways ready to befriend you.\n\nYou are a child to it.\n\nIt is very gentle.\n\nIt is very careful, it is very caring.\n\nAnd if sometimes\n\nyou feel that existence is hard on you,\n\nyou must be fighting with it.\n\nOtherwise existence is always graceful;\n\nit is always motherly.\n\nSoul is a substance that was created by the Creator in the eternity of the world. The Soul is stable, unshakable, immutable, and inviolable. It is the origin and centre of every structure in the world. The Soul exists at the fundamental level. It is at the origin and centre of every structure in the world. The Soul exists on the fundamental plane.\n\nShe initiates the reproduction of the mind and, in collaboration with the mind, creates the body. The mind is the interface with which the Soul interacts with the physical reality.\n\nThe mind exists on the transition level (energy), its space is action through consciousness. The mind is the Soul in action; it can be compared to the hardware of a computer while the consciousness would be the software.\n\nIn the dual world, on the material level, the consciousness is bipolar; it has a structured part aligned with the Soul and an unstructured part controlled by collective belief systems. In our evolution, the mind is becoming more and more structured; and in this process the intensity of the inner light, the Bio-Signal increases.\n\nThis is the most important question. Since we are composed of a trinity – soul, mind and body – we can identify with all three or with one of them. At the beginning of our evolution we think we are the body; as we move forward, our identification changes to the mind and eventually to the Soul. Since we are fundamentally a living Soul, the other two identifications are illusory.\n\n So the concept of “going towards oneself” is similar to “going towards a maximum structuring of the mind” which is a process moving the mind closer to the Soul.\n\n The physical body is made of the condensed light from the mind following the desire of the Soul.\n\nConsciousness is a structure that allows the Soul to control the body. The Soul, whose material part is the body, interacts with reality through the structure of consciousness.\n\n But there is also an interaction between the body and its cells. This interaction is led by the consciousness as well, but this time it is the cellular consciousness. In the broadest sense, consciousness is a structure that combines spiritual matter and physical matter. By evolving consciousness, it is possible to transform the mind from a false master into a perfect servant; that enables us to control our reality and materialize events. Since the Soul is on the basis of everything, she is also eternally present in every event or element.\n\nIn other words, consciousness is the fundamental structure that allows the passage of spiritual light into physical events. In every event, there is still this light vibration coming from the Soul, but in its materialized form. Cellular consciousness allows the realization of the events of creation, maintenance and regulation of the physical body through a structured mind.\n\nThrough the development of human consciousness, through the structuring of the human consciousness, we can change reality for the better.\n\nAt the fundamental level, there is only love and light. It is essential to understand and integrate that any non-constructive emotion or any event considered negative is just a distortion of information caused by our unstructured consciousness. And these distortions are the aftermath of our past experiences which have not been integrated yet. They clog our optics, prevent the proper reception of the luminous information coming from our Soul, and add false information to the light of the mind emitted by our structured consciousness. This means that when we have done a great cleansing, a great normalization, there will be no more possible distortion of the information sent by the Soul to the consciousness.\n\nOnce our consciousness is completely normalized or structured, our mind will be a perfect servant to the Soul. Then we all will have one single perception: that all is perfect and eternal. Then there will be no place for sorrow, sadness and other nonconstructive emotions. There is just no more room for them because everything is full of love and light. And since there will be no more nonconstructive emotions in the future, everyone will realize that the presence of these emotions hinders personal evolution, hinders spiritual growth.\n\nGrief, discord, envy, hatred and other such emotions are elements of the world that is leaving. They actually begin to disappear with the beginning of the development of spirituality.\n\nLife, at the fundamental level, can only be joy and love. Evil does not exist, it is just a lack of knowledge and light that induces a wrong interpretation and perception of situations.\n\nWe have said our evolution as individuals as well as as a species, basically consists in structuring of man’s consciousness; in the wake of this process we will see radical changes in the structure of the world.\n\nThe more a person works on himself, develops and evolves spiritually, the more the structuring of his consciousness increases. The concentration of consciousness means an increase in the density of information, and the speed with which the volume of information is processed. The structuring of consciousness will have considerable consequences on our perception. Grigori Grabovoi\n\nWhen the luminosity of our consciousness increases, man becomes able to materialize his reality to the norm. The increase of luminosity is actually a shift from the material plane with all it’s limitations to the realm of the Soul where there are no limits. Therefore the effect of this on a larger scale, when at least a certain number of us, the power of that luminosity will be so great that it will affect all other beings and this will obviously change the face of the world radically for the better.\n\nIn this case we have an over-concentration of consciousness, which exponentially increases the rate of information exchange, resulting in completely different structures, structures of the highest consciousness, structures of the highest form of life. At this level, for example, a thought is instantaneously an action and an action is a thought. At this level, an object and an action, physical and spiritual, are the same thing. It is the radical change in the structure of the world that this principle is talking about. And a person can achieve this by structuring his own consciousness.\n\nWhen the consciousness is perfectly structured and connected to the Soul, and the optics of the consciousness are perfectly clean and aligned, then the light emitted by the Soul passes through the consciousness without being diminished, and then it can materialize immediately. We are talking about a moment that will come when we will just have to think of something constructive for this event to materialize in the moment. And so, if we can materialize everything, we will never lack anything again. If man realizes that he is abundant and has always been abundant, then violence will no longer have any reason to exist. Peace will be a fact.\n\nThis of course will have direct effects on the state our body is in: a perfectly structured mind is in perfect alignment with the Soul and can only create a perfectly healthy, eternally young body.\n\nSeeing the Universe as the Creator\n\nThis article is based on a 31-day meditation by Hélène Laporte.\n\nWe have learned that the entire universe is within our Soul because it has been created as a co-creation by the Creator and us. So in order to be able to travel the universe through our Soul, we need to expand our mind or consciousness so that it encompasses the entire universe. In everyday consciousness, we habitually direct our focus on one thing at a time only. For example, we read an article on Facebook; especially if the article captures our interest, we are no longer conscious of our body or our environment. Our attention is very limited in this sense.\n\nThis article wants to propose a technique how we can expand our attention or consciousness so that it grows to eventually encompass the entire universe. Once we have reached this degree of structuring of our mind, we could travel to any place in the same instant, but we could also materialize what we want or normalize any event that we find not perfect.\n\nWith every action we take in harmony with the universe, we make the world evolve. We make it more complex, more complete. As we structure our mind, we take back our place as co-creator and we move towards eternity. These notions will become closer and closer to us as we evolve. For the moment, they may be part of the remote areas of our consciousness, but they will come closer with time.\n\nTry to keep the consciousness of your whole body throughout the whole exercise, if you can.\n• Generate a state of relaxation and active attention. \n\n If you have experience int this, you can whatever technique suits you best. What we propose here is one way among others:\n\n I now invite you to yourself and do what is right and good to relax. Yawn, stretch. Connect to your breath. Feel the air coming and going in your nostrils and lungs. Feel your heart beating, feel the blood flow throughout your body. Perceive your body in one pulse. Feel your feet, your legs but also your trunk, your head, your upper limbs. Connect to your entire body. Balance your emotional and energetic state with your intention. Deepen your body’s state of comfort.\n• Feel the awareness of the Creator.\n\n Feel your Soul as a bright golden light and expand this light to encompass your entire body an aura. Then expand the light of your Soul until it encompasses all the elements that exist in the room you are in. \n\n Even if you do not perceive them all in detail, you feel that there are objects all around you. And you can feel them in some way, feel their presence, while your consciousness gets broader.\n• Emission of a spiritual impulse. \n\n Now that your consciousness encompasses all the elements in the room, prepare to emit a spiritual impulse from the of your Soul. It is as if you are sending the light of your Soul to all the elements of this room at the same time.\n\n Hold this image \n\n Our mind will then spread throughout the room and interact with all the elements in the room, and with time and practice, we will be able to get information about each object.\n\n We can obtain a wide variety of information. It can be information about the function of that object, its potential, its history, it’s purpose etc.\n\n In the initial stage of your practice, you may only get a partial perception of the elements, maybe only the perception of their existence. Don’t worry. Your goal is to get a complete perception of your entire environment, which you will only get after some time of practice.\n\nThus, you will be able to apprehend each object, you will be able to access all the information necessary for a perfect management of events. Once you are able to grasp all the elements that are in the room you are in, you will broaden the radius of your perception; the process will be completed when you are able to encompass all of creation, like the Creator.\n\nUsing this method, the more objects you can grasp simultaneously, the more you will be able to take control of information sources. Here is a concrete example of a computer. Through a single glance, you will have integrated its functioning, its use and what it can do for you. This method of contemplation allows you to capture any information from any object; then also the coordinates of all the places in the universe. The access to information is done in a logical, direct way, on a spiritual basis.\n\n It should not be forgotten that the interaction between your Soul and the Soul of another element is always reciprocal. That is to say, as much as you can glean information or energy, as much as you can send information or energy.\n\nWatch your thoughts, as well as your words and actions.\n\nBe present in the hear and now, but be also be present everywhere at once, wherever you are. Fill the space like the creators you are.\n\nWe are talking about the presence of our mind everywhere, in all spaces and in all times. Because we have always been the co-creators of the Universe, we remain linked to everything individually. That is, the connection is already there, we don’t need to make it – we just need to see or feel it. Like the plasma field lines we see in the frozen GaNS experiments.\n\nIt is important to know that this infinite expanded consciousness is part of our being, our Soul lives there forever; it is the cause of her omniscience. In our perfect origins, by being created in His Image, we were already quite capable of doing so, but we forgot… so now we only have to remember!\n\nThe Structure of the Universe\n\nWhat we call “reality” is the world we perceive inside and outside of us. The reality we perceive is the mirror of our trinity. Just like we are made of the trinity: Soul, mind and body ,our reality appears in three levels: the matter level, the energy level and the fundamental level. Here is a table of the parallels:\n• The physical level of reality that we can perceive with our 5 senses and apprehend with our physical body.\n• The intermediate or energetic level of reality is perceives at a more subtle level. It contains our thoughts, our emotions but also all the energetic creations of the collective consciousness and the individual consciousness of human beings. It is the level of action of consciousness. Everything in the intermediate level of reality is a projection, a creation of consciousness and has some existence in consciousness, at the energetic level of reality, but does not exist at the fundamental level. One could say that there is the Great Story and the small Story. The small story is created by the collective consciousness and by the individual consciousness of human beings to experience reality.\n• And the fundamental level of reality or informational field, cannot be perceived by the ordinary (monkey-) mind. Only the structured part of our consciousness or mind can perceive it. This level contains only information, plasma which has no tangibility at all. Everything that exists on the physical level has it’s perfect and eternal original prototype on the fundamental level. Everything on the physical level is the material copy of the original on the fundamental level. Everything existing on the fundamental level is pure information of the norm, pure unconditional love. In the fundamental level of reality, only the Creator and human Souls exist and act.\n\nThe evolution of human beings on the individual level as well as on the level of Humanity as a species reflects the same trinity: most of us start on the duality, go through a process of normalization to finally reach Unity with the Creator and everything else.\n\nThe purpose of us, human beings on Earth is to co-create splendid worlds of love together with the Creator. To be able to consciously co-create, we have to be on the same level as the Creator, the fundamental level. But for now, we are at the beginning of our evolution, one could say we are apprentice magicians.\n\nHuman evolution, if we speak in terms of linear time, could be perceived in three phases:\n• Duality, the phase of physical experience and experimentation. As human beings we are eternal, we (re-)incarnates many times in a human physical body, to evolve in our understanding of how the universe works. In the phase of duality, we chose to understand and experiment with our divine qualities, our light, through the perception of the shadow, or the absence of them.\n\n We experience absence, suffering, lack, separation, old age sickness and death in order to understand, feel and integrate the concepts of unity, abundance, health, joy, love, perfection, eternity and harmony.\n\n The phase of duality is like a learning phase for the human being where he gradually understands who he is and how he functions. But with every dual experience he makes, he also can accumulate limiting beliefs, wounds, fears, conditioning and judgments. In order not to be trapped in belief systems, we should rather understand that negative experiences are only presented to us to sharpen and refine our wishes and to hone our mind to be more structured.\n• The phase of normalization. In this phase we remember or discover our powers and potentials; and we understand that they are in the realm of our Soul. So this phase really is the transition to the Soul. It is as if we are digesting all the experiences, we make in the world of duality to keep only the wisdom and the light.\n\n This is the work we all have to do and it is through this work of personal development that our mind will connect more and more with our Soul.\n\n Imagine veils between your Soul and your mind; the Soul can see through them but the mind cannot. These veils correspond to our wounds and limitations. These veils prevent our mind from correctly perceiving the messages of our Soul and from having access to all the universal knowledge that sits at the fundamental level of reality.\n\n Each time we free ourselves from a limitation, a veil falls, we make a mini quantum leap, i.e. our consciousness rises a notch. With each quantum leap, we change our position. We have access to more information from the field of universal knowledge, which we can perceive through flashes of clarity or a better understanding of what is happening to us in life, as if we have gained height and have a better understanding of divine purposes. With each quantum leap, our consciousness is a little more connected to our Soul and as a result, our thoughts, words and actions are more aligned than before.\n\n But in this phase we also discover or remember more and more the infinite capabilities and powers that become available to us as we approach more and more our Soul. In this phase we discover and remember how to normalize reality, which is how to change events to be perfect for All. And we learn to materialize what is good for All.\n\n This normalization of consciousness is natural and begins to occur from the moment we become aware of these processes and wish to evolve. Of course, it will be much faster if we implement technologies to accompany it, like techniques to structure the mind and understanding how to materialize our wishes, how we create our reality\n• The third phase comes the moment when we realize eternity, when we realize our Oneness with the Creator. This is the moment when we will begin to take our rightful place at the side of the Creator in order to co-create splendid and joyful worlds.\n\nThese three phases do not really follow each other clearly in life. When we enter a process of evolution, our consciousness moves back and forth between the duality phase and the unity phase. We may reach states of temporary transcendence and then feel as if we are falling back into duality with full force.\n\nWe can call our arrival at the fundamental level Illumination; it means that we will have stabilized our state of consciousness in the phase of unity. In the meantime, it is perfectly normal to feel ourselves in very different levels of consciousness from one moment to the next in our lives.\n\nWhen we talk about “entities” we mean living beings that not really have a physical body; they seem to live on the energy level of reality.\n\nHave you ever walked in the countryside of India at sunset? And suddenly you stopped in your tracks because you felt like you saw a snake on the floor? Then, once the fear passed and the light was on, you realize that it was only a rope? Well, it’s the same thing. When we are in a slightly less luminous place, our consciousness, individually or collectively, can create energetic entities that can really make us feel like we really exist. And this often happens on the matter level.\n\nBut on a fundamental level, all this does not exist because everything is at the norm. Anything that’s not perfect can only be part of the Little Story and we need to normalize it. If we are capable of creating these inconveniences, whatever they may be, we are just as capable of normalizing them, making them perfect.\n\nFurther down the rabbit hole: if we are here to learn and we are the ones creating our reality, then it’s us who have created them in order to learn. To learn what? To learn that on the matter level we cannot be sure about anything; and on the fundamental level nothing can harm us; so this lesson can generate the wish in us to live more on the fundamental level, close to our Soul.\n\nOn the fundamental level of reality, there is only the Creator and all that he has created is created in his image -exactly like us. This means that any energetic presence that does not have a soul and a humanoid form (in the earthly environment) does not exist at the fundamental level of reality. Entities that have a soul and a humanoid form are terrestrial human beings (or having lived on Earth at one time) and non-terrestrial beings living in other corners of the universe. All beings are created by the Creator in co-creation with us. As creations of the Creator, all beings are in his image and they, in their turn, will create through their collective and individual consciousness, all kinds of entities on the energy level of reality. These entities are creations of our mind with different objectives: constructive or non-constructive.\n\nAs they do not exist on the fundamental level but on the energetic level of reality, they sometimes can be felt in the physical world. These entities can be of a constructive or non-constructive nature, i.e. help us to rise or rather have a tendency to slow us down in our evolution.\n\nAs far as constructive energy entities are concerned, they will serve as intermediaries to connect us to the Creator, as long as we are not yet able to do so directly through our Soul. That is, until we understand that we ourselves are divine co-creators and that we have the same abilities as the Creator, we create helpers on the way, since we think we are not up to the task. But when we learn to connect with our Soul, those intermediaries disappear.\n\nI am talking about angels and most of the presences you can feel. And just because you can visualize them, energetically perceive them, and even touch them sometimes, does not mean that they are not energetic creations of your consciousness. Any object in our reality is also a creation of our consciousness, such as this table or this pen, for example, and you can touch them too.\n\nAs for non-constructive presences or entities, they are also the result of the creation of our collective or individual consciousness and they rather allow us to find culprits outside of us. For example, if we are angry or afraid, these emotions come from our wounds that have not been normalized in our unstructured mind. We would therefore simply need to normalize our mind so that we don’t feel them anymore.\n\nBut our unstructured mind can create this energetic entity just to justify his fear and thus divert it and prevent us from treating it. Instead of normalizing the wounds responsible for our fear, we will go to an exorcist and ask him to neutralize the energetic entity that is pursuing us. This entity may be felt as very real, in the sense that we really created it, but it does not exist at the fundamental level and when we realize that it does not exist at the fundamental level, it usually looses it’s power to appear on the energy and physical level – and it disappears.\n\nWhen you reach a certain level of evolution, you no longer have that kind of problem because your vibration is far above that kind of creation. This means that you are no longer sensitive to these entities generated by the collective consciousness.\n\nOn the fundamental level of reality, evil does not exist, it appears as a result of our lack of understanding or light.\n\nWhat makes us suffer is not the experience that we live but our interpretation of it, our perception of things. And the way we perceive things or react to them is largely due to our beliefs and our conditioning. Suffering is fundamentally not part of life. No one is guilty of anything; only responsible, yes.\n\nAs all the universes thrive inside the Universal Principle, there cannot be evil in reality only in our conceptual mind, miseducated by experiencing challenging situations with a lack of understanding. We could say that evil is just a faulty communication between the Creator and us, a misinterpretation of his messages. It’s like our computer or cellphone is lacking bandwidth and we only get half the information or nothing at all.\n\nWhen we don’t understand something, we perceive it wrongly and we get confused. It is the lack of knowledge that creates the nonconstructive events and entities. Sometimes we lose the connection with the Creator and then we create a reality for ourselves that is not perfect, not normal – not how it should be. It lacks love and light. To be more precise, the structured part of our mind creates the perfect reality at the Norm; and our not yet structured mind adds misinformation to it.\n\nThe line of Connection belongs to the knowledge of the Universal Community. The Line of Connection (LoC) is the link between our Soul and the soul of the physicality (mind). This connection only exists on the fundamental, plasma level. Have you ever thought about it? Thoughts are not material; they have no dimension or can be measured neither in terms of space nor time. This means that thoughts are not part of the matter level but of fundamental level; and it is via our thoughts that we can make or influence the LoC.\n\nIn the UMEU we can connect our thoughts to the central sun of the unit and our wish for a particular material will make the unit produce it. The wish needs to be coming out of love to be powerful enough to make it work. “Love is the only connection between the Soul and the soul of the physicality. You have to be able to link up with your Soul and use her connection to the matter state to materialize what you wish for.\n\n Mankind has to learn to be still and listen to the vibration of his Soul; each one on his own. Many people tell me that they don’t see their Soul. You have to understand that the Soul has no tangibility – she can only manifest herself on the emotional level. It’s the emotions that create whatever you may wish for: the frock on your shoulders, the metal in your hands and the shoes on your feet.\n\nThe love between a man and a woman leads to the creation of a child; the love between the Soul and the soul of physicality leads to the creation of what we wish for.\n\nThese (UEU) units are not here to demonstrate flight or to create matter; they are given to you to enlighten the man to know how the Soul can use the physical condition to create what she needs.\n\nSo you have to understand how the universe works, how the Creator works – and then you have to participate in it!\n\nYou might get enlightened in the coming times and you wouldn’t know why and where it came from – now you know. It is a very interesting time we are living in.” M. Keshe\n\nThis video has been made by the Brazilian team; you can watch it here . It shows the soul inside the brain and how the Soul takes over the physicality.\n\nThis is a very short video but those who really understand what it shows, know the way now to become absolute unattainable, you could even say invisible to the agents of the NewWorldOrder. A fact which makes them completely powerless in front of you: no PCR test, no vaccine, no confinement, no enslavement, no micro-chip implants, no control, no taxes, no police, no military no judges. We are at an arms length from being able to tap in and use our unlimited powers!\n\n Interested? Read on!\n\nWhen we talk about our connection to the Soul and we have understood that “our Soul” and the Soul of the Creator are ONE, I believe that exploring more deeply our “relationship” with the Creator could be beneficial to have more clarity on how we can approach our Soul in order to remember all of our birth rights and powers….\n\nIn the beginning is the Creator. He could be called “God,” but without any religious connotation; he could also be called “the Collective Soul”. We could imagine him as an extremely evolved human being, who will never stop evolving, because he is perpetual evolution, like all of us. The Creator has a Soul, a mind, and a physical body. The Creator is the source, the whole, it is infinite, and we are one with it. The Creator recreates Himself and the entire universe 1017 times per second.\n\nHis Soul creates and recreates at every moment, the incarnated and non-incarnated human Souls. And it is the human Souls, who, in co-creation with the Creator, create all living beings.\n\nOne cannot understand the above paragraphs on the material level; for the Creator and our Soul dwell on the fundamental level, the Soul level or in non-duality or unity. On this plane there is neither time nor space, for both belong to the plane of duality.\n\nThe Creator, present within us, wants very much to act through us in each of our actions. However he grants us every freedom – even to refuse to be His hands. For we are created in His image, He has given us the gift of all that we possess. He is closer to us than our own nose; deep down we are him. He is our beloved and he loves us. If we reach out our hand to him, we will create as he creates. Only His Co-Creation is capable of co-creating Creators. If we are in harmony with Him, everything we want to change can be changed at any time; everything we want to create, we can create where we are and at any time.\n\nThe Creator and creation are ONE. The Creator recreates the whole of creation in all its infinity at every moment.\n\nWhen we connect to the infinity of space, we can feel that nothing has an end, neither space nor time. When we connect to the infinite and therefore to the fundamental structure of the universe that has neither beginning nor end, we leave duality, we leave the concepts of collective consciousness that speak to us of old age, disease, death and that everything has a beginning and an end.\n\nWe then enter a world that no longer responds to the usual physical laws, and in which we can evolve eternally. As our mind is structured, the field strength of all the cells of our body will increase, the matter of our organism itself will change and we will pass into another dimension in a way. This does not mean that we disappear. We will have to open our consciousness to understand that we don’t have to choose between a vibratory (Soul) and a physical version of ourselves. Just like the photon and the atom, we can exist in two simultaneous quantum states, one vibratory state and at the same time remain in our current physical body, which can live forever. We will learn to harmonize all the events of our life, we will learn to create any event by the power of our creative thinking, we will help the world to develop by our own development. We will evolve indefinitely and perpetually in love, joy, and harmony – when we see the world as the Creator sees it.\n\nFor the same reasons, the kingdom of God is not a particular space, but rather a state of consciousness that we reach when we turn to our Soul and finally understand who we really are: divine co-creators. In order to be able to do this work of structuring our consciousness, it is obvious that we must be freed from all the material contingencies of life. We must be healthy, live in joy, harmony and abundance at all levels. Then we can focus on our evolution and the structuring of our consciousness, without worrying about anything material. When we know how to generate this well-being and abundance in our lives, it is our responsibility to transmit this knowledge to all, so that the whole of Humanity can access their full spiritual potential.\n\nWhen we are at the beginning of our evolutionary process, we are very self-centred; as if we exist in our own world, separated from that of others. Then, when our consciousness is a little more structured, we begin to open up to others, to interact deeply with other human beings and with their respective worlds. This is only possible if our consciousness expands.\n\nBut the expansion of our consciousness is not a cognitive or intellectual process, but an emotional one. This process is not possible through the accumulation of knowledge; only through understanding. By accumulating knowledge, our personality, our “self” does not change; on the other hand each understanding changes us, we are no longer the same person before and after the understanding. Understanding happens in the heart and in our guts; we have to life it. Vice versa: if we don’t see us changing, we have not understood but just cognized intellectually.\n\nIn the beginning, our consciousness is like a wetsuit, a thin layer only comprising our physical body. That is to say, what we call “me” at that phase, is only our body-mind system. But as we evolve, the boundaries of our “self” will broaden and we will gradually include more and more “other’’ entities in in what we call “me”, until it includes the infinity of all the worlds. When we become aware that we are not separated from the world but are part of it, the process of structuring our consciousness accelerates and we have access to the eternity of the world.\n\nWe need to participate in the world, we need to join your Earth and unite with it in the process leading to its restoration: what do we perceive? What have been the consequences of our actions on our Earth?\n\nI f we want to be closer to the Creator, we need to go where He is. We are only able to unite with the Creator where He is, where His spirit reigns – in the Universal Principle at the fundamental level of reality. His abode is the deepest point within us; so the only way to get to Him is diving to the most profound level within ourselves; that’s where our Soul dwells as well. Only the development of our spirit, of your consciousness can bring us there: structuring our mind in love.\n\nWhen we lift the veils that our beliefs and limitations of the material plane have placed on the perfect version of reality of the Creator, then we’ll see ourselves, humans, and also all living beings, and the planet itself, in their perfection. It’s the ability to see perfection that enables us to create perfection and to restore any element to it’s original perfection.\n\nTo meet the Creator where He is, we need to see the world through the highest function of our mind, from the highest point of our consciousness, from the depths of our Soul, and with the burning desire for a world of abundance for all.\n\nHere are a few pointers to help us stay on track:\n• The Path of the Wish\n\n When we look at any element or event of our world, we see how we have created it; and if it doesn’t feel perfect, we can recreate it from scratch by making a wish. Our wish will change its state, eliminate its shortcomings. Our wish is focusing on creation so that everything can be restored to it’s true existence: a harmonious, joyful and eternal existence. We take also care to never allow anything to deviate us from our divine work.\n• Understanding our perception\n\n In the course of our work, we will realize that all the failures and defects that appear are neither failures nor defects, but simply the consequences of our ignorance of the universal law. If we understand this, we are already one step closer to the Creator. We stop denying the obvious and abandon our outdated beliefs forever. We see the truth appear and realize that the world has changed as we have changed.\n\n If you don’t understand this, watch Geshe Michael Roach’s example of the blue pen following this link .\n• See the Creator in everything\n\n Become aware of the presence of the Creator in all things, of the pulsation of truth in all things. Pick any object in your environment; take your time; just be present to it and wait what it will transmit. Through it the Creator speaks to you.\n• Become a Participant\n\n See your world not as something separate from you, but become aware that the universe belongs to you, that you are welcome in it. Realize the union between every thing and every being and you. This union is your Soul. Look at it and you will see the light appear; this light is a call from your Soul upwards, towards ascension, towards peace.\n• See through the eyes of the Creator\n\n Observe the world through the clear gaze of your Soul. Go to meet yourself, deep within yourself, deep within everything, discover your unity with the Earth and with the universe.\n\n Become aware that what connects you to everything has existed from time immemorial. Become aware that your concerns are directed towards your planet, that your desire is merged with his, and feel the peace that comes from this teaching.\n• Act boldly and do not apologize. Don’t explain yourself too much. When you explain yourself – look if you’re actually apologizing for your shortcomings, hoping the listener will be nice and forgive you.\n• I never get angry with anyone. No one can be so important as to oblige my reaction.\n• We must always remember that the road is just a road. If you walk with pleasure, then this is your path. But if you feel you shouldn’t walk on it, leave it.\n• If you don’t like what you receive, change what you give.\n• The main obstacle for most people is internal chatter. When one learns to stop it, anything becomes possible; the most incredible projects become feasible.\n• Realize that you can throw anything out of your life at any moment.\n• We need all our time and all our energy to overcome the idiocy within ourselves.\n\nThey brought balloons to a school. One was given to every student, who had to inflate it, write their name on it and throw it in the hallway.The professors then mixed all the balloons.\n\nThe students were given 5 minutes to find their own balloon. Despite a hectic search, no one found their balloon.\n\nAt that point the professors told the students to take the first balloon that they found and hand it to the person whose name was written on it. Within 5 minutes everyone had their own balloon.\n\nThe professors said to the students: ′′These balloons are like happiness. You will never find it if everyone is looking for their own. But if we care about other people’s happiness… we’ll find ours too.”\n\n“You have to elevate the Soul of physicality to become humble enough to have access to the Soul of Man. Now you have to find out how! These units and the teachings from now on will show you the way. It’s like learning to get from one place to another, say from Paris to Linz; after you have done it once you can always go, because you know the way. Once you understood you have to practice!” M. Keshe\n\nIf we are conscious about it or not, we have chosen this incarnation to participate in the evolution of the universes in co-creation with the Creator. The driving force of this evolution is pleasure for all; the same pleasure is also the driving force for us. When we experience an event which is not what it could be, immediately a wish, or a rocket of desire is fired. Our wishes evolve in parallel with the evolution of the Universe: the more we are engaged in the co-creation of the evolutionary process, the more refined become our wishes.\n\nLiving in a physical 3D world, our main tool in this evolutionary process is our body. The latter is created and maintained by the Soul with the help of the soul of the physicality (mind). The mind acts as a filter to attenuate the fields of the Soul to a level where they can become matter. The mind gives form to the body within the range of possibilities dictated by the environment. The body is the host of our fundamental structures, Soul and mind, in this material world.\n\nThe will of the Soul is the Universal Principle: the best for All. The will of the mind is ideally the same as the one of the Soul. But in the present reality, the mind often follows its own paths without much regard for the Soul or the body. We call the mind “ego” when it is behaving in this fashion.\n\nThe body is the only part of the Trinity that has no will of its own. Because of this it is often the battlefield between the Soul and the mind. We have all experienced this in our illnesses or accidents.\n\nWe can compare the link between the Soul and the body to a rubber band; if the mind moves aligned with the Soul, the rubber band is relaxed and the more the mind resists the more it creates tension in the rubber band. And the tension can rise to the point where the rubber band can no longer support it and breaks. At that moment the existence of the body can no longer be maintained and it “dies”. When Mr. Keshe evokes that the body is a leech of the Soul; the real culprit is the mind.\n\nThe physical body is a fundamental structure of the human being. It is not just a vehicle, or even worse: an ensemble of imperfections and a source of sin, as many religions would have us believe. The body actually is the reflection of the Soul, its extension manifested in matter. If the mind allows the undistorted reflection of the Soul in the body, the latter is eternally perfect. And as a reflection of the Soul it therefore also contains all knowledge. It is through this capacity that the body is quite capable of treating all illnesses itself – if the mind does not intervene, if the mind can get out of the way.\n\nIt is through the physical body that our Soul can interact with all the elements of reality. Our physical body emits vibrations. Often we can feel a person we meet for the first time just by absorbing her vibrations; and the person can feel us. Our vibrations lead to immediate interactions with other living beings. But through the same vibrations we also have an influence on our environment. We can harmonize our whole environment with our vibrations – or not.\n\nAccording to the Plasma Sciences we can imagine our Soul as a sphere, within which the soul of the physicality (mind) is located. When the Soul desires to use a physical body, it projects the soul of the physicality outside the sphere as a protuberance; and when the Soul wants to suspend the physical form, either voluntarily or by death, it withdraws the soul of physicality once again within the sphere.\n\nWhile the mind is inside the Soul sphere, it can be imagined as dormant or suspended. Within the sphere there is no challenge: no personality or ego; because these two states (illusions) are related to life in 3D. The challenge occurs when the soul of the physical form is projected outside the Soul sphere. One could therefore deduce that the mind will evolve faster when it is incarnated. It is in our physical body that all our fundamental structures interact.\n\nOne of the functions of the mind, the attention, has a lot of weight in our project to bring the mind closer to the Soul and this in two directions. First we remember that the Soul cannot leave the Universal Principle; therefore our attention must be closely linked to the Universal Principle if we want to see an effect in the manifestation. Without the connection with the Soul, the mind remains powerless (although it has a tendency to believe otherwise).\n\nThe evolution of the Universe is managed by the Universal Principle, which says that the sole purpose of Everything is homeostasis or equilibrium of the totality. That is to say that all the actions of all beings in all universes all go in the same direction: to maintain the happy balance of the Whole. We are part of the Whole. So if our actions are in line with the Universal Principle, our individual needs are being taken care of automatically at the same time as we take care of the well-being of the Whole, simply because we are part of the Whole.\n\nThe second concerns the aspect of the Universal Principle that manages the link between us and the material world; this aspect is called the Law of Attraction. This Law will manifest everything to which we direct our attention. The manifestations will always go in parallel with the coherence of our mind: if we have a “monkey mind” (mind like a monkey jumping from one subject to another) and little ability to maintain our attention on a single chosen subject – the manifestations will mirror this state of affairs, a potpourri of disparate manifestations. That’s what most of us see every day, isn’t it?\n\nIf our actions follow the whims of the mind, or personal desires without considering our integration and responsibility in the larger context, our wishes are powerless and our actions confused. We act in the direction of death. On the other hand, the more our actions are fuelled by the wishes of our Soul, which lives exclusively in the Universal Principle, the more powerful and capable our wishes are of materializing. At that moment we act in the direction of Life.\n\nFollowing this line of thought even further, we can see that the body is the materialization of all our fundamental structures, the materialization of the interaction between our mind and our Soul. Then the state of our body mirrors the state of our structures and the state of their interactions.\n\nAs long as we remain fragmented in the sense that we have no contact with the Soul or we are not in contact with our body, our contacts with the elements of the universe and the Creator remain random and unconscious. One could even say unreal.\n\nThe moment we are in direct contact with all our structures simultaneously; that is, when our Soul, mind and body trinity are balanced, we return to our true essence, to that fact that we are created “in His image”. At this moment we return to our role as co-creators of the universe. At this moment we can come into contact with any element of the universe, and we will be in control, fully capable of harmonizing it or materializing our wishes entirely and immediately.\n\nThe means of the body to make contact with the elements of the universe is love; it immediately spreads to the object of our attention. Just look at a person with love and his or her condition will improve in the direction of harmonization. Love is an extremely powerful instrument of harmonization, because it unifies and equalizes.\n\nAnd that’s why it is difficult to evolve on one’s own. Love is the most powerful agent of universal communication; the images or emotions conveyed are much more powerful if they are infused with love!\n\nFinally we would like to stress the fact that bringing our mind closer to our Soul requires no effort on our part; there is no path to travel, there is no goal to reach: the only thing we can do is to let the Soul guide our life in love and abundance and for that we only have to transfer the staff of control from the mind to Her. And this happens when we regain the state of trust that a little girl has towards her mother who loves her.\n\nHave you ever seen night going?\n\nThe midnight and its song?\n\nWe are behaving almost like blind people.\n\nIn such a beautiful world we are living in small ponds of our own misery.\n\nOtherwise there is no much joy all around.\n\nWe have just to be aware of it and to become a participant, not a spectator.\n\nParticipate in the night leaving, participate in the evening coming.\n\nParticipate in the stars and the participate in the clouds.\n\nMake participation your lifestyle and the whole existence becomes such a joy, such an ecstasy.\n\nYou could not have dreamt of a better universe.\n\nAstronauts are trained for their voyage even when it only goes into the not-so-deep space with outdated rockets. As the KF prepares to take the whole of Humanity into space, M. Keshe has started the series of teachings that will prepare us to travel into deep space in the spaceship called “Soul”.\n\n\n\n How we can travel Space with the Soul can be explained by the structure of light: physics teach us that light can can appear as particles (photons) or waves, material or energy. So we live as particles on the matter level, then we can travel as waves or energy and then “re-incarnate” as particles on the matter level again.\n\nThe same happens in our MaGravs when we transmute voltage (matter potential) into current (speed) and vice versa; transportation into transmutation and vice versa. Physicality is determined by potential differences (voltage) and speed is determined by current.\n\nAll this is based on the plasma principle that the stronger is always feeding the weaker. This is the reason why we see the sun and all other lights of the universe. The sun in the eye of the man is similar but weaker; so when the man feeds the sun by his attention, he raises it’s energy so it can become a visible reality. A light may be billions of kilometres away, yet it will manifest at the same moment in our eyes as it appears on the surface of the star. To see the light of a star doesn’t take thousands of light years – it is instantaneous. It’s the interaction of our heartbeat with the heartbeat of the star – that does the trick.\n\nThe elements in the Universes have different strengths according to their positioning. If we see a far away galaxy or a closer star, depends on our choice of field strength. Strength in this context means speed of thought. At the highest speed of thought, the strength of the thoughts of the Creator, we will see the whole Unicos at once.\n\nW hat we see doesn’t depend on the strength of the light emitted by an object in space; what we see depends on the choice of strength from our side; we choose what we see. When we can manage a certain strength we can see the corresponding element or destination in the universe and go there at the same time. The speed of thought is of course a function of the structuredness of our mind. An uncontrolled monkey mind who dreams that he is in control, will only give us a slow field strength, whereas a well structured mind will let us see the infinite universe at one glance.\n\nSo there is no need for a spaceship neither for directions to reach certain goals in space, if we manage to get the plasma fields in our body to that particular strength. And this ability to play with the whole range of field strengths can be reached when we have raised the speed of our thought to that of the creator. When we are able to “see” a destination, and we love to be there, that is the trajectory, which will take us there.\n\nWhenever we “see” something, we have received it’s energy or light and we have already confirmed it’s existence back to it. “We create the condition of the fields within the structure of the brain of the man and with it we can instantaneously travel across the Universe.” M. Keshe\n\nThe present structure of our body and our mind does not allow the openness required to raise the speed of thought to the extend required. To change this may require a new generation of human beings being born. At the same time the atmosphere of the planet, the environment, will change to allow the new structure. The motto for this new development is “Be calm and kind. Be calm to receive the new knowledge and be kind to become a giver.”\n\nA new mixture of GaNS will be released to facilitate the arrival of the new conditions. The Austrian team has been commissioned to start the production. With these new GaNS the exhibition centre in Linz will become a Dome of Light ; and it will be able to be seen from all corners of the planet Earth.\n\nThe world is the whole of everything that exists; it is infinite. The space in which we live encompasses an infinite number of universes and galaxies – all of them cocreated by the Creator and Man.\n\nWe all live in the same world to which we give our own colours. Imagine a giant puzzle. Everyone sees a different piece of the puzzle and sees it with their own pair of glasses, deformed or not, depending on their conditioning and injuries. For two people, the perception of the same event or element will not be the same and may even appear radically different. But the original prototype of the world and of each element is the same for all of us.\n\nThe part of our mind that is not yet structured adds selective filters to our perception of our world. And we will take away these filters, one after another, as we evolve. So what we perceive of the world evolves according to our own transformations.\n\nBy observing the world, we in reality listening to ourselves. The outer world is a reflection of our own inner world. We can take a big step forward when we realize that the world is not hostile and that it is on the contrary an extension of ourself, which supports us in our evolution.\n\nWhen we accept to listen to ourselves and to the world, we begin to hear the voice of the one who created it with us. We can perceive the creator both as an infinite vibration, but also in a more personified way, as a big brother much more evolved than us, who can pull us up and advise us. Connecting with the Creator helps us to broaden our perception and vision of the world and ourselves.\n\nWe are interconnected with everything\n\nWhen we perceive all things as conscious parts of ourselves, then we perceive the harmony that emanates from creation.\n\nThis meditation helps us to comprehend the concept that is both very simple and not easy to understand, the concept of unity. The creator has created the whole of what is, in an impulse of love, and he recreates it at every moment. And this whole is like a giant organism that is alive. We, as everything else inside it, are interconnected.\n\nMoreover, the universe is holographic. This means that we are both a piece of the puzzle and the whole puzzle; both a leaf of the tree and the whole tree; both unique and ONE.\n\nWe have learned that all the souls are made in the image of the Creator. They have the same qualities, powers and possibilities. But that doesn’t mean they are all the same as puppets from an assembly line.\n\nJust like human beings are born with the same qualities, powers and possibilities, but each one comes in different shape, has different talents and realizes his possibilities differently.\n\nThe similarity of all the Souls is the reason why they can interact; and the individuality is responsible for the fact that each one finds a different and unique position in respect to all the others. The uniqueness of each Soul makes the creation so complex, beautiful and colourful!\n\nThe image shows GaNS in a container of frozen water; it shows clearly the plasma fields in the matter state. The white circles show the tiny white field lines that connect the entity to other entities. It shows how our Soul is connected with everything else in the universe. And these connections are permanent in the sense that their dedication to the linked entity remains through all the repositioning that take place in our dynamic universes: one connects us to our mother, another to the Pleiades, another to our wife, each of our children, the oak tree in front of our house, the sun, a creature in another universe… We can understand that this is a crude representation, as on the plasma level each entity is interconnected (with both a magnetic and gravitational link) with all the other existing entities; this means that the number of connection is of course unlimited.\n\nThe blue circle shows the stable lines, that have already found and confirmed their positioning; these are the field lines connecting the entity to the planet earth.\n\nWe are part of the universal organism and\n\nWe are independent at the same time.\n\nIn order to understand this, we need to remember that reality appears on two levels: the fundamental level (energy, plasma) and the physical level (matter).\n\nAt the fundamental level, nothing has form; at this level, we are energy, ONE. We are a plasma that is connected to each of the elements of the world which all together form the Universal Plasma. As we are connected to all other elements, we have access to all information within the Universe via our connectedness.\n\nUnder the right conditions a plasma will condense into matter. Quantum physicists have discovered the two quantum states of matter: each element oscillates 1017x/sec between the wave state (plasma, energy) and the particle state (matter). Each element is therefore both vibratory and particulate, both energy and matter.\n\nThat said, our world is not solid and static, it is a hypercomplex and fast dynamism. This speed is so fast that we don’t perceive it, that at every moment our body, for example, is totally recreating itself again. We cannot perceive it with our fleshly senses, but this fact gives the possibility of change on the material level at any moment.\n\nOn the fundamental level, where we are ONE, we are all the elements of the world and we have the possibility to feel that every element of the world is part of us, just as we are part of the whole. The more we structure our mind, the more we will feel this at subtle levels and in different ways. When we perceive the world as ONE and therefore united with us, a feeling of harmony can spring up and spread through each of our cells.\n\nWe can feel that, since we are one with the world, its harmony is directly connected to ours. And it goes both ways: the perception of harmony in Nature, can harmonize us and when we feel good, we spread harmony throughout the world.\n\nLiving in these times we are asked to gradually take our place as co-creators of this universe together with the Creator. In this process the whole world is continuously created in harmony.\n\nSince all the possibilities of the Universe already exist at the Soul level, we will have access to all these possibilities to manifest them in our cocreation at all times. We will have access to this data bank when our clairvoyance is sufficiently developed, that is, when we see through the “eyes of the Soul”.\n\nOur Role in the Evolution of the Universe\n\nWe were the Soul before we entered this physical body and we don’t remember that. Now we are focused on things to help us identify our preferences and sometimes we don’t really understand how perfect and how important it is to deliberately choose. We are born into this physical world because we have a job to do: we are one team with the Creator and as such we are one of the two principle agents to evolve the Universe. And that is not supposed to be hard work for us: Living in the material world, participating in all that happens, in any situation we find ourselves in, we feel what is just right and what could be improved to give us even more pleasure – so we make wishes. And these wishes create by their manifestation the movement we call “evolution”.\n• The Soul – or we can call her God, Existence, Source, Universe – manifests those wishes.\n\nAnd the two are interdependent on each other: the Soul will only manifest our wishes when we are in alignment with them. “To be in alignment” means that we are on the same energy level as them. If you wish for something to make you happy, it won’t happen if you remain sad. There are two parts of the wishing process that help us to be up to speed with our wishes: first we make the wish from the place where it is already fulfilled (happy place); and secondly we anticipate the gratitude and joy that we feel when we have what we wanted (happy mood).\n\nThe Universe evolves along this path: all life is constantly serving up itself to us in ways that cause us to fine-tune your wishes more and more.\n\nSo if we encounter a situation that is not perfect – imperfection is not against us; it is not to teach us that we are losers and not creators; on the contrary, meeting a situation which is not yet perfect, is helping us to define our wish more precisely. This works by a very simple equation:\n\nWhen you know what you don’t want = then you know what you do want\n• if someone is rude to me = I want him to be nicer – in what way?\n• if I have been rude = I want to be nicer – in what way?\n• if I am unhappy = I want to be happier – in what way?\n• if something’s wrong = I want it to go right – in what way?\n• if you don’t have enough of something = I want more of it\n\n00 To think about “in what way” you want to see the chance, is the part that makes the universe evolve.\n\nThis process is very simple, not hard to figure out, we’re doing it all day every day, but what we may not know is the law by which everything in the universe works: the law of attraction. This laws governs the connection between our attention/intention and manifestation on the material plane:\n\nWherever we focus our attention,\n\nIf we are focused on what we want, the universe prepares to manifest that. If, however, our focus changes like a flag in the wind, the universe will try to follow this movement: and a haphazard mess of incongruent and contradicting manifestations will ensue.\n\nThe manifestations follow where our attention goes.\n\nBut our Soul on the other hand, she cannot leave the space where the wishes are fulfilled, neither can she leave the realm of the Universal Principle. If our attention is focused on our wish, we are where our Soul – and our power! – is; if our attention wanders off to negative or selfish places, our Soul can’t follow and our wish looses a lot of it’s power. So the moment we think: “ahh i doesn’t work”, “I can’t do it”, “I just have to live through this mess”… the Soul can’t go there; she feels our distancing ourselves from her and she calls us by making us feel negative feelings of hopelessness, fear, anger, and so on.\n\nBesides Souls don’t follow words in a material language; she follows REALITY, meaning she follows our emotions. Our Soul is unconditional to support whatever our preference is. So if we want coherent results (= coherent manifestations), we need to be aware when our mind leaves the “Wish Fulfilled” place and goes back to the negative emotion space; and go back to the fulfilled space.\n\nWhen we launch a rocket of desire, our Soul immediately becomes a vibrational match to it. But, contrary to our mind, Soul does not overpower the mind: our mind always has the possibility to split our energy by not becoming a match to it.\n\nIf you hold resistive thoughts like “it is quite unlikely that I will get that”, this emotion will either void the manifestation or delay it while we are working out the bugs in OUR frequency to become a vibrational match to what we want.\n\nAs soon as there is the slightest resistance between us (our mind) and our Soul, it creates a vibrational discord between our mind and Soul and we will feel it. Source is in complete alignment with the Universal Principle, Source loves all the people of this planet – and if we don’t agree and hate some people, we have a rift going on between our Soul and us and this rift will make it that we will not be in alignment with her and the manifestation will not happen! Remember that our Soul is the energy that creates worlds!\n\nThere is an emotional test to know how our Soul reacts to anything we do: just think a thought and\n• when I feel loved, our Soul is in agreement with this thought\n• when you feel fear, your Soul is in complete disagreement with this thought\n\nWe can’t want something, have doubts it and get it – impossible!\n\nWe can’t want something and be mad that we don’t have it and get it – impossible!\n\nWe can’t want something and be impatient about it and get it – impossible!!!\n\nWe are going to help you to find ways to line up easily with what you want.\n\nThis is your emotional GPS – it’s all about how you feel right now… what’s the mood you are in right now.. your mood matters because it is your point of Attraction. You can always tell whether your feeling is a feeling of pushing away what you want or whether your feeling is a feeling of allowing in what you want?\n\nWe want you to watch the evidence move from you vibrational reality into your reality; and before long you will have such confidence in your ability to manifest anything that you desire, because you will have discovered what kinds of things you’ve been doing that have been preventing the things that you want from coming easily.\n\nAnd there is another big bug in your system: your observation of the conditions that exist keep you away from seeing the things that you want to see instead. You got to change the way you look at things. Trust the way you feel, trust you GPS.\n\nHere’s an example. Let’s say you want someone else understand what you mean. At this moment the other person is in a different vibrational frequency and is not hearing what you mean.\n\n In your attempt to get them to hear what you mean, you are responding to the condition of them not hearing. So you are basing what you are saying on what they are not hearing. And then you join them in their frequency rather than maintaining yours. And instead of them hearing what you mean, you hear what they mean and nothing changes. You’ll have to deliberately not consider their non-hearing but stay with your wish.\n\nIn the universe there are no material languages. The Universe is a peaceful environment; to an extend that there are no controlling agencies like police and courts. Everybody is on his own and has absolute responsibility for all he thinks, speaks and does. It’s the Soul who is the everpresent “judge” of our actions. “Judge” in quotes because the Soul has no interest whatsoever in judging and punishing – she will only show us the consequences of our actions on the material plane: “I wonder what will happen to the head of a very war mongering nation, when he enters the Universal Body Enhancement Unit – will he come out as a truly peaceful man? Or will his Soul have left him due to his insistance to continue his shameful behavior?” M. Keshe\n\nWe know what happens when the Soul is forced by the mind into this drastic final step. Acually it is not the Soul who does decide anything; it’s always the person – us. The Soul cannot leave the Universal Principle at all; so when we by our “free” “will” “decide” to go our own way in only pursuing our personal goals even at the expense of our fellowmen or of Nature, then it’s ME who is moving away from the Soul. And the rubber band that connects me to my Soul will be under growing tension, until… it snaps! We face the end of our physical life, when we don’t allow our Soul to support our physical body anymore! Clearly.\n\n“The new communication paradigm is not based on personal needs: I come to you because I need this from you. It is based on the fact that all my needs are already fulfilled and I won’t take anything, because I have what I need and I interact with you because I want to learn from you or I want to enjoy your presence. We have to learn how to become givers and not only to be takers.” M. Keshe\n\nIn the past 8k years it has become our unfortunate habit to be takers while the whole Universe since it’s beginnings has the habit to GIVE. This wrong attitude is also responsible for our inability to make the Magrav and reactor systems work at their full potential – just because we don’t understand how the Universe works – we only seem to know how our wrong doings work?!\n\nThe path to the new Universal knowledge and technology is not by making coils and GaNSes but by understanding how the universe and all in it works – in other words: to comprehend our Soul. – in other words: to be our Soul. We cannot learn about our Soul like we learn about law or mecanics, it’s not about cramming amounts of knowledge into our poor brain; we cannot learn about the Soul, we comprehend our Soul the moment we live through our Soul.\n\nThe Universal Communication is not something new: everybody, except us, uses it since the beginning of time. The universal communication does not work with words, because we can cheat with words, we can lie.\n\nThe universal communication works with images. We focus on anything and somebody else can get it. We all have experienced this, that we think of a dear friend and right at that moment, the telephone rings and this same friend calls to know how we are. When we think about someone we don’t form words and sentences in our head – we simply see her image in front of our inner eye.\n\nThe universal communication must be based on a universal “language” that all living beings, us, animals, plants, our planet, the solar system, the universe and the unicos understand. This universal “language” is not using signs to indicate or convey a reality – it uses the reality.\n\nWe have learned this in the context of how to manifest what we wish: when we want rain for the trees, plants, animals and us after a long draught, we don’t pray with words: “Please please dear god give us rain for we are so thirsty”\n\nNothing will happen. Nothing.\n\nThe rain will start when we remember that we have the trust of a child that our sincere wishes are already fulfilled; when we are feeling our feet in the wet mud, when we feel the big warm drops falling on our shoulders, when we smell the perfume of fresh rain wetting the dust, when we rejoice and dance because it’s raining, when we are so grateful about the rain and so happy that we can ask lovingly and it is given to us – always.\n\nWhat we are doing when we want to make it rain, we create the living image of rain. And, done in the right way, this living image is so powerful that it will manifest rain.\n\nThis is the “language” that the universe and everything in it, understands. And we can remember this language, because we used it before we were taught to only use the matter language – when we were babies.\n\nAs an example let’s translate the universal wish from the human material language “english” into the universal language:\n\n“I give from my Soul to all the Souls in existence. Please take what you need. I am present.”\n\nIn the universal language we could visualize each point with our inner eye:\n• I look inside of me and see my Soul as a powerful shining sun. It radiates out unconditionally.\n• I see around me the multitude of beings, some with a body, some without, some happy, some suffering.\n• Now I see how the sun of my Soul radiates out towards every being.\n• I see how some beings gladly take in the warmth of the ray coming from my Soul. I also see other beings who seem oblivious to the rays from my Soul. And some others take in the rays like they are breathing air – without any special concern or awareness of it.\n• I am enjoying the giving of my Soul. I am aware of all that I feel. I am present.\n\nWe have not used words, we only used “real things” like feelings and images, things that the Universe understands. Already our effort to “speak” the language of the universe, or to use universal communication is a kind of giving. We are giving\n\nAlone with the AllOne\n\nListen, O dearly beloved!\n\n I am the reality of the world, the centre of the circumference,\n\n I am the parts and the whole.\n\n I am the will established between Heaven and Earth,\n\n I have created perception in you only in order to be the object of My Perception.\n\n If then you perceive Me, you perceive yourself.\n\n But you cannot perceive Me through yourself.\n\n It is through My Eyes that you see Me and see yourself,\n\n Through your eyes you cannot see Me.\n\nDearly beloved!\n\n I have called you so often and you have not heard Me.\n\n I have shown Myself to you so often and you have not seen Me.\n\n I have made Myself fragrance so often, and you have not smelled Me,\n\n Savorous food, and you have not tasted Me.\n\n Why can you not reach Me through the object you touch\n\n Or breathe Me through sweet perfumes?\n\n Why do you not see Me? Why do you not hear Me?\n\n Why? Why? Why?\n\nFor you My delights surpass all other delights,\n\n And the pleasure I procure you surpasses all other pleasures.\n\n For you I am preferable to all other good things,\n\n I am Beauty, I am Grace.\n\nLove Me, love Me alone.\n\n Love yourself in Me, in Me alone.\n\n Attach yourself to Me,\n\n No one is more inward than I.\n\n Others love you for their own sakes,\n\n I love you for yourself.\n\n And you, you flee from Me.\n\nDearly beloved!\n\n You cannot treat Me fairly,\n\n For if you approach Me,\n\n It is because I have approached you.\n\n I am nearer to you than yourself,\n\n Than your heart, than your breath.\n\n Who among creatures\n\n Would treat you as I do?\n\nI am jealous of you, over you,\n\n I want you to belong to no other,\n\n Not even to yourself.\n\n Be Mine, be for Me as you are in Me,\n\n Though you are not even aware of it.\n\nDearly beloved!\n\n Let us go toward Union.\n\n And if we find the road\n\n That leads to separation,\n\n We will destroy separation.\n\nLet us go hand in hand.\n\n Let us enter the presence of Truth.\n\n Let It be our judge\n\n And imprint Its seal upon our union\n\n For ever.\n\nFrom: Henri Corbin. Creative Sufism ‘Alone with the Alone: Creative Imagination in the Sufism of Ibn Arabi, p. 174-75", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#Separation_from_the_collective_negative_consciousness", "#The_Starting_Point", "#How_did_we_get_into_the_trap", "#How_to_get_out_of_the_collective_hypnosis", "#The_Universe_is_always_loving", "#Mind_and_Consciousness", "#The_Soul", "#The_Mind", "#Who_am_I", "#Consciousness", "#Structuring_of_the_consciousness", "#Seeing_the_Universe_as_the_Creator", "#The_Structure_of_the_Universe", "#The_levels_of_reality", "#The_3_phases_of_evolution", "#The_Entities", "#Constructive_Entities", "#Non-constructive_entities", "#%E2%80%8BLine_of_connection", "#%E2%80%8BVideo_Brain_and_Soul", "#%E2%80%8BThe_Creator", "#%E2%80%8BCarlos_Castaneda_%E2%80%93_Pearls_for_Don_Juan", "#%E2%80%8BUniversal_Principle_the_Balloons_of_Happiness", "#Body_and_Soul", "#Participate_in_the_Universe", "#Space_Travel_%E2%80%93_Lesson_1", "#What%E2%80%99s_the_World", "#We_are_interconnected_with_everything", "#External_and_Internal_Harmony", "#Our_Role_in_the_Evolution_of_the_Universe", "#Universal_Communication", "#Alone_with_the_AllOne", "https://academy.scienceofeden.com/", "https://youtu.be/ywJZFJQAHe4?list=PLpCKWzA-bp9sXwOTMixfcMT2LgsVSXzJL&t=8862", "https://youtu.be/bGk-Be2GYs8", "https://youtu.be/bGk-Be2GYs8", "https://youtu.be/bGk-Be2GYs8", "https://youtu.be/zEroIpr2Yes?list=RDUDNvu3RYmU8"], "authors": [], "publish_date": null}