{"result_id": "363006", "URL": "https://processing.plasma-laurentides.org/fr/maladies-traitements", "timestamp": "2023-04-25 18:23:51 CEST+0200", "meta": {"description": "", "lang": "fr", "keywords": "", "favicon": "https://processing.plasma-laurentides.org/wp-content/uploads/2019/06/PlasmaMacaron-512-150x150.jpg", "canonical": "https://processing.plasma-laurentides.org/fr/maladies-traitements", "encoding": "UTF-8"}, "image": null, "domain": "processing.plasma-laurentides.org", "title": "Maladies et Traitements – Outils d'Autoguérison", "cleaned_text": "Skin covers my entire body and delimits what is ‘inside’ from what is ‘outside’, namely my individuality. By its surface size, my skin is the most salient organ of my body. It is a protective layer that precisely defines my vital space and faithfully and unconsciously allows my inner state to show through: it is therefore a link in my relation with my entourage (I in my relation to others). My skin is the extension of my felt experience, of my inner sensitivity. It is the mirror of my inner life, my calling card. It analyzes all contact information. If I am a gentle person, so will my skin. If I am very highly sensitive, my skin will also be very sensitive. On the contrary, if I am rather hard with myself or with others, my skin too will be hard and thick. If my skin is irritated, then someone or something in my life is irritating me. Great insecurity makes my skin sweaty, whereas skin that perspires a lot evacuates the emotions that I hold back and that I need to release. A disease that ‘touches’ my skin indicates that I am experiencing difficulties in communicating with my entourage. I feel a loss in my soundness of health. The state of my skin indicates the state of my relations with others. My individuality is called into question, my intimacy and my vulnerability may be threatened. What are my limits? What are my zones of intolerance? My skin reacts when I need to touch and be touched, and I experience a deprivation in that respect. That is why I may develop eczema or psoriasis at the time of a separation, for instance: my skin is experiencing stress; it is in a state of need and becomes red with anger, not understanding why it is not receiving affection and tenderness. I am feeling an immense affective coldness and having difficulty in acclimatizing to my new life or my new situation. The quality of my relations with the outside world will thus be represented by the state of my skin.\n\nSnoring is of course a psychosomatic problem. It occurs when a person is facing a perceived injustice and feels that he cannot express himself openly about it.\n• None Do the Work of Byron Katie on the perceived injustice – you can book a session here\n• None before breakfast and lunch; 60ml of the same LP before going to sleep\n\nThe LCA Protocol is used for 21 days.\n\nwash hair with PL-CO2+ZnO just before bedtime; this creates the equivalent of a weak GaNS patch compared to a strong drinking PL.\n\nThe symptoms or areas in which a stroke has occurred vary with age; the person’s concerns at that time are related to the age group to which they belong.\n\n18-25 years: Stroke is often found at the junction between the brain and spinal cord. Stroke is related to the fact that the person has received too much information created in the brain that cannot be received by the body; then the brain blocks. The consequences are often severe paralysis.\n\n35-45 years: stroke results in emotional paralysis, an explanation often not recognized by medicine because there are few physical symptoms: a lot of anger at not being understood, especially by the younger generation; also anger at not having enough time.\n\n50-65 years: at this stage, the personality thinks that she has already lived most of her life and therefore the paralyses are more serious. Especially on the left side (= right side of the brain), which is also the direction of the emotions of the heart. There is little physical damage if the person is at peace with the idea of decline through age.\n• Mix the following LP : 4p LP-ZnO + 3p LP-CO2 + 2p LP-CH3\n\nThe ZnO helps to dissolve negative emotions, or thought patterns; CH3 gives the energy to be able to get out of the depressive low.\n\nDosage : drink 30ml of the mixture 3x/day\n• Prepare a Breathing Tube with 80% LP-ZnO + 20% LP-CH3 and use it minimum 3 hours/day\n\nA 46 year old woman was diagnosed with thyroid nodules and eventually Hashimoto’s disease. She related that the diagnosis was quite accidental, because in the beginning, around 8 years ago, the nodules were tiny. After a few years, however, she began to feel bad. She developed symptoms of very high blood pressure, shortness of breath, a feeling of palpitations, her body temperature fluctuated a lot. The nodules kept on growing and the blood tests were far from encouraging.\n\nThyroid nodules are solid or fluid-filled lumps that form within the thyroid, a small gland located at the base of the neck, just above your breastbone. The great majority of thyroid nodules aren’t serious and don’t cause symptoms; thyroid cancer accounts for only a small percentage of thyroid nodules.\n\nHashimoto’s thyroiditis, also known as chronic lymphocytic thyroiditis, is an autoimmune disease in which the thyroid gland is gradually destroyed. Early on there may be no symptoms. Over time the thyroid may enlarge, forming a painless goiter.\n• LP-Iodine, 100ml, three times a day (Iodine GaNS was prepared using the caustic soda method using crystalline iodine, 99.8% purity)\n\nThe Liquid Plasma of each of these GaNS was prepared directly by the user, through the field interaction process, in the absence of direct contact of the GaNS material with water. A small bottle with GaNS is submerged in a bottle or jar filled with clean water and left to interact for a minimum of 24 hours.\n\nWearing three bracelets with LP and a couple of drops of GaNS-CO2, -ZnO, -Iodine, -CuO, and -CH3 respectively.\n\nThe application of patches with Liquid Plasma took place after the second test, which confirmed the return to normal parameters.\n\nThe patches were prepared in a ratio of approximately 3:1. Each health patch contained 50% LP-CO2 GaNS + couple of drops of GaNS, and 50% LP-Iodine + couple of drops of GaNS material.\n\nAfter 6 weeks of balancing the body using Liquid Plasma, there was a noticeable improvement in well-being. The symptoms subsided and the positive course of the whole process was confirmed by another ultrasound examination, carried out 7 months after the first examination. Her thyroid gland has completely returned to normal.\n\nVaccinations are not acceptable in a single application but in 3 applications with a 2 to 3 week delay between each. Single-dose vaccines contain Mercury, an element that causes damage to the child’s nervous system, especially at the age of 2 to 3 years. It often causes dyslexia, attention deficit disorder and other problems related to brain development. It is damage to brain cells at the neurological level and can either be protected before vaccination or repaired after vaccination.\n\nIn the Plasma Science we do not fight a situation, because generally speaking the fight binds us to our enemy and creates a connection that weakens us, we create another condition. It is recommended to takethe protocol before vaccination preferably, or afterwards to correct the situation\n\nCO2, ZnO, Magnesium, Potassium, Calcium, Folic Acid, EPA. You can also make a Gans of these products to simplify the application and always have the product at home. GaNS-vaccinM.Keshe 172nd KSW@0:58:00Mix the following substances:\n• Vitamin B12 if there is physical damage or if the child’s age is over 7 years\n• Cut the components into pieces and place them in a heat-resistant, closed container (Jam jars)\n• Add Caustic Soda in the same amount and pour boiling water. (Beware of splashes and possible overflows, wear heat-resistant gloves, safety glasses, operate in a ventilated area at the bottom of a sink).\n• When there are no more reactions to soda, close the jar, wait at least 8 to 15 days, then filter all solid particles\n• Collect the dark liquid and wash it several times, there must remain a white deposit which is GaNS, collect and pour it into a bottle with CO2 Liquid Plasma\n\nApply 1x/day in cold climates and 1x/2 days in hot climates. This Gans can also be used to facilitate the taking of the vaccine – especially in young children – and is part of the protocol for the nervous system, with ZnO, and CuO. The elements can also be taken individually.\n\nOther indications: All disorders affecting the nervous system: Stroke, Parkinson’s, Alzheimer’s, cerebral sclerosis, brain surgery, hyperactivity with or without attention disorders, neonatal pain, polio, spinal cord injury, etc.\n\nCreate the following never ending supply of the mixture for wound treatment:\n• None this is your never ending mix; take only the clear LP when the GaNS has settled to the ground; when the container is half empty, fill it back on with demineralized water\n• make 3 small patches and put 2 on the wound and 1 in the back of the wound\n\nWhile it is obvious that a good-feeling body makes for a more pleasant physical experience, we want you to understand that finding pleasant things to focus upon also makes for a good-feeling body.\n\nHowever, most humans are approaching the subject of their physical well-being in a backward manner. Most people who are experiencing physical ailments let their physical condition dictate their mental attitude. In other words, their emotions are responsive to their physical condition. When they are in pain, they offer emotions of frustration, worry, anger, or fear. They want the condition to improve so that their emotional state can improve.\n\nAny illness, or departure from physical well-being, begins at a cellular level—but the overwhelming propensity of your cells is that of thriving. All day, every day, your cells are reclaiming balance at such refined and subtle levels that most people are completely unaware of the power and intelligence of their cellular bodies.\n\nFocusing upon good-feeling objects of attention is the most effective way of providing the optimum environment for allowing unhindered cellular communication and the ultimate thriving of your physical body.\n\n—Abraham, Excerpted from: Getting into the Vortex Guided Meditation CD and User Guide on November 01, 2010\n\n\n\nL’intention joue le rôle primordial sur l’efficacité des outils de Plasma. Lisez l’article sur l’intention pour vous outiller!\n\nLE SYSTÈME DE LA MALADIE\n\nCe petit paragraphe est écrit non pas pour afficher « une vérité »; il veut construire une structure métaphorique, une série d’images qui peuvent bien expliquer les phénomènes de la maladie et aussi cel de la santé.\n\nNous sommes composés de 3 aspets: l’âme, le centre emotionnel (qui peut aussi être appelé « mental » et le corps. L’âme est notre partie « non-personnelle », l’aspet qui fait partie du « Un », « Dieu » etc. Le centre émotionnel ou le mental sont personnel; composé d’une partie consciente et d’une partie inconsciente. Le corps est note « véhicule », le support matériel de notre mental et l’âme. Souvent nous sommes identifiés au corps, pensant que « nous sommes notre corps ».\n\nL’âme est notre aspet plasmique – notre original; elle est toujours en santé et complète; elle ne peut être malade ni peut-elle subir d’accident. L’âme habite dans l’univers morphogénétique. Son inviolabilité fait d’elle la référence avec laquelle nous pouvons savoir si notre mental ou notre corps sont malade ou en santé. Du même fait « une guérison » a deux étappes: la reconnaissance d’un état non-santé, c’est à dire une discrépance entre notre original dans l’univers morphologique et notre copie matérielle, le corps. Ensuite le processus de la guérison consiste dans un « effort » de ramener la copie à l’original.\n\nDonc pour guérir n’importe quel maladie ou condition physique, il faut préalablement équilibrer la déficience dans le centre émotionnel; il faut enlever la raison psychologique pour le déséquilibre physique ou satisfaire l’émotionnel avant. La relation entre l’aspet physique et l’aspet psychologique est 50%:50%.\n\nSi on applique un patch pour traiter une tumeur, il ne faut donc pas oublier d’appliquer un autre sur la tête pour traiter le centre émotionnel.\n\nLA LANGUE DE LA MALADIE\n\nLe fait que toutes nos maladies peuvent être décrit étant « psycho-somatique » indique le fait que chaque maladie provoque des symptomes physiques (soma) ainsi que des symptomes dans notre mental (psyché). On a donc besoin de regarder la gestalt entière d’une maladie. Il y a une relation hierarchique entre les deux champs: la partie psychique impose la partie physique. Ça veut dire si on traite par exemple un tumeur cancéreux seulement sur le plan physique, on peut peut-être faire disparaître le symptome (la tumeure locale); mais elle va revenir dans un autre endroit si on ne traite pas « la centrale », le centre émotif ou le mental.\n\nIl est par conséquent nécessaire d’adresser le centre émotionnel au même temps qu’on traite les symptomes physiques. Une des façons les plus efficace de travailler l’aspet psychologique d’une maladie est « LE TRAVAIL » de Byron Katie. Vous pouvez en savoir plus et réserver une session ici.\n\nLorsque vous commencez à prendre des produits qui contiennent du GaNS vous allez observez plus de fatigue. Ce phénomène est naturel: le GaNS incite votre corps à ré-équilibrer toutes les zones qui était auparavant en déséquilibre; pour faire cela il prends plus d’énergie que d’habitude – ce qui résulte dans plus de fatigue.\n\nSi les produits de GaNS contiennent du ZnO il le même processus se développe sur le plan émotionnel: votre niveau de tolérance est plus bas, vous êtes plus nerveux etc. jusqu’à ce que le nouveau équilibre émotionnel soit installé.\n\nDans le cas de Nectar-plasmique (GaNS de nourriture) vous pouvez observer des rages de sucre ou des rages de « junkfood ». Cela peut se produire car vous êtes débalancés et vous vous sentez plus vulnérable – donc un plus grand besoin de compensation.\n• \n• L’aspect de la communication, le lien entre l’émotionalité et la physicalité: CO2\n• \n• L’aspet du renforcement de la partie musculaire ou infection: CuO\n• Pas de Pb, Al, Hg pour les unités de santé.\n\nEau-de-GaNS = Plasma Liquide = PL\n\nUnité de santé universelle = USU\n\nUnité de santé portative = USP\n\nVoici une liste des outils plasmiques de Santé\n\nAntenne de bien-être\n\nPochette pour l’Antenne\n\nPendentif AURYN\n\nCoupe de Vie\n\nBouteille Via Sano\n\nPlaques Nano\n\nPatch de GaNS\n\nGanseria – Eau de GaNS sur mesure\n\nGouttes oculaires\n\nNectar Plasmique\n\nÔdélène\n\nChevelu Plasmique\n\nGouttes d’Autoguérison\n\nKit d’Autoguérison\n\nPremiers Soins Plasmiques\n\nMarche le Plasma\n\nAssembler autour d’un contenant avec de l’eau distillé des phioles de GaNS-CO2, – CH3, -CuO, -Cohn, -ZnO\n\nApplication par exemple: Une personne avec un rein qui ne fonctionne plus bien.\n• Dans un premier temps on pose la Coupe Transplasma en proximité directe de l’organe qu’on veut guérir chez une personne saine. Cette personne reste pour 1 heure; pendant ce temps les informations du rein en santé se transmettent à l’aide des phioles de plasma liquide dans le grand contentant avec l’eau distillée.\n• Ensuite on peut fabriquer avec cette eau des patch qui sont pose avan et en arrière de la personne dont on veut traiter le rein.\n\nPour traiter certaines maladies, on peut placer des aimants à l’extérieur de la coupe. Si on veut par exemple traiter une tumeur dans le poumon droite: placer un Patch-de-GaNS-CO2 dans le centre d’un aimant rond qui a les pôles sur les deux faces. Fixer ensuite les aimants avec leur pôle sud sur les faces. Le pôle sud enlève l’énergie de l’endroit où il est posé; le pôle nord fournit l’énergie. Un cancer représente un surplus d’énergie (pour multiplier ses cellules à vitesse) qu’on veut enlever.\n\nUn autre exemple: Fibromyalgie. Elle commence dans le centre émotionnel et représente une déficience énergétique. Par conséquent on place les aimants côté Nord avec le patch à la région qui représente la tête.\n\nSi la cible doit être atteinte avec précisiion, utilisez un aimant plus petit; un plus grand si l’endroit à traiter est étalé. Si l’effet droit être très fort, utilisez un aimant en forme de disc; pour les maladies génétique un aimaint rectangulaire.\n\nVous pouvez aussi installer des aimant en série pour créer un « chemin » d’un certain organe vers le centre émotionnel par exemple.\n\nGaNS-os (fait avec des os d’animaux ou des coquilles d’oeufs)\n\nLa respiration à l’aide d’une paille par la Coupe de Vie+rends la salive pH alcalin (de 5 à 9). Avec 1 session de respiration pendant 10 min. la salive reste alcalin pour 2 hrs; avec 1 session tous les 4 heures la salive reste alcalin pendant 4 heures.\n\nLa phycocyanine est réputé de réparer les gênes. L’Eau-de-GaNS-CuO peut défaire les modifications génétiques et restaurer la configuration originelle des gènes.\n\nPhycocyanine GaNS pour détoxifier et régénérer le foi.\n\nPlacez une éponge en cuivre nano-plaquée enveloppé dans un ziplock sur le foi; cela crée un champs fort de plasma de haut niveau.\n\nGaNS Curcuma + Chaga + Tuya (Leatitia)\n\nMélange de PL-soursop+PL-ZnO\n\n1ier jour:\n\nSeulement boire PL-CO2 pas d’autre eau; laver les vêtements en ajoutant 1 t PL-CO2 à l’eau de lessive; aussi ajouter du PL-CO2 à l’eau pour nettoyer la maison.\n\n2nd jour:\n\nL’urine change de couleur\n\nAprès 4 jours à 1-1/2 semaines:\n\nFièvre et fatigue arrivent qui disparaissent après 1 semaine. Une fois la fièvre et fatigue sont parties, on ajoute les PL-CH3+CuO+ZnO au PL-CO2 (pour boire et nettoyer comme au début).\n\nUn enfant hyperactif peut être traité avec EPA 500mg et DHA (acide eisosapentaenoïque et acide docosahexaenoïque) pour compenser le manque de oméga 3. Les animaux en provenance des fermes industrielles n’ont presque plus d’oméga 3 à cause du niveau de stress très élevé dans ce type d’élevage, seulement Oméga 6.\n\nfaire 2 patch PL-CO2; poser un en avant du bas ventre (lieu de la vessie) et l’autre en arrière que la vessie soit entre les 2 patch.\n\nExercice de Kegel:\n• trouver le bon muscle (plancher pelvien) en arrêtant votre flux d’urine au milieu\n• couché sur le dos serrez le plancher pelvien pour 5 sec, puis relâcher pour 5 sec; cinq fois de suite (augmenter le temps graduellement de 5 à 10 sec et de 3x/jour à 10x/jour)\n\nPoser un Patch-d’Eau-de-GaNS-CuO en sandwich entre deux Patch-d’Eau-de-GaNS-CO2 sur la région infectée.\n\nRespirez à travers un tube GaNS-CO2+ZnO; utiliser la Coupe de Vie; prendre des bains de 1-2L d’Eau-de-GaNS-ZnO pour 30min/jour.\n\nPhycocyanine Plusieurs Patch-de-GaNS superposez et inserrés ensemble dans une pochette en tissu.\n\nGaNS-poudre de shungite\n\nAjoutez un petit clou par dessus la production de GaNS-CO2 d’une façon qu’il touche les acides aminées qui flottent à la surface; récoltez les points rouges qui vont se former et ajoutez-les à votre coupe de vie.\n\nAjoutGaNS-cartilage animal ou gélatine + CO2 + CaO + ZnO + CH3 + Mg\n\nGaNS-clousdegirofle\n\nGaNS-poudre de shungite\n\nAjoutez du souffre dans votre fabrication de GaNS – cela harmonise toutes débalancement dans le corps. Ajoutez 1 goutte dans une tasse de votre boisson.\n\nFaire un GaNS avec un os en santé (posé par dessus contenant pour faire le GaNS); ensuite en faire un Patch et le poser sur la région de la transplantation.\n\nCes personnes veulent plus qu’ils ne recoivent; alors ils le prennent de leur corps: « maman, je veux ce biscuit – si tu ne me le donne pas, je vais donner un coup de pied au chien! ».\n\nFaire un GaNS avec des coquilles d’oeuf et un patch; une coupe de vie additionnellement.\n\nUtiliser les acides aminés de la production du GaNS-ZnO.\n\nUtiliser l’urine de la personne pour fermer la plaie et les Patch-de-GaNS-CO2 pour enlever la douleur et guérir avec vitesse.\n\nUtiliser des Patch-ZnO avec -CuO en sandwich.\n\nGaNS-poudre de shungite\n\nGouttes: CO2 + CuO (+ Tuya + Gingembre)\n\nou un Patch-PL-CO2 50% +CuO 50%\n\nPlacez un Patch-d’Eau-de-GaNS-CO2 dans le centre d’un aimant rond (les pôles sur le faces). Collez ensuite l’aimant avec le S à la coupe de vie dans région des poumons. Ansi vous drainez l’énergie de la région de la tumeur qui va par la suite manquer à la tumeur.\n\nHaut\n\nMélanger 2ml PL-ZnO dans 500ml eau; laisser agir pendant 1 heure et boire le tout pendant la journée.\n\n; après 1 semaine la pression du sang s’est normalisée.\n\nGaNS-Tomatina (faire avec une tomate cuit avec la peau); le GaNS d’une tomate cuite est en harmonie avec l’aspet émotionnel de la prostate.\n\nFer: Utilisez le patch à gans CH3 (FeO) dans un patch ou bracelet pour 30 minutes par jour.\n\nCuivre: Utiliser le CuO comme patch mettre dans le lit sans qu’il touche au patient pour 10 min par jour.\n\nFabriquez 4 minuscules stacks-coplanares de la taille d’une pointe de doigt. Tous sont nano-plaqués et couvert de GaNS: #1 GaNS-CO2; #2 GaNS-CuO; #3 GaNS-ZnO; #4 GaNS-CH3. Placez -les autour du moignon.\n\nPour faire repousser des doigts/horteilles, n’utilisez qu’une seule bobine. Appliquez un saran-wrap autour du moignon pour éviter le contact de la bobine avec la peau. La bobine est placée perpendiculaire au moignon à une distance <2-3mm. Entourez le doigt avec les 4 terminaux des bobines; ils doivent être assez long pour qu’ils dépassent le moignon et font 1 tout autuour du doigt. Cela enlève la douleur; aussi la douleur phantome.\n\nSi vous utilisez le casque, le désire authentique de faire repousser le membre va induire le cerveau d’initier ce processus. Le temps est décidé par le cerveau selon le rhythme de renouvellement des cellules.\n\nAutre façon: façonnez un modèle du membre qui n’est pas là, nano-plaquez-le et appliquez les 3 GaNS; connectez le tout au moignon d’une façon conductive – et le doigt va repousser.\n\nCes méthodes ne fonctionnent pas avec des remplacements (hanche, genoux) car les parties vont repousser malgré le remplacement ce qui donnera un conflit d’espace.\n\npeut arriver lorsqu’on ingère du GaNS directement et ne pas l’Eau de GaNS. peut aussi arriver si la detox est très forte parce qu’il y a une énorme quantité de toxine qui le corps essaye d’expulser.\n\nLe patient doit répondre à la question: « Pourquoi tu te fais ça? » car il a peut-être crée la maladie pour prouver que son pouvoir émotionnel est supérieur à toutes les essaies de guérir – il est condamné par lui-même comme incurable. Il n’a aucune volonté de recevoir!\n\nNe pas utiliser des patch ou les coupes mais des magravs; ou vous approchez lentement un patch ou coupe du coeur et le patient juge si ça fait du bien ou pas.\n\nOrganes, moëlle, etc par « copier les informations, la structure d’un organe en santé dans l’organe malade et lui laisser se regénérer ».\n\nEn détail: Assembler autour d’un contenant avec de l’eau distillé des phioles de GaNS-CO2, – CH3, -CuO, -Cohn, -ZnO; placer l’organe correspondant d’une personne en santé par dessus: alors les informations du fonctionnement physiologique de l’organe se transfer dans le liquide (1/2l). Ensuite vous d0ublez le liquide obtenu et placez-le sur l’organe affecté, ou vous faites de patch ou vous donnez le liquide à boire à la personne malade et elle n’aurait plus besoin d’une transplantation car l’organe va être regénéré par les GaNS.\n\nVous pouvez prendre comme « source d’information » l’épouse, le parent et même la même personne, s’il s’agit d’un organe qui est symétrique (poumons, reins, etc).\n\nL’image: le sang ne veut plus transporter une certaine émotion; en bloquant le flux du sang il tente à en finir avec la vie sur terre et atteindre la paix.\n\nAjoutez du souffre dans la fabrication du GaNS; ajoutez une goutte de ce GaNS dans la coupe de vie.\n\nMatelas avec des bobine vortex intégrés; recouverts par de Patch-CO2. Une ceinture avec des bobines plattes (pancake). Une coupe de Vie (CO2+CH3+okra+très peu de CuO).\n\nLe Calcium est typiquement à l’origine de ce cancer. Suivant un traitement avec l’antenne un flocon apparaît sur la tête, les cheveux; c’est la migration du calcium de l’intérieur de la tumeur vers l’extérieur.\n\nGaNS-propolis.\n\nTrouver quel métal est dans le noyau de la tumeur. Faire un GaNS avec le même métal et placer un patch avec le PL ce GaNS sur la tumeur.\n\nLe patch a le même champs magrav que la tumeur; la tumeur est en état plasmique et veut alors créer la balance; il va donc nourrir le patch et par cela s’épuiser. Dorénavant il n’y a plus de support pour les cellules de la tumeur de s’y attacher – ils disparaissent alors.\n\nPlacer des aimants côté Sud avec un patch-CO2 sur l’endroit de la coupe qui représente l’endroit de la tumeure pour siphoner son énergie qu’il a besoin pour proliférer.\n\nAttacher une phiole avec PL-CH3 (énergie), une autre avec PL-CO2 (émotions) et une plaque de Zinc (excitation sexuelle).\n\nLes yeux transfèrent informations de la matière (images) au centre émotionnel. Si le centre émotionnel décide de ne plus vouloir voir la misère qui est le monde, il rend les yeux aveugle; quelconque maladie dégénerative (ça peut être déclanché aussi par des mémoires de générations avant qui ont vus de tels horreurs qui ont créé le désire de ne plus voir). Les yeux ont besoin de 3 voies de traitement simultanées:\n\n1. Eau-de-GaNS-CO2 pour faire la connexion entre le centre émotif et la physicalité: 4à5 parts.\n\n2. Eau-de-GaNs-ZnO pour encourager le centre émotif, pour qu’il peut s’élever afin d’être capable de supporter ce qu’il voit: 1à2 parts.\n\n3. Eau-de-GaNS-CH3 pour fournir l’énergie nécessaire aux cellules de supporter les changements vers le nouveau équilibre: 2à3 parts.\n\n4. Eau-de-GaNS-CuO pour soigner les parties musculaires qui sont déjà adapté à la dégénérence (compensation): 1/2 part.\n\nNe pas appliquer CH3 car le cancer mobilise déjà trop d’énergie – on veut la drainer et ne pas augmenter.\n\nWhile it is obvious that a good-feeling body makes for a more pleasant physical experience, we want you to understand that finding pleasant things to focus upon also makes for a good-feeling body.\n\nHowever, most humans are approaching the subject of their physical well-being in a backward manner. Most people who are experiencing physical ailments let their physical condition dictate their mental attitude. In other words, their emotions are responsive to their physical condition. When they are in pain, they offer emotions of frustration, worry, anger, or fear. They want the condition to improve so that their emotional state can improve.\n\nAny illness, or departure from physical well-being, begins at a cellular level—but the overwhelming propensity of your cells is that of thriving. All day, every day, your cells are reclaiming balance at such refined and subtle levels that most people are completely unaware of the power and intelligence of their cellular bodies.\n\nFocusing upon good-feeling objects of attention is the most effective way of providing the optimum environment for allowing unhindered cellular communication and the ultimate thriving of your physical body.\n\n—Abraham, Excerpted from: Getting into the Vortex Guided Meditation CD and User Guide on November 01, 2010\n\n\n\nL’intention joue le rôle primordial sur l’efficacité des outils de Plasma. Lisez l’article sur l’intention pour vous outiller!\n\nLE SYSTÈME DE LA MALADIE\n\nCe petit paragraphe est écrit non pas pour afficher « une vérité »; il veut construire une structure métaphorique, une série d’images qui peuvent bien expliquer les phénomènes de la maladie et aussi cel de la santé.\n\nNous sommes composés de 3 aspets: l’âme, le centre emotionnel (qui peut aussi être appelé « mental » et le corps. L’âme est notre partie « non-personnelle », l’aspet qui fait partie du « Un », « Dieu » etc. Le centre émotionnel ou le mental sont personnel; composé d’une partie consciente et d’une partie inconsciente. Le corps est note « véhicule », le support matériel de notre mental et l’âme. Souvent nous sommes identifiés au corps, pensant que « nous sommes notre corps ».\n\nL’âme est notre aspet plasmique – notre original; elle est toujours en santé et complète; elle ne peut être malade ni peut-elle subir d’accident. L’âme habite dans l’univers morphogénétique. Son inviolabilité fait d’elle la référence avec laquelle nous pouvons savoir si notre mental ou notre corps sont malade ou en santé. Du même fait « une guérison » a deux étappes: la reconnaissance d’un état non-santé, c’est à dire une discrépance entre notre original dans l’univers morphologique et notre copie matérielle, le corps. Ensuite le processus de la guérison consiste dans un « effort » de ramener la copie à l’original.\n\nDonc pour guérir n’importe quel maladie ou condition physique, il faut préalablement équilibrer la déficience dans le centre émotionnel; il faut enlever la raison psychologique pour le déséquilibre physique ou satisfaire l’émotionnel avant. La relation entre l’aspet physique et l’aspet psychologique est 50%:50%.\n\nSi on applique un patch pour traiter une tumeur, il ne faut donc pas oublier d’appliquer un autre sur la tête pour traiter le centre émotionnel.\n\nLA LANGUE DE LA MALADIE\n\nLe fait que toutes nos maladies peuvent être décrit étant « psycho-somatique » indique le fait que chaque maladie provoque des symptomes physiques (soma) ainsi que des symptomes dans notre mental (psyché). On a donc besoin de regarder la gestalt entière d’une maladie. Il y a une relation hierarchique entre les deux champs: la partie psychique impose la partie physique. Ça veut dire si on traite par exemple un tumeur cancéreux seulement sur le plan physique, on peut peut-être faire disparaître le symptome (la tumeure locale); mais elle va revenir dans un autre endroit si on ne traite pas « la centrale », le centre émotif ou le mental.\n\nIl est par conséquent nécessaire d’adresser le centre émotionnel au même temps qu’on traite les symptomes physiques. Une des façons les plus efficace de travailler l’aspet psychologique d’une maladie est « LE TRAVAIL » de Byron Katie. Vous pouvez en savoir plus et réserver une session ici.\n\nLorsque vous commencez à prendre des produits qui contiennent du GaNS vous allez observez plus de fatigue. Ce phénomène est naturel: le GaNS incite votre corps à ré-équilibrer toutes les zones qui était auparavant en déséquilibre; pour faire cela il prends plus d’énergie que d’habitude – ce qui résulte dans plus de fatigue.\n\nSi les produits de GaNS contiennent du ZnO il le même processus se développe sur le plan émotionnel: votre niveau de tolérance est plus bas, vous êtes plus nerveux etc. jusqu’à ce que le nouveau équilibre émotionnel soit installé.\n\nDans le cas de Nectar-plasmique (GaNS de nourriture) vous pouvez observer des rages de sucre ou des rages de « junkfood ». Cela peut se produire car vous êtes débalancés et vous vous sentez plus vulnérable – donc un plus grand besoin de compensation.\n• \n• L’aspect de la communication, le lien entre l’émotionalité et la physicalité: CO2\n• \n• L’aspet du renforcement de la partie musculaire ou infection: CuO\n• Pas de Pb, Al, Hg pour les unités de santé.\n\nEau-de-GaNS = Plasma Liquide = PL\n\nUnité de santé universelle = USU\n\nUnité de santé portative = USP\n\nVoici une liste des outils plasmiques de Santé\n\nAntenne de bien-être\n\nPochette pour l’Antenne\n\nPendentif AURYN\n\nCoupe de Vie\n\nBouteille Via Sano\n\nPlaques Nano\n\nPatch de GaNS\n\nGanseria – Eau de GaNS sur mesure\n\nGouttes oculaires\n\nNectar Plasmique\n\nÔdélène\n\nChevelu Plasmique\n\nGouttes d’Autoguérison\n\nKit d’Autoguérison\n\nPremiers Soins Plasmiques\n\nMarche le Plasma\n\nAssembler autour d’un contenant avec de l’eau distillé des phioles de GaNS-CO2, – CH3, -CuO, -Cohn, -ZnO\n\nApplication par exemple: Une personne avec un rein qui ne fonctionne plus bien.\n• Dans un premier temps on pose la Coupe Transplasma en proximité directe de l’organe qu’on veut guérir chez une personne saine. Cette personne reste pour 1 heure; pendant ce temps les informations du rein en santé se transmettent à l’aide des phioles de plasma liquide dans le grand contentant avec l’eau distillée.\n• Ensuite on peut fabriquer avec cette eau des patch qui sont pose avan et en arrière de la personne dont on veut traiter le rein.\n\nPour traiter certaines maladies, on peut placer des aimants à l’extérieur de la coupe. Si on veut par exemple traiter une tumeur dans le poumon droite: placer un Patch-de-GaNS-CO2 dans le centre d’un aimant rond qui a les pôles sur les deux faces. Fixer ensuite les aimants avec leur pôle sud sur les faces. Le pôle sud enlève l’énergie de l’endroit où il est posé; le pôle nord fournit l’énergie. Un cancer représente un surplus d’énergie (pour multiplier ses cellules à vitesse) qu’on veut enlever.\n\nUn autre exemple: Fibromyalgie. Elle commence dans le centre émotionnel et représente une déficience énergétique. Par conséquent on place les aimants côté Nord avec le patch à la région qui représente la tête.\n\nSi la cible doit être atteinte avec précisiion, utilisez un aimant plus petit; un plus grand si l’endroit à traiter est étalé. Si l’effet droit être très fort, utilisez un aimant en forme de disc; pour les maladies génétique un aimaint rectangulaire.\n\nVous pouvez aussi installer des aimant en série pour créer un « chemin » d’un certain organe vers le centre émotionnel par exemple.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": ["#", "#Contact_doctors_of_the_Keshe_Foundation_doctorsspaceshipinstituteorg", "#Skin", "#Snoring", "#Stroke", "#Suicide_Prevention", "#Thyroid_nodules", "#Vaccines", "#Wound_treatment", "#Infos_generales", "#L%E2%80%99INTENTION", "#LE_SYSTEME_DE_LA_MALADIE", "#LA_LANGUE_DE_LA_MALADIE", "#SOYEZ_PREPARES", "#Fatigue", "#Emotivite", "#LES_CHARACTERISTIQUES_DU_GANS", "#Abreviations", "#Outils_de_sante", "#Coupe_Transplasma", "#Les_coupes_avec_aimants", "#Fractures", "#Fumeur_-se", "#Genetiques", "#Hepatite", "#Herpes", "#HIV", "#Hyperactivite", "#Hypoglycemie", "#Immunodeficience", "#Incontinence", "#Infections", "#Infertilite", "#Inflammation", "#Insomnie", "#Leucemie", "#Ligaments", "#Maladie_de_Lyme", "#Manque_doligoelements", "#Moelle_transplantation", "#Multiple_sclerose", "#Oreillons", "#Os_fracture", "#Parkinson", "#Plaie_ouverte", "#Poison_de_serpent", "#Polypes_nasaux", "#Poumons_cancer", "#Pression_du_sang", "#Prostate", "#Psoriasis", "#Reduction_des_elements", "#Reparer_les_membres_absents", "#Repoussant_pour_insectes_moustiques", "#Rougeole", "#Sang_dans_l%E2%80%99urine", "#Sang_epais", "#SLA", "#Stimulateur_cardiac", "#Transplantations", "#Thrombose", "#Thyroide", "#Tuberculose_de_la_colonne_vertebrale", "#Tumeur_du_cerveau", "#Tumeurs_en_general", "#Varices", "#Viagra", "#Yeux", "#Yeux_cancer", "#Infos_generales-2", "#L%E2%80%99INTENTION-2", "#LE_SYSTEME_DE_LA_MALADIE-2", "#LA_LANGUE_DE_LA_MALADIE-2", "#SOYEZ_PREPARES-2", "#Fatigue-2", "#Emotivite-2", "#LES_CHARACTERISTIQUES_DU_GANS-2", "#Abreviations-2", "#Outils_de_sante-2", "#Coupe_Transplasma-2", "#Les_coupes_avec_aimants-2", "#i", "https://fabshop.plasma-laurentides.org/en/boutique/atelier/the-work-avec-barsha/", "https://www.facebook.com/groups/306696209434286/permalink/1915187118585179/", "https://plasma-laurentides.org/2016/06/25/intention/", "https://plasma-laurentides.org/2016/07/03/introduction-champs-morphogenetiques/", "https://thework.com/sites/thework/francais/", "https://i.pontdevie.org/produit/antenne-de-bienetre/", "https://i.pontdevie.org/produit/antenne-de-bienetre/", "https://i.pontdevie.org/produit/pochette-pour-lantenne/", "https://i.pontdevie.org/produit/auryn/", "https://i.pontdevie.org/produit/coupe-de-vie/", "https://i.pontdevie.org/produit/via-sano/", "https://i.pontdevie.org/produit/plaques-nano/", "https://i.pontdevie.org/produit/patch-de-gans/", "https://i.pontdevie.org/produit/ganseria-gans-sur-mesure/", "https://i.pontdevie.org/produit/les-gouttes-oculaires/", "https://i.pontdevie.org/produit/nectar-plasmique/", "https://i.pontdevie.org/produit/odelene/", "https://i.pontdevie.org/produit/chevelu-plasmique/", "https://i.pontdevie.org/produit/gouttes-dautoguerison/", "https://i.pontdevie.org/produit/patch-de-gans/", "https://i.pontdevie.org/produit/kit-dautoguerison/", "https://i.pontdevie.org/produit/premiers-soins-plasmiques/", "https://i.pontdevie.org/produit/marche-le-plasma/", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://www.shieldhealth.ie/omega-3-fish-oils.html", "https://www.buyiboga.com/", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://i.pontdevie.org/produit/accessoirs-de-shungite/", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://i.pontdevie.org/produit/accessoirs-de-shungite/", "https://www.beneficialbotanicals.com/products/v-TINC-TINCTURE_JK.html", "https://www.beneficialbotanicals.com/tincture-information/japanese-knotweed.html", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://i.pontdevie.org/produit/accessoirs-de-shungite/", "https://www.carapaprocera.com/", "https://www.carapaprocera.com/", "https://www.amazon.ca/lifestream-High-Phycocyanin-Spiriluna-Blue/dp/B00C1W250S?ie=UTF8&SubscriptionId=AKIAIKBZ7IH7LXTW3ARA&ascsubtag=56fb088e48308f0eb83b69dd&camp=2025&creative=165953&creativeASIN=B00C1W250S&linkCode=xm2&tag=stuccu-20", "https://i.pontdevie.org/produit/accessoirs-de-shungite/", "https://plasma-laurentides.org/2016/06/25/intention/", "https://plasma-laurentides.org/2016/07/03/introduction-champs-morphogenetiques/", "https://thework.com/sites/thework/francais/", "https://i.pontdevie.org/produit/antenne-de-bienetre/", "https://i.pontdevie.org/produit/antenne-de-bienetre/", "https://i.pontdevie.org/produit/pochette-pour-lantenne/", "https://i.pontdevie.org/produit/auryn/", "https://i.pontdevie.org/produit/coupe-de-vie/", "https://i.pontdevie.org/produit/via-sano/", "https://i.pontdevie.org/produit/plaques-nano/", "https://i.pontdevie.org/produit/patch-de-gans/", "https://i.pontdevie.org/produit/ganseria-gans-sur-mesure/", "https://i.pontdevie.org/produit/les-gouttes-oculaires/", "https://i.pontdevie.org/produit/nectar-plasmique/", "https://i.pontdevie.org/produit/odelene/", "https://i.pontdevie.org/produit/chevelu-plasmique/", "https://i.pontdevie.org/produit/gouttes-dautoguerison/", "https://i.pontdevie.org/produit/patch-de-gans/", "https://i.pontdevie.org/produit/kit-dautoguerison/", "https://i.pontdevie.org/produit/premiers-soins-plasmiques/", "https://i.pontdevie.org/produit/marche-le-plasma/"], "authors": [], "publish_date": "3 juillet 2016"}