{"result_id": "365007", "URL": "https://drjoedispenza.com/pages/about-us", "timestamp": "2023-04-25 18:23:59 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.shopify.com/shopifycloud/shopify/assets/no-image-50-3d8cc48bd078edcd544c8d60f929ed2d8800a3fc52e0f602e84b1767e392bfcd_pico.gif", "canonical": "https://drjoedispenza.com/pages/about-us", "encoding": "utf-8"}, "image": null, "domain": "drjoedispenza.com", "title": "About Us", "cleaned_text": "We all have our own personal limits — whether they are related to our ability to create abundance in our life, our capacity to make some type of change in our health or our body, our inability to stop recreating the same outcomes, or just our ability to believe in ourselves. When we step beyond our limitations, we become more unlimited.\n\nAfter many years of witnessing human transformation, we now know that if people are given an opportunity to learn vital information about what’s possible—based in science and reason—and then given numerous opportunities to be stretched beyond their limits to experience the truth of that philosophy, some immaterial energy emerges in them. Unlimited with Dr Joe Dispenza speaks to a collective consciousness of people all over the world who believe they can manifest their personal dreams.\n\n\n\nObserving a community of people coming together in the name of possibility, who can step beyond what they know as normal or natural into the unknown—who intend to transform the way they think and feel because they understand by changing themselves, they change their life—something magical happens. A new consciousness emerges.\n\nWe are a living organism. My hope is that we become a more evolved form of the human species who when freed from the chains of their own limits, heal one another; inform one another; support one another; trust one another; cooperate with one another; honor one another; shine for one another so that others can shine as well. The new consciousness that is emerging during this particular time in history is not based on one individual, but on a collective group of people unified as one mind and one heart, pushing the limits of possibility.", "opengraph": {"site_name": "Unlimited with Dr Joe Dispenza ", "url": "https://drjoedispenza.com/pages/about-us", "title": "About Us", "type": "website", "description": "We all have our own personal limits — whether they are related to our ability to create abundance in our life, our capacity to make some type of change in our health or our body, our inability to stop recreating the same outcomes, or just our ability to believe in ourselves. When we step beyond our limitations, we beco"}, "tags": [], "tweets": [], "movies": [], "links": ["https://drjoedispenza.com/collections/beginners-collection"], "authors": [], "publish_date": null}