{"result_id": "365003", "URL": "https://drjoedispenza.com/collections/in-person-events", "timestamp": "2023-04-25 18:23:56 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.shopify.com/shopifycloud/shopify/assets/no-image-50-3d8cc48bd078edcd544c8d60f929ed2d8800a3fc52e0f602e84b1767e392bfcd_pico.gif", "canonical": "https://drjoedispenza.com/collections/in-person-events", "encoding": null}, "image": null, "domain": "drjoedispenza.com", "title": "Events", "cleaned_text": "In this foundational course, Dr Joe gets you out of your comfort zone, pushes you beyond your limitations, and challenges your very perception of reality. Combining cutting-edge science, inspiring lectures, real-life case studies, and powerful meditations, the information provided in the Progressive Retreat can be applied to overcome challenges in any area of your life.\n\nBuilt upon the foundation of the Progressive Retreat, the Advanced Week Long Retreat is our most transformative experience. In the course of a week, Dr Joe demonstrates the limitless possibilities that exist when the mind, body, and spirit—of both an individual and a community—merge into one field of consciousness.\n\nFor those who want to have breakthrough experiences of reality and evolve their understanding of Dr Joe’s work, the Advanced Follow Up Retreat is designed to super charge a community of committed students to move more deeply into the mystery of the field.\n\nThe Unlimited Youth Retreat is an opportunity for the youngest members of our community to build a strong foundation in the work, to explore deeper aspects of themselves, and to bond with each other – as a strong group of future leaders – in a safe and sacred space.\n\nThis bundle features 2 foundational courses: the Online Intensive and Progressive. In the Online Intensive, Dr Joe teaches a new language and paradigm that ultimately helps students understand themselves, the world around them, and the power of directed consciousness to alter outcomes. In the Online Progressive, Dr Joe gets you out of your comfort zone, pushes you beyond your limitations, and challenges your very perception of reality. Combining cutting-edge science, inspiring lectures, real-life case studies, and powerful meditations, the information contained in the Progressive Retreat can be applied to overcome challenges throughout any arena of your life.\n\nEvery month, Dr Joe carves out an hour to connect with his community to answer questions about the application of this work. These subscription-based conversations are for anybody who is interested in transforming their life. These classes offer the perfect opportunity to ask Dr Joe questions about the application of this work, while hearing about stories from his own journey of personal transformation that you won't hear anywhere else.", "opengraph": {"site_name": "Unlimited with Dr Joe Dispenza ", "url": "https://drjoedispenza.com/collections/in-person-events", "title": "Events", "type": "product.group", "description": "Dr Joe holds a Bachelor of Science degree and is a Doctor of Chiropractic. His post graduate training includes the fields of neuroscience and neuroplasticity, quantitative electroencephalogram (QEEG) measurements, epigenetics, mind-body medicine, and brain/heart coherence. "}, "tags": [], "tweets": [], "movies": [], "links": ["https://unlimited-by-dr-joe-dispenza.myshopify.com/collections/progressive-retreats", "https://unlimited-by-dr-joe-dispenza.myshopify.com/collections/week-long-advanced-retreats", "https://unlimited-by-dr-joe-dispenza.myshopify.com/collections/advanced-follow-up", "/collections/unlimited-youth-retreats", "https://unlimited-by-dr-joe-dispenza.myshopify.com/products/online-progressive-and-intensive-workshop-bundle-by-dr-joe-dispenza-1", "https://unlimited-by-dr-joe-dispenza.myshopify.com/pages/dr-joe-live"], "authors": [], "publish_date": null}