{"result_id": "365009", "URL": "https://drjoedispenza.com/blogs/dr-joes-blog/hello-geniuses", "timestamp": "2023-04-25 18:24:00 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "//cdn.shopify.com/shopifycloud/shopify/assets/no-image-50-3d8cc48bd078edcd544c8d60f929ed2d8800a3fc52e0f602e84b1767e392bfcd_pico.gif", "canonical": "https://drjoedispenza.com/blogs/dr-joes-blog/hello-geniuses", "encoding": null}, "image": null, "domain": "drjoedispenza.com", "title": "An Update From Hemal H. Patel, PhD", "cleaned_text": "For those of you who don't know my dear friend and colleague Dr. Hemal Patel, I wanted to take a moment and introduce you to him. He is a Professor and the Vice Chair for Research in the Department of Anesthesiology at the University of California, San Diego. I thought it would be nice for him to update you on our progress with the most current and past research that we have been doing on all of you. So for those of you who have not met him yet, here is Dr. Hemal.\n\nAs the holidays are fast approaching and the year comes to a close, it seems like a good time to update our community on what’s been happening with our meditation research at the University of California, San Diego (UCSD). It’s astounding how many amazing discoveries we’ve made in such a short period of time—and there seems no end to the insights we expect to gain in the year(s) to come. I sometimes have to remind myself that I met Dr Joe only two years ago.\n\nAs a researcher and professor, in my line of work I talk to a lot of people throughout the day, and because I am so surprised and excited about what we are uncovering in Dr Joe’s community, I can’t help but share the findings. I usually start by showing them a tiny piece of data, and upon seeing their jaws drop, the conversation often turns into an hour-plus exploration of our research findings.\n\nThe most common reaction I receive from skeptics upon witnessing the approaches we’ve taken, the enormity of the data we’ve collected, and the results we’ve discovered is one of disbelief (myself included). Ultimately these conversations lead to acceptance—not to mention a curiosity to further explore the untold, wide-reaching benefits of meditation. As Dr Joe says, “Evidence is the loudest voice.”\n\nThe Evolution of Our Research\n\nAfter my initial Week Long experience in Orlando in April 2021, I have been fortunate to attend two Advanced Follow Up Retreats; one in Marco Island in September and one a few weeks ago in Denver. These events were a whirlwind of activity, experiences, and research—research that has allowed us to look at the impact of meditation upon molecular and biochemical changes. This is exciting because in this next evolution of our research, we observed that the Week Long Advanced Retreat has the potential to make a novice meditator look like an experienced meditator. The fact that this occurs in seven days is absolutely astonishing, not to mention a testament to the experience and dedication of Dr Joe’s students and community. It seems like the majority of beginners who attend a Week Long Advanced Retreat—whether they know it or not—are doing the work well.\n\nWhen I describe what I see at events to others, one observation comes up time and again—this is a community of committed individuals who show purpose and drive. When there is a lecture or a meditation, students are focused and all in, ready to stretch their minds and hearts to the next level. I am quite sure that when I lecture at UCSD, the majority of the class is watching the latest and greatest on Netflix, checking e-mail, or surfing the web.\n\nAt the Marco Island Advanced Follow Up Retreat, we asked the question, can long-time experienced meditators and the newly minted novices evolve their biology even further when pushed in an advanced environment? The study focused on about 15 experienced students and followed them over three days. The blood data is currently pending and we hope to have some findings to report in the new year.\n\nWhat was evident from the data we gathered onsite, however, was that many of these individuals had profound brain-activity changes during meditation—what we refer to as “pops.” These changes were not anomalies or rare events, as one would expect, but common and routine. Soon after these subjects experienced their “pop,” we took blood samples. If it’s anything like our preliminary finding with other students who had similar experiences, we expect to find something substantial in these biological samples. We are eagerly awaiting the results!\n\nAs the year comes to an end, we are about to close the chapter on the impact of meditation on SARS-CoV-2 infection. As promised, I will tell the amazing story of what we’ve discovered, leaving you with a cliff hanger that will be revealed at the Marco Island Week Long Advanced Retreat in January 2022. There will be a free Livestream during the event on Friday, January 14th. So mark your calendar.\n\nOver the last few months, I have been reporting on the Meditation-Covid survey results that many of you have participated in. The survey captured responses from ~3000 individuals representing 66 countries, and the results reveal some very unique characteristics about the Unlimited/Dr Joe meditation community. Before I begin, it’s important to note that the community is ethnically diverse (six of the seven continents are represented—maybe plan a week-long in Antarctica?), and even in the face of many morbidities, the community has an overwhelming positive view of their health, as well as an unwavering commitment to their meditation practice.\n\nAnalyzing this large data set over 63 geospatial units across the world where we had at least 10 respondents in a local region, we see a highly significant correlation (p<0.001) between the length of meditation experience and Covid-19 positive diagnosis. Individuals who have meditated more than six months had a more than 50% reduction in Covid-19 diagnosis relative to those who have never meditated. We also found a link between meditation “dosing,” meaning those who meditate once a day (large dose) vs. once a week (small dose) had less Covid-19 diagnosis. Even more intriguing is the fact that even if experienced meditators got Covid, they had less symptoms and recovered much faster. This is absolutely amazing to see across the globe.\n\nFor a number of retreats before and during Covid, we have been collecting blood from controls, new meditators, and experienced meditators, and we have developed tools to validate this population survey data at the molecular scale. These blood samples allow us to determine if there are certain specific factors which are induced by meditation that impact SARS-CoV-2 viral biology, and to correlate the findings to the effects we see on Covid-19 in the human population surveys.\n\nWe did this by making pseudoviruses that have the spike protein from SARS-CoV-2 but do not contain the rest of the virus. Instead, we packed these viruses with genetic material that makes a red protein. Seeing as the real virus uses the spike protein to bind and internalize into cells, this pseudovirus allows us to track the dynamics of SARS-CoV-2 infection. We also used lung airway epithelial cells (the first cell the virus would encounter if you breath it in) to perform “adoptive transfer” experiments. We did this because we were “adopting” the experience and factors created by meditation to these human cells that have never experienced meditation. We then exposed them to the blood plasma we collected from subjects at the events. Since we have pre/post plasma from controls, novices, and experienced meditators, we could look at a variety of controls and experimental conditions.\n\nWhat’s exciting is we found that the plasma from experienced meditators collected after a Week Long Advanced Retreat contained factors that prevented the pseudovirus from getting into the cells. We then tested this against the actual SARS-CoV 2 virus, as well as the delta variant, and found the same protection using the plasma from the experienced meditators.\n\nWe next determined that if we heated the sample, the effect was lost. Heating plasma, like cooking an egg, will result in denaturing (destroying) of proteins. If we spin the plasma at high forces (100,000g for 1 hr), we can collect all the solid particles and separate them from the fluid in plasma. We found that when we put just the fluid on the adoptive assay of lung cells, there was no protection from the virus. On the other hand, when we put the solid and more dense stuff that was collected from the bottom of the test tube on the adoptive assay of lung cells, the protection was present.­­ This led us to conclude that there is a specific protein or proteins from experienced meditators in the particulate component of plasma that creates this protection against SARS-CoV-2.\n\nNow for the cliffhanger…knowing that it was a protein, there are lots of tools we can use to identify the protein(s) of interest, so we literally went fishing. We performed an immunoprecipitation that uses the spike protein antibody as the bait and fished out from the controls, novices, and experienced meditators before and after meditation what the pseudo virus binds to in the plasma. Since the effect was seen in the experienced meditators post-meditation workshop, we focused on the content of the proteins we fished out from this group.\n\nWe have identified over 100 proteins that bind in the complex material and that may have potential interest; however, when looking through the different proteins, one caught my eye. We started looking directly at this protein and its biological properties in detail, which explain the data we see in the human population survey and the pseudovirus assay. We have since validated its effect in a pure system with gain and loss of function studies, as well as target validation. The identity of this protein will be revealed during the Livestream at the Marco Island Week Long Advanced Retreat on January 14th, 2022, along with the full manuscript of the entire data set. The exciting news is that we are publishing our first paper for scientific review close to the same time in January. We expect it to create a huge splash in the scientific research community.\n\nI thank you for reading this update. I thank you for your commitment to this community. I thank you for your generous encouragement, support, and interest in this research. I have enjoyed meeting so many of you at events and appreciate the thoughtful questions and ideas you bring. If you will be attending Marco Island in January 2022, I look forward to seeing you there, along with our talented research team. We have so many interesting projects planned.\n\nTake care and keep up the meditations to become the new you.\n\nNote: Encephalon will be sending details on how to join the free Livestream on January 14th closer to the date. Information to join will be posted on the Unlimited/Dr Joe Dispenza website, on social media platforms and sent via email. Please mark your calendars and stay tuned.\n\nIf you liked this blog post and want to learn more, Dr. Hemal reveals additional details about the research in the News & Updates section of our website. Scroll down our Scientific Research page to read the latest entry under Research News & Updates.\n\n \n\n You can also watch Dr. Hemal's latest presentation at our July 2021 Denver Week Long Advanced Retreat. And if you would like to venture further down the rabbit hole, watch Dr. Nick Dogris and Dr. Tiff Thompson’s brain scan findings at that same retreat.\n\n \n\n If you want to support the research, and make a tax-deductible contribution, visit Give to Research.", "opengraph": {"site_name": "Unlimited with Dr Joe Dispenza ", "url": "https://drjoedispenza.com/blogs/dr-joes-blog/hello-geniuses", "title": "An Update From Hemal H. Patel, PhD", "type": "article", "description": "For those of you who don't know my dear friend and colleague Dr. Hemal Patel, I wanted to take a moment and introduce you to him. He is a Professor and the Vice Chair for Research in the Department of Anesthesiology at the University of California, San Diego. I thought it would be nice for him to update you on our progress with the most current and past research that we have been doing on all of you. So for those of you who have not met him yet, here is Dr. Hemal.", "image": "http://cdn.shopify.com/s/files/1/0430/1144/0801/articles/Blog_12-03-2021_Dr_Hemal_Patel_2_1200x1200.png?v=1638480615", "image:secure_url": "https://cdn.shopify.com/s/files/1/0430/1144/0801/articles/Blog_12-03-2021_Dr_Hemal_Patel_2_1200x1200.png?v=1638480615"}, "tags": [], "tweets": [], "movies": [], "links": ["https://drjoedispenza.com/pages/scientific-research", "https://drjoedispenza.com/pages/scientific-research#videos", "https://drjoedispenza.com/pages/scientific-research#videos", "https://www.givetoresearch.com/"], "authors": [], "publish_date": null}