{"result_id": "366026", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/tn-looking-at-free-vaccination-in-pvt-hospitals-with-csr-support", "timestamp": "2023-04-25 18:24:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/tn-looking-at-free-vaccination-in-pvt-hospitals-with-csr-support", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "TN looking at free vaccination in pvt hospitals with CSR support", "cleaned_text": "Chennai, July 20 (IANS) Tamil Nadu Health Minister Ma Subramanian said on Tuesday that the state government is exploring the possibilities of providing free Covid vaccine doses to the people through private hospitals and reimbursing the hospitals by using Corporate Social Responsibility (CSR) funds.\n\nSpeaking to reporters in Walayar on the Tamil Nadu-Kerala border, Subramanian said that the government would hold meetings with private hospitals that are empaneled under the state government's Comprehensive Insurance Scheme as well as with various private companies and other institutions.\n\nThe minister said that the private hospitals are not using the vaccines fully, adding that while the Central government is buying 75 per cent of the vaccines manufactured in the country, 25 per cent are earmarked for private hospitals.\n\n\"The private hospitals are not using the vaccines earmarked to them fully. As the Covid-19 situation has improved, the government is exploring the possibility of using CSR funds for free vaccination at private hospitals,\" Subramanian told IANS.\n\nThe minister said that Tamil Nadu requires 12 crore doses to vaccinate its 6 crore eligible population above 18 years of age, adding that it has already administered 1.82 crore doses out of the 1.86 crore doses it has received so far.\n\nSubramanian along with the Municipal Administration Minister R. Sakkarpani, Health Secretary J. Radhakrishnan and Coimbatore District Collector G.S. Sameeran visited the houses on the Walayar border to check the control measures against mosquito breeding.\n\nIt is to be noted that Zika virus cases have been reported in neighbouring Kerala following which the Tamil Nadu government has taken measures to prevent the breeding of mosquitos, paying special attention to areas bordering Kerala.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}