{"result_id": "366031", "URL": "https://nirogstreet.com/blog/coronavirus-updates/china-hands-over-2nd-batch-of-covid-19-vaccine-to-egypt", "timestamp": "2023-04-25 18:24:20 CEST+0200", "meta": {"description": "China handed over the second batch of Covid-19 vaccine donation to Egypt.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/china-hands-over-2nd-batch-of-covid-19-vaccine-to-egypt", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "China hands over 2nd batch of Covid-19 vaccine to Egypt", "cleaned_text": "Cairo- China handed over the second batch of Covid-19 vaccine donation to Egypt.\n\nChinese Ambassador to Egypt Liao Liqiang and Egyptian Health Minister Hala Zayed held a press conference at the headquarters of the health ministry, during which Liao signed a certificate to confirm the handover with Egyptian Assistant Health Minister for Financial and Administrative Affairs Wael El Saaey, Xinhua news agency reported.\n\nChina has given great support and assistance to Egypt through the joint efforts of the Chinese government and enterprises, reflecting the friendship between the leaders of the two countries, and the strong relations between Egypt and China, Zayed told the press conference.\n\n\"The Chinese Covid-19 vaccine is safe, effective and has played an important role in Egypt's vaccination system. Egypt is willing to continue to cooperate with China in various fields such as vaccines, epidemic prevention and control,\" Zayed said.\n\nFor his part, the Chinese ambassador said that when Egypt is most in need, China has always provided sincere help as soon as possible, which is a profound portrayal of the in-depth development of the China-Egypt comprehensive strategic partnership.\n\nThe first batch of Covid-19 vaccines provided by China for Egypt and the General Secretariat of the Arab League arrived in Cairo on February 23. (IANS)", "opengraph": {"title": "China hands over 2nd batch of Covid-19 vaccine to Egypt", "description": "China handed over the second batch of Covid-19 vaccine donation to Egypt.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/china-hands-over-2nd-batch-of-covid-19-vaccine-to-egypt", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2020/10/13/b32572c1b1926d76d80eaf6e67f3dd6c.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": ["covid-19", "covid-19 vaccine"], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}