{"result_id": "366001", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/no-discrimination-against-any-state-in-vaccine-allocation:-centre", "timestamp": "2023-04-25 18:24:01 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/no-discrimination-against-any-state-in-vaccine-allocation:-centre", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "No discrimination against any state in vaccine allocation: Centre", "cleaned_text": "New Delhi, Jan 13 (IANS) The Central government on Wednesday said that 1.65 crore doses of Covishield and Covaxin vaccines have been allocated to the states and Union Territories for health care workers, without any discrimination.\n\nThe vaccines have been transported to far corners of the country, three days before the commencement of the nation-wide vaccination drive. The government plans to vaccinate nearly 30 crore people in the first phase of the drive, including one crore health care workers.\n\n\"Full initial procurement amount of 1.65 crore doses of Covishield and Covaxin vaccines have been allocated to all states and UTs in proportion of health care workers database. Therefore, there is no question of discrimination against any state in allocation of vaccine doses,\" the Union Health Ministry said.\n\n\"This is the initial lot of supply of vaccine doses and would be continuously replenished in the weeks to come. Therefore, any apprehension being expressed on account of deficient supply is totally baseless and unfounded.\"\n\nStates have been advised to organize vaccination sessions taking into account 10 per cent reserve and wastage doses and average of 100 vaccinations per session per day.\n\n\"Therefore, any undue haste on the parts of states to organise unreasonable numbers of vaccination per site per day is not advised.\"\n\nIn wake of this statement, a top government source told IANS\" \"Launch day session sites for whole country have been reduced from 5,000 to 2,934 and for Delhi, reduced from 89 to 75 now.\"\n\nThe states and union territories have also been advised to increase the number of vaccination session sites that would be operational every day in a progressive manner as the vaccination process stabilises and moves forward.\n\nOn Tuesday, the Union Health Ministry said that 1.1 crore Covishield and 55 lakh Covaxin doses have been procured at the cost of Rs 200 and Rs 206 per dose, respectively.\n\nThe roll-out of vaccine will provide priority to the healthcare workers and frontline workers who are estimated to be around three crore, followed by those above 50 years of age and the under-50 population groups with co-morbidities numbering around 27 crore.\n\nOn January 3, two vaccines - Bharat Biotech's Covaxin and Oxford-AstraZeneca's Covishield manufactured by Serum Institute of India were approved for 'restricted emergency use'. Several other vaccines are in the pipeline and are conducting trials.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}