{"result_id": "366025", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/novel-malaria-vaccine-shows-77--efficacy", "timestamp": "2023-04-25 18:24:17 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/novel-malaria-vaccine-shows-77--efficacy", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Novel malaria vaccine shows 77% efficacy", "cleaned_text": "London, April 23 (IANS) A novel malaria vaccine developed by the University of Oxford has demonstrated high-level efficacy of 77 per cent in its Phase 2 trials.\n\nThe Phase 2 randomised, controlled, double-blind trial was conducted on 450 participants, aged 5-17 months at the Clinical Research Unit of Nanoro (CRUN)/Institut de Recherche en Sciences de la Sante (IRSS) in Burkina Faso.\n\nThe participants were split into three groups, with the first two groups receiving the R21/Matrix-M (with either a low dose or high dose of the Matrix-M adjuvant) and the third, a rabies vaccine as the control group. Doses were administered from early May 2019 to early August 2019, largely prior to the peak malaria season.\n\nThe researchers report a vaccine efficacy of 77 per cent in the higher-dose adjuvant group, and 71 per cent in the lower dose adjuvant group, over 12 months of follow-up, with no serious adverse events related to the vaccine noted.\n\nFollowing these results, the Phase 2b trial was extended with a booster vaccination administered prior to the next malaria season one year later.\n\n\"These new results support our high expectations for the potential of this vaccine, which we believe is the first to reach the WHO's goal of a vaccine for malaria with at least 75 per cent efficacy,\" said the team including Adrian Hill, Professor of Vaccinology at the University of Oxford.\n\n\"With the commitment by our commercial partner, the Serum Institute of India, to manufacture at least 200 million doses annually in the coming years, the vaccine has the potential to have a major public health impact if licensure is achieved,\" Hill said.\n\nThe researchers, in collaboration with Serum Institute of India Private Ltd, and Novavax Inc, have now started recruitment for a Phase 3 trial to assess large-scale safety and efficacy in 4,800 children, aged 5-36 months, across four African countries.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}