{"result_id": "366019", "URL": "https://nirogstreet.com/blog/coronavirus-updates/vaccine-profile-frames--stickers-gain-popularity-on-fb--instagram", "timestamp": "2023-04-25 18:24:13 CEST+0200", "meta": {"description": "New Delhi, May 12 (IANS) More than 5 million people globally have used Facebook profile frames in support of vaccination and since April, over 7 million users on Instagram have used Covid-19 vaccine stickers to share that they got vaccinated or share their support for vaccines.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/vaccine-profile-frames--stickers-gain-popularity-on-fb--instagram", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Vaccine profile frames, stickers gain popularity on FB, Instagram", "cleaned_text": "New Delhi, May 12 (IANS) More than 5 million people globally have used Facebook profile frames in support of vaccination and since April, over 7 million users on Instagram have used Covid-19 vaccine stickers to share that they got vaccinated or share their support for vaccines.\n\nFacebook said in a statement on Tuesday that over the course of the pandemic, it has removed more than 16 million pieces of content from its apps for breaking rules on COVID-19 and vaccine misinformation.\n\n\"For certain content that does not break these rules, but could still discourage someone from getting vaccinated, we reduce its distribution on Facebook and remove it from recommendations on Facebook and Instagram,\" the company added.\n\nSince January, Facebook has given more than $30 million in ad credits to help governments, NGOs and other organisations reach people with COVID-19 vaccine information and other important messages.\n\n\"These information campaigns resulted in an estimated 10 billion ad impressions globally. We're also adding authoritative information to posts about vaccines on Facebook and Instagram that link to the COVID-19 Information Center for more resources,\" the company informed.\n\nIn the US, vaccine acceptance has been increasing steadily since January, increasing nearly 10 per cent among all adults.\n\n\"We observed a particularly large increase in vaccine acceptance within certain populations in the US. Vaccine acceptance increased 26 per cent among Black adults and 14 per cent among Hispanic adults,\" Facebook said.\n\n\"In April, among adults who intend to get vaccinated (but have not yet), 36 per cent felt uninformed about how to get a vaccine and only 22 per cent reported that they have an appointment,\" said Facebook.", "opengraph": {"title": "Vaccine profile frames, stickers gain popularity on FB, Instagram", "description": "New Delhi, May 12 (IANS) More than 5 million people globally have used Facebook profile frames in support of vaccination and since April, over 7 million users on Instagram have used Covid-19 vaccine stickers to share that they got vaccinated or share their support for vaccines.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/vaccine-profile-frames--stickers-gain-popularity-on-fb--instagram", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2019/02/03/834f3b8c1e03550d3a98729783555531.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}