{"result_id": "366002", "URL": "https://nirogstreet.com/blog/coronavirus-updates/under-30s-in-britain-to-be-offered-alternative-to-astrazeneca", "timestamp": "2023-04-25 18:24:03 CEST+0200", "meta": {"description": "London, April 8 (IANS) Britons aged 18-29 will be offered an alternative to the Oxford-AstraZeneca vaccine amid concerns over its possible link with reported rare cases of blood clots, the British government's vaccination advisory body said.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/under-30s-in-britain-to-be-offered-alternative-to-astrazeneca", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Under-30s in Britain to be offered alternative to AstraZeneca", "cleaned_text": "London, April 8 (IANS) Britons aged 18-29 will be offered an alternative to the Oxford-AstraZeneca vaccine amid concerns over its possible link with reported rare cases of blood clots, the British government's vaccination advisory body said.\n\nThe announcement by the Joint Committee on Vaccination and Immunisation (JCVI) on Wednesday follows a review of the Oxford jab by the Medicines and Healthcare products Regulatory Agency (MHRA), Xinhua news agency reported.\n\nThe MHRA said the side-effects of the AstraZeneca vaccine were extremely rare and the vaccine's effectiveness is proven, adding that the benefits of taking the vaccine are still very favourable for the vast majority.\n\nHowever, it conceded the new approach is more finely balanced for younger people because the risk from coronavirus is much lower.\n\nJune Raine, chief executive of the MHRA, said at a press briefing that more than 20 million doses of the AstraZeneca vaccine have been given in Britain up to March 31.\n\nAccording to Raine, 79 cases of rare blood clots were reported in Britain, among them 51 women and 28 men aged 18 to 79 years old.\n\nAll these 79 cases occurred after the first dose and 19 people sadly died, said Raine.\n\nShe said the risk of this kind of side effect was about four in one million to those who receive the vaccine.\n\n\"This is extremely rare and the balance of benefits and known risks of the vaccine is still very favourable for the vast number of people,\" she added.\n\nWhile clinical trials allow the scientists to assess relatively common effects, rare side effects can only be identified when vaccines are used at scale, she said.\n\n\"The evidence is firming up\" but \"more work is needed to establish beyond all doubt\" the vaccine has caused extremely rare blood clots, she added.\n\nWei Shen Lim, chairman of the JCVI, said those who have received their first dose of the AstraZeneca vaccine should continue to be offered the second dose of the same vaccine.\n\n\"We are not advising a stop to any vaccination for any individual in any age group,\" he said.\n\nThe advice to offer an alternative to the AstraZeneca vaccine for younger age groups was \"really out of the utmost caution\" rather than \"any serious safety concerns,\" he added.\n\nAlso on Wednesday, the European Medicines Agency (EMA) confirmed that the occurrence of blood clots with low blood platelets are strongly associated with the administration of AstraZeneca Covid-19 vaccine, but should be still listed as very rare side effects.\n\nIn its latest assessment, EMA experts told the media that the reported combination of blood clots and low blood platelets is very rare, and the overall benefits of the vaccine in preventing Covid-19 outweigh the risks of side effects.\n\nEMA's Pharmacovigilance Risk Assessment Committee made the conclusion after carrying out an in-depth review of the more than 80 cases reported in the European Union (EU) database.\n\nCurrently, Britain is also rolling out the Pfizer jab, and the first doses of the Moderna vaccine were administered in Wales on Wednesday.\n\nMore than 31.6 million people in Britain have been given the first jab of a coronavirus vaccine, according to the official figures.\n\nTo bring life back to normal, countries such as Britain, China, Russia, the United States as well as the EU have been racing against time to roll out coronavirus vaccines.", "opengraph": {"title": "Under-30s in Britain to be offered alternative to AstraZeneca", "description": "London, April 8 (IANS) Britons aged 18-29 will be offered an alternative to the Oxford-AstraZeneca vaccine amid concerns over its possible link with reported rare cases of blood clots, the British government's vaccination advisory body said.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/under-30s-in-britain-to-be-offered-alternative-to-astrazeneca", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2021/03/16/2c89129cdbb06ce3740cac2250b09d33.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}