{"result_id": "366034", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/why-people-are-hesitant-towards-vaccination-", "timestamp": "2023-04-25 18:24:22 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/why-people-are-hesitant-towards-vaccination-", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Why people are hesitant towards vaccination?", "cleaned_text": "Warsaw, Aug 1 (IANS) Vaccine deniers are mostly led by a generalised negative attitude to vaccines, according to a study.\n\nVaccine deniers believe that vaccines lead to serious negative side effects, don't protect the individual and the society against infectious diseases, and are not sufficiently tested before introduction.\n\nFurther, they are convinced that anti-vaccination leaders are better informed about vaccines than physicians, and that it is rather the former that act in the public interest.\n\nA team led by the Jagiellonian University and the SWPS University of Social Sciences and Humanities in Wroclaw, Poland conducted a study using data from a total of 492 participants, who have self-identified as either ambiguous towards or opposing vaccination.\n\nThe arguments were collected during a conference, where people opposing the vaccination presented their stand on the subject.\n\nCuriously, even though they often reported their stance to be founded in their own or observed negative experience with vaccines, when asked about their reasoning, they were rather vague in their explanations.\n\nMany reported that they didn't remember the source of information, while others attributed autism, allergies or children being sick to vaccines, despite the missing evidence of correlation.\n\nSuch instances can be explained with people's tendency to remember negative reports, even if those have simply been read online.\n\n\"Confirmation bias consists of an individual actively seeking information consistent with their pre-existing hypothesis, and avoiding information indicative of alternative explanations,\" said the researchers led by Dr. Katarzyna Stasiuk.\n\n\"Therefore, a pre-existing negative attitude toward vaccines may cause individuals to interpret negative symptoms as consequences of vaccines, further reinforcing the negative attitude,\" they added.\n\nThe study is published in the peer-reviewed scholarly journal Social Psychological Bulletin.\n\nMeanwhile, the vaccine-ambiguous participants in the survey were mostly confident in the efficacy of vaccines, as well as them being properly researched.\n\nHowever, they were still susceptible to the anti-vaccine movement's statements about side effects and the \"Big Pharma conspiracy\".\n\nMoreover, if presented with well-prepared arguments, they are likely to become vaccine deniers.\n\nThe team suggests that they need to be presented with prosocial arguments about why medical professionals recommend vaccines, in order to strengthen the positive points of their attitude.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}