{"result_id": "366051", "URL": "https://nirogstreet.com/blog/coronavirus-updates/eu-likely-to-vaccinate-70--adult-population-by-end-of-july", "timestamp": "2023-04-25 18:24:32 CEST+0200", "meta": {"description": "Brussels, April 24 (IANS) European Commission President Ursula von der Leyen brought forward the expected date for the European Union (EU) to vaccinate its 70 per cent of adult population by nearly two months.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/eu-likely-to-vaccinate-70--adult-population-by-end-of-july", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "EU likely to vaccinate 70% adult population by end of July", "cleaned_text": "Brussels, April 24 (IANS) European Commission President Ursula von der Leyen brought forward the expected date for the European Union (EU) to vaccinate its 70 per cent of adult population by nearly two months.\n\nSpeaking after visiting Pfizer's vaccine plant in Puurs, Belgium, where the main vaccine used so far in the EU has been produced, von der Leyen said the goal could be achieved by the end of July instead of late September as had been previously predicted, Xinhua news agency reported on Friday.\n\n\"With the enormous efforts of BioNTech-Pfizer and the acceleration of their vaccine deliveries, I am now confident that we will have sufficient doses to vaccinate 70 per cent of the adult population in the European Union already in July,\" she said, commending the two joint partners as \"strong and reliable suppliers.\"\n\nShe expressed her satisfaction that \"the EU's vaccination campaign is on track,\" passing the mark of 150 million doses delivered and 123 million vaccinations deployed. This made the bloc \"among the top three in terms of Covid-19 vaccinations worldwide, after the United States and China.\"\n\nShe said her commission was close to concluding a deal with BioNTech and Pfizer to supply 1.8 billion additional vaccine doses for 2022 and 2023.\n\n\"We will conclude it in the next days. It will secure the doses necessary to give booster shots to increase our immunity against the virus. It will provide vaccines adapted to escape variants that no longer respond to the vaccines,\" she told a press conference.\n\nVon der Leyen said the European Medicines Agency had approved the increase of the site's production capacity by a further 20 per cent, making it one of the biggest vaccine fill and finish sites in Europe.", "opengraph": {"title": "EU likely to vaccinate 70% adult population by end of July", "description": "Brussels, April 24 (IANS) European Commission President Ursula von der Leyen brought forward the expected date for the European Union (EU) to vaccinate its 70 per cent of adult population by nearly two months.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/eu-likely-to-vaccinate-70--adult-population-by-end-of-july", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2020/12/25/0ad7df9dcf2dad1cabfe6d096236de35.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}