{"result_id": "366005", "URL": "https://nirogstreet.com/blog/coronavirus-updates/vp-seeks-expediting-development-of-covid-vaccine-for-children", "timestamp": "2023-04-25 18:24:04 CEST+0200", "meta": {"description": "Hyderabad, July 30 (IANS) Vice President, M. Venkaiah Naidu on Friday urged the scientific fraternity to focus on expediting the development of Covid vaccine for children and for according priority to protection of children from the virus.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/vp-seeks-expediting-development-of-covid-vaccine-for-children", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "VP seeks expediting development of Covid vaccine for children", "cleaned_text": "Hyderabad, July 30 (IANS) Vice President, M. Venkaiah Naidu on Friday urged the scientific fraternity to focus on expediting the development of Covid vaccine for children and for according priority to protection of children from the virus.\n\nNaidu emphasized that the vaccination drive against Covid-19 should become a pan-India 'Jan Andolan' and appealed to the people to immunise themselves by taking the required doses of the vaccine.\n\nAddressing scientists and staff of the Bharat Biotech International Ltd after a visit to its plant at Genome Valley in Hyderabad, he said that there is no room for vaccine hesitancy. He urged everyone to get vaccinated saying there is no other more powerful way to protect \"ourselves and people around us\".\n\nCommending the development of a nasal Covid vaccine as an important initiative, he said this can reduce vaccine hesitancy and improve the ease of administering.\n\nAsserting that advantages of vaccination far outweigh the perceived drawbacks, Naidu said that this message should be driven home loud and clear to every nook and corner of the country. \"It is now clear that vaccination is preventing hospitalisation and severe disease when infected,\" he added.\n\nCautioning people against becoming complacent by the temporary decline in Covid-19 cases, he said: \"Let us be responsible citizens and not behave in a careless manner by violating Covid protocols\". He appealed to the people to continue with masking, physical distancing and personal hygiene.\n\nThe Vice President also urged the leaders of various political parties and their followers to follow Covid-appropriate behaviour. \"It is the duty of each one of us to act responsibly. We cannot afford to invite the third wave,\" he warned.\n\nObserving that the constantly mutating virus poses unforeseen challenges and forces us to find solutions that will save lives and protect livelihoods, Naidu said that vaccine supplies must be stepped up rapidly and vaccines must be administered to all as quickly as possible.\n\nHe, however, expressed confidence that the immunization drive would pick up pace in the months ahead and said the government intends to vaccinate all eligible adults by the year-end.\n\nLauding the scientists at Bharat Biotech for developing an effective vaccine in a very short time frame, he said he appreciate the optimism and dynamism that Dr Krishna Ella and Dr Suchitra Ella have brought to this organisation.\n\nNaidu said that a few other Indian companies have also raced against time to produce Covid-19 vaccines, while some more are in the pipeline.\n\nSaying India has earned global appreciation as the \"pharmacy of the world\", he said that it supplying over 50 per cent of vaccines and is the largest producer of generic drugs. Indian pharma firms are also supplying over 80 percent of the anti-retroviral drugs globally to combat AIDS.\n\nHe noted that India's domestic pharmaceutical market, estimated at $42 billion in 2021, is likely to reach the $120-130 billion by 2030.\n\nExpressing his happiness that Hyderabad has emerged as the hub for vaccines and bulk drugs, he said that he was pleased to note that it has also turned into a biotechnology hub with the Genome Valley driving growth in this sector.\n\nHe said that it was heartening that one of the recently-sanctioned Central Drug Laboratories has been located in Hyderabad.\n\nThe Vice President, who went around the facilities, complimented the company for contributing significantly towards immunisation programmes in India and abroad.\n\nTelangana Home Minister, Mohammed Mahmood Ali, BBIL Chairman & Managing Director Krishna Ella, Joint Managing Director, Suchitra Ella, Director, Dr V. Krishna Mohan and the heads of various divisions of Bharat Biotech attended the event.", "opengraph": {"title": "VP seeks expediting development of Covid vaccine for children", "description": "Hyderabad, July 30 (IANS) Vice President, M. Venkaiah Naidu on Friday urged the scientific fraternity to focus on expediting the development of Covid vaccine for children and for according priority to protection of children from the virus.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/vp-seeks-expediting-development-of-covid-vaccine-for-children", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/https://iansphoto.in/web/photoimages_new/400/2021/06/29/4caa2e5159b96794babc65acc6a26535.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}