{"result_id": "366035", "URL": "https://nirogstreet.com/blog/coronavirus-updates/vaccine-drive-to-be-affected-in-tamil-nadu-due-to-shortage", "timestamp": "2023-04-25 18:24:23 CEST+0200", "meta": {"description": "Chennai, July 6 (IANS) The vaccination drive in many districts of Tamil Nadu is likely to be affected due to the shortage of vaccines. Health department officials informed that on Monday night there were only 50,000 doses of vaccine left in the central pool.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/vaccine-drive-to-be-affected-in-tamil-nadu-due-to-shortage", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Vaccine drive to be affected in Tamil Nadu due to shortage", "cleaned_text": "Chennai, July 6 (IANS) The vaccination drive in many districts of Tamil Nadu is likely to be affected due to the shortage of vaccines. Health department officials informed that on Monday night there were only 50,000 doses of vaccine left in the central pool.\n\nThe public health department has already communicated to the union ministry for health and family welfare to send fresh doses to the state as the next quota of vaccine will be available only by July 11.\n\nThe officials are planning to provide vaccines only for those who are taking the second dose as several districts have an extreme shortage. A senior official with the state public health department told IANS that the Greater Chennai Corporation is also facing a shortage of vaccines.\n\nWith the department conducting massive awareness drives and several celebrities including movie stars, TV stars, sportspersons including cricketers exhorting the public to get vaccinated, there has been a high demand for doses, and in several districts across the state long queues were seen at vaccination centres.\n\nThe state of Tamil Nadu, according to health officials vaccinated 1,37,482 people on Monday alone and to date it has vaccinated 1.58 crore people. The July allocation for the state was 71 lakh but as of now, only 10 lakh vaccines have arrived in the state.\n\nHealth minister Ma Subramanian had claimed that the state has the capacity to vaccinate 8 lakh people, a day but owing to the shortage of vaccine supply, the state was not able to vaccinate more people.\n\nIt is to be noted that Tamil Nadu has started vaccinating pregnant women as well as lactating mothers recently and in districts like Nilgiris, it has achieved 100 per cent vaccination for all the eligible population including the tribals.\n\nIn another development, Madurai district is short of Covaxin supply since the past one week leaving those who have taken the first jab of this vaccine, anxious. The first and the second doses of the vaccine are taken at an interval of 4 to 6 weeks.\n\nDr Manoj Kumaraswamy, an epidemiologist at Madurai while speaking to IANS said, \"There is a shortage of vaccines here and Covaxin is to be taken in a gap of 4 to 6 weeks and many people are trying frantically for their second dose. We are expecting supply to resume soon.\"", "opengraph": {"title": "Vaccine drive to be affected in Tamil Nadu due to shortage", "description": "Chennai, July 6 (IANS) The vaccination drive in many districts of Tamil Nadu is likely to be affected due to the shortage of vaccines. Health department officials informed that on Monday night there were only 50,000 doses of vaccine left in the central pool.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/vaccine-drive-to-be-affected-in-tamil-nadu-due-to-shortage", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2021/07/06/2b04d819057f9639556719a9fa6d55cf.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}