{"result_id": "366006", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/european-health-bodies-strongly-recommend-full-vaccination", "timestamp": "2023-04-25 18:24:05 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/european-health-bodies-strongly-recommend-full-vaccination", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "European health bodies strongly recommend full vaccination", "cleaned_text": "Brussels, Aug 5 (IANS) The European Medicines Agency (EMA) and the European Centre for Disease Prevention and Control (ECDC) have strongly recommended complete Covid-19 vaccination as a key to protect against the most serious effects of the virus, including those caused by the Delta variant.\n\nWith the increasing circulation of the Delta variant in the European Union (EU) and European Economic Area (EEA), the two agencies on Wednesday encouraged those who are eligible but have not yet been vaccinated to start the immunization program \"in a timely manner\", reports Xinhua news agency.\n\n\"While the available vaccines are highly effective in protecting people against severe Covid-19, until higher proportions of the population are immunized, the risk is not beyond us,\" ECDC's Chief Scientist, Mike Catchpole, said.\n\nThe organisations emphasized that full vaccination with any of the approved vaccines \"offers a high level of protection against severe disease and death caused by SARS-CoV-2, including variants, such as Delta\".\n\nHowever, no vaccine is 100 per cent effective, and breakthrough infections in vaccinated people will continue as long as the virus continues to circulate.\n\nThe agencies therefore recommended that everyone should adhere to national regulations, and continue to take measures such as wearing masks and respecting social distancing, even those who are fully vaccinated.\n\nThe EU has reached its target of ensuring that at least 70 pe rcent of the adult population had received at least one dose of vaccine by the end of July, but the member states hope to see this percentage increase to contain the spread of new variants.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}