{"result_id": "366049", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/44-crore-more-vaccine-doses-ordered-by-health-ministry", "timestamp": "2023-04-25 18:24:31 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/44-crore-more-vaccine-doses-ordered-by-health-ministry", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "44 crore more vaccine doses ordered by Health Ministry", "cleaned_text": "New Delhi, June 8 (IANS) After the Prime Minister announced free vaccination, the Ministry of Health and Family Welfare has issued a fresh order for 25 crore doses of Covishield and 19 crore doses of Covaxin.\n\nThese 44 crore (25+19 cr) doses of COVID-19 vaccines will be available till December 2021, starting now.\n\n\"Additionally, 30% of the advance for procurement of both the Covid vaccines has been released to Serum Institute of India and Bharat Biotech,\" said a statement from the ministry.\n\nWith the aim to further universalize the countrywide vaccination drive, all citizens above 18 years of age can receive the COVID-19 vaccine doses free of cost at government health facilities from June 21.\n\nIn the immediate follow-up of the Prime Minister's announcement of these changes in the Guidelines of National COVID Vaccination programme on Monday, the Union Health Ministry has placed an order with Serum Institute of India for 25 crore doses of Covishield and with Bharat Biotech for 19 crore doses of Covaxin.\n\nThe Government of India has been supporting the efforts of the States and UTs for an effective vaccination drive under the 'Whole of Government' approach since January 16 this year. Based on the various representations received by the Union Government, the vaccination for all adults above 18 years of age was opened with the onset of Liberalized Phase III of India's vaccination strategy on May 1, 2021.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}