{"result_id": "366052", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/astrazeneca-vaccine-safe-for-canadians-over-65:-panel", "timestamp": "2023-04-25 18:24:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/astrazeneca-vaccine-safe-for-canadians-over-65:-panel", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "AstraZeneca vaccine safe for Canadians over 65: Panel", "cleaned_text": "Ottawa, March 17 (IANS) Canada's National Advisory Committee on Immunization (NACI) announced on Tuesday that the Oxford-AstraZeneca Covid-19 vaccine is both safe and effective for people over age 65.\n\nThe committee said real-world evidence has demonstrated that the vaccine is safe and effective in older people, particularly against severe illness from Covid-19 and hospitalisation.\n\nThe announcement is different from a recommendation made by the NACI itself on March 1, when its panel of vaccine experts said AstraZeneca hadn't included enough people over the age of 65 in its clinical trials, the Xinhua news agency reported.\n\nThe committee said that three \"real-world effectiveness studies\" helped inform its decision to change the recommendations, including evidence from Britain, which has been administering the vaccine to people over 65 years and older since January.\n\nThe NACI initially recommended that people over the age 65 should be prioritised for the Pfizer-BioNTech and Moderna vaccines instead of the AstraZeneca, because of \"limited information on the efficacy of this vaccine in this age group.\"\n\nOn Monday, Germany, France, Italy and Spain joined a list of European countries to suspend use of the AstraZeneca vaccine following reports of blood clots in some recipients.\n\nAstraZeneca has said that a review of 17 million people who have received their vaccine in Europe and Britain found no evidence of an elevated blood clotting risk.\n\nOn Monday, Prime Minister Justin Trudeau assured Canadians that the AstraZeneca vaccine is safe for use.\n\n\"Health Canada and our experts and scientists have spent an awful lot of time making sure every vaccine approved in Canada is both safe and effective,\" Trudeau said.\n\nHealth Canada approved the AstraZeneca vaccine for use in anyone 18 years or older in late February. It became the third Covid-19 shot green-lighted in Canada, joining vaccines from Pfizer-BioNTech and Moderna.\n\nCanada's initial 500,000 doses of the AstraZeneca Covid-19 vaccine have been manufactured by the Serum Institute of India.\n\nHealth Canada said that the AstraZeneca vaccine has an efficacy of 62.1 per cent among people 18 to 64 years old.\n\nIn total, Canada is reportedly scheduled to receive 23.9 million doses of the vaccine.\n\nAs of Monday evening, more than 3.1 million Covid-19 vaccine doses were administered across the country, meaning approximately 4.2 per cent of the Canadian population has been immunised against the virus.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}