{"result_id": "366039", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/18--could-not-find-a-covid-dose-when-they-went-for-vaccination", "timestamp": "2023-04-25 18:24:25 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/18--could-not-find-a-covid-dose-when-they-went-for-vaccination", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "18% could not find a Covid dose when they went for vaccination", "cleaned_text": "However, amid the 2nd wave of Covid cases across the country, India is now reporting over 1,50,000 daily cases far surpassing the peak of 97,400 it hit in 2020.\n\nAs India expands its vaccination drive with vaccines now being made available to all above the age of 45 and plans to inoculate 50 lakh people each day, leaders of some states in India are reporting a vaccine shortage.\n\nCitizens from locations like Mumbai and parts of the Delhi National Capital region have also shared their feedback on LocalCircles suggesting that some hospitals have boards indicating that they either have limited doses or no doses available on a particular day. However, the Health Minister Harsh Vardhan has indicated that the country has enough doses.\n\nTo understand what people are exactly facing on the ground, LocalCircles has conducted a survey to gauge if people who have gone to the vaccination centers have in fact experienced this shortage as claimed by some. The survey received more than 24,000 responses from citizens located in 255 districts of India.\n\n18 per cent citizens or someone in their social network who could not find a vaccine dose when they went for vaccination in the first 10 days of April.\n\nIndia has administered over 10 crore vaccine doses to its citizens since the immunization drive began on January 16 this year\n\nIt has also supplied more than 481 lakh doses of Covid-19 to more than 80 countries across the world under the 'vaccine maitri' program as well as under direct supply agreements by the Serum Institute of India.\n\nAs per the survey, however, the worrying factor is that amidst the spike in Covid cases across India, media ground reports from states are suggesting that just over five days of vaccine stocks are currently remaining, while an additional week's supply is in the pipeline.\n\nIn states like Andhra Pradesh and Bihar, current stocks are for less than two days and in others, like Odisha have barely enough for four days. The spokesperson of the Ministry of External Affairs has said that India's move on the export of vaccines would be done keeping in mind the domestic requirements, the survey said.\n\nAs posts and comments were received from people across India about vaccination centers displaying their current stock level as well as some people returning from vaccination centers without getting inoculated, the survey sought to understand from citizens if they or anyone in their social network faced a scenario in the first 10 days of April that they or someone in their network went to get vaccinated and the center was out of vaccine stock.\n\nIn response, 6 per cent said \"happened with 4 or more individuals in my social network\", 6 per cent said \"happened with 2-3 individuals in my social network\", and another 6 per cent said \"happened with one individual in my social network\". There were, however, 76 per cent saying \"did not happen with anyone\", while 6 per cent couldn't' say. The aggregate response indicated that 18 per cent of citizens had someone in their social network who could not get a vaccine dose when they went for vaccination in the first 10 days of April. This question in the survey received 9,016 responses.\n\nIt may be noted that many senior citizens got their first dose in the first 10 days of March and were scheduled to go for getting their second dose during the first 10 days of April.\n\nAs per Local Circles, some went as scheduled and some decided to follow the revised 6-8 week gap between two doses of Astrazeneca vaccine or Serum's Covishield in India.\n\n18 per cent of citizens or their family/friends facing the issue of going to a vaccination center but not getting the vaccine is something that must be looked into by the Central and State Governments, the survey said.\n\nThe shortage may be due to suboptimal local distribution, while it is also possible that certain centers or locations have a genuine shortage. It must also be noted that as the 2nd wave of Covid strengthened in India, 77 per cent of citizens in the LocalCircles survey in April expressed interest in taking the vaccine. The number stood at 38 per cent when India started its vaccination drive thereby marking a major decline in vaccine hesitancy in the 80 days period. This decline in vaccine hesitancy could also be contributing to the demand-supply mismatch, the survey said.\n\nAs per the survey, the Serum Institute of India currently produces 2 million vaccines a day, and Bharat Biotech produces 0.3 million vaccines in a day. If India continues to vaccinate 3 million people a day and if these two providers are unable to scale their production, India will need to import vaccines from other countries. Such a move has the support of 56 per cent of citizens surveyed who are in favour of India getting Pfizer, Moderna, and J&J to conduct trials and make the vaccine available here by June.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}