{"result_id": "366009", "URL": "https://nirogstreet.com/blog/coronavirus-updates/italy-plans-to-vaccinate-1.7mn-people-by-jan-end", "timestamp": "2023-04-25 18:24:07 CEST+0200", "meta": {"description": "Rome, Nov 20 (IANS) Some 1.7 million Italians will get vaccinated against the novel coronavirus by the end of January 2021, the country's Extraordinary Commissioner for the Covid-19 Emergency Domenico Arcuri announced here.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/italy-plans-to-vaccinate-1.7mn-people-by-jan-end", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Italy plans to vaccinate 1.7mn people by Jan end", "cleaned_text": "Rome, Nov 20 (IANS) Some 1.7 million Italians will get vaccinated against the novel coronavirus by the end of January 2021, the country's Extraordinary Commissioner for the Covid-19 Emergency Domenico Arcuri announced here.\n\nAddressing reporters on Thursday, Arcuri said that under the government's national Covid-19 vaccination plan, priority will be given to healthcare workers and the elderly, reports Xinhua news agency.\n\n\"The first vaccine available will be that provided by Pfizer, and Italy will get the first tranche of 3.4 million doses on the basis of the procurement carried out at the European Union (EU) level,\" the top official said.\n\nHe said the vaccines are expected to arrive in the country in the second half of January, and the plan is for the health services to be ready by that time to immediately start the vaccination campaign.\n\n\"Since this vaccine has specific characteristics, the 3.4 million doses will allow us to vaccinate 1.7 million people by the end of January, with each person getting two doses at an interval of about three weeks,\" he explained.\n\nMeanwhile, the country's Health Ministry registered 36,176 new coronavirus cases in the past 24 hours, about 2,000 more than the previous day, which increased the overall infection tally to 1,308,528.\n\nOn Thursday, 17,020 new recoveries were reported, which brought the total number of recoveries since the pandemic officially broke out here in late February to 489,987.\n\nThere were also 653 new deaths in the past 24 hours, bringing the country's death toll to 47,870.\n\nA total of 250,186 people were tested across the country in the last 24 hours, the Health Ministry said, adding that 14.4 per cent of those were positive.", "opengraph": {"title": "Italy plans to vaccinate 1.7mn people by Jan end", "description": "Rome, Nov 20 (IANS) Some 1.7 million Italians will get vaccinated against the novel coronavirus by the end of January 2021, the country's Extraordinary Commissioner for the Covid-19 Emergency Domenico Arcuri announced here.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/italy-plans-to-vaccinate-1.7mn-people-by-jan-end", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2020/11/20/296d85aedcd7d0fe4550861a79737715.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}