{"result_id": "366036", "URL": "https://nirogstreet.com/blog/coronavirus-updates/majority-of-australians-willing-to-pay-for-early-covid-19-vaccine", "timestamp": "2023-04-25 18:24:23 CEST+0200", "meta": {"description": "Canberra, Dec 21 (IANS) An international survey revealed on Monday that a majority of Australianswere willing to pay for an early vaccine against the novel coronavirus.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/majority-of-australians-willing-to-pay-for-early-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Majority of Australians willing to pay for early Covid-19 vaccine", "cleaned_text": "Canberra, Dec 21 (IANS) An international survey revealed on Monday that a majority of Australianswere willing to pay for an early vaccine against the novel coronavirus.\n\nThe survey, which was conducted by Australian consultancy firm CT Group, found that 72 per cent of Australians were willing to take vaccine compared to 57 per cent who were unwilling, Xinhua news agency reported.\n\nTwelve per cent of Australians said they would pay to be vaccinated early at any price and 43 per cent said they would pay up to A$170 ($129) to receive the shot early.\n\nThe Australian government has repeatedly said that the vaccine will be free but will be rolled out in stages from March 2021 with the elderly, vulnerable and healthcare workers to be prioritized.\n\nMore than half of Australian respondents to the survey said that the vaccine should be optional compared to 40 per cent who want it to be compulsory.\n\nOnly 43 per cent of Australians said they expect further waves of the pandemic compared to 75 per cent in the US and 73 per cent in the UK.\n\n\"Australians have shown themselves to be able to work together during the pandemic, and pride in what's been achieved is high,\" Catherine Douglas, managing director of CT Group's Australian research and campaigns business, said on Monday.\n\n\"They are cautiously supportive of the vaccine, but just want to be sure it's safe and effective before committing to taking it.\n\n\"But the research also clearly suggests people are not quite ready to return to doing things as they were pre-Covid,\" Douglas added.\n\nAs of Monday, Australia's overall caseload and death toll stood at 28,171 and 908, respectively.", "opengraph": {"title": "Majority of Australians willing to pay for early Covid-19 vaccine", "description": "Canberra, Dec 21 (IANS) An international survey revealed on Monday that a majority of Australianswere willing to pay for an early vaccine against the novel coronavirus.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/majority-of-australians-willing-to-pay-for-early-covid-19-vaccine", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2019/12/24/1601090c3f03a86531e4927ce78eb62a.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}