{"result_id": "366038", "URL": "https://nirogstreet.com/blog/coronavirus-updates/upper-caste-hindus-lead-in-pro-vaccine-count--sts-in-vaccination", "timestamp": "2023-04-25 18:24:24 CEST+0200", "meta": {"description": "New Delhi, June 22 (IANS) Among all the social groupings, Scheduled Tribes have got the highest number of both shots of the Covid vaccine so far, as per the IANS CVoter Covid Tracker.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/upper-caste-hindus-lead-in-pro-vaccine-count--sts-in-vaccination", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Upper caste Hindus lead in pro-vaccine count, STs in vaccination", "cleaned_text": "New Delhi, June 22 (IANS) Among all the social groupings, Scheduled Tribes have got the highest number of both shots of the Covid vaccine so far, as per the IANS CVoter Covid Tracker.\n\nAs per the tracker, 19.4 per cent among STs have got both shots of the vaccine, followed by Christians at 12.9 per cent, upper caste Hindus at 11.6 per cent, Other Backward Classes at 11.3 per cent, Sikhs at 8.2 per cent, Scheduled Castes at 7.8 per cent, and Muslims at 4.4 per cent.\n\nThe numbers among the Christians are the highest for a single shot of the vaccine at 32.7 per cent, followed by 30.6 per cent Sikhs, 25.3 per cent upper caste Hindus, and 20.8 per cent Other Backward Classes.\n\nThe all-India sample size is 43,032, covering all states and UTs during the last six months in proportion to population. Margin of error is plus/minus 3 per cent at macro level, and plus/minus 5 per cent at the micro level.\n\nOn a Nett basis, when it comes to being pro-vaccine, upper caste Hindus lead the chart at 84.9 per cent, followed by Other Backward Classes at 76 per cent, Christians at 71.9 per cent and Scheduled Tribes at 50.8 per cent.\n\nAccording to the IANS CVoter Covid Tracker, there is no vaccine hesitancy in India. Belying the narrative put forward by a section of the media, the tracker shows that overall, 80 per cent in India are pro-vaccine, which is almost 10 per cent more positive than the American public sentiment on vaccines.\n\nYashwant Deshmukh, Founder-Director of CVoter, said, \"In fact, India happens to be among the most pro-vaccine countries in the world. I don't even know why exactly such subjective stories are done by some agencies, which only suits the weird narrative of India still being a country of snake charmers.\n\n\"In our Covid tracker, we have done the cross tabs even on the lines of caste and religion. Yes, the upper caste and OBC are more open to vaccination when compared to the tribal populations and Muslims in India, but even they are Nett positive on vaccination drive. Overall, more than 80 per cent in India are pro-vaccine. This is almost 10 per cent more positive than the American public sentiment on vaccines.\"", "opengraph": {"title": "Upper caste Hindus lead in pro-vaccine count, STs in vaccination", "description": "New Delhi, June 22 (IANS) Among all the social groupings, Scheduled Tribes have got the highest number of both shots of the Covid vaccine so far, as per the IANS CVoter Covid Tracker.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/upper-caste-hindus-lead-in-pro-vaccine-count--sts-in-vaccination", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2021/06/07/5b0e5e702d8652820f1bba24cb896b4d.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}