{"result_id": "366055", "URL": "https://nirogstreet.com/blog/coronavirus-updates/egypt-receives-raw-materials-to-produce-sinovac-covid-vaccine", "timestamp": "2023-04-25 18:24:35 CEST+0200", "meta": {"description": "Cairo, May 24 (IANS) Egypt has received the first batch of the raw materials to manufacture China's Sinovac vaccine, said the Chinese embassy in Egypt on Sunday.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/egypt-receives-raw-materials-to-produce-sinovac-covid-vaccine", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Egypt receives raw materials to produce Sinovac Covid vaccine", "cleaned_text": "Cairo, May 24 (IANS) Egypt has received the first batch of the raw materials to manufacture China's Sinovac vaccine, said the Chinese embassy in Egypt on Sunday.\n\nAlong with the Sinovac raw materials, a new shipment of China's Sinopharm Covid-19 vaccines also arrived at the Cairo International Airport on Friday, according to a Chinese embassy's statement, Xinhua news agency reported.\n\nEgyptian Health Minister Hala Zayed said on May 9 that Egypt will start locally producing Sinovac Covid-19 vaccine in June, and the first 2 million doses will be produced at the plants of the Egyptian Holding Company for Biological Products and Vaccines (VACSERA).\n\nThe local end-product will be distributed to medical centres across Egypt in two months after being assessed by the Egyptian Drug Authority, said Zayed at a press conference at the airport.\n\n\"VACSERA will produce more than 5 million doses of Sinovac vaccine in two months, and 40 million doses within a year,\" she said.\n\nZayed hailed the arrival of a new shipment of Sinopharm and raw materials of Sinovac vaccine as ushering in \"a new chapter of bilateral ties,\" and the best way to celebrate the 65th anniversary of the establishment of diplomatic ties between the two countries.\n\nChina has made remarkable contributions to Egypt's diversification of vaccine sources and promoting the country's economic recovery in the post-pandemic era, she stressed.\n\nAfter meeting Egypt's own needs, vaccines produced in Egypt will be exported to other countries in the Middle East and Africa to help fight the pandemic, said the Egyptian minister.\n\nVaccine cooperation has laid a good foundation for Egypt and China to expand medical and health cooperation, Zayed said, adding that the two countries will boost cooperation in medical technology transfer and strive for more results to benefit the two peoples.\n\nThe two countries' joint efforts in fighting COVID-19 have not only deepened the traditional friendship and political mutual trust, but also set an example for the international community, Zayed noted.\n\nFor his part, Chinese Ambassador to Egypt Liao Liqiang said that, as Egypt receives the Sinovac vaccine raw materials, it becomes the first country on the African continent to cooperate with China in producing the Covid-19 vaccines.\n\n\"This is very important for the early prevail over the pandemic not only in Egypt, but also in the whole African continent and the Arab region,\" Liao said.\n\nChina calls on the international community to lend more hands to Africa through providing epidemic prevention materials, medicines, technology and funds to ensure the accessibility and affordability of vaccines, Liao said.", "opengraph": {"title": "Egypt receives raw materials to produce Sinovac Covid vaccine", "description": "Cairo, May 24 (IANS) Egypt has received the first batch of the raw materials to manufacture China's Sinovac vaccine, said the Chinese embassy in Egypt on Sunday.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/egypt-receives-raw-materials-to-produce-sinovac-covid-vaccine", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2021/01/20/38571e8f1414aaa21247f60d869ab5c6.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}