{"result_id": "366008", "URL": "https://nirogstreet.com/blog/coronavirus-updates/telangana-governor-takes-second-dose-of-covid-vaccine-with-tribals", "timestamp": "2023-04-25 18:24:06 CEST+0200", "meta": {"description": "Hyderabad, July 12 (IANS) Telangana Governor, Dr Tamilisai Soundararajan, on Monday took her second dose of Covid-19 vaccine with tribals at a tribal habitation in the state.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/telangana-governor-takes-second-dose-of-covid-vaccine-with-tribals", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Telangana Governor takes second dose of Covid vaccine with tribals", "cleaned_text": "Hyderabad, July 12 (IANS) Telangana Governor, Dr Tamilisai Soundararajan, on Monday took her second dose of Covid-19 vaccine with tribals at a tribal habitation in the state.\n\nInspiring and motivating tribals to get vaccinated to protect themselves from the Covid pandemic, she received the second dose along with the tribal women at KC Thanda, a tribal habitation in Maheshwaram mandal of Rangareddy district.\n\nConcerned about the reports indicating low percentage of vaccination among tribal people, the Governor had decided to take the second dose amidst the tribal people.\n\nInspired by the fact that none other than the state's first citizen was coming to their tribal village and taking the vaccine along with them, the tribal women and others enthusiastically vied with each other to take the vaccine.\n\n\"I just want to set an example by taking the vaccine at their remote tribal habitation and motivate the tribal people to overcome the vaccine-hesitancy and come forward to get vaccinated,\" Soundararajan said.\n\nSeated along with tribal women, who came in their rich traditional attire, she took the second dose evoking instantaneous applause from the tribal people and the medical and health staff present in the primary health centre.\n\nThe Governor, who is a doctor herself, called for the 100 per cent vaccination of all the tribal people with special attention towards those primitive tribal groups living in remote forest areas.\n\n\"The tribal people should be given vaccination on a priority basis. They should be protected from this deadly pandemic,\" she added.\n\nThe Governor stated that Prime Minister Narendra Modi has made 'Himayalayan effort' in ensuring that the country develops indigenous vaccine.\n\n\"Indigenous vaccine development is the biggest achievement of our country. Even many developed countries do not have their own vaccine. We have helped many countries by supplying vaccine. We are witnessing the world's largest vaccination in our country,\" she said.\n\nShe exuded confidence that the tribals who were showing a bit of vaccine hesitancy will now be courageous enough to get vaccinated.\n\nTribal women said that the visit of the Governor has inspired them a lot and gave them a new hope and courage about the vaccination.\n\nThe Governor appealed to the people that each one must act like \"vaccine ambassadors\" and motivate the people to get vaccinated at their turn. Vaccine is the permanent protection, while masks and other Covid-appropriate behavour offer temporary protection.\n\nEducation Minister Sabitha Indra Reddy stated that it was a huge honour for the Rangareddy district and the tribal people across the state that the Governor took the vaccine at a tribal habitation and thus set an example.\n\nEarlier, the Governor planted a sapling at the village garden and offered prayers at the Shiva Ganga Temple along with her husband and eminent nephrologist Dr. P. Soundararajan.\n\nShe also surprised the villagers by distributing sweet boxes to each of the household in KC Thanda. She personally handed over sweet boxes to some of the participants at the meeting.", "opengraph": {"title": "Telangana Governor takes second dose of Covid vaccine with tribals", "description": "Hyderabad, July 12 (IANS) Telangana Governor, Dr Tamilisai Soundararajan, on Monday took her second dose of Covid-19 vaccine with tribals at a tribal habitation in the state.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/telangana-governor-takes-second-dose-of-covid-vaccine-with-tribals", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2021/07/12/cdf287fb69ab8d69e504baebe25ec4a2.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}