{"result_id": "366021", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/covid-vaccination-leads-to-reduced-icu-stay--treatment-cost", "timestamp": "2023-04-25 18:24:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/covid-vaccination-leads-to-reduced-icu-stay--treatment-cost", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Covid vaccination leads to reduced ICU stay, treatment cost", "cleaned_text": "New Delhi, July 14 (IANS) A cohort study on the impact of vaccination among Covid-19 patients by Star Health and Allied Insurance has unveiled the significant impacts of vaccination among individuals 45 years and above, IndiaMedToday reported.\n\nThe study concluded that there was a marked reduction in the total hospitalisation expenses by approximately 24 per cent, the average length of stay (ALOS) by a mean of 2.1 days, ICU requirement by 66 per cent and a reduction of approximately 81 per cent in mortality among patients who had completed two doses of vaccination.\n\nThe report said the study was conducted during the second wave (March and April 2021) and considered a sample size of 3,820 hospitalised patients from across India who were 45 years and above.\n\nThe cohort study revealed that the average cost of hospitalisation of the unvaccinated group was Rs 2.77 lakh while the vaccinated group recorded an average cost of Rs 2.1 lakh.\n\nThe cost reduction was due to factors like reduced need of ICU requirement and reduction in the length of hospital stay from an average of seven days among unvaccinated to an average of 4.9 days for the vaccinated group, the report said.\n\nSpeaking on the study, S Prakash, MD, Star Health and Allied Insurance said, \"The beginning of 2021 saw a breakthrough in vaccine discovery against COVID-19 making it the fastest vaccine discovery till date. We aimed to measure and understand in exact terms the impact of Covid-19 vaccination in patients who contracted the illness 14 days after the second dose versus unvaccinated patients, thus making it unique research in its own right.\"\n\nThe cohort study surveyed customers of Star Health and Allied Insurance Company who were admitted for COVID-19 treatment in 1,104 hospitals across the country and found that the ALOS, need for ICU and reduction in costs holds for patients with comorbidities as well. While the need for ICU for patients with comorbidities fell from a whopping 9.4 per cent to 5 per cent amongst those vaccinated, the treatment cost also reduced by nearly 15 per cent.\n\n\"However, the study also revealed that over 57 per cent of patients among the unvaccinated group were hesitant to take the vaccine due to fear, ignorance or more worryingly, social factors and disinterest! There is an urgent need to address this and we hope that through this study we will be able to highlight the benefits of the vaccine, educate and motivate the public to get vaccinated soon,\" added Prakash.\n\nConducted and concluded during the early stages of vaccination drive, the study noted that nearly 86 per cent of those surveyed had not taken the vaccination and amongst these 43 per cent did not have any valid reason for not taking the jab.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}