{"result_id": "366007", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/sl-administers-highest-number-of-covid-vaccines-in-a-day", "timestamp": "2023-04-25 18:24:06 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/sl-administers-highest-number-of-covid-vaccines-in-a-day", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "SL administers highest number of Covid vaccines in a day", "cleaned_text": "Colombo, July 16 (IANS) Sri Lanka's health authorities administered the highest number of Covid-19 vaccines in a single day with nearly 400,000 people inoculated, statistics from the Health Ministry revealed.\n\nAccording to official figures released on Thursday, 384,763 people had been vaccinated against Covid-19 on Wednesday, out of which 338,572 people had received the first dose of Sinopharm, and 35,410 people got the second dose of the jab, reports Xinhua news agency.\n\nIn addition, 3,365 persons were administered the Sputnik V vaccines as the first dose, while the first dose of Pfizer vaccines was given to 7,416 recipients.\n\nThe Health Ministry said that to date, Sri Lanka has administered over 4 million first doses of the coronavirus vaccines across the country, with the majority having received the Sinopharm vaccines.\n\nThirty six per cent of the population above the age of 30 years in Sri Lanka have been administered with at least one dose of a Covid-19 vaccine, Health Promotion Bureau (HPB) Director Ranjith Batuwanthudawa said on Thursday.\n\nIn capital Colombo, one of the worst affected by the virus, 70 per cent of the target population have received the first dose of the vaccine, while 25 per cent have received both doses, Batuwanthudawa said.\n\n\"Considering the other two districts in the Western Province, 66 per cent in the Gampaha district were given the first dose while 21 per cent have received both the doses,\" Batuwanthudawa said.\n\nLast week, President Gotabaya Rajapaksa had put forward a comprehensive mechanism for vaccinating a majority of the Sri Lankan population before September.\n\nRajapaksa said the amount of coronavirus vaccines scheduled to be received in July will be made available to the public, and the districts identified as high-risk areas for spreading the coronavirus will be given priority in vaccine distribution.\n\nSri Lanka is presently under the a third wave of the pandemic with authorities warning of a further spread of the Delta variant.\n\nThe country has to date recorded 279,059 confirmed coronavirus cases, while 3,611 deaths have been reported.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}