{"result_id": "366045", "URL": "https://nirogstreet.com/blog/coronavirus-updates/malay-pm-to-be-among-first-to-receive-covid-19-vaccine", "timestamp": "2023-04-25 18:24:29 CEST+0200", "meta": {"description": "Kuala Lumpur, Dec 22 (IANS) Malaysian Prime Minister Muhyiddin Yassin said on Tuesday that he will be among the first to receive a vaccine against the novel coronavirus in a bid to convince people that it is safe and effective.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/malay-pm-to-be-among-first-to-receive-covid-19-vaccine", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Malay PM to be among first to receive Covid-19 vaccine", "cleaned_text": "Kuala Lumpur, Dec 22 (IANS) Malaysian Prime Minister Muhyiddin Yassin said on Tuesday that he will be among the first to receive a vaccine against the novel coronavirus in a bid to convince people that it is safe and effective.\n\nIn a video message, Muhyiddin explained that his vaccination would be followed by health front liners and high-risk groups such as the elderly, those with non-communicable diseases and chronic respiratory diseases, reports Xinhua news agency.\n\nHe also announced that his government had just signed an agreement with AstraZeneca to obtain 6.4 million doses of the Covid-19 vaccines, enough to cover 10 per cent of Malaysia's population.\n\nThe latest agreement added to vaccines already enough to cover 30 per cent of the population secured by the Malaysian government through the agreement with drug maker Pfizer and the participation in COVAX, an international initiative aimed at ensuring equitable global access to the vaccines.\n\nHe also said the government is in advanced negotiations with other vaccine providers to secure enough vaccines in total to cover 80 per cent of the population.\n\nAccording to Muhyiddin, the country's National Pharmaceutical Regulatory Agency (NPRA) will continue to monitor the effectiveness and safety of vaccines once they are obtained and used.\n\nMuhyiddin also reminded people to adhere to the standard operating procedures (SOP) that have been outlined and practice frequent hand washing, wearing of face masks and maintaining physical distancing.\n\nMalaysia has so far reported 95,327 confirmed coronavirus cases and 438 deaths.", "opengraph": {"title": "Malay PM to be among first to receive Covid-19 vaccine", "description": "Kuala Lumpur, Dec 22 (IANS) Malaysian Prime Minister Muhyiddin Yassin said on Tuesday that he will be among the first to receive a vaccine against the novel coronavirus in a bid to convince people that it is safe and effective.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/malay-pm-to-be-among-first-to-receive-covid-19-vaccine", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2020/03/01/27fa8462e4d34d12ac3cd83553af428f.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}