{"result_id": "366046", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/ktr-urges-centre-to-import-unused-covid-vaccine-stocks", "timestamp": "2023-04-25 18:24:29 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/ktr-urges-centre-to-import-unused-covid-vaccine-stocks", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "KTR urges Centre to import unused Covid vaccine stocks", "cleaned_text": "Hyderabad, June 4 (IANS) Telangana's Information Technology and Industry Minister K.T. Rama Rao on Friday targeted the Centre again for its \"bungling\" on Covid-19 vaccination and demanded that it immediately import vaccines from countries that are sitting on a huge stockpile of unused doses.\n\nHe said the Centre should use Rs 35,000 crore it allocated in the Union Budget for 2021-22 to procure vaccines wherever available in the world and provide them free of cost to all the states to speed up the vaccination.\n\nThe minister was talking to reporters on the sidelines of the inauguration of a 150-bed ICU facility for Covid patients at the Telangana Institute of Medical Sciences (TIMS), Gachibowli.\n\nKTR, as the minister is popularly known, said the Centre should come forward and take the initiative as the vaccination is the only permanent solution to the pandemic. He demanded that the Centre announce a uniform pricing and distribution policy for Covid vaccines to ensure universal vaccination.\n\nBut for \"some wrong decisions taken by the Centre\", the vaccination should have been completed by now or at least progressed with brisk pace, he said.\n\n\"When we should have procured the vaccines, we did not procure. Instead, we exported to other countries,\" he said.\n\nKTR, who is son of Chief Minister K. Chandrasekhara Rao, pointed out that a country of 132 crore population required 264 crore doses but it did not even have a quarter of this. \"Though they (Centre) knew that there are no vaccines available, they announced that people in the 18-44 age group will be vaccinated,\" he said.\n\nHe said at least now the Centre should procure vaccines from countries sitting on huge stockpiles of unused doses. \"My information is that there are 50 crore doses of AstraZeneca vaccine available in the United States and other countries. There are 25 crore doses in the US and another 25 crore in countries like Norway, Denmark and Canada,\" he said, demanding Prime Minister Narendra Modi should talk to his counterparts in those countries and procure vaccines.\n\nReferring to the pressure on Bharat Biotech and Serum Institute, he said the Centre was using 85 per cent of the doses they were manufacturing while from the remaining 15 per cent, they were supplying to the state governments and private hospitals.\n\nHe said Telangana called tenders to procure vaccines and the response would be known later. \"Some states called tenders but there no response. Some states spoke to companies like Pfizer and Moderna but they said they were dealing with the government of India.\"\n\nReferring to Covid situation in Telangana, he said the state was in much better situation compared to its neighbours and exuded confidence that the number of new positive cases will further come down over next one week.\n\nHe claimed that the state government's strategy of conducting door to door fever survey to identify people with Covid symptoms and distributing medicine kits among them yielded good results and the Centre was replicating this.\n\nKTR said the state focused on expanding health infrastructure and also on creating awareness among people to tackle the pandemic\n\nThe minister thanked the IT companies which contributed Rs 15 crore under corporate social responsibility for ICU at TIMS.\n\nMicrosoft, Qualcomm, Franklin Templeton, Cognizant, and WellsFargo contributed the money through the Hyderabad Software Enterprises Association (HYSEA) for the purpose.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}