{"result_id": "366027", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/j&j-single-shot-covid-19-vaccine-shows-66--efficacy-overall", "timestamp": "2023-04-25 18:24:18 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/j&j-single-shot-covid-19-vaccine-shows-66--efficacy-overall", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "J&J single-shot Covid-19 vaccine shows 66% efficacy overall", "cleaned_text": "New York, Jan 29 (IANS) Johnson & Johnson on Friday said its single-shot vaccine has been found to be 66 per cent effective overall at preventing moderate to severe Covid-19, 28 days after vaccination, in phase 3 trials.\n\nThe level of protection against moderate to severe Covid-19 infection was 72 per cent in the US, 66 per cent in Latin America and 57 per cent in South Africa, 28 days post-vaccination, the company said.\n\nThe onset of protection was observed as early as day 14.\n\n\"Our goal all along has been to create a simple, effective solution for the largest number of people possible, and to have maximum impact to help end the pandemic,\" Alex Gorsky, Chairman, Board of Directors and Chief Executive Officer, Johnson & Johnson, said in a statement.\n\n\"We're proud to have reached this critical milestone and our commitment to address this global health crisis continues with urgency for everyone, everywhere.\"\n\nThe vaccine candidate was 85 per cent effective in preventing severe disease across all regions studied, 28 days after vaccination in all adults 18 years and older.\n\nEfficacy against severe disease increased over time with no cases in vaccinated participants reported after day 49, the company said.\n\nSignificantly, the Covid-19 vaccine candidate demonstrated complete protection against Covid-related hospitalisation and death, 28 days post-vaccination.\n\nThere was a clear effect of the vaccine on Covid-19 cases requiring medical intervention with no reported cases among participants who had received the Janssen Covid-19 vaccine, 28 days post-vaccination.\n\n\"These topline results with a single-shot Covid-19 vaccine candidate represent a promising moment,\" said Paul Stoffels, Vice Chairman of the Executive Committee and Chief Scientific Officer, Johnson & Johnson.\n\n\"The potential to significantly reduce the burden of severe disease, by providing an effective and well-tolerated vaccine with just one immunization, is a critical component of the global public health response.\"\n\nThe topline safety and efficacy data are based on 43,783 participants accruing 468 symptomatic cases of Covid-19.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}