{"result_id": "366015", "URL": "https://nirogstreet.com/blog/coronavirus-updates/now-ask-alexa-to-find-nearest-covid-vaccine-centre", "timestamp": "2023-04-25 18:24:10 CEST+0200", "meta": {"description": "New Delhi, Aug 3 (IANS) Amazon Alexa has been updated with the latest Covid-19 related features for Indian users. The virtual assistant can help you find nearest Covid-19 testing centres, vaccination centres, and answer queries about vaccination, helpline numbers in each state.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/now-ask-alexa-to-find-nearest-covid-vaccine-centre", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Now ask Alexa to find nearest Covid vaccine centre", "cleaned_text": "New Delhi, Aug 3 (IANS) Amazon Alexa has been updated with the latest Covid-19 related features for Indian users. The virtual assistant can help you find nearest Covid-19 testing centres, vaccination centres, and answer queries about vaccination, helpline numbers in each state.\n\nIn 2020, Alexa was able to share information about Covid-19 related symptoms and cases in India.\n\nBut now, with the help of MapmyIndia, Alexa can help find the nearest Covid-19 testing centre along with the travel distance. It can also help one identify the closest Covid-19 vaccination centres where vaccines are available.\n\nGet started by asking questions such as \"Alexa, where can I get a Covid-19 test?\"\n\nAlexa will identify the location from the device registration and provide a list of all the nearest vaccination centres. One can use this information to time a visit to the CoWIN portal for booking an appointment.\n\nFurther, Alexa also makes it easy to search vaccination centres and book appointments for friends and family.\n\nTo search for vaccination centres near other pin codes, use the Vaccine Info Alexa skill. The skill will ask for a pin code, as well as the age category to provide you with information.\n\nIn case of unavailability of the vaccine, Alexa can also set a reminder to check with the skill if the vaccine is available the next day. Just say, \"Alexa, open vaccine info.\"\n\nWith the help of the Ministry of Health and Family Welfare website, Alexa also provides the latest updates on the Covid vaccine completion rates in India. It will also answer all queries related to vaccination -- -- safety or how to book a slot.\n\nThe AI-based virtual assistant also provides the Covid helpline numbers in each state, just say, \"Alexa, what is the Covid helpline number in Tamil Nadu?\"\n\nAmazon has partnered with several NGOs such as Akshaya Patra, Give India and Goonj to make the process of donations easier. Just say, \"Alexa, donate now'' and Alexa will send an app notification and an SMS containing Amazon.in/donate link, where users can complete the transaction with their preferred NGO partner and the amount of their choice.", "opengraph": {"title": "Now ask Alexa to find nearest Covid vaccine centre", "description": "New Delhi, Aug 3 (IANS) Amazon Alexa has been updated with the latest Covid-19 related features for Indian users. The virtual assistant can help you find nearest Covid-19 testing centres, vaccination centres, and answer queries about vaccination, helpline numbers in each state.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/now-ask-alexa-to-find-nearest-covid-vaccine-centre", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/https://iansphoto.in/web/photoimages_new/400/2021/05/06/8f8e1cdc34f1ea593329fc156cb7692c.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}