{"result_id": "366048", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/dna-vaccines-for-covid-19-effective-in-mice--hamsters:-study", "timestamp": "2023-04-25 18:24:30 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/dna-vaccines-for-covid-19-effective-in-mice--hamsters:-study", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "DNA vaccines for Covid-19 effective in mice, hamsters: Study", "cleaned_text": "Taipei, May 28 (IANS) Taiwan researchers have successfully developed a vaccine that uses DNA encoding the coronavirus' spike protein, instead of the currently available mRNA vaccines.\n\nDNA vaccines are often hard to deliver into cells. But, the team from the National Health Research Institutes, Taiwan, coupled electroporation with the delivery of the DNA vaccination.\n\nThe research, published in the journal PLOS Neglected Tropical Diseases, showed that mice and hamsters immunised with the new DNA vaccine developed long-lasting antibodies against the SARS-CoV-2 spike protein.\n\nThose antibodies peaked at eight weeks post-immunisation but levels remained relatively high at week 20.\n\nHamsters that received two immunisations at a three-week interval and were exposed to Covid-19 after seven weeks were protected from the virus. They also showed no loss of body weight and had less viral RNA in their lungs compared to animals that were not immunised.\n\n\"The DNA vaccine is thermal stable and no cold chain-needed and can induce high levels of long-lasting neutralising antibody titers against SARS-CoV-2,\" said the researchers, including Shih-Jen Liu and Hsin-Wei Chen, from the varsity.\n\n\"The DNA vaccine confers protective efficacy against SARS-CoV-2 infection in Syrian hamsters which is a severe Covid-19 disease animal model,\" they added.\n\nCurrently available Covid-19 vaccines rely on mRNA strands to teach the human immune system to recognize the SARS-CoV-2 virus.\n\nWhile both DNA and mRNA vaccines use genetic material encoding part of a virus to elicit an immune response, DNA vaccines can often be produced more quickly and at lower cost and transported without the requirement of cold temperatures.\n\nRecent clinical trials have also indicated that DNA vaccines are safe and effective in treating infections including HIV-1, Zika, Ebola and influenza viruses.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}