{"result_id": "366053", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/from-india-to-us--world-urges-biden-not-to-hoard-coronavirus-vaccine", "timestamp": "2023-04-25 18:24:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/from-india-to-us--world-urges-biden-not-to-hoard-coronavirus-vaccine", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "From India to US, world urges Biden not to hoard Coronavirus vaccine", "cleaned_text": "New Delhi/Washington (IANS) From the owner of the biggest producer of one of the Coronavirus vaccines in India to several senators in the US, a wide range of people have appealed to US President Joe Biden to temporarily suspend the intellectual property rules for the vaccine production.\n\nAs the second wave of the Coronavirus pandemic intensifies, India has appealed to the WTO to waive off the rules so that it can scale up the Covid-19 vaccine production. The virus which originated in Wuhan in 2019 has killed around 3 million people so far. In India alone, 170,000 people have died due to the contagious disease.\n\nCEO and owner of Serum Institute Pune-the biggest manufacturer of Oxford-AstraZeneca Covid-19 vaccine, Adar Poonawalla, in a tweet which went viral, requested the Biden administration to lift the embargo on raw material exports out of the US. \"If we are to truly unite in beating this virus, on behalf of the vaccine industry outside the U.S., I humbly request you to lift the embargo of raw material exports out of the U.S. so that vaccine production can ramp up. Your administration has the details,\" he tweeted.\n\nAt least ten senators in a letter to President Biden said the US should prioritise people over pharmaceutical company profits and support the temporary waiver of the rules. A waiver could pave the way for generic or other manufactures to make more vaccines, media reports quoted the letter led by Senator Bernie Sanders.\n\nA group of 170 world leaders and Nobel laureates earlier sent a similar letter to Biden urging him to support a temporary waiver of the WTO's intellectual property rules.\n\nIndia's China expert Brahma Chellaney lashed out at the US for hoarding raw material. \"As if Biden's vaccine hoarding policy during a global crisis wasn't bad enough, he also has restricted export of key raw materials, affecting vaccine production in India. Yet the mainstream US media has ignored the global impacts of the dual U.S. hoarding.\n\nPossibly influenced by Poonawalla's tweet, the government on Friday announced that it will help scale production for locally manufactured Covaxin vaccine, from 10 million/month in April to 100 million/month by September 2021.\n\n\"The current production capacity of indigenously developed Covaxin vaccine will be doubled by May-June 2021 and then increased nearly 6-7 fold by July - August 2021 i.e increasing the production from 1 crore vaccine doses in April, 2021 to 6-7 crore vaccine dose/month in July - August. It is expected to reach nearly 10 crore doses per month by Sep 2021,\" the government said in an official statement.\n\nCapacities of Bharat Biotech Limited, Hyderabad as well as other public sector manufactures are being upgraded with required infrastructure and technology, the government said. At least three public sectors companies are also being supported to increase the capacity of vaccine production.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}