{"result_id": "366056", "URL": "https://nirogstreet.com/blog/coronavirus-updates/japan-to-donate-1.6m-covid-vaccine-doses-to-nepal", "timestamp": "2023-04-25 18:24:35 CEST+0200", "meta": {"description": "Kathmandu, July 13 (IANS) Nepal is now receiving Covid vaccines from different countries and facilities.", "lang": "en", "keywords": "", "favicon": "/base/images/pharmacy.png", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/japan-to-donate-1.6m-covid-vaccine-doses-to-nepal", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Japan to donate 1.6m Covid vaccine doses to Nepal", "cleaned_text": "Kathmandu, July 13 (IANS) Nepal is now receiving Covid vaccines from different countries and facilities.\n\nA day after Nepal received 1.5 million doses of Johnson & Johnson vaccine from the US under the COVAX facility, Japan on Tuesday announced to donate about 1.6 million doses of the Japan-made AstraZeneca vaccine to Nepal under grants through COVAX.\n\nThe Minister for Foreign Affairs of Japan officially announced the grant of 1.6 million doses of Covid-19 vaccine on Tuesday, according to a press statement issued by the Embassy of Japan in Kathmandu.\n\nEarlier, Nepal had received 1.8 million Covid vaccine doses from China, 1.1 million from India and 3,48,000 doses from COVAX under the grant.\n\nNepal also separately purchased two million doses of AstraZeneca vaccine from the Serum Institute of India, but has received one million doses so far.\n\nNepal is waiting to receive another one million doses from the Serum Institute of India but due to export ban in India, it is not certain when Nepal will get them. Nepal has also procured four million Sinopharm vaccine doses from China and has started receiving them.\n\nAccording to the Japanese Embassy in Kathmandu, the vaccine doses will be shipped from Japan to Nepal during the period between mid-July and the end of August.\n\n\"The exact shipping schedule will be confirmed once the procurement arrangements are finalised by the international organisation which is in charge of the matter,\" the statement read.\n\nAccording to the Ministry of Health and Population of Nepal, 2,611,807 Nepalis have been given Covid-19 vaccine doses, of which 1,079,192 have been fully vaccinated with two doses.", "opengraph": {"title": "Japan to donate 1.6m Covid vaccine doses to Nepal", "description": "Kathmandu, July 13 (IANS) Nepal is now receiving Covid vaccines from different countries and facilities.", "type": "Website", "url": "https://nirogstreet.com/blog/coronavirus-updates/japan-to-donate-1.6m-covid-vaccine-doses-to-nepal", "image": "https://s3-ap-southeast-1.amazonaws.com/nirog/images/blogs/http://iansphoto.in/web/photoimages_new/400/2021/03/11/b6f9ae43b26868e3af27121b5b94d79f.jpg", "image:width": "500", "image:height": "500", "site_name": "NirogStreet"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}