{"result_id": "366042", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/fake-covid-vaccine--test-certificate-market-growing:-research", "timestamp": "2023-04-25 18:24:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/fake-covid-vaccine--test-certificate-market-growing:-research", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Fake Covid vaccine, test certificate market growing: Research", "cleaned_text": "London, May 17 (IANS) Israel-based researchers have found an online market of fake vaccine and test certificates with over 1,200 vendors in the UK and worldwide on dark web and on instant messaging platforms like WhatsApp, Telegram and Jabber. The vendors on these platforms sell false documents for $25, the media reported.\n\nResearchers from the cybersecurity firm Check Point found evidence of forgeries of vaccine cards issued by the UK National Health Service and the US Centers for Disease Control and Prevention, fake test certificates and products claimed to be Covid vaccines, the Guardian reported on Sunday.\n\nFrom about 20 dark web vendors in November last year, the number grew to 600 in January and more than 1,200 by March, the researchers found.\n\nThe majority of people caught in the UK with fake negative Covid test certificates were from poorer nations, including African, South American and Asian countries, a Border Force official was quoted as saying to the Guardian.\n\nBesides, anti-vaxxers -- individuals who refuse to take the vaccine on the grounds of baseless conspiracy theories and spread dangerous disinformation - also buy the forged certificates, Liad Mizrachi, senior researcher at Check Point, said.\n\nThe researchers noted that in the beginning of the pandemic in 2020, darknet produced the masks, the protective equipment, and later drugs were also on sale. Initially the Chinese-made Sinovac and Russian-produced Sputnik jabs were offered, later Pfizer and Moderna vaccines were also offered in the darknet.\n\n\"As at March, vendors were supplying from all the countries in Europe -- Spain, France, Germany, Switzerland, Sweden a (plus) Mexico, Australia,\" said Oded Vanunu, head of product vulnerability research at Check Point.\n\n\"After vaccinations, the next step was the certificates and negative tests,\" he added.\n\nThe researchers said individuals who proudly post images of themselves holding the cards on social media unwittingly provide the source for forgeries. Without an official global database recording individuals' vaccination status, the system will be open to fakes and forgery, Vanunu said.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}