{"result_id": "366043", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/covid:-third-booster-vaccine-may-make-immunity-last-longer", "timestamp": "2023-04-25 18:24:27 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/covid:-third-booster-vaccine-may-make-immunity-last-longer", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Covid: Third booster vaccine may make immunity last longer", "cleaned_text": "<br>Since the beginning of the coronavirus pandemic in November 2019, the SARS-CoV-2 may have produced thousands of variants but most disappeared. However, some like the UK (B117) and South Africa (501Y.V2) and Brazil (B11248) variants mutated in such a way that helped the virus survive and reproduce.\n\nCurrently, all the vaccines require two-doses to be administered, two, three, or four weeks apart, through the intramuscular route. However, a third booster vaccine or an annual vaccine dose like other flu shots may become the normal and help immunity to last longer.\n\n\"Studies on the durability of our immune responses to the administered vaccines are currently ongoing. Emerging data suggests that there is a likelihood that our immunity may wane over time and given the increasing trend in the emergence of virus variants of concern, there is a high likelihood of booster doses,\" Dr Veena P. Menon, Ph.D, Faculty -In-Charge, Clinical Virology Laboratory, Amrita Institute of Medical Sciences, Kochi, told IANS.\n\n\"Yes, the third booster will help since new variants are emerging and we still don't know how long the immunity lasts. Whatever immunity people are gaining with the vaccines, a booster will definitely help. People have suggested an annual vaccination as well,\" added Dr Suresh Kumar D., Consultant, Infectious Diseases Specialist at Apollo Hospitals Chennai.\n\nHowever, it remains to be seen when it would be most appropriate to administer the third booster, Menon said.\n\nUS pharmaceutical major Pfizer's CEO Albert Bourla, in a recent statement, announced that Covid vaccine recipients will \"likely\" need a third dose between six to 12 months after they're fully vaccinated. He also suggested the need for yearly vaccinations against coronavirus.\n\nA booster shot is \"a repeat dose of a vaccine that you've already received to literally boost your immunity,\" Susan R. Bailey, an allergist and clinical immunologist and President of the American Medical Association, was quoted as saying to National Geographic.\n\nThe third booster creates virus-fighting memory in the immune system. Thus, it creates a \"greater and more long lasting\" immune response, Bailey said.\n\nBut, are the existing vaccines well able to suppress the new variants? Yes, say the health experts.\n\n\"As per the WHO all the currently approved vaccines are expected to provide at least some protection against new variants as protection is mediated by broad immune responses involving both arms of immunity - humoral (antibody dependent) and T cell dependent,\" Menon said.\n\nWhile the Pfizer and Moderna vaccines have shown a reasonable effect against the mutants, the South African and Brazilian mutants are worrisome.\n\n\"Most of the current vaccines, including Oxford- AstraZeneca vaccine, are covering well against the UK variant. But it has done poorly against the South African mutant. The efficacy is 10-15 per cent, which is why South Africa had to return the vaccines. The vaccine is doing reasonably effective against the Brazilian variant with around 40-50 per cent efficacy. Covaxin has not been tested against these variants and there is no research yet on this,\" Kumar said.\n\n\"Changes or mutations in the virus cannot make vaccines completely ineffective. In the event that any of the current vaccines prove to be less effective against one or more variants, it will be possible to change the composition of the vaccines to protect against these variants,\" Dr Alpana Razdan, VP and Lab Head, Genestrings Diagnostic Centre, New Delhi, told IANS.\n\nVaccination is important and if they do not happen on time, the burden of Covid will remain for a longer period of time, she noted.\n\nWhile vaccines are not a shield against infection, they surely help reduce the severity of the infection and chances of death and hospitalisation, said the experts urging people to cut out the hesitancy and get innoculated.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}