{"result_id": "366023", "URL": "https://nirogstreet.com/blog/amp/coronavirus-updates/now--corona-vaccine-war-rages-between-centre--maharashtra", "timestamp": "2023-04-25 18:24:15 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "", "canonical": "https://nirogstreet.com/blog/coronavirus-updates/now--corona-vaccine-war-rages-between-centre--maharashtra", "encoding": "utf-8"}, "image": null, "domain": "nirogstreet.com", "title": "Now, 'Corona vaccine war' rages between Centre, Maharashtra", "cleaned_text": "<br>Hours after Tope on Wednesday said that the state had only 3 days doses of the Covid vaccines in stock, Union Health Minister Harsh Vardhan hit back, virtually blaming Maharashtra for the current spread of the pandemic across the country.\n\n\"Throughout the last year, I have been a witness to the misgovernance and utter casual approach of the Maharashtra government in battling the virus. The lackadaisical attitude of the state government has singularly bogged down the entire country's efforts to fight the virus,\" he had said.\n\nHe also deplored attempts by some state governments to \"distract attention\" from their failures and spread panic among the people, even as the Centre rushed 7.50 lakh doses to the state on Thursday.\n\nStung by the missive, Tope pointed out that though there is no dispute with the Centre over the vaccine supplies, the situation of the biggest state in the country was grimmer and hence it needed more doses to combat the pandemic.\n\nNationalist Congress Party (NCP) President Sharad Pawar also spoke with Harsh Vardhan on Wednesday on the prevailing Covid status in Maharashtra and said the latter had assured all help in tackling it.\n\nAs the Centre on Thursday informed that the state would be given 17.50 lakh doses from April 15, but Tope said the state's demand is at least 40 lakh vaccines per week in view of the terrible spread here compared with other states.\n\n\"Gujarat with a population of 6 crore with 17,000 active cases, was given 1 crore doses of the vaccine, but Maharashtra with a double (12 crore) population and (now) 5 lakh active cases was given only 1.04 crore doses, of which barely 9 lakh jabs are left. Accordingly, vaccination has been stopped in Satara, Sangli and Panvel in Raigad,\" said Tope.\n\nSimilarly, he sought to know why Uttar Pradesh gets 48 lakh doses, Madhya Pradesh 40 lakh, Gujarat 30 lakh and Haryana 24 lakh - all ruled by BJP - compared with only 7.50 lakh doses from Maharashtra, the worst-hit in the country.\n\nHe said this state has the highest number of active patients but also topped the country in terms of the vaccination programme as per the Centre's own figures released this week.\n\n\"We shall maintain the level of 6 lakh doses per week and won't go beyond it at this stage. But at least give us 40 lakh vaccine every week,\" Tope appealed, adding out that the progressive total cases in the state have crossed 30 lakh.\n\nTope reiterated the demand by Chief Minister Uddhav Thackeray to allow vaccine production at the Haffkine Institute in Mumbai and appealed that the Centre and State must unitedly fight to overcome the challenges of Covid pandemic.\n\nHe said that Maharashtra is a big state demographically and geographically with 55 percent of the total active cases in the country, but compared to the deaths per million cases, the fatality rate figure is much lower than other states.\n\n\"This has been appreciated not only by the Centre but also taken note of by other global publications and the national media. The state is handling the crises strictly as per the norms of the Centre and the ICMR in all respects,\" Tope asserted.\n\nAt the meeting with Prime Minister Narendra Modi later on Thursday, he said he would be raising four demands - at least 1.6 crore, or 40 lakhs per week, vaccine doses, adequate supply of remdesivir medicine with a price cap, permission to requisition oxygen from neighbouring states, and overcoming the shortages of ventilators as the state grapples with the virus.\n\nThe minister said that many developed countries have started vaccinating citizens above the age of 18 and considering the growing number of Covid patients in the state, appealed for giving doses to all in the 18-40 age groups too.", "opengraph": {}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}