{"result_id": "367015", "URL": "https://chopra.com/retreats", "timestamp": "2023-04-25 18:24:45 CEST+0200", "meta": {"description": "Immerse yourself in a one-of-a-kind meditation, relaxation or spiritual retreat that brings ancient practices that are backed by science into modern life, transforming your routine.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/retreats", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "All Retreats", "cleaned_text": "Chopra retreats have been gatherings where people have found love, inspiration, and connection as well as experienced transformational healing. After deep reflection, 2023 will be the last year for Chopra live events as we’ve experienced them.\n\n\n\nThere are several upcoming opportunities in 2022 and 2023 to come together and celebrate the unique magic of Chopra’s transformational retreats. We’re committed to making our final events extra special—a year of beautiful grand finales dedicated to you.\n\n\n\nIf you’ve attended one of our events in the past, you know the synchronistic magic that happens at Chopra events. We’d love for you to experience it one more time.\n\n\n\nAnd if you’ve never been to one of our events because you’ve been waiting for the right time... we hope that you’ll join us in presence, joy, and most of all, gratitude for the beautiful memories we’ve made, and the countless lives we’ve touched and will continue to impact as we move forward.", "opengraph": {"title": "All Retreats", "url": "https://chopra.com/retreats", "image": "https://chopra.brightspotcdn.com/dims4/default/625b258/2147483647/strip/true/crop/2100x1103+0+120/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Fc8%2F0f%2F44928d4c479ab6cdabc7199d8ec4%2Falikaukas-dsc-3177.jpg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/625b258/2147483647/strip/true/crop/2100x1103+0+120/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Fc8%2F0f%2F44928d4c479ab6cdabc7199d8ec4%2Falikaukas-dsc-3177.jpg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "image:alt": "Join Deepak Chopra at our signature live retreats", "description": "Leave your computer at home. Turn your phone off—not on silent, actually off. Immerse yourself in a one-of-a-kind retreat that brings ancient practices that are backed by science into modern life, transforming your routine—and yourself in the process. ", "site_name": "Chopra", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://chopra.com/retreat-announcement-faqs"], "authors": [], "publish_date": null}