{"result_id": "367019", "URL": "https://chopra.com/retreats/silent-awakenings", "timestamp": "2023-04-25 18:24:48 CEST+0200", "meta": {"description": "Embark on a journey of silent self-discovery with a team of world-renowned well-being experts and learn to hear your inner voice through meditation, yoga, and focused intentions.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/retreats/silent-awakenings", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "Silent Awakenings", "cleaned_text": "An Inward Journey through Silence \n\nShh. Turn down the noise. Power off the distractions. Just listen. Do you hear it in the silence? That’s your inner voice. When you step away from the noise of everyday life, you make space for the thoughts that matter—the ones that tell you what you want and need.\n\n\n\nSilent Awakenings is a week-long journey within, inspired by teachings and writing of Deepak Chopra. Held along the banks of the Colorado River at the secluded Hyatt Lost Pines Resort and Spa, you’ll embark on a journey of silent self-discovery and allow your mind and body to settle into their own natural rhythms. Deepak Chopra and the most inspiring names in well-being will gently guide you as you create space for stillness, relax beneath the wide sky, and reconnect with your deepest self.\n\n\n\nSilence allows you to go beyond inner and outer distractions, see life's challenges from a clear perspective, and watch as your soul shines through. For that reason, we ask that you attend this retreat on your own so that you may focus all your attention on your spiritual growth.\n\nChopra retreats have been gatherings where people have found love, inspiration, and connection as well as experienced transformational healing. After deep reflection, 2023 will be the last year for Chopra live events as we’ve experienced them.\n\n\n\nThere are several upcoming opportunities in 2022 and 2023 to come together and celebrate the unique magic of Chopra’s transformational retreats. We’re committed to making our final events extra special—a year of beautiful grand finales dedicated to you.\n\n\n\nIf you’ve attended one of our events in the past, you know the synchronistic magic that happens at Chopra events. We’d love for you to experience it one more time.\n\n\n\nAnd if you’ve never been to one of our events because you’ve been waiting for the right time... we hope that you’ll join us in presence, joy, and most of all, gratitude for the beautiful memories we’ve made, and the countless lives we’ve touched and will continue to impact as we move forward. Learn more What can I expect when I attend this retreat? During your week of silence, you will participate in sunrise practices, walking meditations across the winding pathways of the hotel grounds, heart and mind-opening lectures, journaling sessions, and transformational satsangs with Deepak by the fire. Twice each day, Chopra-certified instructors will lead you through yoga sessions designed to honor silence and awaken to your deepest self. Each 60-minute session will feature classes suited for all skill levels and be inspired by Chopra Yoga. Come together in a safe, loving, and non-judgmental environment with like-minded seekers and receive compassionate support and encouragement from the Chopra staff to help you become more self-aware and experience personal breakthroughs. Designed by a certified nutritionist, our primarily vegetarian meals feature fresh, local ingredients that promote lightness of body, clarity of mind, and openness of spirit. All meals are included. Vegan and gluten-free options are available by request. Let the beauty of nature do the talking Tucked away in the rolling hill country of Austin, Texas, the Hyatt Regency Lost Pines Resort and Spa is the perfect place for relaxation, contemplation, and diving deep into your inner stillness. Here, the great outdoors takes center stage amid towering pine trees and along the banks of the Lower Colorado River. With over 405 acres of wide-open space to explore, we invite you to let go of the anchors holding you back and open your senses, heart, and mind to the wonders of nature: gardens, waterfalls, pecan groves, rocking chairs beneath shade trees for quiet contemplation, a pool and lazy river, and so much more. After your days, relax by a fire pit near the river and gaze at the stars. Waitlist only\n• DEEPAK CHOPRA™ MD, FACP, founder of The Chopra Foundation, a non-profit entity for research on well-being and humanitarianism, and Chopra Global, a whole health company at the intersection of science and spirituality, is a world-renowned pioneer in integrative medicine and personal transformation. Chopra is a Clinical Professor of Family Medicine and Public Health at the University of California, San Diego and serves as a senior scientist with Gallup Organization. He is the author of over 90 books translated into over forty-three languages, including numerous New York Times bestsellers. His 90th book and national bestseller, Metahuman: Unleashing Your Infinite Potential (Harmony Books), unlocks the secrets to moving beyond our present limitations to access a field of infinite possibilities. For the last thirty years, Chopra has been at the forefront of the meditation revolution and his latest book, Total Meditation (Harmony Book, September 22, 2020) will help to achieve new dimensions of stress-free living and joyful living. TIME magazine has described Dr. Chopra as “one of the top 100 heroes and icons of the century.” www.deepakchopra.com\n• Brent BecVar has worked in direct association with Deepak Chopra and the Chopra Organization for more than 30 years and was one of the first certified instructors of both Primordial Sound Meditation and Perfect Health Ayurvedic Lifestyle. In 1993 with Dr. Chopra and Dr. David Simon, Brent established and supervised the Sharp Center for Mind Body Medicine Residential Program in Del Mar, California, which later became the Chopra Center for Wellbeing.\n• Sarah Platt-Finger is the Director of Chopra Yoga and the co-founder of ISHTA Yoga, LLC. Deepak Chopra has called Sarah “an extraordinary teacher of yoga who has contributed enormously to my well-being.” She received her 500-hour certification in the ISHTA lineage in 2004 and was initiated as a Yoga Master in 2013. Since then, Sarah has made it her life’s purpose to share the authentic teachings of yoga to a greater collective worldwide. She believes that yoga can be used as a microcosm for the reality we create off the mat, and that a deeper awareness of our physical, mental, and emotional patterns can bring us closer to the divine essence of our being. Sarah teaches an embodied and affirming practice that encourages healing, transformation, and self-empowerment.\n• Danielle has worked with Chopra Global for over 10 years leading events and trainings. For the past 20 years Danielle has worked with business leaders, elite athletes, intact teams, individuals, yogis and people who are completely new to wellbeing. She was most recently at Lululemon, as their Director of Mindfulness, Learning & Leadership leading a global team of facilitators and coaches. She is joining a financial institution as their head of Leadership Development and Organizational Wellness to lead wellbeing, including mental health programs to their employees.She is passionate about integrating the tools of mindful performance into corporate culture and has created trainings and practices that contribute to the wellbeing of 30,000 global employees, athletes and guests.Danielle leads in person and online programs, including 200hr and 300hr yoga leadership teacher trainings and immersive retreats. She is a Certified Professional Co-Active Coach (CPCC) and incorporates the teachings of yoga, meditation, Ayurveda and coaching with her clients.www.daniellemika.com\n• Dr. Suhas Kshirsagar is a world-renowned Ayurvedic physician and medical astrologer from a family of traditional Vedic healers in India. He holds a B.A. in Ayurvedic medicine and completed a three-year residency as an M.D. (doctorate in Ayurvedic internal medicine) at the prestigious Pune University in India.\n\nChopra Retreats are coming to an end. Join us for a year of beautiful grand finales and book one of our final retreats today! Your safety is our priority Due to the recent CDC guidance update, Chopra will no longer be requiring proof of vaccination or negative COVID-19 tests in order to attend the retreat. We strongly encourage, but will not require, all guests to wear a face mask in indoor event settings. Click below to learn about Chopra’s COVID-19 protocols.", "opengraph": {"url": "https://chopra.com/retreats/silent-awakenings", "image": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "site_name": "Chopra", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://chopra.com/retreat-announcement-faqs", "https://chopra.com/retreat-announcement-faqs", "#pricing", "#pricing", "https://chopra.com/bio/deepak-chopra-m-d", "https://chopra.com/bio/deepak-chopra-m-d", "https://chopra.com/bio/brent-becvar-m-s", "https://chopra.com/bio/brent-becvar-m-s", "https://chopra.com/bio/sarah-finger", "https://chopra.com/bio/sarah-finger", "https://chopra.com/bio/danielle-mika-nagel", "https://chopra.com/bio/danielle-mika-nagel", "https://chopra.com/bio/suhas-kshirsagar", "https://chopra.com/bio/suhas-kshirsagar", "https://chopra.com/retreat-updates", "null", "https://chopra.com/retreats", "#updates", "https://chopra.com/retreat-updates"], "authors": [], "publish_date": null}