{"result_id": "367001", "URL": "https://chopra.com/articles/letter-about-our-covid-19-policy-at-chopra-retreats", "timestamp": "2023-04-25 18:24:36 CEST+0200", "meta": {"description": "Dear Chopra family,", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/articles/letter-about-our-covid-19-policy-at-chopra-retreats", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "Letter about our Covid-19 Policy at Retreats", "cleaned_text": "Chopra Global has always been at the forefront of health and wellbeing, applying the wisdom of ancient healing systems and integrating this with modern science. In the context of the current Covid-19 pandemic, it is imperative that we have a spiritual perspective, yet use modern science to guide us.\n\nWe have been excited to reintroduce our live events and facilitate gathering of our community after over a year of disconnection, and at the same time the health and safety of our employees and guests remains our priority. The scientific data is clear on transmission of the SARS-CoV-2 virus. The greatest risk of transmission is among unvaccinated people who are much more likely to contract the virus and also more likely to transmit the virus in the case of infection.\n\nWith this in mind, we are implementing policies for our live events that will reduce the risk of infection for our guests as well as our staff. As of Sept 15th, all staff and guests at Chopra events are required to be fully vaccinated against Covid-19 prior to arrival. In addition, per the CDC guidelines, we will use all of the preventive strategies available to prevent on-site transmission, including requiring masks be worn for all indoor activities, frequent sanitizing, and practicing social distancing as much as possible. We will be screening employees and guests for symptoms that may be related to COVID infection and in the event of resultant concerns, prohibiting participation until testing can be done. Documentation of vaccination is required in the form of the original vaccination card or a printed copy of the vaccination card, along with an appropriate ID matching the name displayed on the card. Documentation must show receipt of all generally suggested doses of the applicable vaccine no less than two (2) weeks prior to the start of the applicable event, including any boosters or other re-vaccinations suggested due to the passage of time. Due to the changing nature of this pandemic, we will update our policy as needed.\n\nThis stance is not based on fear of a virus, but on the reality of the pandemic that is facing us at this time. By implementing this policy, we can maximize the safety of employees and guests while benefiting from the ability to gather in community and continue our physical, mental and spiritual wellbeing journey together.", "opengraph": {"title": "Letter about our Covid-19 Policy at Chopra Retreats", "url": "https://chopra.com/articles/letter-about-our-covid-19-policy-at-chopra-retreats", "image": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "description": "Dear Chopra family,", "site_name": "Chopra", "type": "article", "article:author": "https://chopra.com/bio/sheila-patel-m-d", "article:published_time": "2021-08-19T23:48:54.548", "article:modified_time": "2021-08-19T23:48:54.548", "article:section": "In The News"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": "2021-08-19T23:48:54.548"}