{"result_id": "367014", "URL": "https://chopra.com/retreats/silent-awakenings/faq", "timestamp": "2023-04-25 18:24:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/retreats/silent-awakenings/faq", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "Silent Awakenings FAQs", "cleaned_text": "Welcome to your Silent Awakenings FAQ page! We are grateful for your patience as we finalize all the necessary details you’ll need to know about your September 25, 2022 retreat at beautiful Tenaya Lodge in Yosemite.\n\nWhat airports are close by?\n\nTenaya Lodge at Yosemite is located 62 miles north of Fresno International Airport (FAT) on California State Highway 41 and 2 miles from the south entrance to Yosemite.\n\nHow can I get to the hotel from the airport?\n\nThere is no public transit from Fresno after Labor Day weekend. Taxi and ride-sharing services are both available at the airport and recommended. Rental cars are available from all major companies.\n\nHertz is offering discounted rates for Chopra guests. To book, visit the Hertz Website and select Enter a Promo or Discount. In the box labeled Discount/CDP/Club Code, enter code 2188961, select I am booking this trip for: \"Leisure,\" and hit apply.\n\nWill there be parking available?\n\nSelf-parking is available for no charge. A parking permit is required and will be issued at the time of check-in.\n\nHow do I book my hotel with the Chopra discounted rate?\n\nContact your Program Consultant for specific details.\n\nWhat time is hotel check-in?\n\nStandard check-in at Tenaya Lodge is 4:00 pm. The hotel will allow early check-in upon arrival if rooms are available.\n\nWhat time is hotel check-out?\n\nStand check-out at Tenaya Lodge is 11:00 am. The hotel will provide storage for your luggage at the valet is needed.\n\nWhat amenities are available at the hotel?\n\n\n\nWhat meals are included at this event?\n\n\n\nI have food sensitivities. What kind of food will I be able to eat?\n\nAll meals will be clearly labeled for easy reference. Please contact your Program consultant if you have specific restrictions. In addition, Tenaya Lodge has detailed procedures in place to ensure safe food preparation to accommodate guests with allergies.\n\nWhat restaurants are on the property?\n\n\n\nWhat should I wear?\n\nComfortable clothing for meeting spaces and resort wear for activities. We recommend layers as the temperatures can vary in the meeting space and outdoors. You will also want to have clothing for yoga and outdoor excursions on hand if you desire. It is suggested that guests wear white for the closing ceremony on Friday, September 30th.\n\nDo I need to bring a yoga mat?\n\nAll retreat guests will be provided a travel yoga mat by Yoga Design Lab at event registration.\n\n\n\nAs always, the health, safety, and well-being of our community are a top priority.\n\nWe pay close attention to the evolving nature of the ongoing COVID-19 pandemic and changes to related guidance from public health organizations, including the CDC, as well as local rules and regulations in effect at the locations our retreats are held. We also recognize that due to the lifting of mask mandates in public spaces, such as airplanes and hotels, more stringent safety requirements that we might seek to enforce at Chopra events regarding COVID would be insufficient to fully control the environment at our events.\n\nConsequently, as of August 10, 2022, we are no longer requiring proof of COVID-19 vaccination or negative testing prior to attendance at Chopra events. In addition, although we highly encourage guests to continue to wear masks indoors at our events, we will not be enforcing a mask mandate unless required by local regulations.\n• Event guests are not required to provide proof of COVID-19 vaccination or a negative COVID-19 test.\n• We will continue to screen event guests for symptoms that may be related to COVID-19 infection and, in the event of resultant concerns, prohibit participation until testing can be conducted.\n• We strongly encourage, but will not require, all guests to wear a face mask in indoor event settings.\n• We strongly encourage all event guests to be fully vaccinated against COVID-19 prior to attending any large gatherings, including Chopra events\n\nPlease note that our policies and procedures continue to be based on the current nature of the COVID-19 pandemic and related public health guidance, among other factors. Accordingly, this policy is subject to change. We encourage you to check this page regularly for any changes or updates to the foregoing.\n\nClick here to learn more about Chopra’s Covid-19 protocols.\n\n\n\nPlease take the Chopra Meditation Foundations before your retreat. This course can be accessed anywhere, anytime, and takes most people around 3 hours to complete. You will use your mantra for the group meditations at the retreat to deepen your experience.\n\nHere's how to access your Chopra Meditation Foundations Course:\n• Step 2: Click on the “Sign In” link to be redirected to the login page. Enter your username (your email address) and your new password then click the “Sign In” button.\n• Step 3: Land on your Home Page, where you’ll find your Chopra Meditation Foundations course.\n\nNeed some help? Customer Excellence is more than happy to assist. Please email them at or call 760-494-1688.\n• First time logging in? Click to access the Chopra Education password reset page.\n• The email address that this message has been sent to will be the one associated with your Chopra account. Enter this email address, then select “Send Reset Link”.\n• You will immediately receive an email from with a password reset link.\n• The link will direct you to a landing page prompting you to reset your password. Follow the prompts, then select “Change Password”.\n• If you don’t see this, please be sure to check your spam/junk/promotions folder in your email.\n• Bookmark Learn.Chopra.com for easy access to all Chopra online learning.\n\nDownload the Chopra Retreats App! With the app, you can see the schedule, sign up for breakout sessions, communicate with other guests and talent, view the map, save content, and so much more! The Chopra Retreats app is available in the or . To access the Silent Awakenings retreat in the app, follow these steps:\n• Open your Chopra Retreats app\n• Enter passphrase: A passphrase will be shared via email closer to the event.\n• Allow push notifications to stay up to date with event alerts and changes.\n• If this is your first Chopra retreat using our Chopra Retreats App, create your account by clicking the profile icon in the top right corner. Be sure to use this email address to sign up\n• If you have previously attended a Chopra Retreat and used our Chopra Retreats App, log in to your existing account\n• A General Info screen will appear with the event location and basic information\n• You’re all set! Feel free to navigate the Silent Awakenings Retreat details: Tap the menu (three yellow lines) in the top left-hand corner to explore.\n• If you need to reset your password, the email will be sent from\n\nWe also suggest that you read the following book(s) prior to attending so that you can get the most out of your experience:\n• Holy Silence, The Gift of Quaker Spirituality, by J. Brent Bill\n• Book of Secrets, 112 Meditations to Discover the Mystery Within, by Osho\n• Listening Below the Noise, by Anne D. LeClaire\n\nWhat time is event registration?\n\nEarly event registration for Silent Awakenings will take place Sunday, September 25th between 3:00 pm to 6:00 pm. Registration will also be offered Monday, September 26th from 7:00 am to 8:30 am.\n• Access to the Chopra Meditation Foundations Course\n\nWhat event seating is available?\n\nSeating is on a first-come, first-served basis and changes daily.\n\nWhat is a typical day like?\n\nYour day will follow the basic structure below. Meditations will be led by Deepak and Chopra Certified Instructors.\n\nTo learn more about what a typical day would look like, view the schedule on the retreat page.\n\nAre there any additional materials I need to prepare myself for this event?\n\nPaid tuition to Chopra’s Meditation Foundations Course is included as part of Silent Awakenings to enrich both your experience at the retreat and also the quality of your life.\n\nIf you have not already received your Primordial Sound Mantra, this course is a supplement to the event and will prepare you to fully understand the teachings offered at Silent Awakenings. If you have already received your Primordial Sound Mantra, you can use this course as a refresher or gift to a friend.\n\nWhat is Ayurveda? \n\nAyurveda means “the science of life.” Developed over thousands of years through studying different mind and body types, Ayurveda provides a roadmap to whole-body, personalized health.\n\nThe two main guiding principles of Ayurveda are:\n• The mind and the body are inextricably connected and\n• Nothing has more power to heal and transform the body than the mind. Freedom from illness depends upon expanding our own awareness, bringing it into balance, and then extending that balance to the body.\n\nWho will benefit from this retreat? \n\nSilent Awakenings is for committed Primordial Sound Meditation practitioners who want to take their meditation and spiritual awareness to a deeper level. A silent retreat isn’t suited for everyone, yet for those who are ready to take a deep inward journey, many gifts await.\n\nSilent Awakenings is perfect for anyone who wants to:\n• Step away from life’s demands and engage in deep reflection.\n• Engage in an extended experience of personal contemplation and rejuvenation.\n\nWhat happens during personal time? \n\nYou will have time every day to be alone. You can exercise, write in your journal, walk in nature, or do anything that is nurturing for your experience.\n\nAre there any requirements to attend? \n\nSilent Awakenings is an advanced retreat, limited to guests who have previously attended any Chopra program, workshop, or taken our Primordial Sound Meditation or Chopra Meditation Foundations online course. This is a unique opportunity for an extended experience of meditation, silence, and contemplation that will help you dive deeper and be more present in your life.\n\nWe ask that participants fulfill the following prerequisites before coming to Silent Awakenings:\n• For at least two months prior to the event, participants need to have a practice of meditating twice a day with one of the daily meditations lasting a minimum of thirty minutes.\n• At least one day a month in the time leading up to the event, spend the day in silence.\n\nExperiences during meditation and silence vary for each individual. These practices in a retreat setting offer a unique opportunity for growth, healing, and positive transformation. As part of a healing journey, these practices can bring to the surface some challenging thoughts, emotions, and memories or can trigger physical symptoms, especially in the case of past trauma. For the majority of attendees, these experiences can be managed with the support of our staff and teachers. Chopra Global retreats are designed for participants who are mentally and physically stable and not for one-on-one psychological support or acute medical emergencies. They are not a substitute for professional therapy or medical care. If you have pre-existing mental or physical health conditions, please consult with your health care provider or therapist prior to registering for a retreat. In the event of emergency or the need for advanced care during a retreat, guests will be referred to on-site property staff and resources. Chopra Global will not be held liable for any ill effects that occur during a retreat. If you are under the care of a psychiatric professional, we recommend you discuss attendance in the retreat with them to see if it is appropriate for you.\n\nWhat is the local climate like? \n\nTenaya Lodge is located in Fish Camp, CA just outside Yosemite National Park. Average daily temperatures during the retreat range from a high of 75 degrees to a low of 45 degrees.\n\nWhat are the highlights of the area?\n\n\n\nWhere are the nearest hiking trails? \n\nThere are several hiking trails on the property. Additionally, hiking trips in Yosemite can be scheduled through the concierge for an additional fee.", "opengraph": {"title": "Silent Awakenings FAQs", "url": "https://chopra.com/retreats/silent-awakenings/faq", "image": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "description": "Embark on a journey of silent self-discovery with a team of world-renowned well-being experts and learn to hear your inner voice through meditation, yoga, and focused intentions.", "site_name": "Chopra", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.touchofclasslimo.com/", "https://www.limoforyou.com/", "https://chopra.com/retreat-updates", "https://learn.chopra.com/learn/signin?_ga=2.112042564.1342905620.1650483114-943178957.1626884357", "mailto:support@chopra.com", "https://learn.chopra.com/learn/forgot-password", "mailto:support@chopra.com", "https://apps.apple.com/us/app/chopra-retreats/id1463445975", "https://play.google.com/store/apps/details?id=com.guidebook.apps.chopraretreats.android", "mailto:passwordreset@guidebook.com", "https://chopra.com/retreats/silent-awakenings#schedule"], "authors": [], "publish_date": null}