{"result_id": "367013", "URL": "https://chopra.com/well-within-faqs-2022", "timestamp": "2023-04-25 18:24:44 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/well-within-faqs-2022", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "Well Within FAQs", "cleaned_text": "What airports are close by? \n\nThe Terranea Resort is approximately 30 minutes from Los Angeles International Airport (LAX) and Long Beach Airport (LGB). Taxi and ride-sharing services are also available at the airport and recommended.\n\nHow should I get to the hotel from the airport?\n\nRequest an Uber or Lyft:\n\nDownload the Uber App \n\nDownload the Lyft App \n\nPrivate car transfers are offered through . You can book your private transfer by contacting the Terranea concierge at 855-938-4047 or by emailing res@avalontrans.com directly.\n\nIs there parking on property?\n\nValet parking is available at the resort for a discounted nightly fee of $25.\n\nDo I need to book my hotel stay?\n\nYour hotel stay is included in the cost of the package. Contact your Program Consultant for more details about extra nights or upgraded room types.\n\nWhat time is hotel check-in?\n\nStandard check-in at Terranea Resort is 4:00pm. The hotel will allow early check-in upon arrival if rooms are available.\n\nWhat time is hotel check-out?\n\nStandard check-out at Terranea Resort is at 11:00am. The hotel will provide storage for your luggage at the valet if needed. Guests should check out of their rooms during breakfast. The hotel will hold guests' bags until they are ready to depart.\n\nWhat amenities are available at the hotel?\n• Spa\n• As a retreat guest, you will receive a 10% discount on all spa services during your stay. To receive this discount, mention “Chopra” and book your spa experience through the spa receptionist. Book your appointment online or call: 310-265-2740\n• We highly recommend that you book your appointment prior to your arrival to ensure availability.\n• Golf\n• The Links at Terranea is a dramatic nine-hole, par-3 Southern California oceanfront golf course, with stunning views of the Pacific Ocean and Catalina Island. Masterfully routed and beautifully integrated with its natural surroundings, this collection of championship-caliber holes offers a unique environment for both group and individual play. Artful bunkering, unobstructed sightlines and a wide range of classic strategic elements combine to deliver an unparalleled golf experience on the Los Angeles coast.\n• For more information and to book a tee time, visit The Links website .\n• Fitness\n• The panoramic views from the 5,000-square-foot Fitness & Wellness Center and adjoining Movement Studio bring nature indoors to inspire and motivate. State of-the-art Technogym cardio equipment, customized personal training sessions or private classes are available to assist you with meeting your goals. Classes range from relaxing to challenging and include yoga, Pilates, circuit training, water aerobics, seaside cycling, and \"Nature's Gym” (our signature boot camp fitness class).\n• The Tide Pool Kids Club is available for children ages 4–12 years old. Children must be potty-trained and advanced reservations are required. For complete details or for more information, please view the , call (310) 265-2843 or email terraneakidsclub@terranea.com.\n\nWhat Room Packages are Available?\n\nContact your Program Consultant if you would like to upgrade to one of the following:\n\nWhat meals are included for this event?\n\n\n\nWhat kind of food will be served?\n\nFresh, locally-sourced, primarily-vegetarian meals curated by the Executive Chef in partnership with our Nutritionist following the main principles of Ayurveda. Vegan and Gluten-free options will be available at all meals.\n\nI have food sensitivities. What kind of food will I be able to eat?\n\nIf you have dietary restrictions recommended by a physician, please contact your Program Consultant with your specific requests accompanied by a note from your doctor.\n\nAre there restaurants on property or within walking distance?\n\nThere are several restaurants on property at Terranea Resort, including:\n• None\n• New American Cuisine, open for breakfast, lunch, and dinner daily\n• None\n• Open for dinner Monday-Sunday, open for lunch and dinner Friday-Sunday\n\nWhat should I wear?\n\nComfortable clothing for meeting spaces and resort wear for activities. We recommend layers as the temperatures can vary in the meeting space. Many guests have blankets or jackets for their comfort inside. You’ll also want to have clothing for yoga and additional excursions on hand if you so desire.\n\nDo I need to bring a yoga mat?\n\nAll retreat guests will be provided a travel yoga mat by Yoga Design Lab at event registration.\n\nAre pets allowed at the retreat?\n\nUnfortunately, no pets are permitted at retreats.\n\nGet your personalized mantra\n\nPlease take the Chopra Meditation Foundations before your retreat. This course can be accessed anywhere, anytime, and takes most people around 3 hours to complete. You will use your mantra for the group meditations at the retreat to deepen your experience.\n\nHere's how to access your Chopra Meditation Foundations Course:\n\nStep 1: Log into your Chopra Education account \n\nStep 2: Click on the “Sign In” link to be redirected to the login page. Enter your username (your email address) and your new password then click the “Sign In” button.\n\nStep 3: Land on your Home Page, where you’ll find your Chopra Meditation Foundations course.\n\nStep 4: Begin learning and receive your Primordial Sound Mantra!\n\nNeed some help? Customer Excellence is more than happy to assist. Please email them at or call 760-494-1688.\n• First time logging in? Click to access the Chopra Education password reset page.\n• The email address that this message has been sent to will be the one associated with your Chopra account. Enter this email address, then select “Send Reset Link”.\n• You will immediately receive an email from with a password reset link.\n• The link will direct you to a landing page prompting you to reset your password. Follow the prompts, then select “Change Password”.\n• If you don’t see this, please be sure to check your spam/junk/promotions folder in your email.\n• Bookmark Learn.Chopra.com for easy access to all Chopra online learning.\n\nChopra Retreats App\n\nDownload the Chopra Retreats App! With the app, you can see the schedule, sign up for breakout sessions, communicate with other guests and talent, view the map, save content, and so much more! The Chopra Retreats app is available in the or . To access the Well Within retreat in the app, follow these steps:\n• Allow push notifications to stay up to date with event alerts and changes.\n• If this is your first Chopra retreat using our Chopra Retreats App, create your account by clicking the profile icon in the top right corner. Be sure to use this email address to sign up\n• If you have previously attended a Chopra Retreat and used our Chopra Retreats App, log in to your existing account\n• A General Info screen will appear with the event location and basic information\n• You’re all set! Feel free to navigate the Well Within Retreat details: Tap the menu (three yellow lines) in the top left-hand corner to explore.\n• If you need to reset your password, the email will be sent from\n\nHow To Sign up for Breakout Sessions in the Chopra Retreats App\n• Tap the menu (three yellow lines) in the top left-hand corner, and select “Retreat Schedule”\n• Next to each session on the right, there is a yellow plus sign. Tap the plus sign to add that session to your personal schedule. A prompt will appear that confirms your registration was successful, and the yellow plus sign becomes a checkmark.\n• To unregister for a session, tap the yellow check mark and select “Unregister”\n• You must register for a breakout session to attend.\n• Breakout sessions are indicated by a black box under the session name with the remaining spaces. You will not be able to register for more than one breakout session at the same time.\n• Tap the menu and select “Personal Schedule” to see any sessions you have added or breakout sessions you have registered for.\n• You can view all breakout sessions, and all sessions that require advanced sign ups under the Breakout Sessions tab from the menu dropdown list.\n\nHow To Sign up for a ProVEDA Massage in the Chopra Retreats App\n• Tap the menu (three yellow lines) in the top left-hand corner, and select “ProVEDA Massage Schedule”\n• Next to each session on the right, there is a yellow plus sign. Tap the plus sign to add that massage session to your personal schedule. A prompt will appear that confirms your registration was successful and the yellow plus sign becomes a check mark.\n• To unregister for a session, tap the yellow check mark and select “Unregister”\n• Tap the menu and select “Personal Schedule” to see any sessions you have added or breakout sessions you have registered for.\n\nDiscover Your Dosha\n\nDiscover your dosha in seconds and hop on the path to better health. Find out your mind-body type here:\n\nWhat time is event registration?\n\nEvent registration for Well Within is Thursday, October 6 from 4:00pm – 7:00pm and Friday, October 7 from 7:30am – 9:00am.\n\nWhat is included in my ticket?\n• Access to the Chopra’s Meditation Foundations Course\n\nWhat event seating is available?\n\nSeating is on a first come first serve basis and changes daily. Our Certified Teachers and Premier Access guests will have reserved seating throughout the event within the keynote space known as “the Sanctuary”.\n\nWhat is the climate of the area?\n\nThe climate of Rancho Palos Verdes is year-round mild-to-hot and mostly dry. October to November is mild and pleasantly warm with the average temperatures ranging from 58°F (14.4°C) to 78°F (25.6°C). Sunny days abound with more than 8 hours of daily sunshine, and the atmosphere is beautiful. Sea temperatures are a little cold for swimming.\n\nWhat are some highlights of the area?\n\nTerranea is located on the Palos Verdes Peninsula, one of Southern California’s most scenic and coveted coastlines overlooking the Pacific Ocean and Catalina Island. When you step onto Terranea’s 102-acre coastal resort paradise, it's like stepping into a whole new world – a hidden gem just minutes from the bustle of Los Angeles. Enjoy a tranquil escape in this natural haven with an endless array of awe-inspiring adventures and quintessential California fun. Click to explore local attractions.\n\nAs always, the health, safety, and well-being of our community are a top priority.\n\nWe pay close attention to the evolving nature of the ongoing COVID-19 pandemic and changes to related guidance from public health organizations, including the CDC, as well as local rules and regulations in effect at the locations our retreats are held. We also recognize that due to the lifting of mask mandates in public spaces, such as airplanes and hotels, more stringent safety requirements that we might seek to enforce at Chopra events regarding COVID would be insufficient to fully control the environment at our events.\n\nConsequently, as of August 10, 2022, we are no longer requiring proof of COVID-19 vaccination or negative testing prior to attendance at Chopra events. In addition, although we highly encourage guests to continue to wear masks indoors at our events, we will not be enforcing a mask mandate unless required by local regulations.\n• Event guests are not required to provide proof of COVID-19 vaccination or a negative COVID-19 test.\n• We will continue to screen event guests for symptoms that may be related to COVID-19 infection and, in the event of resultant concerns, prohibit participation until testing can be conducted.\n• We strongly encourage, but will not require, all guests to wear a face mask in indoor event settings.\n• We strongly encourage all event guests to be fully vaccinated against COVID-19 prior to attending any large gatherings, including Chopra events\n\nPlease note that our policies and procedures continue to be based on the current nature of the COVID-19 pandemic and related public health guidance, among other factors. Accordingly, this policy is subject to change. We encourage you to check this page regularly for any changes or updates to the foregoing.\n\nClick here to learn more about Chopra’s Covid-19 protocols.", "opengraph": {"title": "Well Within FAQs", "url": "https://chopra.com/well-within-faqs-2022", "image": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "site_name": "Chopra", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.uber.com/en-GH/drive/resources/download-the-app/", "https://www.lyft.com/app-sms", "https://avalontrans.com/", "https://psmsspa-northcentral.azurewebsites.net/#/en-US/terranea/SPA/", "https://www.terranea.com/golf", "https://www.terranea.com/experiences/tide-pool-kids-club", "https://www.terranea.com/dining/marsel", "https://www.terranea.com/dining/catalina-kitchen", "https://www.terranea.com/dining/bashi", "https://www.terranea.com/dining/nelsons", "https://www.terranea.com/dining/solviva", "https://learn.chopra.com/learn/signin?_ga=2.112042564.1342905620.1650483114-943178957.1626884357", "mailto:support@chopra.com", "https://learn.chopra.com/learn/forgot-password", "mailto:support@chopra.com", "https://apps.apple.com/us/app/chopra-retreats/id1463445975", "https://play.google.com/store/apps/details?id=com.guidebook.apps.chopraretreats.android", "mailto:passwordreset@guidebook.com", "https://chopra.com/dosha-quiz", "https://www.terranea.com/resort/local-area/local-attractions-palos-verdes", "https://chopra.com/retreat-updates"], "authors": [], "publish_date": null}