{"result_id": "367011", "URL": "https://chopra.com/retreats/health-retreat", "timestamp": "2023-04-25 18:24:42 CEST+0200", "meta": {"description": "Real growth doesn’t happen by simply listening and absorbing—it’s the result of engaging, participating, and actually doing the work. Jumpstart your journey towards whole health at this one-of-a-kind retreat featuring world-renowned thought leaders speaking about cutting-edge topics and wisdom traditions for modern life.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/retreats/health-retreat", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "Chopra Health • Twice Monthly", "cleaned_text": "This experience has changed my life. I arrived feeling broken. I left feeling powerful. I know, without a doubt, I will continue to elevate my life, and others around me, through these practices. This 6-day course instilled in me the faith I needed in myself and the universe. A \"playground of well-being\" nestled in the high Sonoran Desert, CIVANA Wellness Resort and Spa is devoted entirely to whole health. The resort offers a vast array of classes to supplement your experience, including guided hikes, yoga, sound healing, cycle classes, outdoor adventure, and more. During your six days, you can even enjoy the benefits of hydro-therapy at the , a unique and immersive spa experience that utilizes alternating hot and cold elements to ground your body, boost circulation and soothe the soul (included with every spa treatment).\n\n Experience days of custom spa experiences that include that will help you relax and invigorate your true self. This includes the Revive to Thrive treatment featuring dry-glove exfoliation to jumpstart detoxification and stimulate the lymphatic system; warm herbal oil from scalp to toes, with friction strokes to further dislodge toxins; relaxing muscle-specific strokes; and marma point therapy to awaken energy in the body, calm the mind and activate healing. The result: A feeling of calm, grounded energy to help you feel renewed.\n\n After completing a Mind-Body Health Questionnaire, you will meet one-on-one for a 60-minute consultation with a physician trained in Ayurveda. Together, you will create a personalized health and lifestyle wellness plan based on your and specific needs to unlock lasting transformation. Learn how to leverage the 5,000-year-old holistic healing system of to reduce inflammation (a causative factor in most chronic disease), rebalance the gut, and balance the nervous system to achieve optimal wellness. In intimate educational sessions and workshops, expert educators will teach you how to take a life-changing, well-rounded approach to your well-being. Tap into the power of , our signature practice relying on personalized mantras to cultivate calm, compassion, and clarity. \n\n\n\nExperience mindful movement through daily classes blending traditional wisdom and modern wellness techniques to promote inner peace, improved flexibility, and increased strength. Our team of experts will guide you through a multi-step process during the retreat that will help reduce . This gentle cleanse will leave you with a regained sense of energy and vitality. Nourish your body with clean, locally-sourced vegan meals developed by our Executive Chef Ashley Reese. These light and savory meals are specially designed using to support the multi-step detoxification process so you can leave feeling better than ever. Treat yourself to the RAJA package Our RAJA package takes your self-care one step further. Stay in a luxurious Spa King room featuring a soaking tub and aromatherapy. Enjoy an enhanced spa treatment experience, with upgrades including two treatments with two therapists and an additional specialized treatment. And take home a premier amenity gift box. \n\n Book now This program would be good for anyone who is open-minded and truly wants to heal, be happy and healthy, and live a life of their greatest expectations—a life worthy of their dreams.\n• Dr. Fabio is a triple board-certified physician with expertise in Integrative & Functional Medicine/Oncology, Molecular Imaging and Obesity. Dr. Fabio served as an Assistant Professor of Radiology & Radiation Oncology, and subsequently as the Director of Molecular Imaging for the University of Arizona Medical Center in Tucson, Arizona. Dr. Fabio is a fellow of the Integrative Medicine Program at the University of Arizona, where he additionally studied integrative medicine, herbal medicine, nutrition, fitness, acupuncture, and stress management. He is published in several peer-reviewed journals and book chapters in radiology, oncology, cardiology, nutrition, and information science.Dr. Fabio is the medical director for the Chopra Health Program at CIVANA and the founder and director of the Center for Integrative Healing and Wellness at the CIVANA Wellness Resort and Spa. When not working, Dr. Fabio is an outdoor enthusiast, naturalist, and practitioner of shinrin-yoku (forest bathing) - hiking, mountain biking, kayaking, and camping throughout the amazing Arizona and Southwest.\n• Dr. Bartlett Hackenmiller is a physician and author who is board-certified by both the American Board of Obstetrics and Gynecology and the American Board of Integrative Medicine. Her family and personal experiences drove her to explore healing modalities beyond pharmaceutical drugs and surgery, including the healing effects of time in nature. As a result, she completed a fellowship at the University of Arizona Andrew Weil Center for Integrative Medicine and has pursued certifications in herbal medicine, Ayurveda, science, and medical writing, and is a certified nature and forest therapy guide. She has served as medical director of the Association of Nature and Forest Therapy and is currently Chief Medical Advisor for Alltrails. She joined the medical team at the Chopra Health Retreat in 2021 and serves as the Lead Ayurvedic Health Practitioner.Dr. Suzanne is the award-winning author of “The Outdoor Adventurer’s Guide to Forest Bathing,” published in 2019 and “A Friend Like John, Understanding Autism,” published in 2011. She speaks internationally and does freelance writing about integrative medicine and nature therapy.Suzanne and her husband Joe enjoy spending time with their large blended and extended family. They are avid outdoor enthusiasts and lead workshops combining outdoor adventure and the mindful practice of forest bathing.\n• Dr. Patel is triple boarded in Internal Medicine, Pediatrics & Integrative Medicine. Her mission is to help individuals prevent and reverse chronic disease, optimize wellness, and live the best life with energy, joy, and vitality. She believes in blending Eastern & Western medicine and empowering her patients with the knowledge to find the root cause of disease and helping them take back control of their health. She specializes in chronic conditions such as thyroid & hormones, gut health, inflammatory conditions, heart disease, and diabetes.\n• Dr. Barlow is board-certified in Integrative Medicine, Family Medicine, and Hospice and Palliative Medicine osteopathic physician. During her 16 years in Family Medicine and Hospice, she also became a Chopra Certified Ayurvedic Lifestyle and Primordial Sound Meditation Instructor, a 6 Steps to Self-Healing certified provider as well as a yoga instructor, Reiki master, and Emotional Freedom Technique practitioner. Improving and maintaining well-being continues to be Dr. Carrie’s passion, and she pulls from a wide array of techniques to give individualized integrative recommendations to her patients. When she is not working you can find her reading books on spirituality or American history, watching action movies with her husband, jumping on the trampoline with her 2 sons, or taking her dog for long walks with her neighbors.\n• Julie Rake began practicing family medicine as a PA in 2003 and specialized in primary care and women’s health. She completed the Integrative Medicine Fellowship at the University of Arizona under the tutelage of Integrative Medicine leader Dr. Andrew Weil and graduated in 2015.Julie’s true passion lies in the study of Neuroplasticity and Mind-Body medicine.She speaks frequently to health care professionals, patients and other groups on various topics related to healing trauma and advancing health from a mind/body approach. Some of her top presentations include “Suicide Prevention,” “Post Traumatic Stress Disorder,” and “The Neuroscience of Transformation.”Julie joined the medical team at the Chopra Health Retreat in January of 2021. As a longtime student of the teachings of Deepak Chopra, she is committed to giving back to the Chopra mission of helping to heal, awaken, and transform lives.\n• Matthew Mabee received a Culinary Arts Degree from The Culinary Institute of America in 2013. He worked post-graduation in the Northeast as a Pastry Chef at a local bakery and Cooking Classroom Instructor for a family run farm and winery in Connecticut. There, he collaborated with the Farmer/Nutritionist and a classically trained chef to instruct guests on how to prepare seasonal, nutritious foods and pair them with complementing wines. He also worked in private residences as an Event Concierge for a local catering company executing private business dinners for high profile clients, birthday celebrations, and holiday events in lower Connecticut and New York.In 2015, Matthew moved westward to California where he worked in Front Office, Guest Services, Club Lounge Services, and Reservations for The Ritz-Carlton, Half Moon Bay. Working in the various roles within the resort, he provided luxury guest services for VIP clientele, large-group event clients, and leisure stay guests. He transitioned to CIVANA in 2021 as the Program Operations Manager to aid in facilitating the service delivery of Chopra Health Retreat. Matthew’s hope (along with the divine timing for self-discovery within the wandering soul) is that all whom he engages with find healing and peace.", "opengraph": {"url": "https://chopra.com/retreats/health-retreat", "image": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "site_name": "Chopra", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["#pricing", "https://civana1.wpengine.com/aqua-therapy-circuit/", "#pricing", "https://chopra.com/articles/your-guide-to-traditional-ayurvedic-massage", "#pricing", "https://chopra.com/articles/the-key-to-perfect-health", "#pricing", "https://chopra.com/articles/ask-dr-sheila-what-is-ayurveda", "#pricing", "https://chopra.com/articles/what-is-primordial-sound-meditation", "https://chopra.com/articles/yoga-can-heal-your-life", "#pricing", "https://chopra.com/articles/healing-through-nature-with-plants", "https://chopra.com/articles/deep-detoxification-for-everyone", "#pricing", "https://chopra.com/articles/ayurveda-and-the-6-tastes-of-life", "#pricing", "#pricing", "https://chopra.com/bio/fabio-almeida", "https://chopra.com/bio/fabio-almeida", "https://chopra.com/bio/suzanne-bartlett-hackenmiller", "https://chopra.com/bio/suzanne-bartlett-hackenmiller", "https://chopra.com/bio/jyoti-patel", "https://chopra.com/bio/jyoti-patel", "https://chopra.com/bio/carrie-barlow", "https://chopra.com/bio/carrie-barlow", "https://chopra.com/bio/julie-rake", "https://chopra.com/bio/julie-rake", "https://chopra.com/bio/matthew-mabee", "https://chopra.com/bio/matthew-mabee", "https://civanacarefree.com/stay-well/", "https://chopra.com/retreat-updates#civana", "#contact", "#dates"], "authors": [], "publish_date": null}