{"result_id": "367020", "URL": "https://chopra.com/retreat-updates", "timestamp": "2023-04-25 18:24:49 CEST+0200", "meta": {"description": "As always, the health, safety, and well-being of our community is our top priority.", "lang": "en", "keywords": "", "favicon": "/apple-touch-icon.png", "canonical": "https://chopra.com/retreat-updates", "encoding": "UTF-8"}, "image": null, "domain": "chopra.com", "title": "Retreat Updates", "cleaned_text": "As always, the health, safety, and well-being of our community are a top priority.\n\nWe pay close attention to the evolving nature of the ongoing COVID-19 pandemic and changes to related guidance from public health organizations, including the CDC, as well as local rules and regulations in effect at the locations our retreats are held. We also recognize that due to the lifting of mask mandates in public spaces, such as airplanes and hotels, more stringent safety requirements that we might seek to enforce at Chopra events regarding COVID would be insufficient to fully control the environment at our events.\n\nConsequently, as of August 10, 2022, we are no longer requiring proof of COVID-19 vaccination or negative testing prior to attendance at Chopra events. In addition, although we highly encourage guests to continue to wear masks indoors at our events, we will not be enforcing a mask mandate unless required by local regulations.\n• Event guests are not required to provide proof of COVID-19 vaccination or a negative COVID-19 test.\n• We will continue to screen event guests for symptoms that may be related to COVID-19 infection and, in the event of resultant concerns, prohibit participation until testing can be conducted.\n• We strongly encourage, but will not require, all guests to wear a face mask in indoor event settings.\n• We strongly encourage all event guests to be fully vaccinated against COVID-19 prior to attending any large gatherings, including Chopra events\n\nPlease note that our policies and procedures continue to be based on the current nature of the COVID-19 pandemic and related public health guidance, among other factors. Accordingly, this policy is subject to change. Please check this page regularly for any changes or updates to our policy. This policy is in regard to Chopra Global's large destination retreats and does not pertain to smaller retreats and programs operated at partner properties, including the Chopra Health Retreat at CIVANA – for more information about the policies applicable at CIVANA please see below.\n\nIn addition to Chopra Global’s protocols, Chopra staff and event attendees are also subject to the COVID-19 policies enforced at the properties at which individual events are held. These policies may vary at each event venue based on numerous factors, including applicable governmental rules and regulations. Up-to-date information about the policies and procedures in place at specific event venues is available at the links below:\n\nAs of October 23, 2022, Chopra Health Retreat guests are no longer required to provide proof of COVID-19 vaccination or negative testing prior to attendance and while guests are highly encouraged to continue to wear masks indoors at CIVANA, a mask mandate will not be enforced unless required by local regulations; Chopra Health Retreat guests must follow CIVANA's safety standards and procedures which can be found and are subject to change based on the current nature of the COVID-19 pandemic and related public health guidance.\n\nWhat are you basing your policies on?\n\nChopra Global has always been at the forefront of health and well-being, applying the wisdom of ancient healing systems and integrating this with modern science. In the context of the current COVID-19 pandemic, it is imperative that we have a spiritual perspective, yet use modern science to guide us. While we continue to use lifestyle practices to maximize our potential for healing, we can also accept the benefits of modern medicine when needed. There is no contradiction here.\n\nAccordingly, under the guidance of our Chief Medical Officer, we stay current on all the medical literature and scientific discussions regarding COVID-19. Using CDC guidelines, along with advice from a range of medical experts in the field of immunology and public health, recommendations are made on company policies with the overarching goals of promoting the health, safety, and well-being of our guests and staff while at the same time welcoming our global community to the transformative experiences provided at our events.\n\nPlease note that in accordance with the changing nature of the pandemic and the relevant guidance from the established healthcare community, including the CDC, as well as any applicable governmental rules and regulations, we expect our policies to continue to evolve. Please check our website regularly for changes or updates to the foregoing.\n\nHow long is this policy in place for?\n\nWe closely monitor the evolving nature of the pandemic and the guidance from the established healthcare community, including the CDC, with the overarching goals to ensure that our policies for our events promote the health, safety, and well-being of our guests as well as our staff while at the same time welcomes our global community to the transformative experiences provided at our events.\n\nConsequently, this policy may change based on myriad factors, as we deem necessary. For the avoidance of doubt, the current policy will stay in place until we determine it is safe or necessary to change it.\n\nWill I still need to wear a mask at the retreat? Why?\n\nAt this time we are strongly encouraging, but not requiring, all guests to wear a face mask in indoor event settings. There is still evidence of the potential for transmission of the SARS-CoV-2 virus, and variants thereof, even among vaccinated people, and this risk is significantly reduced through the use of masks. Therefore, we still recommend, and will be offering, masks to be worn in indoor spaces.\n\nWhat are you doing to prevent the spread of COVID-19?\n\nWe will continue to screen Chopra employees and event guests for symptoms that may be related to COVID-19 infection and, in the event of resultant concerns, prohibit participation until testing can be conducted. We also take additional on-site precautions to mitigate potential transmission of infectious disease including encouraging guests to wear masks while indoors, promoting social distancing when possible, and implementing enhanced sanitation procedures.\n\nI registered for my retreat prior to this policy change (8/10/2022). Why have you made this change now?\n• We pay close attention the evolving nature of the ongoing COVID-19 pandemic and changes to related guidance from public health organizations, including the CDC, as well as local rules and regulations in effect at the locations our retreats are held and calibrate our policies accordingly, considering our overarching goals of promoting the health, safety, and well-being of our guests and staff while at the same time welcoming our global community to the transformative experiences provided at our events.\n• We also recognize that due to the lifting of mask mandates in public spaces, such as airplanes and hotels, more stringent safety requirements that we might seek to enforce at Chopra events regarding COVID would be insufficient to fully control the environment at our events\n• Based on the foregoing considerations, this policy may change, including by way of the re-introduction of more stringent requirements, as we deem necessary.\n\nMy question isn't listed here. Who can I ask?\n\nIf your question was not answered by our FAQs, please reach out to your Chopra Program Consultant directly via email or phone. If you cannot locate your Program Consultant's contact information, you may contact us at or 888-736-6895.", "opengraph": {"title": "Retreat Updates", "url": "https://chopra.com/retreat-updates", "image": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:url": "https://chopra.brightspotcdn.com/dims4/default/4434deb/2147483647/strip/true/crop/5472x2873+0+0/resize/1200x630!/quality/90/?url=http%3A%2F%2Fchopra-brightspot.s3.amazonaws.com%2Ff4%2F18%2F9da1ac5a4e1988beaed0d631368c%2Fohgotqym.jpeg", "image:width": "1200", "image:height": "630", "image:type": "image/jpeg", "description": "Ensuring health and safety at our retreats is our top priority", "site_name": "Chopra", "type": "website"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.tenayalodge.com/pages/alert", "https://www.terranea.com/promise", "https://www.marriott.com/en-us/hotels/mrkfl-jw-marriott-marco-island-beach-resort/overview/?scid=de46d581-3951-439d-a073-cd98dcc325b8&gclid=EAIaIQobChMI59f07vDB-QIVkvvjBx0HWgxCEAAYASAAEgLy2PD_BwE&gclsrc=aw.ds", "https://www.amrcollection.com/en/resorts-hotels/secrets/mexico/puerto-los-cabos-golf-spa-resort/?utm_source=gmb&utm_medium=SOCi", "https://www.fairmont.com/orchid-hawaii/?cmpid=google_orc_search-brand-ww_branded-e-revsh&kpid=go_cmp-801192929_adg-43113283673_ad-432372935458_kwd-75619961_dev-c_ext-_prd-&gclid=EAIaIQobChMIwObKnPHB-QIV6WJyCh0HywQqEAAYASAAEgJpUfD_BwE", "https://civanacarefree.com/stay-well/", "mailto:joinus@chopra.com"], "authors": [], "publish_date": null}