{"result_id": "368040", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/cancer/cuban-lung-cancer-vaccine/", "timestamp": "2023-04-25 18:26:12 CEST+0200", "meta": {"description": "Can you tell me anything about Cuba's lung cancer vaccine? Is it safe? Does it work? If so, is there any chance that it will be available in the U.S. any time soon?", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/cancer/cuban-lung-cancer-vaccine/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Cuban Lung Cancer Vaccine? - Ask Dr. Weil", "cleaned_text": "The Cuban pharmaceutical, CimaVax, is not what most people think of as a vaccine – it is not used to immunize people at risk for lung cancer. Instead, it is given to patients who already have the disease in order to slow the growth and spread of tumors. Based on what we know from clinical trials in Cuba and in Europe, CimaVax is safe, causes no significant side effects and has been effective in more than 50 percent of all cases. Reportedly, it has been used to treat about 5,000 lung cancer patients in Cuba and elsewhere. It has been available free to Cubans since 2011. Lung cancer is the fourth leading cause of death in Cuba, thanks in part to its famous cigars.\n\nCimaVax was in development for 25 years, and according to researchers in the United States, shows potential to be used as a traditional vaccine. If effective, it could actually prevent lung cancer in smokers and, perhaps, be used to treat and prevent other types of cancer including breast, colorectal, head-and-neck, prostate, pancreatic, and ovarian. Cuba’s Center for Molecular Immunology has signed an agreement with Roswell Park Cancer Institute in Buffalo, NY to perform a clinical trial of CimaVax in the U.S. This came about following President Obama’s move to normalize diplomatic relations between the U.S. and Cuba. Roswell Park must now apply to the FDA for permission to conduct the trial it envisions, a process anticipated to take six to eight months.\n\nCimaVax works by attacking a protein produced by tumors, causing the body to release antibodies against epidermal growth factor, a hormone that promotes the growth of cancer cells unless it’s blocked from reaching them.\n\nSimilar treatments are already available to lung cancer patients in the U.S. and Europe. The scientific excitement about CimaVax is its potential as a vaccine for cancer prevention. I’ve read that the Cuban researchers were unable to explore this for financial reasons. However, investigators there are now working on another promising lung cancer vaccine called Racotumomab that acts differently.\n\nFor a poor country – the average worker earns $20 per month – Cuba’s population is one of the healthiest in the world. Life expectancy for a child born there in 2011 is slightly longer than it is in the U.S. Researchers have termed this the “Cuban Paradox” since life expectancy usually is longer in wealthy countries. In an article about the good health of Cuba’s people, the credited the country’s public health system and government investment in primary care and public health measures. And clearly its success with CimaVax suggests that its medical research is world-class as well.\n\nE. Nininger Vinageras et al, “Phase II randomized controlled trial of an epidermal growth factor vaccine in advanced non-small-cell lung cancer.” Journal of Clinical Oncology, March 20, 2008 doi: 10.1200/JCO.2007.11.5980\n\nJerry M. Spiegel et al, “Lessons from the margins of globalization: appreciating the Cuban health paradox.” Journal of Public Health Policy, 2004", "opengraph": {"locale": "en_US", "type": "article", "title": "Cuban Lung Cancer Vaccine? - Ask Dr. Weil", "description": "Can you tell me anything about Cuba's lung cancer vaccine? Is it safe? Does it work? If so, is there any chance that it will be available in the U.S. any time soon?", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/cancer/cuban-lung-cancer-vaccine/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2017-11-14T04:06:16+00:00", "image": "https://www.drweil.com/wp-content/uploads/2017/01/health-wellness_body-mind-spirit_cancer_cuban-lung-cancer-vaccine_1440x1080_521615472.jpeg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/cancer/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/cancer/"], "authors": [""], "publish_date": "November 13, 2017"}