{"result_id": "368041", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-vaccine-side-effects/", "timestamp": "2023-04-25 18:26:14 CEST+0200", "meta": {"description": "Not everyone who receives the vaccine develops any side effects. Two shots are needed, spaced three or four weeks apart depending on whether you get the Pfizer-BioNTech product or the Moderna one.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-vaccine-side-effects/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "COVID-19 Vaccine Side Effects? | Disease & Disorders | Andrew Weil, M.D.", "cleaned_text": "First, you should be aware that not everyone who receives the COVID-19 vaccine develops any side effects. Two shots of the vaccine are needed, spaced three or four weeks apart depending on whether you get the Pfizer-BioNTech product or the Moderna one.\n\nAccording to the U.S. Centers for Disease Control and Prevention (CDC), the most commonly reported side effects of COVID-19 vaccination are pain at the injection site, tiredness, headache, muscle pain, chills, fever, joint pain and swollen regional lymph nodes.\n\nYou should be able to reduce any pain or discomfort in the affected arm by applying a clean, cool, wet washcloth over the area and by using the arm normally. If you find that the redness or tenderness where you got the shot increases after 24 hours, contact your healthcare provider. Do the same if you have other side effects that worry you or don’t seem to be going away after a few days.\n\nBe aware that you won’t be fully protected from COVID-19 until a week or two after you’ve received your second shot. In the meantime, be sure to take precautions – wear a mask over your mouth and nose when you’re around others, stay at least six feet away from others, avoid crowds and wash your hands often. It is best to continue masking and social distancing even after you are immunized.\n\nIf you’ve been infected by COVID-19 and recovered, you may be immune to reinfection for at least 90 days, although we don’t yet know how long natural protection lasts.\n\nThe vaccine itself won’t cost you anything, although your health care provider may charge an administration fee for giving the shot, and that cost can be reimbursed by your insurance company or, for the uninsured, by the U.S. Health Resources and Services Administration’s Provider Relief Fund.\n\nMy advice: Don’t worry about temporary side effects or cost. Get the shot!\n\nU.S. Centers for Disease Control and Prevention (CDC) “What to Expect after Getting a Covid 19 Vaccine,” January 11, 2021", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19 Vaccine Side Effects? | Disease & Disorders | Andrew Weil, M.D.", "description": "Not everyone who receives the vaccine develops any side effects. Two shots are needed, spaced three or four weeks apart depending on whether you get the Pfizer-BioNTech product or the Moderna one.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-vaccine-side-effects/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2021-09-03T16:48:44+00:00", "image": "https://www.drweil.com/wp-content/uploads/2020/12/22121828/COVID-19_Vaccine_QA_1213407600.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-what-you-should-know-about-coronavirus/"], "authors": [""], "publish_date": "September 3, 2021"}