{"result_id": "368036", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/mumps/", "timestamp": "2023-04-25 18:26:04 CEST+0200", "meta": {"description": "Mumps, also known as epidemic parotitis, is a highly contagious viral infection that primarily affects the parotid glands - the saliva-producing glands behind both cheeks. The infection may also involve the testes and nervous system.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/mumps/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Mumps - Dr. Weil's Condition Care Guide", "cleaned_text": "What is mumps?\n\n Mumps, also known as epidemic parotitis, is a highly contagious viral infection that primarily affects the parotid glands – the saliva-producing glands behind both cheeks. The infection may also involve the testes and nervous system. Because most people in the United States have been vaccinated against the disease, occurrences here are now very rare (less than 300 cases annually). However, there have been sporadic outbreaks in recent years, mostly among people living in close quarters such as college dormitories, summer camps, and military barracks.\n\nWhat are the symptoms?\n\n A person who gets the mumps will often experience fever, headache, fatigue, muscle aches, loss of appetite, pain with chewing or swallowing, and occasionally laryngitis. In addition, the painful swelling that is characteristic of mumps usually affects the parotid salivary glands located within the cheek, near the jaw line and below the ears. This swelling lasts about five to seven days and leads to the appearance of “chipmunk cheeks” classically seen in mumps.\n\nAlthough it is seldom severe or life-threatening, up to half of young men affected develop swelling of the testicles, called orchitis, which can be a cause of sterility later in life. Swelling can also occur in the ovaries and breast tissue of females who have reached puberty. In about 5% of infections, mumps leads to meningitis, an inflammation of the tissues covering the brain. Rarely, mumps can lead to deafness, inflammation of the brain itself (encephalitis) and spontaneous abortion if an infection occurs during pregnancy. As with other childhood diseases, complications are more likely when adults are infected, but a good number of people who get the mumps may have no symptoms at all.\n\nWhat are the causes?\n\n The mumps virus spreads via respiratory secretions (by breathing in droplets of secretions from an infected person’s cough or sneeze) or from direct contact with objects contaminated by the saliva of an infected person. It can be transmitted to another person three days before symptoms appear, all during the illness, and until about nine days after symptoms are first noticed. Mumps most commonly affects children who have not been vaccinated against the virus, but adults can be infected as well. There is an incubation period for approximately two to three weeks from the time of exposure before the symptoms appear when a person can unknowingly spread the disease.\n\nWhat is the conventional treatment?\n\n Aside from supportive care, there is no conventional treatment for mumps. Those who are severely ill should go see their doctor, however, they should call to report their symptoms if mumps is suspected so they do not infect others around them. They should be placed in respiratory isolation (where air circulates within the room and not outside into the general public) if possible.\n\nPrevention with vaccination is the key to avoiding an infection with the mumps virus. The mumps vaccine, given as part of the vaccine widely known as MMR (for measles, mumps and rubella vaccine) is considered 95 percent effective. This means that of every 100 vaccinated individuals, up to five may contract mumps if exposed to the virus. Typically, the first dose is given at 12 -18 months of age, and the second is given at four to six years of age, before starting school.\n\nNote that the MMR is not necessarily only for children. Adults who were born outside of the U.S. after 1957 should also be vaccinated. Foreign-born adults born earlier than this are considered immune to these three diseases.\n\nWhat therapies does Dr. Weil recommend for mumps?\n\n First, vaccinate yourself and your children.\n\nThe infant vaccination schedule does seem crowded, but this is a deliberate strategy, part of a national effort to have every child in the United States fully immunized by age two. If you adhere to the schedule, your child could have up to 24 injections in the first two years of life. These include vaccines to prevent diphtheria, tetanus and whooping cough, polio, hepatitis A and B, influenza type B, measles, mumps, rubella, pneumonia and meningitis. The anti-immunization movement is fueled by parental concerns about developmental disabilities associated with vaccines, but Dr. Weil does not think there is good evidence linking the vaccines to these disorders.\n\nIf you’re concerned about side effects, have your pediatrician check your children prior to getting vaccinated (serious reactions are more likely in sick children). You also may want to look into homeopathic treatments designed to reduce the risk of vaccine reactions.\n\nTake any precautions you feel are necessary, but Dr. Weil feels it is extremely important to have children immunized as recommended. Although immunizations are not without risks, the risks are much lower than those that come with the diseases they are meant to prevent. If you have received the recommended two doses of the vaccine, you should have lifelong immunity. Actually getting the disease also confers lifelong immunity.\n\nAlthough there is no specific treatment for mumps, you may feel better if you apply hot or cold compresses to swollen areas, gargle with warm salt water to soothe a sore throat, take acetaminophen or ibuprofen for fever and drink plenty of liquids (avoid acidic drinks such as soda and orange juice). Homeopathic remedies such as belladonna and poke root can also be helpful.", "opengraph": {"locale": "en_US", "type": "article", "title": "Mumps - Dr. Weil's Condition Care Guide", "description": "Mumps, also known as epidemic parotitis, is a highly contagious viral infection that primarily affects the parotid glands - the saliva-producing glands behind both cheeks. The infection may also involve the testes and nervous system.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/mumps/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:published_time": "2010-09-17T04:00:00+00:00", "article:modified_time": "2016-09-23T21:26:17+00:00", "image": "https://www.drweil.com/wp-content/uploads/2013/06/rash_child_ART.jpg", "image:width": "250", "image:height": "202", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-bacterial/", "https://www.drweil.com/health-wellness/health-centers/children/whooping-cough-pertussis/", "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/pneumonia/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-bacterial/", "https://www.drweil.com/health-wellness/balanced-living/wellness-therapies/homeopathic-medicine/"], "authors": ["", "Susan Bulzoni"], "publish_date": "2010-09-17T04:00:00+00:00"}