{"result_id": "368017", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/how-can-i-protect-myself-from-monkeypox/", "timestamp": "2023-04-25 18:25:25 CEST+0200", "meta": {"description": "Monkeypox has been in the news lately after cases appeared in humans in multiple countries where it had not previously been seen, and there is still much to be learned about how it spreads and how it can be prevented.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/how-can-i-protect-myself-from-monkeypox/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "How Can I Protect Myself From Monkeypox? | Andrew Weil, M.D.", "cleaned_text": "Monkeypox is a virus that’s closely related to smallpox and cowpox, all of which are in the genus. It’s not new, having been identified more than 60 years ago in monkeys; the first infection in a human was noted in 1970. Monkeypox has been in the news lately after cases appeared in humans in multiple countries where it had not previously been seen, and there is still much to be learned about how it spreads and how it can be prevented. Much of what we do know, however, is consistent with well-established avoidance strategies for other viral infections: good hygiene, keeping your distance from infected persons, and using safer sex practices.\n\nIt is possible for humans to become infected with monkeypox after exposure to an animal that is carrying the virus, including rodents and primates, but those cases have been very rare and mostly limited to certain regions of Africa. There were a few cases in the United States in 2003 that were traced to pet prairie dogs that had been exposed to infected rodents imported from Africa at an animal vendor’s facility. That outbreak was contained relatively quickly.\n\nThere is no firm evidence yet as to how or where the current outbreak was initiated. Early evidence suggests that person-to-person transmission is most likely in those who touch or have prolonged close contact with an infected person; transmission has also been observed in men who have sex with other men. It is troubling that none of the cases identified recently were associated with people who have traveled to regions of Africa where monkeypox is endemic.\n\nIf you are old enough to have received the smallpox vaccine as a child, you may have some immunity to monkeypox. The two viruses are related enough that having been infected with or vaccinated against smallpox offers some protection against monkeypox. In fact, some scientists predicted a resurgence of monkeypox after smallpox was eradicated in 1980 and routine vaccinations were discontinued. Some 70% of the world’s population now has no immunity against smallpox, making them vulnerable to infection with monkeypox. A group of experts who met in 2019 published an article in the journal the following year that predicted a coming threat of “human monkeypox…an unintended consequence of smallpox eradication.”\n\nSymptoms of monkeypox generally start with chills and fever, headache, body aches – all typical of viral infections. Monkeypox infection often includes swollen lymph nodes as well. The characteristic rash appears a few days after the onset of the more general symptoms. Treatment is usually aimed at easing symptoms while the virus runs its course, and there are some anti-viral medications that are effective in severe cases. The United States also has a supply of smallpox vaccines that can be used to help manage outbreaks if needed. Fortunately, monkeypox is a much milder illness than smallpox (which had up to a 30% mortality rate). Those at risk for severe cases of monkeypox include small children, pregnant or breastfeeding women, those with compromised immune systems, and those with certain skin conditions.\n\nAs with all infections, your best defense is prevention. Keeping your immune system strong is key, so please read my guide to your immune system. The Centers for Disease Control and Prevention advises avoiding contact with animals that may be harboring the virus, or touching their bedding; staying away from anyone who may be infected; and practicing good hand-washing and other hygiene practices.\n\nIt’s important to note that monkeypox can spread easily during any close contact, including sexual contact. While the predominance of cases in men who have sex with men shows human-to-human transmission is occurring, the risk is not limited to any one group – anyone exposed to the virus can become infected, so we all should take precautions.\n\n\n\n Simpson K, Heymann D, Brown CS, Edmunds WJ, Elsgaard J, Fine P, Hochrein H, Hoff NA, Green A, Ihekweazu C, Jones TC, Lule S, Maclennan J, McCollum A, Mühlemann B, Nightingale E, Ogoina D, Ogunleye A, Petersen B, Powell J, Quantick O, Rimoin AW, Ulaeato D, Wapling A. “Human monkeypox – After 40 years, an unintended consequence of smallpox eradication.” . 2020 Jul 14;38(33):5077-5081. doi: 10.1016/j.vaccine.2020.04.062. Epub 2020 May 13. PMID: 32417140. https://pubmed.ncbi.nlm.nih.gov/32417140/", "opengraph": {"locale": "en_US", "type": "article", "title": "How Can I Protect Myself From Monkeypox? | Andrew Weil, M.D.", "description": "Monkeypox has been in the news lately after cases appeared in humans in multiple countries where it had not previously been seen, and there is still much to be learned about how it spreads and how it can be prevented.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/how-can-i-protect-myself-from-monkeypox/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2022-06-27T13:49:44+00:00", "image": "https://www.drweil.com/wp-content/uploads/2022/06/21075213/How-Can-I-Protect-Myself-From-Monkeypox-QA-1398845578.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/balanced-living/healthy-living/your-immune-system/"], "authors": [""], "publish_date": "June 27, 2022"}