{"result_id": "368009", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/do-you-need-a-whooping-cough-shot/", "timestamp": "2023-04-25 18:25:08 CEST+0200", "meta": {"description": "In this Q&A, Dr. Weil answers a reader's question about the whooping cough vaccine to prevent whooping cough in adults.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/do-you-need-a-whooping-cough-shot/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Whooping Cough Vaccine | Dr. Weil", "cleaned_text": "An advisory committee to the U.S. Centers for Disease Control and Prevention (CDC) voted in February 2012 to recommend that all adults, including those over the age of 65, be vaccinated against pertussis (whooping cough). The whooping cough vaccine shot, called Tdap, which stands for tetanus, diphtheria and pertussis, protects against the three diseases, all of which can be deadly.\n\nThis new recommendation is actually an update of one from 2005, when the CDC recommended that in addition to children over the age of 2 months, all adults up to the age of 65 be vaccinated with Tdap. Those over 65 weren’t included at the time because no whooping cough vaccine was available for this age group. In 2011 a Tdap vaccine was approved for use in individuals age 65 and older.\n\nOver the past few years, whooping cough in adults and children has become an increasing problem in the United States. In 2010, more than 21,000 cases were reported, one of the highest numbers in more than 50 years. And while whooping cough has always been regarded as a childhood disease, you’re at risk unless you’ve had the vaccine within the past 10 years. The CDC reports that less than nine percent of adults in the U.S. have had another whooping cough vaccination.\n\nWhooping cough is caused by a bacterium, , which is highly contagious and is passed from person to person by direct contact with droplets from the coughing or sneezing of an infected person. The most contagious period is early in the disease when the only symptoms appear to be those of a common cold: runny nose, sneezing, conjunctivitis (pink eye), an occasional cough, and a mild fever. After a week or two, the “cold” enters another stage with symptoms that characterize whooping cough: violent fits of coughing and a gasp for breath in between coughs that sounds like a “whoop.” The coughing is so severe and deep that it often triggers vomiting and can result in broken ribs, seizures and dehydration. Attacks typically occur at night and can leave you exhausted from lack of sleep. In between coughing fits, you seem perfectly okay.\n\nUnfortunately, whooping cough isn’t easy to treat. If it is diagnosed during the first week, the antibiotic erythromycin may lessen the severity and duration of the infection. After that, there’s no good treatment – you just have to let the disease run its course, which typically lasts six to eight weeks. Cough medicines usually don’t help much. Over time, the coughing lessens in frequency and intensity but can linger for months. Household contacts should be immunized and also treated with erythromycin.\n\nThe most frequent complication (and the most frequent cause of death) of whooping cough is secondary bacterial pneumonia, which can occur in up to 30-40 percent of patients.\n\nThe most likely explanation for the return of whooping cough in recent years is that significant numbers of people stopped immunizing their kids out of concerns over the safety of pertussis vaccine. Today’s newer whooping cough vaccine is safer than the old one, and there is no reason not to use it. The risks of pertussis are much greater than those of the vaccine. This disease is no joke: in 2010 more than 9,100 people in California caught whooping cough and 10 infants died. The CDC reported that the outbreak was the highest recorded in the state since 1947.", "opengraph": {"locale": "en_US", "type": "article", "title": "Whooping Cough Vaccine | Dr. Weil", "description": "In this Q&A, Dr. Weil answers a reader's question about the whooping cough vaccine to prevent whooping cough in adults.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/do-you-need-a-whooping-cough-shot/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2016-12-02T22:22:02+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/vision/conjunctivitis/"], "authors": [""], "publish_date": "December 2, 2016"}