{"result_id": "368019", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/shingles/", "timestamp": "2023-04-25 18:25:29 CEST+0200", "meta": {"description": "Shingles are small, fluid-filled blisters similar to chickenpox. An attack of shingles comes from a reactivation of the same varicella-zoster virus that causes chickenpox.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/shingles/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Treatment of Shingles - Dr. Weil's Condition Care Guide", "cleaned_text": "What is shingles?\n\n Shingles are small, fluid-filled blisters similar to chickenpox. An attack of shingles comes from a reactivation of the same varicella-zoster virus that causes chickenpox. The virus usually lies dormant in the nervous system of the body for several decades. No one knows why it suddenly becomes active, but 10 to 20 percent of those who have had chickenpox as children will someday develop shingles. The risk increases with age. Of the one million cases that occur in the United States every year, about half are in people over 60.\n\nWhat are the symptoms of shingles?\n\n Shingles usually begins with an itch, a tingling sensation, or a stabbing pain, usually in the skin of the torso or the face on one side of the body. A few days later, a rash develops along the affected area as fluid-filled blisters similar to chickenpox that then dry out and crust. In its early stages, the condition can cause intense pain without any blisters, which means it is often misdiagnosed as a pulled muscle or some other painful condition. Shingles usually runs its course in three to five weeks.\n\nAlthough it is possible to get shingles more than once, this happens in only one to five percent of patients, usually those whose immune systems are compromised. These cases can occur many years after the first episode and tend not to develop in the same area of the body as the first bout. Most people who appear to experience multiple episodes of shingles are probably experiencing infections with a related virus, which cause sores similar to shingles.\n\nPostherpetic neuralgia is a complication of shingles that affects the nerve fibers and skin and can be extremely painful. It typically occurs after the rash has resolved. The symptoms are typically confined to the area where the shingles occurred and may include a sharp, burning or deep, aching pain; extreme sensitivity to touch and temperature change; itching and numbness. These problems can go on for months, in some cases years, and are most likely to occur among older people. In fact, the older you are when you develop shingles, the more likely you are to develop postherpetic neuralgia. This complication rarely occurs before the age of 50, but develops in at least 50 percent of shingles patients over 60 and in almost 75 percent of those 70 or older.\n\nShingles can also lead to other potentially dangerous nervous system complications, including inflammation of the brain (encephalitis) and spinal fluid (meningitis). If shingles occurs on the face, it can cause hearing problems and temporary or permanent blindness. Loss of facial movement (paralysis) is possible as well. If blisters aren’t properly treated, bacterial skin infections can also become an issue.\n\nWhat are the causes?\n\n Shingles is caused by the varicella-zoster virus, from the family of herpes viruses that also causes cold sores and genital lesions. Many of these viruses can reside in dormant states in the nervous system. If the body’s immune response does not completely destroy the virus, the right conditions can allow them to travel along the path of the nerves up to the skin’s surface.\n\nIt is uncertain what causes the reactivation, but more than likely, having a decreased immunity is one of the predisposing factors. Shingles is much more common in older adults (whose immune systems become weaker with age) and in those whose immunity is suppressed. Heightened emotional or physical stress can also play a part in increasing the incidence of shingles.\n\nA person with active blisters can infect anyone who hasn’t previously had chickenpox. This usually occurs through direct contact with open sores. Once exposed, the person will develop chickenpox, not shingles (although the shingles may come later in life, as they did for the person who passed along the infection).\n\nIt’s important for individuals with an immune deficient condition (such as HIV, AIDS, cancer patients undergoing chemotherapy, bone marrow transplant recipients and organ donor patients) or those on immune suppressive therapy – such as steroids and other immune modulating drugs – to avoid physical contact with people who have shingles until the blisters completely crust over. Also, infants up to three months of age and pregnant women who have never before had the chickenpox should also be kept from such contact.\n\nWhat is the conventional treatment?\n\n Conventional medicine often treats shingles conservatively with symptomatic medications for pain and itching. Over-the-counter anti-inflammatory medications such as ibuprofen, acetaminophen, prescription narcotics, and sometimes steroids can be used for pain control, while antihistamines are often recommended for the itch. High doses of antiviral drugs like acyclovir (Zovirax), valacyclovir (Valtrex) or famciclovir (Famvir) can be used to reduce the duration and severity of symptoms. They work best when started within the first two days of the rash. Prompt treatment can not only ease discomfort, but can also reduce risk of complications.\n\nPostherpetic neuralgia can be treated with a variety of therapies: skin patches that release the anesthetic lidocaine and relieve pain for four to 12 hours are often beneficial. Antidepressants in doses smaller than those used to treat depression, especially tricyclics like amitryptaline (Elavil), seem to make the pain easier to tolerate. Other conventional options are anticonvulsant drugs such as gabapentin (Neurontin), prescription narcotics, and TENS units (transcutaneous electrical nerve stimulation), which involve placing electrodes in the painful area to deliver tiny electrical impulses to nearby nerve pathways.\n\nNeurological and ocular complications are emergencies that demand prompt medical attention.\n\nWhat therapies does Dr. Weil recommend? \n\n Dr. Weil knows of no vitamins or supplement regimen to prevent shingles. Acupuncture and hypnosis can help relieve pain, either the acute pain of early onset, or the residual pain known as postherpetic neuralgia. You can also use topical capsaicin (the substance that makes red chilies hot). This depletes nerve cells of “substance P,” a natural chemical that is involved in sending pain signals to the brain. Rub the cream on the affected area of skin three times a day. It may hurt more during the first few days of application, but pain will resolve over time.\n\nCapsaicin cream is sold over-the-counter as Zostrix or Capzasin-P. Another way to deplete substance P and potentially gain relief from the itching is to expose the affected skin to hot water for 30-60 seconds. This works very well for contact dermatitis from plants like poison ivy, and may be effective here as well. A third topical therapy is turmeric paste. To make this Ayurvedic remedy: use 1/2 cup of turmeric with 1 cup of water (add 1 to 1.5 teaspoons of ground black pepper, optional) then boil this mixture into a paste for at least 8 minutes (you may have to add more water). Let cool before using. Be aware that turmeric can stain clothes and plastic container, so be careful when applying to affected area.\n\nIn addition, a vaccine to prevent shingles has been recently approved by the FDA for use in people age 60 and older. The new vaccine, Zostavax, isn’t perfect – it works about 50 percent of the time. However, people who developed shingles despite receiving the vaccine seemed to have less severe cases than did those who got the placebo. Zostavax did prevent postherpetic neuralgia in 67 percent of the people studied. The vaccine seemed to be most effective in people 60-69 years old but also provided some protection for older groups. Side effects were mostly redness, soreness, swelling or itching at the injection site and headache. The vaccine is somewhat expensive – typically between $150 to $200.\n\nHaving had an unpleasant case of shingles, Dr. Weil is inclined to recommend the vaccine for those at risk.", "opengraph": {"locale": "en_US", "type": "article", "title": "Treatment of Shingles - Dr. Weil's Condition Care Guide", "description": "Shingles are small, fluid-filled blisters similar to chickenpox. An attack of shingles comes from a reactivation of the same varicella-zoster virus that causes chickenpox.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/shingles/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:published_time": "2013-05-10T18:48:27+00:00", "article:modified_time": "2017-07-14T15:14:12+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/chickenpox/", "https://www.drweil.com/sexual-health/herpes/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/cold-sores/", "https://www.drweil.com/sexual-health/hiv-and-aids/", "https://www.drweil.com/health-wellness/balanced-living/wellness-therapies/acupuncture/", "https://www.drweil.com/health-wellness/balanced-living/wellness-therapies/hypnosis-and-hypnotherapy/", "https://www.drweil.com/health-wellness/balanced-living/cooking-recipes/cooking-with-spices-turmeric/", "https://www.drweil.com/health-wellness/balanced-living/wellness-therapies/ayurvedic-medicine/"], "authors": ["", "Susan Bulzoni"], "publish_date": "2013-05-10T18:48:27+00:00"}