{"result_id": "368032", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/safe-from-smallpox/", "timestamp": "2023-04-25 18:25:56 CEST+0200", "meta": {"description": "I understand that healthcare workers are going to be vaccinated against smallpox. Since the government now has enough vaccine, why shouldn't everyone be vaccinated? Wouldn't we be safer?", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/safe-from-smallpox/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Safe from Smallpox?", "cleaned_text": "The current plan is to vaccinate some 500,000 doctors, nurses and other health care workers who would be most likely to come into contact with smallpox victims in the event of a biological attack. Because the disease is highly contagious, it makes sense to protect a core of health care professionals so that they can safely care for anyone who might become infected.\n\nYes, we do now have enough vaccine for everyone, which wasn’t true a year ago. Vaccinating everyone in the country may seem like a good idea, but it would be risky. Like vaccines for measles, mumps, rubella and chickenpox, the smallpox vaccine relies upon a live virus – in this case the vaccinia virus, a \"pox\" virus in the same family as smallpox. Vaccinia confers immunity against smallpox about 95 percent of the time. This virus is usually (but not always) harmless. The Centers for Disease Control (CDC) estimates that for every one million people who receive the vaccine for the first time, between 14 and 52 will develop life-threatening side effects such as encephalitis. One or two of every million people vaccinated will die. Those at highest risk are pregnant women, those who have or have had skin conditions (especially eczema), and those with weakened immune systems (transplant patients, the HIV positive, cancer patients).\n\nThe live virus may also cause less serious reactions such as rash, fever, head and body aches, weakness, and lymph node swelling or tenderness. Even normal after-effects can be troublesome. First, a red, itchy bump develops at the injection site. A week later, the bump becomes a big blister, fills with pus and begins to drain. Then, the blister dries, and a scab forms. In the third week, the scab falls off, leaving a small scar. Given the risks and discomforts, unnecessarily exposing the whole population to the smallpox vaccine doesn’t make sense in the absence of a confirmed bioterrorist threat.", "opengraph": {"locale": "en_US", "type": "article", "title": "Safe from Smallpox? - DrWeil.com", "description": "I understand that healthcare workers are going to be vaccinated against smallpox. Since the government now has enough vaccine, why shouldn't everyone be vaccinated? Wouldn't we be safer?", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/safe-from-smallpox/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/measles/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/mumps/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/eczema-treatment-and-symptoms/"], "authors": [""], "publish_date": "September 17, 2010"}