{"result_id": "368024", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/chickenpox/", "timestamp": "2023-04-25 18:25:40 CEST+0200", "meta": {"description": "Learn the facts about chickenpox, shingles and varicella zoster. As your trusted health advisor, Dr. Weil offers expert advice and information on chickenpox and other health conditions and topics.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/chickenpox/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Treatment of Chickenpox - Dr. Weil", "cleaned_text": "What is chickenpox?\n\n Chickenpox is a highly contagious disease common in early childhood. It is seen most often in children less than ten years old. However, the classic symptoms and incidence of chickenpox have begun to change since the introduction of a vaccine in the mid-1990s.\n\nChickenpox isn’t usually serious in healthy kids, but it can cause serious problems for pregnant women, newborns, older individuals who haven’t yet had the disease, and those who are immune-compromised. Most people who get chickenpox will not get it again, but once infected, the virus remains dormant in the body and can reactivate later in life, causing the disease known as shingles.\n\nWhat are the symptoms?\n\n When a person is exposed to chickenpox, it usually takes one to three weeks for symptoms to appear. These usually begin as a non-descript illness – fever, headache, sore throat or abdominal pain with loss of appetite and fatigue. Some kids only have a few, if any, of these early symptoms. The “pox” rash typically comes a day or two later, unfortunately, right after you’re the most contagious\n\nClassically, chickenpox rash appears in the form of red spots on the skin that develop into clear fluid-filled blisters – “dew drops on a rose petal.” After first appearing on the head, face or trunk, the rash then spreads outward in clusters, often including the extremities and mucosal surfaces such as the nose, mouth, vagina, even the eyelids. Children with skin problems like eczema or sunburn can get a worse reaction with more than 1,500 blisters, but the average child typically develops between 250-500 lesions. After a day or two, blisters become cloudy and burst – releasing their fluid – then crusting over. New lesions can appear for up to a week, and the hallmark for clinical diagnosis is seeing both old and new blisters.\n\nBesides the fever and other symptoms, the crusting rash can itch intensely. This can lead to secondary bacterial infection, especially when scabs are vigorously scratched. Other complications can include varicella pneumonia, hepatitis, meningitis, encephalitis, and Reye’s syndrome – a dangerous and potentially fatal multi-system disease associated with the use of aspirin in children that severely affects the brain and liver.\n\nComplications from chickenpox occur more frequently in older kids, adults and immunocompromised individuals – either from illnesses such as AIDS and cancer or from chemotherapy and bone marrow transplantation. Some of the worst cases of chickenpox have been seen in asthmatic kids taking steroids during their symptom-free period. Children under one year of age whose mothers have had chickenpox are not very likely to catch it if exposed to another child with active chickenpox. If they do, they often have mild cases because they retain partial immunity from maternal antibodies.\n\nExposed pregnant women without immunity can transmit the virus from placenta to fetus. If this occurs early – before 28 weeks – it can lead to miscarriage or serious developmental abnormalities. This is known as , with effects ranging from underdeveloped extremities to severe anal and bladder deformities. The systemic viral infection can also damage the brain and spinal cord as well as the eyes and skin.\n\nInfection later in gestation or immediately post-partum is referred to as . Maternal infection can be associated with premature delivery, while the risk of neonatal infection following exposure is greatest seven days before or after delivery. The baby may also be exposed to the virus via infectious siblings or other contacts, but this is of less concern if mom is immune. Newborns of non-immume moms who develop symptoms are at a high risk of pneumonia and other serious complications.\n\nThe vaccine involves a live virus, and those who get the vaccine can develop a mild case of chickenpox, often on areas other than is typical (such as the feet and hands). Vaccinated kids who develop the disease usually recover much quicker and have fewer blisters without as many complications compared to typical cases.\n\nWhat are the causes?\n\n Chickenpox is caused by the Herpes viruses known as . A peak in cases typically occurs during the late winter and early spring; and because the virus is highly contagious, most individuals who aren’t immune will get the disease if exposed. The zoster virus can be spread by direct contact: sharing food or drinks from an infected person, touching infected surfaces or coming into contact with fluid from an open blister. It can also spread as droplets through the air, as when someone coughs or sneezes. Those who get the vaccine can be contagious, especially if they contract active blisters. People who have chickenpox become the most contagious 1-2 days before breaking out with the rash. They remain contagious until all blisters crust over, usually about a week after they first appear.\n\nWhat is the conventional treatment?\n\n Historically, treatment has been aimed at keeping people comfortable while their immune system fights the infection. Aveeno (oatmeal) baths in lukewarm water can help prevent itching and subsequent scratching. Over-the-counter antihistamines, either taken orally or applied topically as a lotion, such as calamine, can also help control the itching.\n\nTrimming fingernails is a good method of reducing bacterial infections and scarring, which typically occur after lesions get scratched open. Fever control should be with Tylenol first, as Ibuprofen may be linked to an increased risk of secondary infections (although no association has ever been clinically demonstrated) Aspirin should never be used to treat fever in children.\n\nAntiviral medicines, such as Acyclovir have been approved by the FDA for treating chickenpox in kids older than 2 years of age who are susceptible to systemic complications. They should be started within the first 24 hours of the rash. These drugs are expensive, have side effects, and because most children will recover without problem, the benefits may not outweigh the risks for healthy kids. However, antiviral medicines play an important role for those with severe rash or complications, and should be considered in older children and teenagers, as well as the immunosuppressed. Those with severe immune problems may also receive intravenous immunoglobulin treatments if their symptoms are serious or longstanding.\n\nWhat therapies does Dr. Weil recommend for chickenpox?\n\n Daily doses of vitamin C, garlic, echinacea, and astragalus can help boost immunity. So can immune-stimulating mushrooms such as cordyceps, reishi, shiitake and maitake. Extracts are available in capsule or liquid form and can be taken as directed, halving the dose for smaller children. Probably the single best measure to avoid getting any viral illness is washing your hands often and keeping them away from your eyes and nose. Also, try to avoid contact with people who are coughing or sneezing since airborne droplets can also spread the virus.\n\nA highly effective chickenpox vaccine has been available in the U.S. since 1995. It can protect against infection more than 80-90 percent of the time, as well as decreasing severity and shortening the course of the illness if you do get an infection. Parents often express concern that the immunity provided by the vaccine might not last – chickenpox is the only live vaccine currently requiring a booster. However, twenty-five years of surveillance in vaccinated kids has detected no signs of decreasing immunity.\n\nThere is also a question regarding how strong the immune response is with vaccine as compared to those who actually get the disease. An increasing population of vaccinated kids has never gotten the illness, but whether their immune systems can effectively deal with the virus long term remains to be seen. This is especially worrisome since shingles seems to be on the rise. In fact, some individuals claim to be experiencing it multiple times later in life. A varicella vaccine against shingles is also available for seniors to take. Time will tell as to how well it works to decrease the incidence of shingles as Americans who contracted chicken pox in the “baby boomer” cohort move into their sixties and seventies.", "opengraph": {"locale": "en_US", "type": "article", "title": "Treatment of Chickenpox - Dr. Weil", "description": "Learn the facts about chickenpox, shingles and varicella zoster. As your trusted health advisor, Dr. Weil offers expert advice and information on chickenpox and other health conditions and topics.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/chickenpox/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:published_time": "2008-09-09T04:00:00+00:00", "article:modified_time": "2017-03-02T00:57:22+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/hair-skin-nails/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/eczema-treatment-and-symptoms/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-bacterial/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/shingles/"], "authors": ["", "Susan Bulzoni"], "publish_date": "2008-09-09T04:00:00+00:00"}