{"result_id": "368004", "URL": "https://www.drweil.com/health-wellness/health-centers/children/can-immunizations-cause-birth-defects/", "timestamp": "2023-04-25 18:24:57 CEST+0200", "meta": {"description": "My wife wants to have another child. She is concerned about the risk of birth defects because, as a member of the military stationed in Iraq, she has been vaccinated against anthrax and smallpox. What are the real risks?", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/health-centers/children/can-immunizations-cause-birth-defects/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Can Immunizations Cause Birth Defects", "cleaned_text": "Being vaccinated against smallpox and anthrax should not increase the risk of birth defects in women who got the shots a month or longer before becoming pregnant. When your wife got her vaccinations, she may have been asked if she was pregnant or intended to become pregnant; perhaps her concern stems from the issue having been raised at that time. If a woman is vaccinated against smallpox while she is pregnant, the baby can pick up a rare infection called fetal vaccinia, which carries a risk of premature delivery, skin rash with scarring, stillbirth, or the death of the baby after delivery. But fewer than 50 of these cases have been reported worldwide. Apart from this extremely rare danger, smallpox vaccine does not pose an increased risk of serious birth defects. Nor does it appear to increase the risk of miscarriage, low birth weight or other problems. However, women vaccinated against smallpox should avoid pregnancy until the vaccine site is completely healed and the scab has fallen off – or at least four weeks have passed.\n\nAs far as the anthrax vaccine is concerned, there is some concern that it may increase the risk of birth defects if administered the first trimester of pregnancy. This risk was identified in January 2002 by a preliminary U.S. Navy study, but the findings contradict those from an earlier Army study that identified no reproductive health problems among military women who received the anthrax vaccine. The government hasn’t released details of the Navy study, including the type of birth defects noted, pending review of the data. The Defense Department has said that some of the women surveyed may have been beyond the first trimester of pregnancy when the study took place.\n\nIn summary: while there are concerns that birth defects may occur among babies of women vaccinated against smallpox or anthrax during pregnancy, I’ve seen nothing to indicate an elevated risk of birth defects among women who were vaccinated a month or more before becoming pregnant.", "opengraph": {"locale": "en_US", "type": "article", "title": "Can Immunizations Cause Birth Defects", "description": "My wife wants to have another child. She is concerned about the risk of birth defects because, as a member of the military stationed in Iraq, she has been vaccinated against anthrax and smallpox. What are the real risks?", "url": "https://www.drweil.com/health-wellness/health-centers/children/can-immunizations-cause-birth-defects/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2016-12-02T04:48:00+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/health-centers/", "https://www.drweil.com/health-wellness/health-centers/children/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/"], "authors": [""], "publish_date": "December 1, 2016"}