{"result_id": "368029", "URL": "https://www.drweil.com/health-wellness/health-centers/children/are-childhood-vaccines-dangerous/", "timestamp": "2023-04-25 18:25:50 CEST+0200", "meta": {"description": "Learn what Dr. Weil has to say about childhood vaccines, why they're important, and why children's vaccination schedule seems to be overcrowded.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/health-centers/children/are-childhood-vaccines-dangerous/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Are Childhood Vaccines Dangerous? | Andrew Weil, M.D.", "cleaned_text": "The infant vaccination schedule does seem crowded, but this is a deliberate strategy, part of a national effort to have every child in the United States fully immunized by age two. If you adhere to the schedule, your child would have up to 24 injections in the first two years of life. These include vaccines to prevent diphtheria, tetanus and whooping cough, polio, hepatitis A and B, influenza type B, measles, mumps, rubella, pneumonia and meningitis.\n\nThe advantage of adhering to the schedule is that kids will get full protection from these diseases early in life. The downside is the need to follow a complicated and sometimes confusing schedule, as well as recognizing that youngsters who don’t follow the immunization schedule tend not to catch up. This can leave them unprotected against whooping cough, hepatitis, meningitis, and flu.\n\nMost of us haven’t come in contact with the diseases we’re vaccinated against and may not appreciate how severe they can be. The only infectious disease that has been eradicated so far is smallpox, but the others still occur frequently. You may remember the mumps outbreak in the spring of 2006. While the disease usually is mild when it occurs in children, it can lead to infertility among men who are infected as adults. An outbreak of whooping cough in 2005 occurred among adults whose childhood vaccinations no longer protected them (an adult vaccine is now available). The coughing due to this disease can be so severe that it can result in broken ribs, pneumonia, and seizures.\n\nDiphtheria, a disease that is rare but not unknown in the United States today, causes a thick, tough, gray membrane to form and grow in the throat. In young children, this membrane can close off the upper airway making breathing impossible. What’s more, a toxin produced in the body during the illness can affect various organs including the heart and brain causing damage that can be deadly. And as for polio, most of us have never seen its devastating effects, for which we should be quite grateful. (The vaccine has virtually eliminated the disease in the western world since the 1950’s.)\n\nIf you decide to space out your child’s vaccinations, speak to your pediatrician about an alternate schedule, or check the “catch up” schedule posted online at: www.cispimmunize.org\n\nI’m aware of the anti-immunizations movement fueled by parental concerns about developmental disabilities, but I don’t think there is any good evidence linking the vaccines to these disorders, which is why my daughter had all her shots as scheduled. If you’re concerned about side effects, have your pediatrician check your children over first (serious reactions are more likely in sick children). You also may want to look into homeopathic treatments designed to reduce the risk of vaccine reactions.\n\nTake any precautions you feel are necessary, but I urge you to have your children immunized as recommended. Although immunizations are not without risks, the risks are much lower than those that come with the diseases they are meant to prevent.", "opengraph": {"locale": "en_US", "type": "article", "title": "Are Childhood Vaccines Dangerous? | Andrew Weil, M.D.", "description": "Learn what Dr. Weil has to say about childhood vaccines, why they're important, and why children's vaccination schedule seems to be overcrowded.", "url": "https://www.drweil.com/health-wellness/health-centers/children/are-childhood-vaccines-dangerous/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2022-08-31T15:15:44+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/health-centers/", "https://www.drweil.com/health-wellness/health-centers/children/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/measles/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/mumps/", "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/pneumonia/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-bacterial/", "https://www.drweil.com/health-wellness/health-centers/children/whooping-cough-pertussis/"], "authors": [""], "publish_date": "August 31, 2022"}