{"result_id": "368044", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/need-a-pneumonia-shot/", "timestamp": "2023-04-25 18:26:20 CEST+0200", "meta": {"description": "The “pneumonia vaccine” is actually a vaccine against pneumococcal disease. Learn more about it and why it's important.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/need-a-pneumonia-shot/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Need A Pneumonia Shot? | Andrew Weil, M.D.", "cleaned_text": "The “pneumonia vaccine” is actually a vaccine against pneumococcal disease, which is caused by pneumococcal bacteria. These bacteria can cause pneumonia when they enter the lungs, as well as a systemic blood infection (called “bacteremia”), and meningitis. The pneumococcal vaccine protects against almost all pneumonococcal diseases, including ear and throat infections. It does not protect against pneumonia caused by other germs, including viruses, other types of bacteria, and fungi.\n\nPneumonococcal pneumonia is more serious than viral pneumonia and is a common cause of hospitalization and death in older people. According to the National Institute on Aging about 20 to 30 percent of people over 65 who have pneumonococcal pneumonia develop bacteremia and about 20 percent of those patients die despite treatment with antibiotics.\n\nI recommend the pneumococcal vaccine for everyone age 65 and older (it is covered by Medicare). At this age, you’re two to three times more likely to get pneumococcal infections than younger people are. The vaccine is also recommended for anyone with chronic illness such as heart disease, emphysema and asthma or diabetes and for anyone with a weakened immune system. Fortunately, most people need to get only one shot. There is some medical thought that it is best to get the vaccine before age 65 (anytime after age 50) since results may be better if you get the vaccine when you’re younger.\n\nIf you get the shot, you might experience some minor side effects – typically, swelling and soreness at the injection site. Less than one percent of those who get the shot develop fever and muscle pain or unusual swelling and pain at the site of the shot.\n\nIncidentally, a recent study showed that vaccinating young children against certain strains of the pneumococcal bacteria had an unexpected payoff – a big drop in rates of pneumonococcal disease among older adults. A study published in the October 26, 2005 issue of the showed that since the childhood shot was introduced in 2000, rates of pneumococcal disease among adults 50 and older dropped by 28 percent. The researchers analyzed data from eight geographic areas in the United States for the years from 1998 to 2003 to reach their conclusions.", "opengraph": {"locale": "en_US", "type": "article", "title": "Need A Pneumonia Shot? | Andrew Weil, M.D.", "description": "The “pneumonia vaccine” is actually a vaccine against pneumococcal disease. Learn more about it and why it's important.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/need-a-pneumonia-shot/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2022-03-30T17:03:38+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-bacterial/", "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/emphysema-and-copd/"], "authors": [""], "publish_date": "March 30, 2022"}