{"result_id": "368016", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/sexual-health/aids-vaccine-whats-next/", "timestamp": "2023-04-25 18:25:24 CEST+0200", "meta": {"description": "I'm so discouraged about the failure of the AIDS vaccine. Are there any other possibilities on the horizon?", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/sexual-health/aids-vaccine-whats-next/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "AIDS Vaccine: What's Next?", "cleaned_text": "The recent announcement that the first AIDS vaccine ever tested on a large group of people failed to protect a significant number against infection was discouraging. However, results suggested that the vaccine did seem to work among certain minorities. Among blacks, the vaccine worked 78.3 percent of the time, but of the 5,400 people in the trial, only 314 were black. Among Asians, the vaccine worked 68 percent of the time, but only 77 Asians took part. These small numbers may have skewed results; no one knows what would happen if the vaccine were tested on large numbers of blacks and Asians.\n\nIn the trial as a whole, which consisted largely of gay men, the rate of infection among those who received the vaccine was 5.7 percent compared with 5.8 percent among those who received the placebo. This is not a statistically significant result.\n\nWhile disappointing, this vaccine isn’t the only one under development. Dozens of others are in the works. Researchers recently announced that another experimental vaccine seems safe for babies born to HIV infected women. Now that safety is established, researchers must decide on further testing. Someday a vaccine could replace the drugs now given to prevent transmission of HIV from mother to child.\n\nResearchers are working with eight different types of experimental vaccines aimed at different targets on HIV and infected human cells. Ultimately, we may end up with more than one that works – or with different vaccines for different populations at risk. VaxGen, the developer of the AIDS vaccine that “failed” has already announced plans to investigate why it seemed to protect blacks and Asians. Clearly, we have a lot to learn, and meantime the AIDS epidemic continues: it already has killed 20 million people worldwide and infected 40 million more. Most experts are convinced we’ll see a vaccine before we see a cure. I’m disappointed with the overall results of the recent trial, but I’ll be very interested to learn more about the findings among minorities. While no vaccine is as far along in the developmental process as VaxGen’s, we still may make the 10 year goal set by former President Clinton in 1997.\n\nMore information on HIV and AIDS from Dr. Weil’s Condition Care Guide.", "opengraph": {"locale": "en_US", "type": "article", "title": "AIDS Vaccine: What's Next? - DrWeil.com", "description": "I'm so discouraged about the failure of the AIDS vaccine. Are there any other possibilities on the horizon?", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/sexual-health/aids-vaccine-whats-next/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2016-12-02T22:07:21+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/sexual-health/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/sexual-health/hiv-and-aids/"], "authors": [""], "publish_date": "December 2, 2016"}