{"result_id": "368003", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/meningitis-bacterial/", "timestamp": "2023-04-25 18:24:55 CEST+0200", "meta": {"description": "Learn more about bacterial meningitis, as well as many other health topics from Dr. Weil, your trusted health advisor.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/meningitis-bacterial/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Meningitis, Bacterial - Dr. Weil's Condition Care Guide", "cleaned_text": "What is bacterial meningitis?\n\n Meningitis is an infection of the membranes (meninges) surrounding the brain and spinal cord that can occur at any age. It is usually caused by bacteria or virus (see Meningitis, Viral) that has infected the bloodstream. There is also a rare, fungal form that can affect people with severely compromised immune systems.\n\nEven though meningitis is relatively rare (only 10,000 Americans are affected annually), it is fatal in approximately 10 to 13 percent of all cases, most of which are the result of bacterial infections. Another 10 percent of cases develop serious health problems as a consequence of meningitis. These complications may include permanent mental impairment, hearing loss and seizures. In the 1990s, surveys conducted by the U.S. Centers for Disease Control and Prevention showed that college freshmen living in dormitories were at a slightly increased risk, and since then, many colleges and universities have been recommending (or requiring) that incoming freshmen be vaccinated against the most common infectious agents that can cause the disease.\n\nWhat are the symptoms?\n\n Early symptoms in adults and adolescents, which may develop over several hours or even days, can often be mistaken for the flu. They classically include high fever, headache (that can be severe) with a stiff neck, nausea, vomiting, confusion, sleepiness or difficulty waking up, light sensitivity, a decreased appetite and, in some cases a skin rash or seizures.\n\nNewborns and young infants may not have classic signs and symptoms of meningitis, but instead may cry inconsolably, have excessive sleepiness or irritability, a poor suck or decreased feeding, a bulging fontanelle – the soft spot on the top of a baby’s head – or stiffness in the body, head and neck. Infants with meningitis are often difficult to comfort, and often cry harder when held. If there is a suspicion of bacterial meningitis, medical treatment should be sought immediately.\n\nThe complications can be severe. The longer one goes without treatment, the greater the risk of seizures and of permanent neurological damage, including hearing loss, blindness, loss of speech, learning disabilities, behavior problems and brain damage, even paralysis. Bacterial infections of the central nervous system progress quickly. Within a matter of days, sometimes hours, the disease can lead to shock and death. Non-neurological complications can include fluid and electrolyte abnormalities, kidney and adrenal failure, life-threatening changes in blood clotting and fluid build-up in the lungs that can lead to respiratory distress.\n\nWhat are the causes?\n\n The bacterial type of meningitis is more dangerous than the viral type. Meningitis in newborns follows sepsis (an infection of the bloodstream) caused by exposure to bacteria (usually group or ) in the birth canal. Older infants and children develop bacterial meningitis after exposure to respiratory secretions from infected people.\n\nAlthough many different kinds of bacteria can cause meningitis, the one most frequently responsible for this potentially disastrous illness is , or meningococcus. It can be spread by kissing; sharing eating utensils, cigarettes or drinking glasses; or from droplets spread by a cough or sneeze. Other common bacterial causes include (pneumococcus) and (H. flu), which, in addition to meningitis, can also cause upper respiratory infections, pneumonia, ear and sinus infections. Pneumococcus is the most common cause of meningitis in infants and young children. Both of these bacteria have been leading causes of meningitis in children prior to the 1990s. However with the advent of vaccinations against each, the incidence of meningitis from these bacteria have been greatly reduced.\n\nAn unfinished childhood vaccine schedule can significantly increase the risk of bacterial meningitis. In addition, anyone working or living in close quarters is more susceptible to infections like this. Besides college students living in dormitories, personnel on military bases or living in barracks, kids in boarding schools and at daycare facilities all have an increased risk of developing meningitis.\n\nSince the vaccines have been developed, bacterial meningitis is no longer primarily afflicts children under age five; it has become a disease of teenage years and early adulthood. If you are pregnant or work with animals, you are at an increased risk of contracting an infection caused by the bacteria, which may lead to meningitis. Also if you are immune compromised in any way (due to AIDS, diabetes, removal of your spleen, receiving cancer treatment or immune suppressive therapy), you have a higher chance of getting meningitis. Moreover, this population can be susceptible to fungal infections in addition to the typical bacterial and viral culprits.\n\nCryptococcal meningitis is a fungal form of the disease that affects people with immune deficiencies such as AIDS and can be life-threatening if not treated early with aggressive antifungal medications.\n\nWhat is the conventional treatment?\n\n Acute bacterial meningitis requires prompt hospitalization and treatment with intravenous antibiotics to ensure recovery and reduce complications. The medications chosen depend on the type of bacteria causing the infection. Often, analyzing a sample of cerebrospinal fluid (obtained by a spinal tap) can help identify the pathogen and signify whether the meningitis is viral, fungal or bacterial. In almost all cases, however, if bacterial meningitis is suspected, doctors will typically use a broad-spectrum antibiotic or combination of antibiotics until culture results determine the exact cause.\n\nDoctors may also recommend treatment to manage the complications that might occur; for instance, acute brain swelling, shock, fluid abnormalities, convulsions or dehydration. Patients may be placed in a critical care unit for intense treatment and observation. They are usually put in isolation to reduce spread of the infection, and healthy contacts who have been exposed to meningococcus will usually require prophylactic treatment.\n\nThese types of preventive measures typically involve only those who have been in close proximity with the sick person – household members, intimate contacts, daycare center playmates, roommates, etc. Casual contact as might be seen in a regular classroom, office or factory setting is not usually significant enough to cause concern, nor does it require mandatory treatment, but prompt notification to anyone that might have been exposed is absolutely warranted. Preventative antibiotic therapy should be administered as soon as possible (ideally within 24 hours after the disease has been identified) and consists of either oral rifampin for two days or a one-time dose of ciprofloxacin.\n\nThe meningococcal vaccine can also be given to younger children who are at high risk of bacterial meningitis or who have been exposed to someone with the disease. It’s approved for use in children as young as two years old.\n\nUnfortunately, even with immediate and appropriate antibiotic treatment, as many as 25 percent of newborns who develop bacterial meningitis cannot be saved. In older infants and children, the chance of not recovering from the disease varies from about five percent for infections H. Flu, to 10 percent for meningococcus, to as high as 20 percent when pneumococcus is the cause. Of those that survive, about one in four newborns will develop serious complications, while older children typically have fewer problems later in life.\n\nWhat therapies does Dr. Weil recommend for bacterial meningitis?\n\n The conventional approach to bacterial meningitis is the best acute treatment. Getting intravenous antibiotics can be life-saving.\n\nFrom a preventative standpoint, it’s important to understand how the disease is spread. Pay attention to good hygiene: carefully wash your hands before eating and after using the toilet, and especially within a crowded setting or after contact with animals; cover your mouth and nose when coughing or sneezing, and wash hands afterwards. If you’re pregnant, reduce your risk of listeriosis by cooking meat thoroughly, as well as avoiding ready-to-eat foods like hot dogs and lunch meats. Eat hard cheeses instead of soft ones made with unpasteurized milk (like feta, Brie, Camembert, blue-veined cheeses and Mexican style cheeses such as queso fresco, queso blanco and panela).\n\nMaintain your immune system by getting enough rest and regular exercise, following Dr. Weil’s anti-inflammatory diet, taking a daily antioxidant and multivitamin-mineral supplement, and attending to the stress in your life. Immune boosting tonics are certainly a healthy option to learn about if you have an increased risk of bacterial infections of any kind. For maintaining strong immune function, Dr. Weil recommends astragalus. You can buy extracts of astragalus in liquid, capsule or tablet form. Follow the dosing directions on the package. You can also take immune-stimulating mushrooms, especially in combinations of maitake ( ), reishi ( ), royal sun agaricus , and other traditional medicinal species, which seem to act better when used together than when taken individually.\n\nFinally, getting the meningococcal vaccine is a good idea, especially for those who are susceptible and at increased risk. The vaccine offers 85- to 95 percent protection against four bacterial strains that are responsible for 70 percent of meningococcal disease in the United States, but will not help protect against the strains responsible for the remaining 30 percent. Immunity lasts for three to five years. Even if you are immunized, should you be exposed to meningococcal meningitis afterward, you’ll need prompt preventive antibiotic treatment as a precaution. The vaccine’s side effects are minimal: some swelling and redness at the injection site and, rarely, flu-like symptoms or (even more rare) an allergic reaction. If you have had reactions to other vaccines, be sure to talk to your doctor about the benefits of the vaccine weighed against any potential risk.", "opengraph": {"locale": "en_US", "type": "article", "title": "Meningitis, Bacterial - Dr. Weil's Condition Care Guide", "description": "Learn more about bacterial meningitis, as well as many other health topics from Dr. Weil, your trusted health advisor.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/meningitis-bacterial/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:published_time": "2010-07-27T04:00:00+00:00", "article:modified_time": "2017-02-16T18:05:35+00:00", "image": "https://www.drweil.com/wp-content/uploads/2017/01/health-wellness_body-mind-spirit_back-pain_meningitis-bacterial_1440x1080_177257849.jpeg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-viral/", "https://www.drweil.com/health-wellness/body-mind-spirit/back-pain/meningitis-viral/", "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/pneumonia/", "https://www.drweil.com/sexual-health/hiv-and-aids/", "https://www.drweil.com/health-wellness/health-centers/aging-gracefully/dr-weils-anti-inflammatory-diet/"], "authors": ["", "Susan Bulzoni"], "publish_date": "2010-07-27T04:00:00+00:00"}