{"result_id": "368015", "URL": "https://www.drweil.com/health-wellness/health-centers/children/is-the-measles-vaccine-worthwhile/", "timestamp": "2023-04-25 18:25:21 CEST+0200", "meta": {"description": "The measles virus is so easily spread that 90 percent of those exposed to it will get sick. Learn why Dr. Weil is a strong proponent of immunizations, including the MMR vaccine.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/health-centers/children/is-the-measles-vaccine-worthwhile/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Is the Measles Vaccine Worthwhile? | Children | Andrew Weil, M.D.", "cleaned_text": "If you view measles as merely an uncomfortable, annoying, or trivial disease of childhood, you should be aware of its history. Its complications can be devastating – about one patient in 10 will develop an ear infection (otitis media) and one in 15 will get pneumonia, which in some cases can be life-threatening. About one measles patient in 1,000 contracts encephalitis, an inflammation of the brain that causes nausea and vomiting, seizures and sometimes coma and death. Measles can also cause deafness. Cases occurring in pregnant women can lead to miscarriage and low birth-weight babies. Approximately 30 million to 40 million cases of measles occur worldwide each year, resulting in nearly a million deaths and incalculable disability.\n\nThe measles virus is so easily spread that 90 percent of those exposed to it will get sick. What’s more, it can linger in the air after an infected person leaves the scene and continue to infect others for up to two hours. Children (and adults) are safe only if they’ve been vaccinated or have already had measles.\n\nMeasles outbreaks in the U.S. this year (2019) have occurred in 23 states, including New York, New Jersey, Washington, California and Michigan. As of September 2nd 2019, cases in the U.S. have risen to 1,234 across 31 states in the the worst U.S. outbreak of the virus since 1992, when – thanks to the MMR vaccine (for measles, mumps and rubella) – we regarded the disease as eliminated.\n\nAccording to the CDC these cases are mainly due to unvaccinated U.S. residents traveling abroad to areas where the vaccine is not as readily available as it is here. measles is prevalent. In April, the World Health Organization reported that there were three times as many cases of measles worldwide this year as there were in the first three months of 2018.\n\nBear in mind that before 1963 when the vaccine became available, an estimated three to four million people in the U.S. were infected every year, with 48,000 requiring hospitalization and 4,000 developing encephalitis. An estimated 400-500 people died annually.\n\nThere’s no treatment for measles; it has to run its course. Infants with known exposure can receive the MMR within three days to limit severity of the infection. Pregnant or immune-compromised people can get serum immune globulin injections, which provide pre-formed antibodies to fight the virus. When given within six days of exposure, this treatment can prevent measles or make symptoms less severe.\n\nI am a strong proponent of vaccination. Immunization is not without risk, but the risk is greatly outweighed by the risk of disease. Children should get the MMR vaccine as recommended – one shot at 12 to 15 months and the second between ages 4 and 6.\n\nParents who decline to have their children vaccinated may believe that the MMR vaccine is linked to autism. That is untrue. Extensive reports from the American Academy of Pediatrics, the Institute of Medicine and the U.S. Centers for Disease Control and Prevention have shown that there is no scientifically proven link between the MMR vaccine and autism.\n\nIf you have children who have not been vaccinated against measles, I urge you to make sure they get the shots.\n\n\n\n Measles (Rubeola), U.S. Centers for Disease Control and Prevention, accessed April 25, 2019, cdc.gov/measles/about/complications.html", "opengraph": {"locale": "en_US", "type": "article", "title": "Is the Measles Vaccine Worthwhile? | Children | Andrew Weil, M.D.", "description": "The measles virus is so easily spread that 90 percent of those exposed to it will get sick. Learn why Dr. Weil is a strong proponent of immunizations, including the MMR vaccine.", "url": "https://www.drweil.com/health-wellness/health-centers/children/is-the-measles-vaccine-worthwhile/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2019-09-03T23:23:08+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/health-centers/", "https://www.drweil.com/health-wellness/health-centers/children/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/skin/measles/"], "authors": [""], "publish_date": "September 3, 2019"}