{"result_id": "368005", "URL": "https://www.drweil.com/health-wellness/health-centers/children/hpv-vaccine-for-pre-teens/", "timestamp": "2023-04-25 18:25:00 CEST+0200", "meta": {"description": "The \"HPV vaccine\" (Gardasil) was introduced in 2006 to help protect against infection with four strains of the human papillomavirus (HPV), two of which are responsible for 70 percent of all cases of cervical cancer.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/health-centers/children/hpv-vaccine-for-pre-teens/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "HPV Vaccine for Pre-Teens? | Andrew Weil, M.D.", "cleaned_text": "The “HPV vaccine” (Gardasil) was introduced in 2006 to help protect against infection with four strains of the human papillomavirus (HPV), two of which are responsible for 70 percent of all cases of cervical cancer. These same HPV strains are known to cause anal cancers, and appear to be responsible for throat cancers resulting from oral sex. Rates of these types of cancer are increasing in both men and women. More than half of all men and women are infected with HPV within a year of becoming sexually active.\n\nA federal advisory panel on immunization practices recommended vaccination of 11 and 12 year old girls when the FDA approved the vaccine. In 2011, vaccination was also recommended for boys of the same age to help prevent the virus’s spread. Many parents have objected to vaccinating their daughters against a sexually transmitted virus before they become sexually active, but they’re missing the point: the vaccine won’t work once infection has occurred. The rationale for vaccinating boys is to prevent the spread of HPV to their future sex partners.\n\nSo far, the rates of vaccination of girls have been disappointing, but the CDC reports that vaccination rates among boys have been somewhat better than expected. Data from a CDC telephone survey indicate that about 21 percent of boys have had at least one of the three shots, although fewer than seven percent have been fully vaccinated. The CDC also says that the initial rate for vaccinating girls with at least one HPV shot was 25 percent. In 2012, the percentage of girls vaccinated was about 54 percent – not much changed from the previous two years. Only a third of pre-teen girls had been fully immunized with all three doses last year.\n\nThere are more than 100 strains of HPV, and more than 30 of them are sexually transmitted. Of those, HPV strains numbers 16 and 18 are linked to most cases of cervical cancer as well as to vaginal and vulvar cancers. In 90 percent of all cases, HPV infections clear up on their own and cause no obvious symptoms (except, in some cases, genital warts; the vaccine also protects against the viruses responsible for most of those).\n\nHPV infections that linger, however, can initiate changes that might lead to cancer. Although suspicious cervical changes can be picked up on Pap smears, some 10,000 women in the United States develop cervical cancer every year, and the disease causes about 3,900 deaths annually, most of which could be prevented if all women received regular Pap smears. Worldwide, cervical cancer kills more than 288,000 women per year. Women vaccinated with Gardasil will still need Pap smears once they become sexually active to check for cervical changes due to other HPV strains that the vaccine doesn’t affect. A newer test for HPV is very effective at identifying infections with strains of the virus known to cause cervical cancer. It is approved for testing when abnormalities show up on a woman’s Pap test and for use in conjunction with Pap tests in women over 30.\n\nThe HPV vaccine is given in three shots administered over a period of six months; it will cost an estimated $360. (Most private insurers now cover the cost of vaccinating young girls.) Parents now have the opportunity to protect their kids from several types of cancer later in life. In my view, the HPV vaccine offers the possibility of saving millions of lives around the world.\n\nSources: \n\n “Human Papillomavirus Vaccination Coverage Among Adolescent Girls, 2007–2012, and Postlicensure Vaccine Safety Monitoring, 2006–2013 — United States”, U.S. Centers for Disease Control and Prevention, accessed January 3, 2013 http://www.cdc.gov/mmwr/preview/mmwrhtml/mm6229a4.htm\n\n“Teen Vaccination Coverage, 2012 National Immunization Survey (NIS)”, U.S. Centers for Disease Control and Prevention, accessed January 3, 2013, http://www.cdc.gov/vaccines/who/teens/vaccination-coverage.html", "opengraph": {"locale": "en_US", "type": "article", "title": "HPV Vaccine for Pre-Teens? | Andrew Weil, M.D.", "description": "The \"HPV vaccine\" (Gardasil) was introduced in 2006 to help protect against infection with four strains of the human papillomavirus (HPV), two of which are responsible for 70 percent of all cases of cervical cancer.", "url": "https://www.drweil.com/health-wellness/health-centers/children/hpv-vaccine-for-pre-teens/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2022-10-26T17:05:07+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/health-centers/", "https://www.drweil.com/health-wellness/health-centers/children/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/cancer/cervical-cancer/", "https://www.drweil.com/sexual-health/genital-warts/"], "authors": [""], "publish_date": "October 26, 2022"}