{"result_id": "368033", "URL": "https://www.drweil.com/health-wellness/health-centers/aging-gracefully/thimerosal-can-flu-shots-lead-to-alzheimers/", "timestamp": "2023-04-25 18:25:58 CEST+0200", "meta": {"description": "No convincing evidence suggests that any harm has been caused by the low doses of mercury in vaccines. Learn more about this subject.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/health-centers/aging-gracefully/thimerosal-can-flu-shots-lead-to-alzheimers/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Thimerosal: Can Flu Shots Lead to Alzheimer's? | Andrew Weil, M.D.", "cleaned_text": "No. Thimerosal, a preservative that contains minute amounts of mercury, has been safely used in some vaccines and other products since the 1930’s. No convincing evidence suggests that any harm has been caused by the low doses of mercury in vaccines. Despite scare stories linking flu shots with Alzheimer’s disease, scientific studies suggest just the opposite: Alzheimer’s risk declines among those vaccinated against diphtheria, tetanus, polio, and influenza. Moreover, a study published in the on Nov. 3, 2004, showed that annual flu shots for older adults were associated with a reduced risk of death from all causes.\n\nMost adverse effects of flu shots today are minor local reactions such as redness and swelling at the injection site. According to the U.S. Centers for Disease Control and Prevention (CDC), thimerosal is used to prevent the growth of bacteria and fungi should they get into a vaccine. This can happen when a needle enters a vial as a vaccine is being prepared for administration. Contamination can cause severe reactions, including systemic illness and death.\n\nYou should be aware that today’s flu vaccines are available with or without thimerosal. You can find out whether or not a particular brand of vaccine has it by logging onto the U.S. Food and Drug Administration‘s website and scrolling down to Table 3, which lists influenza (and other) vaccines and their thimerosal content, if any. Alternatively, you can ask your health care professional or pharmacist for a copy of the vaccine package insert, which will tell you whether or not thimerosal is present.\n\nFor the record, thimerosal does not remain in the body long enough to build up and reach harmful levels. It breaks down into ethylmercury and thiosalicylate, both of which are easily eliminated. I wouldn’t worry about the small amount of thimerosal that may still be in some flu vaccines. The health risks of influenza are much greater than any small risk thimerosal may present. Remember, the flu is more than a bad cold. It is a significant disease that can lead to pneumonia, which can be deadly, especially in the elderly. Each year, more than 100,000 people are hospitalized and 20,000 die as a result of the flu and its complications.\n\nI recommend flu shots for those over 65, as well as anyone with a weakened immune or respiratory system, nursing home residents, and health care workers who have regular contact with patients.", "opengraph": {"locale": "en_US", "type": "article", "title": "Thimerosal: Can Flu Shots Lead to Alzheimer's? | Andrew Weil, M.D.", "description": "No convincing evidence suggests that any harm has been caused by the low doses of mercury in vaccines. Learn more about this subject.", "url": "https://www.drweil.com/health-wellness/health-centers/aging-gracefully/thimerosal-can-flu-shots-lead-to-alzheimers/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2022-08-31T15:11:07+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/11/safe_image.png", "image:width": "476", "image:height": "249", "image:type": "image/png"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/health-centers/", "https://www.drweil.com/health-wellness/health-centers/aging-gracefully/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "http://www.fda.gov/BiologicsBloodVaccines/SafetyAvailability/VaccineSafety/UCM096228"], "authors": [""], "publish_date": "August 31, 2022"}