{"result_id": "368031", "URL": "https://www.drweil.com/health-wellness/balanced-living/healthy-living/aluminum-a-vaccine-danger/", "timestamp": "2023-04-25 18:25:54 CEST+0200", "meta": {"description": "Research reveals that the total body burden of aluminum from vaccines, breast milk, and infant formula, is well below the minimal risk level. Learn more.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/balanced-living/healthy-living/aluminum-a-vaccine-danger/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Aluminum, Childhood Vaccines, Chlidren's Health | Andrew Weil, M.D.", "cleaned_text": "Since the 1920s, aluminum salts have been added to the DTP (diphtheria, tetanus, pertussis) vaccine as adjuvants – substances that boost the immune response to the shot. The greatest danger connected with them appears to local pain and redness at the injection site. I’ve seen no evidence suggesting that there are any adverse long-term effects. A recent review of dozens of studies (published in the February, 2004, issue of ) came to the same conclusion.\n\nAccording to the U.S. Agency for Toxic Substances and Disease Registry (ATSDR) between 50 and 70 percent of the injected aluminum adjuvants in vaccines is excreted within 24 hours. The ATSDR estimates that infants are exposed to aluminum in breast milk (40 micrograms per liter) and in infant formulas (an average of 225 micrograms per liter) and that the total body burden from those sources and from vaccines is below the minimal risk level except for the relatively brief period between vaccination and excretion.\n\nI recommend avoiding anti-perspirants that contain aluminum compounds, which are irritants and may be absorbed into the body. We don’t know the details of aluminum toxicity, but aluminum has no known role in human physiology, and I think you’re better off with natural deodorants available in health food stores (the best ones contain extracts of green tea) or with rubbing alcohol splashed under the arms as an antibacterial agent.\n\nBear in mind that while aluminum is all around us (it is, in fact, the most abundant metal in the earth’s crust, but nearly always bound to other minerals), the average human intake is relatively low; between 30 and 50 mg per day, mostly from foods and drinking water. However, according to the National Institute of Environmental Health Sciences, we absorb less than one percent of the aluminum we swallow. Major sources are baking powder, pickles crisped with alum, antacids and some brands of buffered aspirin. Check product labels to avoid consuming extra aluminum.", "opengraph": {"locale": "en_US", "type": "article", "title": "Aluminum, Childhood Vaccines, Chlidren's Health | Andrew Weil, M.D.", "description": "Research reveals that the total body burden of aluminum from vaccines, breast milk, and infant formula, is well below the minimal risk level. Learn more.", "url": "https://www.drweil.com/health-wellness/balanced-living/healthy-living/aluminum-a-vaccine-danger/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2021-11-17T20:49:40+00:00", "image": "https://www.drweil.com/wp-content/uploads/2016/12/health-wellness_balanced-living_healthy-living_aluminum-a-vaccine-danger_2714x1811_000028135082.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/balanced-living/", "https://www.drweil.com/health-wellness/balanced-living/healthy-living/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/health-centers/children/whooping-cough-pertussis/"], "authors": [""], "publish_date": "November 17, 2021"}