{"result_id": "368026", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/does-covid-19-shrink-your-brain/", "timestamp": "2023-04-25 18:25:44 CEST+0200", "meta": {"description": "Even mild COVID appears to influence brain structure and function.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/does-covid-19-shrink-your-brain/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Does COVID-19 Shrink Your Brain? | Disease & Disorders | Dr. Weil", "cleaned_text": "It might. More than three years into the COVID-19 pandemic, most people are familiar with the classic symptoms of the infection, such as a fever, cough, loss of smell, and congestion. We’ve also learned that some people who have had COVID-19 — an estimated 1 in 5 Americans, according to the U.S. Centers for Disease Control and Prevention — go on to develop “long COVID,” varied lingering symptoms that can include fatigue, shortness of breath, and headaches.\n\nNow we can add another unwelcome consequence to the list of COVID-related concerns: brain shrinkage. A large study by researchers at Oxford University’s Wellcome Centre for Integrative Neuroimaging in the United Kingdom found that even mild COVID appears to influence brain structure and function. The team of investigators compared two sets of brain scans from nearly 800 middle-aged and older adults. The first batch was taken between 2014 and early 2020, the second between February and May 2021. About half of the participants had COVID-19 between March 2020 and April 2021. First, the researchers estimated brain changes over time in each group and then looked for differences in these changes between the groups. They also compared the groups’ scores on tests of cognitive function.\n\nThe investigators found that, compared to their peers, people who been diagnosed with COVID-19 tended to exhibit greater loss of gray matter, a greater decrease in brain volume, and more tissue damage in the area of the brain associated with the sense of smell. They also had a greater decline in the ability to perform complex tasks. This was true even for people with mild COVID-19. When the researchers compared these post-COVID scans to brain scans of people who had had pneumonia, they found no such changes in the latter group. This suggests that such losses in brain size are specific to COVID-19 infection. While more research is needed, the researchers suspect that direct viral infection or inflammation of brain cells might play a role. ( , March 7, 2022)\n\nTo me, this study is one more good reason to protect yourself against COVID-19 as much as possible. Get vaccinated, stay up to date on boosters, wash your hands well and often, and wear a face mask in crowded, indoor spaces.\n\nDouaud, G., Lee, S., Alfaro-Almagro, F. SARS-CoV-2 is associated with changes in brain structure in UK Biobank. 604, 697–707 (2022). doi.org/10.1038/s41586-022-04569-5", "opengraph": {"locale": "en_US", "type": "article", "title": "Does COVID-19 Shrink Your Brain? | Disease & Disorders | Dr. Weil", "description": "Even mild COVID appears to influence brain structure and function.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/does-covid-19-shrink-your-brain/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2023-01-31T22:37:42+00:00", "image": "https://www.drweil.com/wp-content/uploads/2022/12/Covid-Brain-Size-QA-1278674176.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-what-you-should-know-about-coronavirus/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/how-to-get-out-of-a-four-month-long-covid-fatigue/"], "authors": [""], "publish_date": "January 31, 2023"}