{"result_id": "368038", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-what-you-should-know-about-coronavirus/", "timestamp": "2023-04-25 18:26:08 CEST+0200", "meta": {"description": "The initial symptoms of COVID-19 include fever, cough and shortness of breath that develop between two to 14 days after exposure.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-what-you-should-know-about-coronavirus/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "COVID-19: What You Should Know About Coronavirus | Andrew Weil, M.D.", "cleaned_text": "COVID-19: What You Should Know About Coronavirus\n\nMany coronaviruses can cause illness in humans and animals, from the common cold to serious diseases including Middle East Respiratory Syndrome (MERS) and Severe Acute Respiratory Syndrome (SARS), and now illness due to the current virus (COVID-19) infecting humans worldwide. MERS, and SARS seem to have originated in bats and then jumped to an intermediate animal (camels for MERS and civit cats for SARS, with the pangolin theorized for COVID-19), which then allowed human exposure.\n• Download the Andrew Weil Center For Integrative Medicine’s set of recommendations.\n\nBelow, you’ll find what you need to know about transmission of the virus from person to person, symptoms, testing and treatment, as well as Dr. Weil’s recommendations for prevention.\n\nAccording to the U.S. Centers for Disease Control and Prevention (CDC), the virus can be passed via close contact (within six feet) with an infected person who coughs or sneezes, spreading droplets that you can inhale. You also can pick up the disease by touching surfaces where viruses have landed and then touching your mouth, nose or eyes. However, according to the CDC, this is not the main way the virus spreads.\n\nThe initial symptoms of COVID-19 include fever, cough and shortness of breath that develop between two to 14 days after exposure. Most cases (an estimated 80 percent) are mild. Some people have no symptoms after picking up the virus but can still transmit it to others. If you have been diagnosed with COVID-19 and develop severe breathing problems, call 911, tell them about your diagnosis, explain what’s wrong and ask for immediate medical help. In addition to fever and coughing, difficulty breathing is the main symptom of serious illness.\n\nThose who develop serious illness as a result of infection with the coronavirus usually are people age 65 and older, as well as those with underlying health problems, such as lung disease, high blood pressure, heart problems or diabetes.\n\nInitially, the CDC restricted testing for the coronavirus, bypassing people who had no symptoms and those who had not been in contact with someone who had a confirmed infection or had not traveled to China, Italy, Iran or other affected countries.\n\nMost people can now be tested to determine whether or not they are currently infected with COVID-19. An additional blood test can reveal whether or not an individual already has had an infection and has developed antibodies to the virus. It’s estimated that it can take one to three weeks after infection for your body to make antibodies. These may protect you from being infected again, but we don’t yet know how much protection they provide or how long it might last. You can test positive for antibodies even if you haven’t had symptoms of COVID-19.\n\nState and local health departments and healthcare providers determine who can be tested. To find out whether you are eligible, check your state or local health department website or discuss testing with your physician.\n\nThe test for infection involves oral or nasal swabs to detect the COVID-19 virus in saliva or secretions in the nose or throat. This may be somewhat uncomfortable but takes only a few seconds. In some places, you can get the results within an hour; elsewhere, samples are sent to a laboratory and results may not be available for a few days.\n\nIf the result is negative, you were not infected at the time of the test. Be aware, however, that a negative result can occur very early in an infection before the virus is detectable. If you develop symptoms after a negative test, you’ll need to be tested again.\n\nThe CDC recommends priority testing for the following individuals:\n• People working in health care facilities and group residences such as nursing homes.\n• First responders (emergency medicine technicians, police officers, firefighters and others) who have COVID-19 symptoms.\n• People with COVID-19 symptoms who live in long-term care facilities or other group living settings, including prisons and shelters.\n• Individuals who have COVID-19 symptoms such as fever, cough, shortness of breath or difficulty breathing, chills, muscle pain, new loss of taste or smell, congestion or runny nose, vomiting or diarrhea, or sore throat or fatigue.\n• Individuals recommended for testing by their doctors or local health department.\n\nHow Long The Virus Remains on Surfaces\n\nNew research from the National Institutes of Health has shown that airborne virus particles from a person infected with COVID-19 can remain in the air for hours and on surfaces for days. These particles are on droplets released by coughing and sneezing or when an infected person touches objects. Droplets in the air are able to infect others for at least three hours. Here’s a rundown of how long the virus can remain viable on various surfaces under laboratory conditions.\n• Stainless steel: Half of the virus particles become inactive between 5 and 6 hours, but viable virus was detected up to 72 hours.\n• Plastic: The half-life (the time it takes for virus concentration to decrease by half) is between 6 and 7 hours, but here viable virus can be found after two to three days.\n• Cardboard: Less than 24 hours. The half-life IS about three-and-a-half hours, with much variability.\n• Copper: No viable particles were measurable after four hours.\n\nThere is no specific treatment for mild cases. If you have tested positive and have a mild case, you probably will be told to go home and stay there. The CDC advises wearing a facemask when you’re around people or animals in your household. Do not allow guests to visit while you’re in quarantine. If possible, stay in a room of your own, away from other members of the household and (if possible) use a bathroom for yourself alone. Your physician or local health department will determine when you’re no longer capable of transmitting the infection to others and no longer need to be quarantined. This is done on a case-by-case basis.\n\nSymptoms of severe cases include shortness of breath, increased trouble breathing and a high fever that can lead to severe pneumonia with respiratory failure and septic shock. People this sick need to be hospitalized.\n\nIn China, death rates from COVID-19 have been higher among men than women, possibly because more men in China are smokers and at greater risk of respiratory complications.\n• Wash your hands frequently and thoroughly with soap and water for at least 20 seconds. Studies have shown that this can reduce respiratory illness in the general population by 16 to 21 percent. Reportedly, in 2003 during the SARS epidemic, handwashing reduced the risk of transmission by 30 to 50 percent. According to the U.S. Centers for Disease Control and Prevention (CDC), hand washing is essential under the following conditions:\n• Before eating and during and after food preparation…\n• Before and after treating a cut or wound.\n• After using the toilet, changing diapers or cleaning up a child who has used the toilet.\n• After blowing your nose, coughing or sneezing.\n• After touching an animal or cleaning animal waste.\n• After handling pet food or pet treats; after touching garbage.\n• Wear a mask. Wearing a mask helps protect others from catching the disease. Pre-symptomatic and asymptomatic transmission are both possible: Studies have shown that viral load can peak in the days before symptoms begin, and that even just speaking is enough to spread the virus.\n• Hand sanitizers: Choose products with an alcohol concentration between 60–95 percent. These are more effective than those with a lower concentration of alcohol or non-alcohol-based products. Apply the product to the palm of one hand (read the label to learn the correct amount) and rub it all over the surfaces of both hands until they are dry.\n• Avoid sick people if possible and you are not a health care worker.\n• Do not shake hands. Instead, greet friends and business associates with a fist bump or friendly nod.\n• Try not to touch your face: Most people touch their face multiple times per day. If you’ve picked up germs on your hands, then touch your face, you give the infectious agents easy access to your body via eyes, nose and mouth.\n\nWhat You Should & Shouldn’t Take\n\nConsider The Following:\n\nDr. Weil considers the following natural immune stimulating and antiviral agents as likely safe to take before and during a COVID-19 virus infection. However, we don’t know for sure whether any of them will affect the symptoms or severity of the infection.\n• Garlic ( contains several compounds with antibacterial, antifungal and antiviral properties. Dr. Weil advises taking two cloves of raw garlic at the first sign of a cold or as a preventive. Mash or chop them finely and mix with food or cut cloves into chunks and swallow them whole like pills. Capsules of allicin, the active component of garlic, are more powerful.\n• Quercetin: This bioflavonoid is found in a variety of fruits, vegetables, and grains. Good sources include buckwheat, apples, onions, kale, tomatoes, broccoli, asparagus, berries, red wine, and tea. Quercetin can also be taken in supplement form at doses between 500 mg and 1000mg daily.\n• Green tea: Green tea is an excellent source of antiviral and anti-inflammatory catechins, notably, one called epigallocatechin gallate, or EGCG. Be sure to choose organic green tea, and it is best to drink it at mealtimes. You can re-steep the same loose green tea throughout the day to pull out all of its medicinal properties. Drinking 3 to 5 cups of daily is recommended.\n• Astragalus membranaceous: Astragalus is the source of a popular medicine called huang qi available in any drugstore in China for use against colds, flus and other respiratory infections. Dr. Weil recommends taking two capsules of a standardized extract preventively twice a day during the flu season\n• Full mycelium and fruiting body mushroom extracts: Many mushrooms are considered medicinal and regulate immunity to increase resistance to infections while minimizing damaging inflammation. Most medicinal mushroom extracts are dosed between 1,000 mg and 3,000 mg daily.\n• Peppermint: Use peppermint chest-rub formulations as needed for congestion due to the common cold. Alternatively, brew a cup of fresh peppermint tea – hot, warm, cooled or iced.\n• Andrographis paniculata: This plant, native to southeast Asia is used to treat the common cold and throat infections. It may work by stimulating the immune system and may prevent influenza viruses from binding to cells. Dr. Weil recommends taking a 400mg standardized extract twice daily for prevention.\n• Zinc: Helps maintain optimum immune function, boosts immunity and may prevent coronavirus from entering cells. Zinc also appears to reduce the severity of coronavirus infections and may have protective effects in the upper respiratory tract. Typical daily doses of zinc lozenges are 15 mg to 30 mg.\n• Vitamin A: Vitamin A plays a vital role in immune system health and also helps the skin and mucous membranes repel bacteria and viruses more effectively. Excessive, chronic intake of some forms of vitamin A can be toxic. Avoid taking supplemental vitamin A as retinol or retinoic acid, and instead use plant-derived vitamin A precursors such as beta-carotene (in addition to other mixed carotenoids). Doses 15 to 30mg of mixed carotenoids and beta-carotene are recommended.\n• Vitamin C: Dr. Weil recommends taking 250 mg of vitamin C daily and increasing that by an extra 1,000 mg if you have a cold or flu, work in a smog-filled city, or live with a smoker.\n\nWhat You Shouldn’t Take\n\nIf you have symptoms of infection or have had a positive test for the coronavirus, Dr. Weil recommends avoiding the following agents, which could possibly stimulate an inflammatory response.\n• Is There A Drug For COVID-19?\n• How Much Can Masks Help?\n• Don’t Give Up On Your Mask\n• Can A Mask Protect Against The Flu?\n• What Does Social Distancing Mean?\n• Can You Get COVID-19 Twice?\n\nDr. Weil recommends accessing the U.S. Centers for Disease Control and Prevention COVID-19 website.\n\nInformation about the spread of the coronavirus worldwide is available from the World Health Organization.\n\nN. Van Doremalen, . “Aerosol and surface stability of HCoV-19 (SARS-CoV-2) compared to SARS-CoV-1.” The New England Journal of Medicine . MARCH 17, 2020, DOI: 10.1056/NEJMc2004973", "opengraph": {"locale": "en_US", "type": "article", "title": "COVID-19: What You Should Know About Coronavirus | Andrew Weil, M.D.", "description": "The initial symptoms of COVID-19 include fever, cough and shortness of breath that develop between two to 14 days after exposure.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-what-you-should-know-about-coronavirus/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:published_time": "2021-02-09T07:01:18+00:00", "article:modified_time": "2021-09-15T16:46:50+00:00", "image": "https://www.drweil.com/wp-content/uploads/2020/03/16123609/covid-19-coronoavirus-CCG-ART-1205573573-copy.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "500", "height": "281", "embed_code": "<iframe loading=\"lazy\" title=\"Dr. Weil's COVID-19 Message | Andrew Weil, M.D.\" width=\"500\" height=\"281\" src=\"https://www.youtube.com/embed/Kv_IFgqx_IA?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"/>", "src": "https://www.youtube.com/embed/Kv_IFgqx_IA?feature=oembed"}], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "https://www.worldometers.info/coronavirus/", "https://www.worldometers.info/coronavirus/country/us/", "https://www.drweil.com/wp-content/uploads/2020/03/IntegrativeApproachesPublic.pdf", "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/covid-19-why-wear-masks/", "https://www.drweil.com/vitamins-supplements-herbs/herbs/garlic/", "https://www.drweil.com/health-wellness/health-centers/aging-gracefully/cant-drink-enough-red-wine/", "https://www.drweil.com/vitamins-supplements-herbs/herbs/quercetin/", "https://www.drweil.com/vitamins-supplements-herbs/herbs/astragalus/", "https://www.drweil.com/vitamins-supplements-herbs/herbs/peppermint/", "https://www.drweil.com/vitamins-supplements-herbs/supplements-remedies/zinc/", "https://www.drweil.com/vitamins-supplements-herbs/vitamins/facts-about-vitamin-a/", "https://www.drweil.com/vitamins-supplements-herbs/vitamins/vitamin-c-benefits/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-vaccine-issues/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-vaccine-side-effects/", "https://www.drweil.com/blog/bulletins/good-news-about-covid-19-vaccines/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/is-there-a-drug-for-covid-19/", "https://www.drweil.com/blog/bulletins/how-much-can-masks-help/", "https://www.drweil.com/blog/bulletins/dont-give-up-your-mask/", "https://www.drweil.com/blog/bulletins/best-material-for-a-homemade-face-mask/", "https://www.drweil.com/health-wellness/body-mind-spirit/colds-flu/can-a-mask-protect-against-the-flu/", "https://www.drweil.com/blog/bulletins/best-masks-to-prevent-coronavirus/", "https://www.drweil.com/health-wellness/body-mind-spirit/respiratory/covid-19-why-wear-masks/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/what-is-contact-tracing/", "https://www.drweil.com/blog/spontaneous-happiness/sheltering-at-home/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/what-does-social-distancing-mean/", "https://www.drweil.com/blog/bulletins/social-distancing-to-avoid-covid-19/", "https://www.drweil.com/blog/bulletins/covid-19-your-weight/", "https://www.drweil.com/vitamins-supplements-herbs/vitamins/covid-19-low-levels-of-vitamin-d-increases-risk/", "https://www.drweil.com/blog/bulletins/older-men-covid-19/", "https://www.drweil.com/blog/bulletins/covid-19-and-your-dreams/", "https://www.drweil.com/blog/bulletins/covid-19-coronavirus-and-your-eyes/", "https://www.drweil.com/health-wellness/body-mind-spirit/dental-oral-health/covid-19-avoid-the-dentist/", "https://www.drweil.com/blog/bulletins/covid-19-food/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/is-dining-out-a-covid-19-risk/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-will-warm-weather-affect-the-corona-virus/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/can-you-get-covid-19-twice/", "https://www.drweil.com/blog/bulletins/covid-19-reinfection/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-surface-spread/", "https://www.drweil.com/blog/bulletins/covid-19-hand-sanitizer-warning/", "https://www.drweil.com/blog/bulletins/dogs-to-diagnose-covid-19/", "https://www.cdc.gov/coronavirus/2019-ncov/index.html", "https://www.who.int/emergencies/diseases/novel-coronavirus-2019"], "authors": ["", "Susan Bulzoni"], "publish_date": "2021-02-09T07:01:18+00:00"}