{"result_id": "368008", "URL": "https://www.drweil.com/blog/bulletins/exercise-boosts-effects-of-covid-and-flu-vaccines/", "timestamp": "2023-04-25 18:25:06 CEST+0200", "meta": {"description": "Engaging in exercise right after getting an immunization appears to bolster the body’s defenses by strengthening its immune response.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/blog/bulletins/exercise-boosts-effects-of-covid-and-flu-vaccines/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "Exercise Boosts COVID And Flu Vaccines | Andrew Weil, M.D.", "cleaned_text": "Want to maximize the effectiveness of your COVID or flu vaccine? Take a long brisk walk, run or bike ride, say researchers at Iowa State University. They found that engaging in exercise right after getting an immunization appears to bolster the body’s defenses by strengthening its immune response.\n\nIn one experiment, the study team looked at the effect of a 90-minute walk, jog, or stationary bike ride on the immune system of 70 adults who had just received a flu shot or the first dose of the Pfizer-BioNTech COVID-19 vaccine. Some of the volunteers were asked to exercise directly after receiving their vaccine, while others were simply asked to stay seated. When the researchers compared blood samples taken prior to immunization with those taken up to four weeks later, they found that those in the study who exercised after the injection produced more antibodies than those who had remained sedentary. A second experiment in mice suggests that exercise assists the body in producing a protein that helps generate antibodies and T-cells specific to the viruses that cause COVID and flu. The results were published online in\n\n“These findings suggest that adults who exercise regularly may increase antibody response to influenza or COVID-19 vaccine by performing a single session of light- to moderate-intensity exercise post-immunization,” write the researchers. They plan to continue tracking the immune response for six months after vaccination and are also studying the effect of exercise on COVID booster shots.\n\nTry this recipe today: Seared Salmon With Orange Glaze\n\nSign up for more Dr. Weil newsletters:", "opengraph": {"locale": "en_US", "type": "article", "title": "Exercise Boosts COVID And Flu Vaccines | Andrew Weil, M.D.", "description": "Engaging in exercise right after getting an immunization appears to bolster the body’s defenses by strengthening its immune response.", "url": "https://www.drweil.com/blog/bulletins/exercise-boosts-effects-of-covid-and-flu-vaccines/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2022-04-27T19:45:15+00:00", "image": "https://www.drweil.com/wp-content/uploads/2022/02/22094454/Exercise-Boosts-Effects-Of-COVID-And-Flu-Vaccines-WB-906783868.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/blog/", "https://www.drweil.com/blog/bulletins/", "https://www.drweil.com/diet-nutrition/recipes/seared-salmon-with-orange-glaze/"], "authors": [""], "publish_date": "April 27, 2022"}