{"result_id": "368028", "URL": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/is-there-a-drug-for-covid-19/", "timestamp": "2023-04-25 18:25:48 CEST+0200", "meta": {"description": "Remdesivir, an experimental anti-viral drug has been associated with a modest decrease in recovery time for patients in the U.S. infected with the coronavirus. A study in China found no such benefit.", "lang": "en", "keywords": "", "favicon": "https://www.drweil.com/wp-content/themes/drweil/images/favicon.ico", "canonical": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/is-there-a-drug-for-covid-19/", "encoding": "UTF-8"}, "image": null, "domain": "www.drweil.com", "title": "A Drug For COVID-19? | Disease & Disorders | Andrew Weil, M.D.", "cleaned_text": "You’re likely referring to remdesivir, an experimental anti-viral drug that has been associated with a modest decrease in recovery time for patients in the U.S. infected with the coronavirus. A study in China found no such benefit.\n\nAccording to preliminary findings from the National Institutes of Health, patients treated with remdesivir recovered 31 percent faster than those who received a placebo, a recovery time of 11 days for those treated compared to 15 days for patients who received a placebo. The study also revealed that those treated with remdesivir were less likely to die.\n\nThe study that yielded this new information was sponsored by the National Institute of Allergy and Infectious Diseases (NIAID) and included 1,063 hospitalized COVID-19 patients with lung involvement. Recovery among those who took part was defined as being well enough to be discharged from the hospital and return to their normal activities.\n\nRemdesivir is described as an “investigational broad-spectrum antiviral.” It was first used in clinical trials in 2014 during an outbreak of Ebola. Treatment involves 10 daily injections. In announcing the study results, Dr. Anthony Fauci, M.D., director of NIAID, said he was optimistic that the drug would become the “standard of care” for COVID-19 patients.\n\nHowever, the timing of the release of these results has been criticized by some leading scientists because they were made public before peer review or publication in a medical journal. Even so, according to the , the U.S. Food and Drug Administration is likely to announce emergency approval for remdesivir for treatment of COVID-19.\n\nWhile remdesivir does appear to speed recovery of some COVID-19 patients, be aware that it has been used only in investigational studies and at this writing is not licensed or approved in the U.S. for treatment of the infection.\n\nYeming Wang et al, “Remdesivir in adults with severe Covig-19: a randomized, double-blind, placebo-controlled, multicenter trial,” The Lancet, April 29, 2020", "opengraph": {"locale": "en_US", "type": "article", "title": "A Drug For COVID-19? | Disease & Disorders | Andrew Weil, M.D.", "description": "Remdesivir, an experimental anti-viral drug has been associated with a modest decrease in recovery time for patients in the U.S. infected with the coronavirus. A study in China found no such benefit.", "url": "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/is-there-a-drug-for-covid-19/", "site_name": "DrWeil.com", "article:publisher": "https://www.facebook.com/DrWeil", "article:modified_time": "2020-06-05T15:15:55+00:00", "image": "https://www.drweil.com/wp-content/uploads/2020/01/28081900/novel-coronavirus-QA-2020-476921149-copy.jpg", "image:width": "1440", "image:height": "1080", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drweil.com/", "https://www.drweil.com/health-wellness/", "https://www.drweil.com/health-wellness/body-mind-spirit/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/", "/health-wellness/balanced-living/meet-dr-weil/about-andrew-weil-m-d/", "https://www.drweil.com/health-wellness/body-mind-spirit/disease-disorders/covid-19-what-you-should-know-about-coronavirus/"], "authors": [""], "publish_date": "June 5, 2020"}