{"result_id": "370027", "URL": "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-parotitis/", "timestamp": "2023-04-25 18:27:43 CEST+0200", "meta": {"description": "Homeopathic remedies for parotitis help in reducing the inflammation and swelling of the parotid glands and offer a natural and effective treatment.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-parotitis/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic Remedies for Parotitis - DrHomeo Homeopathy", "cleaned_text": "Parotitis refers to inflammation of one or both the parotid glands. The parotid glands are the largest and one of the major pair salivary glands which function to produce saliva in the mouth. These are located on either side of the face inside each cheek over the jaw in front of each ear. The parotid gland is the most commonly affected among all the salivary glands by inflammation. Homeopathic remedies for parotitis help in reducing the inflammation and swelling of the parotid glands.\n\nHomeopathy offers a natural and very effective treatment for cases of parotitis. The homeopathic medicines bring excellent recovery by focusing to treat the root cause behind inflamed parotid glands. These medicines are very beneficial for both acute (of recent origin) as well as chronic (present from long periods of time or recurring frequently from long time) cases of parotitis. With this they work magnificently to bring relief in its symptoms like facial pain, tenderness, difficulty in opening mouth and fever. These medicines are also indicated for cases where the parotid glands have become hard or where pus has collected (abscess formation) in the parotid glands. These medicines are safe to use among people of all age groups and don’t have any side effects as they are prepared from naturally occurring substances.\n\nHomeopathic medicine belladonna is prepared from plant Deadly Nightshade. This plant belongs to the family Solanaceae. It is a top grade medicine for treating cases of parotitis. The key symptoms to use this are swelling in the face in front of the ear with violent shooting or stitching pain. The side of the face also gets red and hot with swelling. The pain can worsen from touch or motion. The pain may sometimes extend to the throat, external ear or neck. The pain is recurrent and tends to appear everyday, sometimes peculiarly at the same hour. Dryness of mouth and lips is also present. Along with above symptoms, high fever with alternate heat and chills appears. Although it works well for treating parotitis of either side, it is commonly used to treat swelling of the right parotid.\n\nIt is the next effective medicine for treating parotitis cases. It is used when there is swelling of parotid gland along with tenderness and sensitiveness. The parotid gland is also hard. In these cases pain in parotid mostly throbbing or stinging type is also there. The pain is worse mainly at night. The pain can also worsen from empty swallowing (means of swallowing saliva down the throat) or in fresh air. Sometimes speaking also increases the pain. With above few general symptoms including excessive salivation, offensive odour in mouth, bad taste in mouth and excessive sweating can appear.\n\nThis medicine is helpful for persons who have inflamed parotid gland and have extreme difficulty in opening their mouths. Swallowing causes pain and is difficult, at times nearly impossible. The parotid gland is also very much enlarged along with swelling and inflammation in it. They have fever accompanying the above complaints. For using this medicine mostly left sided parotid is involved. It is also useful for cases where abscess (lump having pus in it) has formed in the parotid gland.\n\nHepar Sulph is a helpful medicine for inflamed parotid gland with high fever. Marked chills are present with fever along with restlessness. Its use is indicated for cases of acute inflammation of parotid gland.\n• Aurum Met – When Parotid is Swollen and Painful to Touch\n\nAurum Met is a prominent medicine when the parotid gland is swollen and painful to touch. The gland feels sore and bruised. There is also a pressing pain in the parotid gland.\n\nThis medicine is indicated when there is swelling and puffiness of face in case of inflamed parotid glands.\n\nThis medicine is useful when the left parotid gland is inflamed, swollen and enlarged with pain in it. The pain is usually stitching in nature. The pain can radiate from the parotid gland to the ear or head.\n\nThe features guiding its use are swelling and hardness of the left parotid. With this warmth is felt over the parotid gland on the left side. Apart from this it is also indicated when there is pus formation in the parotid gland.\n\nThis natural medicine is prepared from Indian Turnip belonging to the Araceae family. Use of this medicine is considered when the left parotid gland is swollen and is very sore to touch.\n\nBaryta Carb is an excellent medicine for cases where the right parotid gland is swollen and painful. This gland is also tender to touch. Along with this the breath is very offensive.\n\nThis medicine is prepared from root procured before flowering of a plant Bryonia alba commonly known as wild hops. This plant belongs to the family Cucurbitaceae. It is a wonderful medicine to treat cases where swelling and pain is present in the right parotid gland. There is marked swelling in the face before the ear. The parotid is also sensitive to even slightest touch.\n\nIt is a natural medicine prepared from plant Lycopodium Clavatum having the common name club moss. This medicine belongs to the family Lycopodiaceae. The characteristic symptom for using it is stitching pain in the region of the right parotid gland.\n\nIt is valuable medicine when the right sided parotid is swollen and hard.\n• Conium – For Swelling and Hardness of Parotid Gland\n\nThis medicine works well when the parotid gland is swollen and hard. It is also significant medicine when there is pus in the left sided parotid gland with profuse sweating and disturbed sleep.\n\nCarbo Animalis is a very beneficial medicine when the parotid gland is hard, swollen and painful. The pain is most times shooting or lancinating type.\n\nInflammation of parotitis can arise from various causes. These includes the following:\n\nParotitis can arise from bacterial infection. The common bacteria involved in inflaming these glands are staphylococcus aureus, streptococcus pyogenes and Escherichia Coli (E.coli). Apart from these the infection of parotid glands can also arise from bacteria known as mycobacterium tuberculosis that is responsible to cause TB (tuberculosis).\n\nThe infection can also arise due to a viral infection. The most common virus that causes parotitis is mumps virus. This virus infection is rare nowadays because of the use of vaccination MMR (the vaccine that provides protection against three serious illnesses including measles, mumps and rubella). Before the introduction of this vaccine the mumps infection used to be very common in children.\n• Blockage of parotid duct or any of its branches\n\nThis blockage obstructs the flow of saliva and favours the accumulation and growth of bacteria within the salivary glands. The blockage may arise from many reasons that includes – salivary duct stone, a mucus plug in a salivary duct, stricture which means narrowing of salivary duct from an injury / infection and a tumour which is mostly benign i.e. non – cancerous.\n\nIt is an autoimmune disease where immune cells due to a misdirected response start damaging the glands which are responsible to produce tears and saliva. It results in dry eyes and a dry mouth. Chronic inflammation of the parotid gland can arise in this syndrome. Women suffering from sjogren’s syndrome are at a high risk of parotid gland inflammation as compared to males having the same syndrome, in a ratio of 9:1 respectively.\n\nSome of the factors that put a person at a high risk of parotitis includes poor oral hygiene, having diabetes, taking medicines that cause dryness of the mouth (like some antihistamines and antipsychotics), dehydration (it is mainly a cause of non – infectious cases of parotitis and can occur after surgery or in elderly people), excessive intake of alcohol, radiation therapy of head and neck done for cancer treatment and as a part of bulimia from self induced vomiting.\n\nIn this condition swelling of the face in front of ears below the jaw occurs. There may be redness over the face / upper neck on the affected side. With this facial or mouth pain occurs that is mostly felt while eating or opening mouth. There can also be decreased ability or difficulty to open the mouth. Foul taste in mouth, dryness of mouth and fever, chills attends above features. There can be complaints on either one or both sides and the intensity of symptoms also tend to vary from case to case. If not treated well in time then there are chances of collection of pus (abscess formation) in the parotid gland. In cases of recurrent parotitis intense swelling in the neck can cause destruction of the affected glands.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic Remedies for Parotitis  - DrHomeo Homeopathy", "description": "Homeopathic remedies for parotitis help in reducing the inflammation and swelling of the parotid glands and offer a natural and effective treatment.", "url": "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-parotitis/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "HOMEOPATHIC TREATMENT", "article:published_time": "2020-05-02T18:06:22+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2020/05/parotitis-.gif", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2020/05/parotitis-.gif", "image:width": "393", "image:height": "262", "image:alt": "homeopathic remedies for parotitis"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathic-remedies-for-parotitis%2F&t=Homeopathic%20Remedies%20for%20Parotitis%C2%A0", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathic-remedies-for-parotitis%2F&title=Homeopathic%20Remedies%20for%20Parotitis%C2%A0", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/05/parotitis-.gif"], "authors": [], "publish_date": "2020-05-02T18:06:22+00:00"}