{"result_id": "370028", "URL": "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-transverse-myelitis/", "timestamp": "2023-04-25 18:27:45 CEST+0200", "meta": {"description": "Homeopathy for Transverse Myelitis like Rhus Tox works well for symptomatic treatment when taken along with conventional treatment.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-transverse-myelitis/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathy for Transverse Myelitis - DrHomeo Homeopathy", "cleaned_text": "Transverse myelitis is a neurological condition arising from inflammation of both sides of the same section of the spinal cord. Due to the inflammation there usually occurs damage to the myelin sheath that covers the fibers of the nerve cells. Loss of myelin leads to interruption of the messages sent by nerves of the spinal cord all over the body. Homeopathy for Transverse Myelitis works well for symptomatic treatment when taken along with conventional treatment.\n\n It may result in muscle weakness, pain, sensory issues, paralysis, dysfunction of bowel or bladder. It is a rare disease. Though it can occur at any age but mostly it develops in children of age group 10 yrs to 19 yrs and adults of age group 30 years – 39 years.\n\nWhat exactly leads to this condition is still unknown. However there are various reasons linked with it. Firstly it can develop from autoimmune activity in which the immune cells attack and damage the body’s own healthy tissues. Second reason is certain types of infections that can be viral, bacterial or fungal. Some of the viruses linked with it include EBV (epstein barr virus), herpes viruses, zika, mumps, Cytomegalovirus, measles, rubella, HIV, influenza. Among bacteria the ones associated with it are tuberculosis, syphilis, lyme disease, diphtheria, pertussis, tetanus. Parasites and fungal agents may rarely cause it. Third reason linked to it is multiple sclerosis (a disorder in which myelin sheath surrounding nerves in spinal cord and brain are destroyed from autoimmune activity). Other causes include spinal injuries, vaccination side effects, sarcoidosis (a disease characterised by formation of tiny clumps of inflammatory cells various organs of the body leading to its inflammation). In some cases no cause is ruled out behind it.\n\nIts first symptom is pain in the lower back or neck. It may start all of sudden. The pain can radiate down the legs or arms. It may also radiate to the chest or abdomen. The symptoms of pain vary depending upon which part of your spinal cord is affected. Its next symptom is numbness or tingling, prickling sensation in legs, feet or toes or feeling of coldness or burning. There may be excessive sensitivity to clothing or to intense heat or cold. Third symptom that can arise is weakness or heaviness in the arms or legs. There may be stumbling or dragging one foot while walking. Last symptoms relate to bladder problems (like frequent urination, difficulty in urinating or urinary incontinence) and bowel problems like constipation, loss of bowel control. Its symptoms may develop in between a few hours to many weeks time. It mostly affects both sides of the body below the area of the spinal cord which is affected. In some cases however the symptoms may occur only on one side of the body. Some of its complications include paralysis of arms, legs; Sexual dysfunction in which a male sufferer faces difficulty to have erection or reach an orgasm and female sufferer may have difficulty reaching orgasm. It may also lead to permanent disability and depression or anxiety.\n\nHomeopathy plays a supportive role in such cases along with conventional treatment. The homeopathic medicines though can’t reverse the condition but can help in managing its symptoms in a safe and natural manner. Symptoms that can be managed with them include pain, numbness, prickling sensation, burning, muscle weakness and those related to bladder problems and bowel problems. The homeopathic medicine which will suit a particular case of myelitis depends on the symptom of the person in every case. It is advised to take any homeopathic medicine under supervision of a homeopathic physician and that too along with conventional mode of treatment at the same time for best results.\n• None Rhus Tox – To Manage Pain in Neck or Lower Back\n\nIt is a very effective medicine for managing pain in the neck or lower back. In cases needing it for lower back pain, worsening is there from sitting or rest. Motion, exercise and pressure tend to give relief. With this there is sensation as if the back is broken from intense pain. Lower back is also sore. Next in case of neck pain the pain may radiate to shoulders. This gets worse from motion and from cold air exposure. Warm application on the neck gives relief. Massages over the neck also offer relief.\n\nIt is a natural medicine prepared from a plant called Hypericum perforatum commonly known as ‘St. John’s Wort.’ It belongs to family Hypericaceae. It is well indicated when there is violent sharp pain in the back. Walking and stooping are difficult from this. Next it is indicated for neck pain. The neck is very sensitive to touch where it is required. In cases needing it symptoms including numbness, tingling, burning in the limbs may be present. It is one of the best medicines for managing cases of injury to the spine.\n• None Zincum met – For Numbness in Limbs and Back Pain\n\nIt is a major medicine when there is numbness in limbs and back pain.\n\nThe pain is most felt when walking. There is also a burning sensation in the spine. This is worse when sitting. General weakness is felt with above symptoms.\n\nIt is a leading medicine for managing muscle weakness. Other than this it is also valuable medicine for managing cases of paralysis. It is suitable for managing weakness of limbs and urinary bladder. Persons needing it have weakness and heaviness in the limbs. Arms feel weak and lame to them. Next they may have unsteadiness of forearm and hand muscles. They also have unsteady gait and easy falling. Electric shock like pain in legs may be present. Lastly it is a top listed medicine for cases with loss of bladder control resulting in involuntary passage of urine.\n• None Phosphorus – For Marked Burning and Sensitivity of Spine\n\nPhosphorus is a prominent medicine when there is marked burning and sensitivity of the spine. Along with this the back feels weak. Limbs weakness and numbness is also there. Leg weakness is felt with trembling of legs when beginning to walk. There occurs stumbling while walking. Pain in the back is also there. It is also well indicated for managing constipation when stool is narrow, dry in these cases.\n\nIt offers great help in cases of muscle weakness. Persons needing it complain of weakness in limbs. Pain in legs and back can be there. General weakness may also attend it. Lastly, it is well-indicated for managing the cases of paralysis.\n• None Colocynth – For Pain Radiating from Lower Back Down the Leg to Feet\n\nThis medicine is prepared from pulp of fruit of plant Citrullus colocynthis also known as cucumis colocynthis and bitter apple. This plant belongs to the family cucurbitaceae. It is very useful when the pain from the lower back radiates down the leg to feet. For using it the pain is shooting lightning like in nature. It gets worse from slightest motion. Relief is obtained from heat application.\n• None Picric Acid – For Numbness, Prickling and Muscle Weakness in Legs\n\nIt is a highly valuable medicine for cases having numbness, prickling and muscle weakness in legs. Legs weakness is felt from even little walking where it is required. Heaviness in legs also occurs. In some cases a crawling sensation in the legs is present. Burning along the spine may attend to the above symptoms. Next symptom that may be present is an aching and dragging sensation in the lower back. This tends to worsen from motion.\n\nIt is a very beneficial medicine for managing weakness of limbs. There is also heaviness of limbs in cases requiring it. Next guiding symptom for using it is burning pains in limbs. Numbness in feet and tingling sensation in fingers are yet other symptoms indicating its use.\n\nThis medicine is prepared from the plant Gelsemium Sempervirens commonly known as Yellow Jasmine. This plant belongs to family loganiaceae. For using it the weakness can be felt in arms or legs. With this numbness in arms may also be there. Next there may be problems with walking and unsteady gait. Lastly pain in the legs may be complained about. Its use is also indicated in case of incontinence of urine.\n\nThis medicine is prepared from a plant called One Berry. This plant belongs to the family trilliaceae. It is very helpful for managing neck pain. Persons needing it often complain of pain from the neck radiating down the fingers. They also feel a sensation of heavy load on the neck. A characteristic symptom attending it is numbness in the fingers. Exertion worsens the symptoms and rest gives relief in cases that require it.\n\nMerc Sol is an important medicine to manage increased frequency of urine. The frequency of urine is high both in day and night. Even there is an urge to pass urine every hour. Urine stream is also weak. Some people needing it may have a burning sensation while passing urine. Urgency to pass urine is also there.\n\nNux Vomica is a very beneficial medicine to manage constipation. It is indicated when there is ineffectual urging for stool but stool is insufficient and unsatisfactory. People needing it pass scanty stools often in a day but don’t feel as if the bowels have emptied. They have a sense of incomplete bowel evacuation even after passing stool for multiple times. They may have abdominal pain.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathy for Transverse Myelitis - DrHomeo Homeopathy", "description": "Homeopathy for Transverse Myelitis like Rhus Tox works well for symptomatic treatment when taken along with conventional treatment. ", "url": "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-transverse-myelitis/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "HOMEOPATHIC TREATMENT", "article:published_time": "2020-11-27T10:58:26+00:00", "article:modified_time": "2021-04-23T11:07:40+00:00", "updated_time": "2021-04-23T11:07:40+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2020/11/Woman-with-back-pain-732x549-thumbnail-732x549-1.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2020/11/Woman-with-back-pain-732x549-thumbnail-732x549-1.jpg", "image:width": "732", "image:height": "549", "image:alt": "Transverse Myelitis"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathy-for-transverse-myelitis%2F&t=Transverse%20Myelitis%20%E2%80%93%20Supportive%20Treatment%20with%20Homeopathy", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathy-for-transverse-myelitis%2F&title=Transverse%20Myelitis%20%E2%80%93%20Supportive%20Treatment%20with%20Homeopathy", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/11/Woman-with-back-pain-732x549-thumbnail-732x549-1.jpg"], "authors": [], "publish_date": "2020-11-27T10:58:26+00:00"}