{"result_id": "370043", "URL": "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "timestamp": "2023-04-25 18:28:00 CEST+0200", "meta": {"description": "Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic remedies for vaccine side effects - DrHomeo", "cleaned_text": "Vaccines during childhood give protection to children against many serious diseases. For example DPT vaccine protects against diphtheria, tetanus, whooping cough (pertussis); MMR vaccine protects against measles, mumps, rubella; OPV protects against polio; HiB vaccine protects against Haemophilus influenzae type B infection. Though vaccine use is safe but like many other medicines any of the vaccine can cause some side-effects though mild in most cases. This occurs from a natural response of the body while it is directed towards immunity building against the disease for which vaccination is given. These side effects last from a few hours to one or two days after vaccination. Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination.\n\nSome of the side effects that can occur after inactivated poliovirus vaccine (IPV), DPT, Pneumococcal conjugate vaccine (PCV), Haemophilus influenzae type B vaccine (HiB vaccine). They mostly appear within 24 hrs of vaccination. These include mild fever; pain, soreness, tenderness, swelling or redness at the site of the injection; loss of appetite; diarrhoea; vomiting; tiredness; sluggishness and irritability; fussiness; secondary blister elsewhere on the body.\n\nOther than this side effects can occur 6 to 10 days after injection in case of MMR vaccine. These include mild fever, measles like rash, cough, runny nose, puffy eyes, swelling of salivary glands and loss of appetite.\n\nNext vaccine is rotavirus vaccine that can sometimes lead to diarrhoea, abdominal pain, restlessness and irritability in children.\n\nOther side effects that can occur after vaccination include small, red lump at the injection site. In some vaccines temporary headache, muscle or joint pain, runny nose, nasal congestion, trouble sleeping or drowsiness and being sleepy than usual.\n\nIn case of high temperature rarely febrile seizures or fits can occur in young children. The chance of febrile seizure is high if a child has a history of such seizure earlier in his life or have a family history of seizures.\n\nIn any of the vaccinations there are very rare chances (even less than one in million) of severe allergic reaction known as anaphylaxis. Swelling of face, hives, difficulty in breathing and even collapse can occur in severe allergic reactions. This tends to happen within minutes of taking the vaccination. This needs medical help right away without any delay.\n\nHomeopathy offers a very natural, effective, safe and gentle management of various ailments that arise after vaccination. These medicines are helpful to manage complaints of fever, diarrhoea, stomach pain, skin complaints, sleeplessness, redness, inflammation and swelling of arm, weakness headache, excessive sleep , runny nose, nasal congestion, cough, muscle or joint pain. In case of seizures use of homeopathic medicine should be considered along with conventional treatment. It is to be noted that homeopathic medicines have their own limitations to treat cases of severe reaction – anaphylaxis ( some of its signs and symptoms are swelling of tongue, throat, trouble breathing, rapid heartbeat, sudden drop of blood pressure). In such cases one must take immediate medical help from conventional mode of treatment without delay as it is a life threatening condition.\n\nThis medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly named as Arbor Vitae. This plant belongs to family Coniferae. It is a leading medicine for managing numerous complaints arising after vaccination. Firstly it is indicated for diarrhoea after vaccination. It also helps in stomach pain in such cases. Secondly it is indicated for skin complaints, skin eruptions and skin growths that follow vaccination. Its third indication in these cases is seizures. Next it works effectively to manage sleeplessness that follows vaccination. Lastly it helps cases of weakness of legs that occur after re vaccination.\n\nSilicea is another highly valuable medicine for managing many issues that follows vaccination. Here it is well indicated for managing redness, inflammation and swelling of the arm that can appear after vaccination. Next it helps to manage weakness and lack of stamina in such cases. Another main indication for its use is nausea and loose motion that appear after vaccination sometimes. Headache, excessive sleep from vaccination are also well managed with this medicine. Apart from above indication seizures and weight loss are the rest of complaints where this medicine is indicated.\n• Ledum Pal – For Swelling, Redness and Inflammation of Arm\n\nThis medicine is prepared from plant Ledum Palustre commonly known as wild rosemary and also marsh cistus. This plant belongs to family ericaceae. It is a foremost medicine in homeopathy for puncture wounds as arising from needle prick. Here it is beneficial medicine to manage swelling, redness and inflammation of the arm after vaccination injection. This medicine is also considered as a preventive for side effects of vaccination.\n\nThis medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage fever after vaccination. In cases needing it the heat stage is prominent. There is burning heat over the whole body but especially most prominent in the head and face. Body feels burning hot like fire. With this redness of face is also there. Anxiety and restlessness is present with the internal heat of the body. There is excessive thirst during the heat stage. The heat stage alternates with the chill stage. In this stage there is coldness of limbs with heat in head. Violent chill is felt in the back. Apart from above it can also be used for managing redness, inflammation and swelling of the arm appearing after vaccination injection.\n\nThis medicine is prepared from plant Podophyllum peltatum commonly known as May Apple. This plant belongs to the family berberidaceae. It is a well indicated medicine to manage diarrhoea. In cases requiring it the stool is watery, profuse and gushing. It can be yellowish or greenish in colour and has a very offensive smell. The stool can be frothy and have mucus in it sometimes. There is a sudden urge to pass stool. Fetid flatus is present with this. There is an urge for stool immediately after eating and drinking. Diarrhoea is usually painless where it is required. Intense nausea can be present before passing the stool. After passing stool, extreme weakness is felt by the person.\n\nIt is a prominent medicine for managing skin rash appearing after vaccination. Violent itching is present in the rash where it is required. The itching is worse from warmth of bed and is better in the open air. Stinging and burning is marked in the rash. Skin is also sensitive to the slightest touch along with above symptoms.\n\nIt is a very beneficial medicine for skin eruptions that can occur after vaccination. The eruptions are pustular where it is required. These eruptions are most marked on the scalp, face, and legs. It is also indicated for scabby eruptions on scalp, arms and legs appearing after vaccination.\n\nArsenic Album is a very helpful medicine for managing runny nose and nasal congestion. In cases needing it there is profuse and watery discharge from the nose. It can lead to burning sensation, excoriation in the nostrils. In some cases stoppage of the nose and fluent runny nose alternate with each other that requires this medicine. Great weakness may attend the above symptoms.\n\nThis medicine is prepared from plant Drosera Rotundifolia having a common name round – leaved sundew. This plant belongs to family droseraceae. It is an effective medicine to manage dry irritative cough. Along with cough roughness, dryness and tickling sensation is felt in the fauces. People needing it mainly complain of cough getting worse from lying down in the evening and from warmth.\n\nThis medicine offers great help in cases of loose cough with rattling of mucus in the chest. Cough is present day and night. Chest feels congested from mucus in the chest. Scanty, thick, phlegm is expectorated in these cases. Expectoration is difficult.\n\nRhus Tox is a very effective medicine to manage joint pain and muscle pain. It brings great relief in this complaint. The pain may be worse at rest and better by motion where this medicine is required. In cases needing it, stiffness of joints may also be present. The stiffness tends to get better by warmth and also by massage.\n\nThis medicine is prepared from the fresh root of plant Cicuta Virosa having the common name water hemlock. This plant belongs to the family umbelliferae. This medicine can be used along with conventional treatment for managing seizures after vaccination. In cases needing it the fits occur with frightful distortion of the limbs or whole body. Loss of consciousness and frothing at mouth may occur with this. High fever is present along with above symptoms.\n\nHomeopathic medicine Malandrium is particularly indicated for managing cases where dryness, hardness and roughness of skin occurs after vaccination.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic remedies for vaccine side effects - DrHomeo", "description": "Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination.", "url": "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "HOMEOPATHIC TREATMENT", "article:published_time": "2020-08-12T18:47:21+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "image:width": "780", "image:height": "439", "image:alt": "Homeopathic remedies for vaccine side effects"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fvaccine-side-effects-homeopathy-can-help%2F&t=Vaccine%20Side%20Effects%20%E2%80%93%20Homeopathy%20Can%20Help", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fvaccine-side-effects-homeopathy-can-help%2F&title=Vaccine%20Side%20Effects%20%E2%80%93%20Homeopathy%20Can%20Help", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg"], "authors": [], "publish_date": "2020-08-12T18:47:21+00:00"}