{"result_id": "370016", "URL": "https://www.drhomeo.com/homeopathic-treatment/effective-homeopathic-medicines-for-otosclerosis/", "timestamp": "2023-04-25 18:27:28 CEST+0200", "meta": {"description": "Homeopathic medicines for otosclerosis like Calcarea Fluor are highly effective to manage the associated symptoms and bring about recovery.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/homeopathic-treatment/effective-homeopathic-medicines-for-otosclerosis/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic medicines for otosclerosis - DrHomeo Homeopathy", "cleaned_text": "Otosclerosis is a condition where a bone (called stapes, present in the middle ear) gets stuck in its place. The sound waves enter from the outer ear and from here pass to the ear canal followed by eardrum. This eardrum vibrates from sound waves. This vibration is then carried forward to three little bones present in the ear known as malleus, incus and stapes. The middle ear bones amplify sound vibrations and help to transmit sound from the middle ear to the inner ear. If the stapes bone gets fixed in its place then it hinders normal transmitting of the sound from middle ear to inner ear leading to hearing loss. It is one of the most common causes of hearing loss that arises among young adults. Homeopathic medicines for otosclerosis are highly effective to manage the associated symptoms and bring about recovery.\n\nThe exact reason behind this condition is still not clearly known. But it is thought to arise when extra bony tissue grows around the bone stapes in the middle ear. This abnormal growth of bone decreases the movement of the stapes. It results in a decrease in the amount of sound that is passed to the cochlea in the inner ear. The abnormal bone grows slowly and eventually it gets fixed in its place.\n\nGenetic and environmental factors are thought to play a role in its development. Persons having family history of otosclerosis are at high risk to suffer from the same condition. If we consider age then it mainly tends to affect people between the age of 10 to 40 years. Though both men and women can develop this condition but it has been found that women are at higher risk to get otosclerosis as compared to men. People who have suffered from measles at any time in the past are at risk. Measles can lead to development of this condition is evident from the detection of measles virus in stapes footplates in persons having otosclerosis found in various studies. It has also been found that a reduction in cases of otosclerosis has followed in the population who have been vaccinated against this viral infection supporting role of measles virus in otosclerosis.\n\nPeople who have stress fractures to the bones in the middle ear or have / had some of the autoimmune disorder are at risk to suffer from this condition. It is also known that pregnancy can make this condition worse though it doesn’t cause it. A possibility of low levels of fluoride with the development of otosclerosis is also related. It has been evidenced by the fact of reduction of the number of cases of otosclerosis in the UK after adding fluoride in drinking water on a routine basis. Though this possibility is under controversy.\n\nThe major symptom that a person gets in this condition is hearing loss. Initially there arise difficulty in hearing low – pitched sounds or there is inability to hear a whisper. This tend to gets worse gradually with passing time. Many people having it often narrate that their hearing ability is somewhat better when they are in environment with lot of noise. Mainly conductive type of hearing loss occurs. In this sound waves are able to reach the eardrum but are not carried properly from bones in the middle ear and hence to the inner ear. Sensorineural hearing loss can also occur but it usually appears late with the progression of the disease. The person having it may speak softly because this condition can make him hear his voice sound very loud. Next symptom that appears along with hearing loss is tinnitus (hearing noises in the ear in the absence of any external sound.) It arises from irritation of the nerve endings in the inner ear. It tend to worsen from exhaustion, fatigue, nervousness and in a quiet environment. The intensity of tinnitus doesn’t depend on the intensity or type of hearing loss. Other symptoms that can arise include dizziness / vertigo (a sensation where a person feels as if he is spinning or surrounding objects are moving) and issues with maintaining normal body balance. In this condition one or both of the ears can be affected.\n\nHomeopathic medicines offer much help to manage its symptoms that includes noises in ear (tinnitus), vertigo (spinning sensation and hearing difficulty. Some homeopathic medicines are also known to aid dissolving of the extra bony tissue growths appearing in stapes bone in these cases. These homeopathic medicines are of natural origin, so they manage complaints in a very safe manner with zero side effects.\n\nIn homeopathy Calcarea Fluor is well known for its general action to dissolve extra bony growths forming anywhere in the body which make it indicated to treat cases of otosclerosis. In these cases it is known to dissolve extra bony tissue that forms around the stapes bone and relieve its symptoms. The symptoms effectively managed by this medicine are hearing difficulty and tinnitus. When it comes to tinnitus it especially helps when ringing or roaring noises in the ear are marked.\n• Graphites – When Hearing is Better in Noisy Environment\n\nGraphites is a significant medicine to treat this condition when a person has hearing difficulties but hears better when present in a noisy environment. Along with this they hear humming, ringing or hissing noises in the ear. Sometimes they also hear cracking sounds in the ear usually when eating. They also feel that the ears are stuffed up along with the above symptoms.\n• Chininum Sulph – For Managing Hearing Difficulty and Noises in Ear\n\nChininum Sulph is very beneficial to manage hearing difficulty and noises in the ear. People needing it complain of violent ringing noises in their ears. Sometimes they buzz in their ears also. Along with this they have hardness of hearing. Many times they may have complaints of headaches with above symptoms.\n\nFerrum Picricum is a well indicated medicine which is given when noises in the ear are present. The noises are mainly buzzing or hissing in nature in cases requiring Ferrum Picricum. Along with this hearing is impaired. In such cases vertigo is also there with above complaints.\n\nThis medicine is prepared from oil of the seeds of the plant Chenopodium Anthelminticum. This plant belongs to family chenopodiaceae. It is very beneficial medicine for persons who complain of roaring, buzzing noises in the ear. Along with this they have hearing difficulty. They may also have sudden attacks of vertigo with above complaints.\n\nSalicylic Acid is recommended to manage ringing noises in the ear. With this hearing is diminished. Vertigo with intense nausea accompanies this.\n• Silicea – For Noises in Ear and Hearing Loss\n\nThis medicine is considered where a person hears noises in the ears and has hearing loss. For using it the noises are usually hissing. But they can also be roaring, ringing or like a loud pistol.\n\nPetroleum is also helpful to manage noises in ears in such cases. For using Petroleum the noises are highly variable. The noises may be roaring, ringing, humming, cracking or noise like that of wind or like rushing water when Petroleum is needed. Hearing difficulty is also marked with this.\n\nHomeopathic medicine Gelsemium is prepared from the bark of the root of a plant known as Gelsemium Sempervirens. This plant is commonly known by the name of yellow jasmine. This plant belongs to family loganiaceae. It offers great help to manage complaints of loss of balance in these cases. Here person feels that they would fall from loss of balance while walking. They also have to attend complaints of dizziness. This is mostly felt when they do sudden head movement. Apart from this difficulty in hearing and tinnitus with rushing or roaring noises in the ears arise with above symptoms.\n\nHomeopathic medicine Conium is prepared from a plant known as Conium Maculatum. The family of this plant is umbelliferae. Conium is a useful medicine for managing vertigo episodes. Persons needing it feels as if all the objects around them are spinning. They complain that vertigo most of the time arises when they turn the head. They wish to keep the head perfectly still to prevent this complaint of vertigo. They may also have vertigo on stooping and while walking with a tendency to fall down.\n• Cocculus Indicus – For Vertigo Attended with Nausea and Vomiting\n\nThis medicine is prepared from seeds of the plant Cocculus Indicus having the common name Indian Cockle. This plant belongs to the family menispermaceae. Its use is highly recommended to manage vertigo accompanied with nausea and vomiting. Along with this complaint there are noises in the ear particularly like from rushing water. Hardness of hearing is present along with this.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic medicines for otosclerosis - DrHomeo Homeopathy", "description": "Homeopathic medicines for otosclerosis like Calcarea Fluor are highly effective to manage the associated symptoms and bring about recovery.", "url": "https://www.drhomeo.com/homeopathic-treatment/effective-homeopathic-medicines-for-otosclerosis/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "HOMEOPATHIC TREATMENT", "article:published_time": "2020-06-11T14:07:54+00:00", "article:modified_time": "2020-06-11T14:08:12+00:00", "updated_time": "2020-06-11T14:08:12+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2020/06/ear-.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2020/06/ear-.jpg", "image:width": "1200", "image:height": "628", "image:alt": "Homeopathic Medicines for Otosclerosis"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Feffective-homeopathic-medicines-for-otosclerosis%2F&t=Effective%20Homeopathic%20Medicines%20for%20Otosclerosis", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Feffective-homeopathic-medicines-for-otosclerosis%2F&title=Effective%20Homeopathic%20Medicines%20for%20Otosclerosis", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/06/ear-.jpg"], "authors": [], "publish_date": "2020-06-11T14:07:54+00:00"}