{"result_id": "370030", "URL": "https://www.drhomeo.com/autism/autism-spectrum-disorder-treatment/", "timestamp": "2023-04-25 18:27:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/autism/autism-spectrum-disorder-treatment/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "AUTISM SPECTRUM DISORDER TREATMENT", "cleaned_text": "Until recently Autism was something that only highly specialised neuro-development experts had heard of. Not many knew about this disease. Not even general physicians knew much about it though Kanner (an American psychiatrist) had first observed this disorder in 1943. But what is worrisome is the rate at which it is coming up.\n\nAn exhaustive article published in the Time magazine (November, 2002) mentioned a disturbing rate of 1 in every 150 children of the age of 10 having features of autism in the USA. Just a few years ago the incidence was one in ten thousand. Although no clear statistics are available for India, a sudden increase in its incidence here, too, has been very alarming.\n\nAutism, a neurological disorder, begins in early childhood (typically during the first three years of life) and affects three crucial areas of development: verbal and nonverbal communication, social interaction, and creative or imaginative play. Other characteristics may include repetitive and ritualistic behaviour, hand-flapping, spinning or running in circles, excessive self-stimulation, self-injury, aggression, reduced sensitivity to pain, temper tantrums, and sleeping and eating disturbances. To put it simply, autism is a term used to describe children who are socially withdrawn and preoccupied with routine; who struggle to acquire spoken language yet often possess intellectual gifts that rule out the diagnosis of mental retardation.\n\nWhat is happening to our children? What has gone wrong with them? What is the reason for this sudden increase in autism cases? The reasons are not clear, but the factors under scrutiny range from genetic disturbances, environmental toxins and drugs used in pregnancy to the vaccines administered for the prevention of various diseases. “Vaccine-induced autism” is under enormous scrutiny, though there is no conclusive scientific study to prove or disapprove it. But for those who believe in autism being triggered by vaccines, hypothecate that the immune (defence) response generated by the MMR vaccine (measles, mumps and rubella) damages the nerve sheaths (nerve coverings) leading to a generalised neurological disorder.\n\nIn this imbroglio, the basic questions still remain unanswered. What perturbs more is the epidemic-like spread of autism which makes one ponder the so-called advances of modern civilisation.\n\nHomeopathic treatment is extremely beneficial for those who respond to it. Many of those who do respond, the results may be so favourable that in a matter of a year or two some of the autistic kids may nearly come out of autism.\n\nHomeopathy, however, has its limitations. It may not help all autistic cases. Even for homeopaths it is a big unanswered question, why is it so that nearly 35 per cent of children with full-blown autism benefit so much with homeopathy and why the other 65 per cent do not.\n\nBefore starting homeopathic treatment the evaluation of the child on an autism rating scale is a must. Periodical assessments are also necessary to interpret improvements.\n\nEarly treatment leads to better results. It has been observed that homeopathic intervention shows better results in very young children suffering from autism.\n\nHomeopathic secretin is more helpful for autistic children with a leaky gut (diarrhoea). It helps in neutralising peptides in the blood. It is very effective in controlling hyperactivity.\n\nAlthough homeopathic medicine carcinocin is very effective in the treatment of autism, it certainly is not a panacea. For carcinocin to be used, like any other homeopathic treatment, the child has to fall in with its constitutional picture. As autism is a spectrum disorder and cases can range from mild to severe, a prescription based on a thorough constitutional analysis is always the best option.", "opengraph": {"locale": "en_US", "type": "article", "title": "AUTISM SPECTRUM DISORDER TREATMENT - Homeopathy at DrHomeo.com", "description": "autism spectrum disorder , my child has autism , child has autism symptoms of autism, child has symptoms of asd , details of autistic child ,autistic child symptoms autism in children details read further autism treatment", "url": "https://www.drhomeo.com/autism/autism-spectrum-disorder-treatment/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:tag": "verbal and nonverbal communication", "article:section": "Autism", "article:published_time": "2008-12-28T12:22:39+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fautism%2Fautism-spectrum-disorder-treatment%2F&t=AUTISM%20SPECTRUM%20DISORDER%20TREATMENT", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fautism%2Fautism-spectrum-disorder-treatment%2F&title=AUTISM%20SPECTRUM%20DISORDER%20TREATMENT", "http://www.drhomeo.com/photos/Autismtreatmentwithhomeopathy_1338F/Autism Treatment.gif", "http://www.drhomeo.com/photos/Autismtreatmentwithhomeopathy_1338F/profilepic.jpg"], "authors": [], "publish_date": "2008-12-28T12:22:39+00:00"}