{"result_id": "370023", "URL": "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-post-covid-syndrome/", "timestamp": "2023-04-25 18:27:38 CEST+0200", "meta": {"description": "Homeopathy for post Covid syndrome can be of great help in managing the lingering symptoms of the infection, which can be felt for months post infection.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-post-covid-syndrome/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathy for Post Covid Syndrome - Support & Symptom Management", "cleaned_text": "Covid-19 is an infectious disease caused by the new coronavirus (severe acute respiratory syndrome coronavirus 2, or SARS-CoV-2). This virus strain was identified in December 2019. This disease has been declared as a pandemic in March 2020 by the World Health Organization (WHO). Homeopathy for post Covid syndrome can be of great help in managing the lingering symptoms of the infection.\n\nIt spreads from person to person directly by inhaling the respiratory droplets released from an infected person via coughs, sneezes or talks. It can also spread indirectly if a person touches any surface that has been contaminated by this virus and then touches his or her mouth, nose or eyes without first washing and disinfecting the hands properly.\n\nThe symptoms of Covid -19 vary from mild to severe in intensity. The symptoms tend to appear between 2 – 14 days after the virus exposure. The most common symptoms of Covid – 19 includes fever, cough and fatigue (tiredness). Loss of smell and taste may be the early symptoms in many cases. Its other symptoms include difficulty in breathing, body aches, fatigue, headache, sore throat, runny nose or congested nose, nausea, vomiting and diarrhoea. The elderly people and those already having certain health conditions (like diabetes, serious heart disease, lung disease, cancer, asthma and chronic kidney disease) are at high risk of developing severe symptoms and serious complications.\n\nThere is evidence that few people who suffered from Covid -19 may experience some long-term, debilitating symptoms that occur after having recovered from the acute infection. Though recovered from the initial stage, they struggle to overcome the lingering health issues that follow it.\n\nThese include chronic fatigue (weakness), loose stool (diarrhoea), nausea, loss of appetite, abnormal heart rate, recurring shortness of breath, disturbed sleep, muscle weakness, muscle pain, joint pain, weight loss, loss taste and smell, depression, anxiety, brain fog, difficulty in concentrating, memory issues, dizziness and confusion. They may linger on for weeks to months. These symptom sets are together referred to as post covid syndrome. Some of the symptoms that linger on are quite similar to the ones that occur in chronic fatigue syndrome (CFS), also known as myalgic encephalomyelitis (ME). As per a study it is estimated that around 87 % of patients after initial recovery from COVID still have one persistent symptom. Further among the various symptoms it is seen that about 60% of people after recovering from acute infection of Covid-19 still face complaints of persistent fatigue. Though this syndrome can affect people of any age, but in elderly and those having health issues (like diabetes, hypertension and weak immune system) the effects persist for long.\n\nOther than above symptoms it may also cause inflammation in the brain, heart damage, lung damage and stroke.\n\nIt has been suggested that inflammatory cytokines accumulation in the CNS (central nervous system) might be the reason for symptoms occurring after recovery from viral infection.\n\nHomeopathy can be of great help in managing the lingering symptoms of Post Covid syndrome. Though in homeopathy there are no specific medicine, but the medicines can be selected and used based on the symptom picture in every case which is the basic mode applied for selecting homeopathic medicines for treating /managing any of the medical conditions. One can consider use of these medicines for supportive help along with conventional mode of treatment for symptom management. The homeopathic medicines can be used to manage its symptoms including chronic fatigue (weakness), loose stool (diarrhoea), nausea, disturbed sleep, sleeplessness, muscle pain, joint pain, depression, anxiety, brain fog, difficulty in concentrating and dizziness. Following are some of the medicines that can be helpful for it as per the symptom indication. It is strictly advised to consult a homeopathic physician before considering use of any of the following medicines and self prescription should not be done at all. Only a homeopathic physician can judge and guide about the appropriate medicine, its dosage and repetition that is needed for a given case after complete case analysis.\n\nThis medicine can be used for managing fatigue, weakness. Its use is indicated where a person feels weak, tired from doing even a slight exertion. There is a desire to lie down with this. They feel exhausted that most times worsens at night time. This is also an important medicine to manage anxiety issues. With anxiety restlessness is marked. Apart from above it is a good remedy for managing diarrhoea (loose stool) and vomiting.\n\nThis medicine is prepared from the bark of the root of a plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. This medicine is useful to manage complaints of dizziness and weakness. It is one of the well indicated medicines to manage fatigue after viral infections. Persons who need it have marked drowsiness and dullness along with weakness and dizziness. Muscle ache and muscle weakness are present too. It also helps to manage brain fog and concentration issues, problems with fixing attention present along with dullness of mind.\n• Kali Phos – For Marked Weakness on Mental and Physical Sphere\n\nIt is the next important medicine that can be considered where a person complains of marked weakness on both mental and physical spheres. Other than this it may be used in cases of sleep disturbances (sleeplessness and restlessness during sleep). Next, it is indicated for managing brain fog, depression and anxiety issues.\n\nIt is also a significant medicine which is used in convalescence period when recovering from an illness. It helps to manage fatigue felt since a debilitating acute illness. This medicine also helps in cases of brain fog and concentration problems. Memory weakness and dullness of mind is present with this.\n\nIn homeopathy Rhus Tox is a leading medicine for managing muscle pain and joint pains. This medicine helps in relieving the pain as well as stiffness in the joints and muscles. Most persons who need it feel that their pain worsens from rest and gets better by movement. They may also have redness and swelling in the joints.\n\nIt is a very effective medicine for managing complaints of dizziness. For using this medicine the dizziness may be worse by lying down, turning in bed, or from moving the head or eyes even slightly. Other than this it is also indicated for managing weakness and concentration difficulty. In most cases needing it great weakness is felt in the morning in bed.\n\nIt is a natural medicine prepared from dried bark of plant Cinchona Officinalis also known as Peruvian bark. This plant belongs to family rubiaceae. In homeopathy it is a very beneficial medicine for managing complaints of diarrhoea and the attending weakness. The main indications for using it are brownish loose stool passed with excessive gas. It is usually painless. The stool may have undigested food particles in it. It may have a foul odour. The stool is very weakening. Abdominal bloating may be present along with above symptoms.\n\nThis medicine is prepared from the dried root of plant Cephaelis ipecacuanha that belongs to the family rubiaceae. It is indicated when there is distressing nausea. With this there is excessive accumulation of saliva in the mouth. The nausea may be constant. Weakness can attend the complaint of nausea. Empty burping may occur with this. Abdominal distension may also be present. Sometimes vomiting of white, glairy mucus arises.\n\nIt is a top grade medicine in homeopathy when it comes to manage depression symptoms. This medicine is prepared from plant Ignatia Amara commonly known as St. Ignatius Bean. This plant belongs to family loganiaceae. People who require it remain sad, melancholic and weep frequently with this. They remain irritable and desire loneliness. They also have mental dullness. Sometimes they have mood swings from sadness to happiness and crying to laughing. They feel worse from consolation.\n\nAconite is another well indicated medicine for managing anxiety issues like medicine Arsenic Album. Aconite is prepared from plant Aconitum Napellus commonly known as monkshood. This plant belongs to family ranunculaceae. Aconite is of great help when it comes to managing anxiety issues. Persons needing it feel restless with internal anxiety. They have a desire to move or change their position frequently. They do everything in great haste. They may have panic attacks with anxiety, palpitations and trembling of body.\n\nJust like medicine Kali Phos, Coffea Cruda offers great help in cases of sleeplessness. Persons needing it remain restless in bed and tosses from side to side. They have constant thoughts in mind and many ideas crowding the mind. It is well indicated for managing complaints of sleeplessness after acute diseases.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathy for Post Covid Syndrome - Support & Symptom Management ", "description": "Homeopathy for post Covid syndrome can be of great help in managing the lingering symptoms of the infection, which can be felt for months post infection.", "url": "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-post-covid-syndrome/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "HOMEOPATHIC TREATMENT", "article:published_time": "2020-09-20T10:58:36+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2020/09/mask-1.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2020/09/mask-1.jpg", "image:width": "1200", "image:height": "800", "image:alt": "Homeopathy for Post Covid Syndrome"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathy-for-post-covid-syndrome%2F&t=Post%20Covid%20Syndrome%20%E2%80%93%20Homeopathy%20for%20Support%20%26%20Symptom%20Management%C2%A0", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathy-for-post-covid-syndrome%2F&title=Post%20Covid%20Syndrome%20%E2%80%93%20Homeopathy%20for%20Support%20%26%20Symptom%20Management%C2%A0", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/09/mask-1.jpg", "http://www.drhomeo.com/homeopathic-treatment/homeopathy-for-depression/"], "authors": [], "publish_date": "2020-09-20T10:58:36+00:00"}