{"result_id": "370017", "URL": "https://www.drhomeo.com/latest-posts/homeopathy/comment-page-17/", "timestamp": "2023-04-25 18:27:29 CEST+0200", "meta": {"description": "Homeopathy for chronic diseases works on the principle of 'like cures like' (the same principle on which vaccines are based), encouraging self-healing.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/latest-posts/homeopathy/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "HOMEOPATHY", "cleaned_text": "This incident goes back to 1980 when a boy aged 10 was diagnosed with a damaged heart valve. Medical history revealed that the valve was damaged due to a throat infection, which the child had suffered when he was five. Also known as rheumatic heart disease, it is an infection that travels from the throat down to the heart. Initially this diagnosis was made during a routine examination by a general practitioner and was later confirmed by a premier medical institute in this region. The institute also confirmed that the valve was not in a good condition and the damage was irreversible. Concerned parents, on a lookout for an alternative treatment, put him on homeopathy. After two years of Homoeopathic treatment, tests were done again at the same institute, revealing that the damage had reverted and the valve was in a near-perfect condition. The child survived and grew up with perfect anatomy as a healthy individual. He lives to learn and practice homeopathy and incidentally, is the author of this piece.\n\nLike this one, many cases which signify homeopathy’s great ability to heal chronic disorder go unnoticed or are seen with skepticism for obvious reasons. It is not uncommon to find such cases in a skilled-homeopath’s repository.\n\nThe grace lies in the system itself. To be more specific, it is the principle on which it is based. The system basically works on the principle of like cures like (the same principle on which the modern-day vaccines are based). What makes homeopathy do well in chronic disorder is the fact that it is able to use the body?s own healing system with this principle. Small doses of a similar substance incite a reaction in the body?s healing system, which then heads for a cure. The modern-day scientists are realising this emerging truth that the body has a wonderful innate capacity to heal itself. Otherwise it is very difficult to explain a strange phenomenon where a serious illness like cancer at times gets cured on its own.\n\nAnother reason why homeopathy works wonders in chronic diseases is because it is less dependent on disease labels. Quite a few of the chronic disorders go untreated when the conventional system is not able to reach at a conclusive diagnosis. The scope for homeopathy widens up quite a bit because the prescription banks not only on disease diagnosis. Equal emphasis is placed on the innate constitution and its predisposition, causation and symptomatology effects. Another major factor which is less visible but more advantageous is the fact that homeopathic treatment is not suppressive in nature.\n\nThe homeopathic system of medicine is a constant reminder of our body?s own natural ability to maintain and heal itself.", "opengraph": {"locale": "en_US", "type": "article", "title": "HOMEOPATHY - Homeopathy at DrHomeo.com", "description": "Homeopathy for chronic diseases works on the principle of 'like cures like' (the same principle on which vaccines are based), encouraging self-healing.", "url": "https://www.drhomeo.com/latest-posts/homeopathy/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Latest posts", "article:published_time": "2007-11-08T01:36:02+00:00", "article:modified_time": "2018-08-16T10:06:01+00:00", "updated_time": "2018-08-16T10:06:01+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Flatest-posts%2Fhomeopathy%2F&t=HOMEOPATHY", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Flatest-posts%2Fhomeopathy%2F&title=HOMEOPATHY", "http://www.drhomeo.com/photos/HOMEOPATHY_9C04/image.png", "http://www.drhomeo.com/photos/HOMEOPATHY_9C04/TEXTBggfg.jpg"], "authors": [], "publish_date": "2007-11-08T01:36:02+00:00"}