{"result_id": "370008", "URL": "https://www.drhomeo.com/head-injury/head-injury-its-homeopathic-treatment/", "timestamp": "2023-04-25 18:27:18 CEST+0200", "meta": {"description": "Homoeopathic treatment for head injury treats specific conditions that arise from brain injuries like epilepsy, paralysis, memory and speech loss, etc.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/head-injury/head-injury-its-homeopathic-treatment/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Head Injury :its Homeopathic treatment", "cleaned_text": "In a recently completed study, Dr Edward Chapman of Boston?s Spaulding Rehabilitation Hospital demonstrated that homeopathy significantly lessens the symptoms and improves the functioning of individuals with mild chronic head injury.\n\nFor what is now backed up by research are what homeopathy, for the last two centuries, have been trying to advocate ? that neurological problems arising out of injuries, either recent or remote, can be effectively treated with homeopathy. Not only does homeopathy help in treating the long-term effects of injury, but also it can help in stopping internal hemorrhage (bleeding) if the injury is fresh. It can also reduce swelling in the brain.\n\nTraumatic brain injury (TBI) is a term used to describe a sudden physical assault on the head that causes damage to the brain. It occurs in two types: closed and penetrating. A closed head injury occurs when the head suddenly and violently hits an object, but the object does not break through the skull (e.g. head hitting the dashboard in a car accident). A penetrating type is like a gun shot wound.\n\nAn injury can also occur in response to the shaking of the brain within the confines of the skull, an injury called “countercoup”. Shaken baby syndrome is a kind of a countercoup injury that is caused when the baby is violently shaken and the brain sustains injury due to the sudden violent shaking.\n\nAs brain controls the whole body functions, the possibility of the damage that it can cause engulfs a wide spectrum of disabilities. Loss of consciousness, loss of motor power and/or sensation, loss or decrease in one?s cognitive abilities (the process of knowing in the broadest sense, including perception, memory and judgment) and loss or decrease in one?s speech, swallowing, etc, are usually the most common ones.\n\nThe impact of the injury causes the brain to move back and forth against the inside of the bony skull. The frontal (front) and temporal (side) lobes of the brain, the major speech and language areas often receive the most damage in this way because they sit in pockets of the skull that allow more room for the brain to shift and sustain injury. Because these major speech and language areas often receive damage, communication difficulties frequently occur following closed head injuries.\n\nIt is often very difficult to predict the damage or the nature of the damage in the first week, as the freshly injured brain undergoes swelling and bruising, and it is only after the swelling has subsided that the real residual abnormalities are detected.\n\nThe wonder of arnica lies in treating brain injuries, recent or remote, in the most natural and effective way. It is more of a head injury panacea. It helps in first controlling the bleeding in the brain and also in reducing the swelling in the brain. It has been found useful when years after the brain injury, symptoms related to it start appearing.\n\nThe degree to which a homeopath can help is governed by two factors: by the extent of the damage , and the function of the brain that has been compromised.\n\nAlthough quite a few of the effects can be handled by Arnica alone, the residual abnormalities do have a wide range. Homoeopathy has in its repository other effective medicines that are specific to certain conditions that arise from brain injuries. For example, there are separate groups of medicines for epilepsy, paralysis, memory and speech loss, etc, occurring after brain injury.\n\nThis feature ( authored by Dr. Vikas Sharma ) was earlier published in The Tribune(North India’s largest circulated daily newspaper). Dr. Vikas Sharma is regular Homeopathic columnist for The Tribune.You can mail him at vikas@drhomeo.com", "opengraph": {"locale": "en_US", "type": "article", "title": "Head Injury :its Homeopathic treatment - Homeopathy at DrHomeo.com", "description": "Homoeopathic treatment for head injury treats specific conditions that arise from brain injuries like epilepsy, paralysis, memory and speech loss, etc.", "url": "https://www.drhomeo.com/head-injury/head-injury-its-homeopathic-treatment/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Head injury", "article:published_time": "2007-07-09T10:46:16+00:00", "article:modified_time": "2018-08-16T07:35:52+00:00", "updated_time": "2018-08-16T07:35:52+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhead-injury%2Fhead-injury-its-homeopathic-treatment%2F&t=Head%20Injury%20%3Aits%20Homeopathic%20treatment", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhead-injury%2Fhead-injury-its-homeopathic-treatment%2F&title=Head%20Injury%20%3Aits%20Homeopathic%20treatment", "http://www.drhomeo.com/photos/HeadInjuryitsHomeopathictreatment_11CF9/image.png", "mailto:vikas@drhomeo.com"], "authors": [], "publish_date": "2007-07-09T10:46:16+00:00"}