{"result_id": "370011", "URL": "https://www.drhomeo.com/medicine/silicea-homeopathic-medicine-uses-indications-dosage/", "timestamp": "2023-04-25 18:27:25 CEST+0200", "meta": {"description": "Apart from skin diseases, Homeopathic medicine Silicea serves great help in treating conditions like fistula and cystic growths.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/medicine/silicea-homeopathic-medicine-uses-indications-dosage/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic Medicine Silicea - Uses, Dosage and Indications", "cleaned_text": "The remedy Silicea is derived from Silica or Silicic oxide from the Mineral Kingdom. The mineral silica in its crude state is inert and insoluble. When potentized according to the formula of Homeopathy, that is a process where the latent medicinal powers of a drug are aroused, it becomes one of the most valuable drugs of Homeopathic materia medica. It is also known very commonly as Quartz.\n\n Silica is present naturally in our body as well; in the bones, nerve sheaths, skin, nails, etc. It has the capability to replace a surgeon’s knife by its remarkable action.\n\nThis remedy suits people who are nervous and irritable, usually break into sweats, with dry skin and a lean, thin body. The musculature is weak and lax. Such patients usually cannot bear cold at all. If the individual receives a slight injury it suppurates and the formation is hard and nodular.\n\nIt is one of the polychrest remedies, that is it has an effect on all the spheres of the body. It acts on the bones, mucous membranes, cartilages, skin, cellular tissues, nerves, glands, lachrymal duct, Eustachian tube, etc.\n\n It is known to be a very helpful remedy in treating bad effects of vaccination and complaints arising from the suppression of foot sweat.\n\nAbscesses, boils, bone affections, carbuncle, constipation, cough, dentition problems, diabetes, enuresis, epilepsy, fistula, headache, hernia, rheumatism, rickets, skin troubles, sexual disturbances, bad effects of vaccination, Bartholin’s cyst, pilonidal sinus, haemorrhoids, anal fissures, anal abscess and fistulas, Meniere’s Disease, sinusitis and anxiety.\n\nThis remedy settles many disorders of the mind, the marked symptoms being lack of confidence, stamina, and concentration. This remedy is well-suited professional and well-doing people. They claim to have everything in order and they seem to know what they are doing. But after a while, they start feeling a lack of confidence and firmness, they now have difficulty in processing thoughts and speech before giving a presentation. As a result of which, they start to dread to appear in public. They dread failure and the consequences of it; they feel their mind will not work when they want it to. This is nothing but an outcome of the prolonged mental exhaustion they have always been prone to. So a lawyer might end up saying, ‘I have never been well since so and so case.’ He overworks on it and many sleepless nights follow. And he ends up so mentally exhausted, yet everything is in vain. The most important thing to note here is, that when such patients go hard on themselves and force themselves to perform, they do so with flying colors. So, even though there is a fear of failure, yet when they perform, they do it well.\n\n Another case is illustrated in a young man who has studied for years and is now nearing the end of this course. He dreads the final examinations but he goes through them all right, then fatigue comes upon him and for years he’s unable to enter his profession. He has this dread of undertaking anything. This remedy restores such affections of the brain.\n\n Patients who need this remedy also dread loneliness. They always want someone to be around them. When they are amongst people, even though they are not talking or interacting with them, they are happy.\n\nWhen it comes to the nasal passages, this medicine can be given for conditions like sinusitis, allergic rhinitis, ulcerations of the nasal cavities, epistaxis, etc. It can resolve the blockage of nasal passages due to any condition. The nose feels painfully dry and obstructed in the morning. As the day progresses, coryza (nasal discharges) can develop. The patient starts to lose his sense of taste and smell. It can be given for recurrent epistaxis as well. There is violent sneezing with tickling in the throat and nasal discharges.\n\nIt is one of the best remedies given for tonsillitis (inflammation of the tonsils). It can be given for both follicular tonsillitis and quinsy (abscess in the region of tonsils). There is a sensation of a lump in the throat and there is a great difficulty in swallowing. There is a pain in the throat, which is sharp as from needles and pins, more on the left side, generating cough in some cases. The attacks of tonsillitis and quinsy are periodical, they get better for a while but come back again. It can very effectively deal with the acute and chronic stages of these conditions. The medicine is also helpful in chronic pharyngitis. Tickling in the throat causes bouts of cough. There is hoarseness of voice. The thyroid gland is enlarged and, there is swelling in front of the throat. The right side of the gland is swollen, which commences from the left, the patient cannot move his neck and holds it stiffly.\n\nThis medicine has its action on almost all the parts. It can be given for multiple ear conditions. It very effectively manages Otorrhea (ear discharge), Meniere’s Disease, perforated eardrums, tinnitus, Eustachian tube blockage, and hearing loss. There is over sensitiveness towards all noises The ears seem blocked, which open with a pop. In cases of otorrhea, the discharge could be curdy and pasty or thin and watery, with caries of the bone. There is a high degree of tinnitus(noises in the ear), all kinds of noises; hissing, roaring, like many cars passing by. It can be really helpful in cases of Eustachian tube blockage where the ears are blocked, a certain amount of hearing loss is present, but it returns with a snap. It takes care of the ruptured tympanic membrane (eardrum) with a discharge from the ear.\n\nWith its effect on the eyes, it has treated a great number of complaints. It can be helpful in defects of vision; where the eyes are weak, the patient can neither write nor read, the sight is indistinct.\n\n It proves to be infallible in cases of Blepharitis ( inflammatory condition of the eyes), like styes (red tender bump at the edge of the eyelids), Uveitis (inflammation of the Uvea), swelling in the eyes due to traumatic causes, abscess & boils around the eyes and lips, keratitis (inflammation of the cornea). There is intense photophobia accompanying the eye complaints. The eyes are red, they burn and there is intense tingling. Not only this, it can be given for chronic conditions like Cataract, especially of the right eye, where there is greyish cloudiness in the eye. In conditions like ulcerations of the cornea, with a discharge of thick and yellow pus, attended with pain, this medicine can do wonders.\n\nThis medicine can be given for cases of bouts of breathlessness, where the patient loses his breath on slight exertion, be it running, stooping, followed by a cough. There is deep sighing breathing.\n\n In conditions like Asthma, where the cough is in spasms and comes on as soon as the patient lies down.\n\n The cough can have many presentations. It can be dry or loose. In cases of dry cough, excited by tickling in the throat, with hoarseness of voice. When the cough is loose, there is profuse expectoration of phlegm, the patient awakens at night, worsens from slightest motion, and especially after lying at night.\n\n In children, who have a suffocative cough, obstructed and difficult respiration and the expectoration of the phlegm just doesn’t seem to end.\n\n With its action on the heart, it checks the palpitations, with an irregular and hard pulse.\n\nThis medicine can be given to kids that have a difficult dentition or if the teething is delayed. It acts on the gums and strengthens them, thereby checking the loose teeth. It can be given for caries of teeth where the pain worsens on even inhaling air and at night. There is a very severe toothache, with stinging pain and the patient tosses and turns during his sleep. If after extraction of teeth, there is a swelling in the gums and roof of the mouth, Silicea is the remedy. It has proven to be beneficial in cases of gum boils as well, where the gums are very sore and painful. Also, in such patients, there is a bad odour from the mouth.\n\nIt has since long proven be to very beneficial in cases of Caries of bones, bony fistulas, rickets and AVN (Avascular Necrosis of bone). Caries of the bone of any part of the body, but especially the small bones of the ears, nose and mastoid process and the shaft of the long bones, the head of the bones and the cartilaginous portions. The necrosis of the jaw, wrist bones, hand bones, feet bones, ankle, knees and in addition long bones —including humerus (bone in the upper arm), femur (bone in the thigh) and tibia (bone in front of the leg) — are all the site of action for using this medicine. In kids, who have open fontanelles and sutures, it has played an amazing role in the fusion of the bone. It can be given in cases of Rickets, where there is a deformity in the structure of the bone due to deficiency of essential Vitamins. It can be given for defects in the spinal curvature as well, such as Kyphosis, lordosis, and scoliosis.\n\nThe action of this remedy on skin cures many conditions where the skin is unhealthy and very problematic. It is one of the best anti-suppurative remedies available in homeopathy. It very effectively aborts pus formation, thereby dealing with many skin conditions like acne, boils, abscesses, eczema, impetigo, carbuncles, felons, ingrown nails, ulcers, Bartholin’s cyst, herpes, and cellulitis. The eruptions on the skin are itchy and burn. It can take care of eczematous, impetiginous and herpetic eruptions. There is eczema of the scalp, hands, and forearms. Every little injury on the skin has a tendency to suppurate. In many cases, where there is a foreign body lodged in the skin, like splinters, fish bones and needles, this medicine helps in the dislodgement of such substances and helps in healing the skin after. There is a tendency to form boils, and the boils come in crops, which do not heal readily. It can be of great help in cases of felons (inflammation of the tip of the finger), where the pain is deep-seated, with intense burning and stinging in the fingertips which are felt up to the shoulder. Not to forget, the action of this medicine is remarkable in cases where there are recurrent ingrown nails. The patient has a tendency for ingrown nails, and it can literally replace a surgeon’s knife in such cases.\n\nIt can prove to be a brilliant remedy in cases of constipation, diarrhea, hemorrhoids, pilonidal sinuses, anal abscesses, fissures, and fistulas. While its action on the patients with chronic constipation, this homeopathic remedy can help in managing symptoms like a very hard stool, which is highly unsatisfactory, has to be expelled with great effort; sometimes a part of the stool protrudes out but again recedes back and this happens again and again. There is pain and burning in anus after struggling to expel out the stool. At times, the stool is so hard and it remains for a really long time in the rectum due to deficient power to expel it.\n\n The hemorrhoids are intensely painful, there is a discharge of bloody mucus from the rectum. In cases of fissure and fistula in the anus, accompanied by a history of constipation, there is pain that lasts even after passing the stool and lasts several hours. It can be given to people who tend to have summer diarrhea, that is diarrhea comes on during the weather change; wherein the stool is watery and highly offensive.\n\nThis remedy has shown great clinical improvements in cases of disorders of the male sexual system. It can also be given for clinical conditions like prostatitis, prostatomegaly, nightfalls, hydrocele, Syphilitic eruptions on the penis. The erections are painful, especially before rising in the morning. The erections are very frequent and come on anytime even without any stimulus. The sexual desire has compromised and is not as strong as before. The prostate gland is enlarged but without any pain. In cases of Prostatitis, there is a pus discharge from the urethra. It can be very effective in cases of hydrocele of men and children. The eruptions on the genitals can be very itchy, red and painful, with sweating on the scrotum. Men suffering from nightfalls, usually have a history of excessive masturbation.\n\nIn females, this remedy can be helpful in conditions like prolapse of the uterus, cysts in the vagina, metrorrhagia, leucorrhoea, amenorrhoea, pruritus vulva. Menses; if too early are scanty and profuse when late. Menstrual cycles are irregular, come every two-three months. Before menses, usually, there is a headache or leucorrhoea which burns; pains as if the parts were sore. During menses, there is a pain in the abdomen, toothache during menses with anxiety and weariness of life. Usually, women have constipation before and after menses, which can be managed with this medicine.\n\n It can also be given in affections of the breast, where there is inflammation, induration, and suppuration of the breasts. Inflammation of the nipples, they crack and ulcerate.\n\nPatients who might need this medicine have a very restless and disturbed sleep. They feel highly drowsy after eating or in the evenings. But when they try to doze off, they are highly restless, frequently keeps on waking up due to the overcrowded thoughts and cannot sleep again. There could be Somnambulism (night walking); the patient gets up while asleep, walks about and lies down after. The dreams are pleasant, could be lascivious; anxious while dreaming; dreams of murders, horrid things, of past events, of someone choking him/her. The patient breaks into a sweat and wakes up in the morning with a headache due to the dreams he had at night. He feels so tired and unrefreshed that he wishes to remain in bed.\n\nThere are cases where the complaints surprisingly appear after the suppression of sweat. For instance, after playing or exercising, we usually rush to take a bath even when the body is still sweating. This medicine is helpful in such cases, where the complaints have begun after such an incidence and lasted ever since. It can be of help in complaints arising from suppression of other discharges as well. There is usually a cold and clammy sweat on the forehead. One striking feature about a patient’s perspiration is that the sweating is more on the head and upper limb and the patient is generally dry on the lower body parts.\n\nThe dosage depends on many factors, especially on the stage of a given condition.\n\n It can be given in different potencies where it can be frequently repeated as well. Generally, in lower potencies, it helps in building pus in raw eruptions and when given in high potencies, it helps to abort the process of inflammation.\n\n Hence, in high potencies, it should not be frequently repeated.\n\n Its action lasts for about 4- to 60 days.\n\nAntidoted by: Camphor, Hepar Sulph, Acid Fluor.\n\n It antidotes: Mer Cor, Sulphur\n\n Follows well: Belladonna, Bryonia, Cina, Graphites, Ignatia, Nitric acid.\n\n Followed well by Lachesis, Lycopodium, Sepia", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic Medicine Silicea - Uses, Dosage and Indications", "description": "Apart from skin diseases, Homeopathic medicine Silicea serves great help in treating conditions like fistula and cystic growths.", "url": "https://www.drhomeo.com/medicine/silicea-homeopathic-medicine-uses-indications-dosage/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Medicine", "article:published_time": "2018-04-08T11:17:56+00:00", "article:modified_time": "2019-05-09T12:15:58+00:00", "updated_time": "2019-05-09T12:15:58+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fmedicine%2Fsilicea-homeopathic-medicine-uses-indications-dosage%2F&t=Silicea%20%E2%80%93%20Homeopathic%20Medicine%20its%20Uses%2C%20Indications%20and%20Dosage", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fmedicine%2Fsilicea-homeopathic-medicine-uses-indications-dosage%2F&title=Silicea%20%E2%80%93%20Homeopathic%20Medicine%20its%20Uses%2C%20Indications%20and%20Dosage"], "authors": [], "publish_date": "2018-04-08T11:17:56+00:00"}