{"result_id": "370015", "URL": "https://www.drhomeo.com/medicine/thuja-homeopathic-medicine-its-uses-indications-and-dosage/", "timestamp": "2023-04-25 18:27:28 CEST+0200", "meta": {"description": "Thuja majorly acts on the mucus membrane of the genitourinary tract, gastrointestinal tract, on the skin, glands, blood, mind, and brain.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/medicine/thuja-homeopathic-medicine-its-uses-indications-and-dosage/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Thuja - Homeopathic Medicine: Its Uses, Indications, and Dosage", "cleaned_text": "Thuja is a plant remedy prepared from fresh green twigs of a plant Thuja Occidentalis commonly known by the name of Arbor Vitae. The natural order of this plant is Coniferae. Arbor Vitae is an evergreen plant that attains a height of ranging from 20 to 50 feet. This plant exists in large number in the upper zones of North America, from Pennsylvania northwards. It blossoms from May until June and matures its fruit in autumn.\n\nAs a homeopathic remedy, it is primarily used for ailments related to the skin, reproductive organs, and anorectal disorders.\n\nIndividuals requiring Thuja have a hydrogenoid (excessive water in the body) constitution. Rain and damp, cold weather that increases the number of molecules of water in the system worsens the symptoms in them. It suits strumous and sycotic persons, those with lax muscles and light hair. It is also suitable for persons with lymphatic temperament who are fleshy with a dark complexion, black hair, and unhealthy-looking skin.\n\nThis remedy majorly acts on the mucus membrane of the genitourinary tract, gastrointestinal tract, on the skin, glands, blood, mind, and brain. Its use is also indicated for wart-like growths upon mucous membranes and the skin. This remedy has an antibacterial action and is widely used to treat gonorrhea. It is considered to be a medicine that works particularly well on left-sided ailments of the body.\n\nThuja is used to treat conditions like warts, moles, skin pigmentation (chloasma), freckles, fungal infections like ringworms, ill-effects of vaccination, hair and scalp infections, nail problems, gonorrhea, balanitis, prostate issues, urethral stricture, piles, anal fissures, anal fistula, constipation, tooth complaints, ovarian cysts, ovaritis, uterine fibroids, hirsutism, recto-vaginal fistula, lumps and tumors, fatty tumors, ganglion, eye tumors, styes, polyps, depression, delusions, and fears.\n\nThe Scope of Thuja as a Homeopathic Remedy\n\nThuja is of great service in treating many complaints of the skin.\n\nWARTS: It is highly effective to treat warts appearing anywhere on the skin, on male / female genitals, and on the anal area. Warts may be small or large, jagged, cauliflower-like, flat or horny. They may ooze moisture and also bleed. The color of warts may be brown, dark or red, and they may be hard or soft. They may have burning, itching, and pain too including sore, sticking, stinging type of pain. They may appear singly, isolated or in multiple crops/groups. They may also be inflamed and sensitive to touch.\n\n\n\nFRECKLES: It is also a highly beneficial remedy to treat moles and freckles, particularly light-brown freckles. The facial skin seems greasy/oily in cases requiring this remedy.\n\nPIGMENTATION: It is an effective remedy to treat skin pigmentation with dirty brownish discoloration on the face or any part of the body. It also treats fungal infections of the skin and ringworms very effectively.\n\nGONORRHEA: It works well in cases of gonorrhea in males where there is swelling of the urethra with scalding on urination. Along with this watery discharge of yellow/green color from the urethra is present.\n\nWARTS ON GENITALS: This remedy can also be used to treat warts on prepuce, penis, scrotum. They may be small or pedunculated, and dry.\n\nBALANITIS: The third indication for using Thuja in cases of male afflictions is balanitis. Here the glans is covered with red sores which are highly sensitive. Burning between the prepuce and glans penis may also be present. \n\n\n\nPROSTATE ISSUES: It is also prominently indicated to treat prostate issues where there is a complaint of frequent urination. Sudden urgency to urinate is marked, and the stream of urine may be small and forked in some cases.\n\nThuja is a highly recommended medicine to treat a number of ailments in females. Uterine fibroids, warts, ovarian cysts and painful periods are some of the ailments where this remedy works very well.\n\nOVARIAN PAIN: Left-sided ovarian pains that are cutting or shooting in nature, pain in the left ovary indicate its use. Pain from the left ovary may also radiate to the groin and left leg. Left ovary is inflamed. Burning pain in the left ovary, especially during periods, is marked. The burning pain tends to get worse while walking with a desire to lie down. \n\nIt is also an important remedy to treat warts on the female genitalia – vulva, vagina, and cervix. Stinging pain may be present in warts, and they may also bleed. \n\n\n\nUTERINE POLYPS: In cases of uterine polyps, this medicine is indicated where excessive menstrual bleeding and intermenstrual bleeding is present. Vaginal discharge, back pain and tiredness of legs accompany. \n\nIn addition to the above, it also treats the complaint of unwanted facial hair (hirsutism) in females. \n\nIt is also a prominently used medicine to treat cases of rectovaginal fistula in females.\n\nThuja is a significant medicine to treat many anorectal complaints, like constipation, piles, fissures, and fistulas.\n\nCONSTIPATION: It is useful to treat constipation where there is obstinate constipation and the stool comes in the form of hard balls. The anus feels constricted, hard stool is followed by soft stool, and in some cases, the stool is covered with blood. Pain in the rectum may appear while passing stool. There is soreness and burning at the anus throughout the day. Burning or sticking in the anus, painful stitches in the anus (as from a needle), smarting pain in the anus are some other attending features.\n\nPILES: It used to treat piles in cases where pain while passing stool is present. Burning at anus especially while walking is marked.\n\nFISSURES: It is used to treat fissures of the anus. In such cases, the anus is highly sensitive and painful to touch. Burning and itching at the anus are also present. \n\nApart from the above, Thuja is widely used to treat anal fistula and warts around the anus. Highly offensive sweat around the anus may be present with the above complaints.\n\nThuja is helpful to rectify many urinary complaints associated with inflammation/infection of the urinary tract, stricture of urethra and prostate issue. The urinary symptoms managed with this medicine are cutting pains after urination, burning pain in the bladder and urethra. Its use is also considered when the stream of urine is forked and small, where there is frequent urination (especially at night), and where there is a sudden urgency to pass urine.\n\nThis remedy is useful to treat depression, fears, and delusions. There is depression with sadness, aversion to company, attended with irritability, loathing of life and self-contempt. Many of the fears may be present when this remedy is indicated, including fear of getting an infection, fear of germs, fear of strangers, fear of death, fear of getting a venereal disease.\n\nMany troubles arising from vaccination including skin rash, stomach ailments, neuralgia, conjunctivitis, growths at the site of vaccination can be treated with this medicine.\n\nThuja is an effective anti-sycotic medicine. Fatty tumors, ganglion, eye tumors (styes, tarsal tumors), breast tumors, uterine tumors, polyps (of ears, vocal cords, uterus) all are within the range of treatment.\n\nIt is a very helpful remedy to manage hair fall. It also helps to treat dry and split hair, thin, lustreless, brittle hair, premature greying of hair and white scaly dandruff.\n\nThuja is useful to treat fungal infections of nails, particularly in cases where the nails are discolored and soft, out of shape and distorted. The nails may get dry or brittle, and crumble or break. It is also used to treat ingrown toenails.\n\nUse of Thuja is also suggested to treat tooth complaints like decay/caries especially when the root decays but the crown remains sound. It also helps in cases of crumbling and yellowing of teeth. Toothache better by pressure and a toothache that worsens before and after menses also indicate the need for this medicine.\n\nAs a remedy, Thuja can be used from 30 C to 1M potency. The repetition and potency vary from case to case.\n\nComplementary medicines – Arsenic album, Natrum Sulph, Sabina, Silicea, and Medorrhinum.\n\nMedicines that follow Thuja well are – Nitric Acid, Calcarea Carb, Lycopodium, Pulsatilla, Sabina, Silicea, and Sulphur.\n\nAntidotes – Camphor, Chamomilla, Pulsatilla, and Sulphur", "opengraph": {"locale": "en_US", "type": "article", "title": "Thuja - Homeopathic Medicine: Its Uses, Indications, and Dosage", "description": "Thuja majorly acts on the mucus membrane of the genitourinary tract, gastrointestinal tract, on the skin, glands, blood, mind, and brain.", "url": "https://www.drhomeo.com/medicine/thuja-homeopathic-medicine-its-uses-indications-and-dosage/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Medicine", "article:published_time": "2019-04-15T12:24:53+00:00", "article:modified_time": "2019-05-02T12:38:26+00:00", "updated_time": "2019-05-02T12:38:26+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2019/04/Thuja-tincture-1024x938.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2019/04/Thuja-tincture-1024x938.jpg", "image:width": "1024", "image:height": "938", "image:alt": "thuja"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fmedicine%2Fthuja-homeopathic-medicine-its-uses-indications-and-dosage%2F&t=Thuja%20%E2%80%93%20Homeopathic%20Medicine%3A%20Its%20Uses%2C%20Indications%2C%20and%20Dosage", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fmedicine%2Fthuja-homeopathic-medicine-its-uses-indications-and-dosage%2F&title=Thuja%20%E2%80%93%20Homeopathic%20Medicine%3A%20Its%20Uses%2C%20Indications%2C%20and%20Dosage", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2019/04/Thuja-tincture.jpg"], "authors": [], "publish_date": "2019-04-15T12:24:53+00:00"}