{"result_id": "370012", "URL": "https://www.drhomeo.com/hair-fall/homeopathic-treatment-for-alopecia-areata/", "timestamp": "2023-04-25 18:27:26 CEST+0200", "meta": {"description": "Homeopathic medicines for alopecia areata and bald patches can cure it without steroids. homeopathic medicines for hair loss in patches is very effective", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/hair-fall/homeopathic-treatment-for-alopecia-areata/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic treatment for Alopecia Areata and Bald patches", "cleaned_text": "Having bald patches on one’s head, beard and eyebrows can be very distressing. Although it does not affect the patient’s health in any other form, it is certainly life-altering as its sudden onset, recurrent episodes, and unpredictable course have an adverse impact on the psyche of those suffering from it. Alopecia areata refers to the loss of hair in patches, usually on the scalp, but any other body part covered with hair can also be affected. When alopecia areata appears in the beard, it is known as alopecia areata barbae. Alopecia affects all ages, races, and sexes equally. Homeopathic remedies for alopecia areata provide an excellent treatment for it. They are fairly successful as it helps the hair grow back.\n\nThe five top-ranking homeopathic medicines that treat Alopecia Areata effectively are Fluoric Acid, Phosphorus, Lycopodium, Calcarea carb and Vinca Minor.\n\nFluoric Acid is one of the best homeopathic remedies for alopecia areata. It works equally well for hair fall in patches occurring in any part of the scalp. It helps wonderfully in the regrowth of hair in bald patches. Those needing it may have an itchy scalp too. The scalp can be sensitive to touch.\n\nWhen and How to use fluoric Acid?\n\nThis medicine can be used as the first line of treatment in cases of alopecia areata. With its use, there is gradual regrowth of hair. Initially, Fluoric Acid 30C can be used two to three times a day. Once the hair starts to regrow, the dose should be reduced.\n\n2. Phosphorus – For Alopecia Areata With Hair Loss From Front Or Sides Of Scalp\n\nThough Phosphorus can be used for hair loss in any portion of the scalp, it is most suitable when hair loss from the front or the sides is prominent. Those needing it can have a tendency of excessive sweating on the scalp. Heat may also be felt in the scalp, dandruff may also be present.\n\nWhen and How to use Phosphorus?\n\nUse of Phosphorus is mainly suggested when hair loss occurs especially from the front or side portion of the scalp. Though it can be taken in any potency from low to high but the most frequently recommended is 30C potency. Phosphorus 30C can be taken twice a day for good results.\n\n3. Lycopodium – For Alopecia Areata When Hair Loss Is Marked On Top Of Scalp (Vertex)\n\nLycopodium is a natural remedy sourced from plant club moss. It works well in recovering from bald patches that occur mainly on the top of the scalp. The person suffers burning sensation and itching on the scalp. Apart from this, Lycopodium is a leading medicine to treat premature greying of hair.\n\nWhen and How to use Lycopodium?\n\nWhen hair loss is marked on the top of the scalp, this medicine can be considered. Among its various potencies ranging from low to high, it is best to start with 30C potency twice a day. Its higher potencies can be considered afterward but only after consulting a homeopathic physician.\n\nThis medicine can be used in cases where patchy hair loss is accompanied by increased sweating on the scalp. A cold sensation on the scalp can also be felt. Scalp can be itchy as well.\n\nWhen and How to use Calcarea Carb?\n\nIt is recommended for persons who have hair loss in spots along with a tendency of increased sweating. It is used in different potencies ranging from low to high depending on the complaint but the most common in use is 30C potency. Lycopodium 30C can be taken once in the morning and once in the evening for best results.\n\n5. Vinca Minor – For Tendency To Alopecia Areata When Regrown Hair Are White\n\nThis medicine is prepared from the plant ‘lesser periwinkle’. It is useful in treating alopecia areata cases where there is a tendency for hair to fall in spots which then get replaced by white hair. Along with this, itching and violent scratching over the scalp may also be present.\n\nWhen and How to use Vinca Minor?\n\nThis medicine is specifically used in cases in which there is a tendency for hair loss in spots and when the hair which regrow are white-colored. This medicine can be taken in 30C potency twice a day. It works two ways — in treating tendency to have hair loss in spots, and preventing whitening of hair that grow back.\n\nWhat Are The Signs And Symptoms?\n\nAlopecia areata shows up as bald (hair loss) patches. The loss of hair occurs in circular or oval patches from the scalp or elsewhere such as eyebrows, beard, etc. The bald patches are usually of the size of a five-rupee coin or one-rupee coin and are smooth to touch. Complete loss of hair may also occur in some individuals although it is not very common.\n\nThe most common areas for alopecia areata are the scalp and the beard, but may involve any body part with hair. There may be one, or multiple bald patches. Few people complain of itching when hair starts falling. There is no physical discomfort associated with it.\n\nOther than typical circular or oval shape patches of alopecia areata, there are some rare types of alopecia areata:\n\nOphiasis alopecia areata – Band-like hair loss on the temporal area (sides) and occiput area (back of head)\n\nAlopecia areata is an autoimmune disease (the body’s defense cells start destroying body’s own healthy tissues out of a misdirected response). In alopecia areata, the defense cells start destroying hair follicles resulting in bald patches. The immune cells attack the hair follicle matrix of some of the hair that are in growth phase. Following this, these strands of hair prematurely (before their complete formation and maturation) pass into a phase where hair stops growing. The hair follicle stem cells are not damaged so the ability of the hair follicles to regenerate is not affected at all. Why? Immune cells target hair follicles here is still unknown. However, it is thought that heredity and genetics play a significant role in alopecia areata. Patients suffering from alopecia areata very often mention a family member suffering from the same condition. It is estimated that one in five persons suffering from alopecia areata has someone in the family who has the same problem. As per research, persons having alopecia areata might also have a history of some other autoimmune disease (for example, vitiligo – white patches on skin due to lack of melanin pigment; thyroiditis – inflammation of thyroid gland) or some other family member might be suffering from some autoimmune disease. Some factors viral infections, vaccines and physical stress can trigger alopecia areata.\n\nHomeopathy is an advanced science and treats many diseases of autoimmune origin including alopecia areata. Homeopathic treatment for alopecia areata helps by optimizing the overactive immune system that is destroying the hair follicles. Homeopathic medicines stop the size of the bald spots from enlarging and help in the regrowth of hair. Thus, homeopathy can provide an effective and permanent solution to this problem. Moreover, once alopecia areata is treated with homeopathy, the chances of the problem reoccurring are greatly reduced.\n\nHow common is alopecia areata and does it cause permanent hair loss?\n\nAlopecia areata is a fairly common condition and about one percent of the population is affected at any given time. The hair loss in alopecia areata is not permanent. Alopecia areata is a reversible hair loss as the follicles (a structure that encloses the root of the hair) of hair are not damaged.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic treatment for Alopecia Areata and Bald patches", "description": "Homeopathic medicines for alopecia areata and bald patches can cure it without steroids. homeopathic medicines for hair loss in patches is very effective", "url": "https://www.drhomeo.com/hair-fall/homeopathic-treatment-for-alopecia-areata/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Hair fall", "article:published_time": "2022-08-05T09:15:19+00:00", "article:modified_time": "2022-12-01T12:54:21+00:00", "updated_time": "2022-12-01T12:54:21+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2022/08/alopecia.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2022/08/alopecia.jpg", "image:width": "1500", "image:height": "1500"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhair-fall%2Fhomeopathic-treatment-for-alopecia-areata%2F&t=Homeopathic%20Remedies%20For%20Alopecia%20Areata", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhair-fall%2Fhomeopathic-treatment-for-alopecia-areata%2F&title=Homeopathic%20Remedies%20For%20Alopecia%20Areata", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2022/08/alopecia.jpg", "http://www.drhomeo.com/hair-fall/hair-falling-and-homeopathy/"], "authors": [], "publish_date": "2022-08-05T09:15:19+00:00"}