{"result_id": "370007", "URL": "https://www.drhomeo.com/medicine/homeopathic-medicines-for-numbness-in-hands-fingers/", "timestamp": "2023-04-25 18:27:17 CEST+0200", "meta": {"description": "The top homeopathic medicines for numbness in hands and fingers include Causticum, Hypericum, Kali Phos, Paris Quadrifolia and Phosphorus.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/medicine/homeopathic-medicines-for-numbness-in-hands-fingers/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "homeopathic medicines for numbness in hands and fingers", "cleaned_text": "Numbness of the hands and fingers mainly arises from irritation, compression or damage to the nerves that supply the hands and fingers. It can be one-sided or both sided and can arise due to various reasons. The main causes of numbness in hands and fingers include carpal tunnel syndrome (CTS), cervical spondylosis/radiculopathy, cubital tunnel syndrome, brachial plexus injury, peripheral neuropathy and ganglion cyst that may press upon the nerve. Homeopathic medicines for numbness in hands and fingers help treat the problem from the root.\n\nOther reasons include Vitamin B12 deficiency, long-standing/uncontrolled diabetes mellitus, multiple sclerosis, Raynaud’s disease, Lyme disease, alcohol use disorder, Guillain-Barre syndrome, and spinal cord injury.\n\nNumbness in hands and fingers can by other symptoms like tingling, pricking, pin-needle sensation or burning in hands and fingers. Clumsiness or lack of strength/weakness may also be felt in the arm, hand or fingers along with above-mentioned symptoms.\n\nHomeopathic Medicines for Numbness in Hands and Fingers\n\nThere are excellent medicines in homeopathy to treat numbness of hands and fingers in an effective manner. These medicines are selected individually for every case of numbness in hands/fingers. The reason behind numbness and attending symptoms like tingling, pin needle sensation, pricking, and weak muscles are taken into consideration to finalize the prescription. The top remedies for treating numbness in hands and fingers include Causticum, Hypericum, Kali Phos, Paris Quadrifolia and Phosphorus.\n\nCausticum is a top-listed medicine for treating numbness in hand and fingers. Excessive weakness and a paralytic feeling in hand is prominently present with numbness. Hands and fingers feel icy cold. Sweat on the hands may also be present. In some cases drawing pains in the hands attend. Pain in the thumb and index finger is also there. Causticum is one of the leading medicines to treat numbness in the fingers arising in cases of carpal tunnel syndrome (due to pinching of the median nerve).\n\n2. Hypericum – For Numbness in Hands/Fingers from Nerve Injury\n\nHypericum is prepared from a plant Hypericum Perforatum commonly known by the name of St. John’s Wort. The natural order of this plant is Hypericaceae. It is highly useful in cases of numbness of hands/fingers arising from nerve damage or injury. Along with numbness complaint of tingling and crawling sensation in hands/fingers may be present. A burning sensation may also be complained of in hands and fingers.\n\n3. Kali Phos – Indicated for Numbness in Fingertips\n\nKali Phos is a remedy of great value to treat a number of nervous complaints. It is well indicated for treating cases where numbness in the fingertips is prominent. Prickling in hands is also noted in cases needing Kali Phos. General debility and weakness is present mostly with the above complaints. Persons requiring Kali Phos often have a nervous and sensitive constitution. Neuralgic pains that are better by gentle exercise also point towards its use.\n\n4. Paris Quadrifolia – For Numbness in Fingers in Cervical Spondylosis\n\nParis Quadrifolia is prepared from a plant named One-berry. This plant belongs to natural order Trilliaceae. Paris Quadrifolia is highly beneficial to treat numbness in fingers in cases of cervical spondylosis. Fingers feel and cold alternately with numbness. Tearing, drawing or shooting pain in fingers assist sometimes. Along with this pain in nape of neck and shoulders is marked. The pain from the neck often radiates down to the fingers. Exertion worsens the pain. Weight and weariness in the nape of the neck is also felt. The neck is tensed and stiff. Swelling of the neck may also accompany the above symptoms.\n\n5. Phosphorus – For Hand Numbness in the Morning\n\nPhosphorus is a suitable medicine to manage hand numbness arising mainly in the morning. Hands feel numb and insensible on waking in the morning. Burning sensation in the palms may be there. Hands are weak and its movements are also clumsy. The heaviness of the hands is also there. Numb, insensible fingertips accompanied with crawling sensation is another key feature to use Phosphorus.\n\n6. Silicea – For Numbness of Hands at Night\n\nSilicea is an excellent medicine to manage numbness of hands at night time. There is also a weakness of hands where Silicea is indicated. Hands start to feel lame after slight exertion or while writing sometimes. Tingling in fingers and burning sensation in the ends of fingers is also characteristic of using Silicea. Profuse sweat on hands is noted most times with the above symptoms. Silicea is also helpful to relieve hand numbness in case a ganglion cyst is compressing the nerve and causing numbness. In addition to the above, Silicea is useful in cases of numbness in arms. In such cases, the arms feel heavy and there may be a pricking and pin-needle sensation.\n\nCalcarea Carb is very effective to manage numbness of hand/finger while grasping anything. There is also tingling in the fingers as if they are asleep. Weakness in the fingers is present. Fingers feel heavy on movement. Hands may be cold. Excessive sweat on hands is also marked. Fingers may feel stiff in the morning. Sometimes hands feel cramped, especially in the morning. Hands may be swollen and may have nervous tingling.\n\n8. Natrum Mur – For Numbness and Tingling in Hands/fingers\n\nNatrum Mur is significant medicine to treat numbness attended with tingling in hands and fingers. Rubbing the hands often help to relieve numbness where Natrum Mur is indicated. Burning sensation in the hands, especially in the palms, is well noted. Cramping is also present in the hands and fingers in a few of the cases requiring this medicine.", "opengraph": {"locale": "en_US", "type": "article", "title": "homeopathic medicines for numbness in hands and fingers", "description": "The top homeopathic medicines for numbness in hands and fingers include Causticum, Hypericum, Kali Phos, Paris Quadrifolia and Phosphorus.", "url": "https://www.drhomeo.com/medicine/homeopathic-medicines-for-numbness-in-hands-fingers/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Medicine", "article:published_time": "2019-04-18T11:22:25+00:00", "article:modified_time": "2019-04-18T11:22:29+00:00", "updated_time": "2019-04-18T11:22:29+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2019/04/Numbness-in-Right-hand.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2019/04/Numbness-in-Right-hand.jpg", "image:width": "600", "image:height": "400", "image:alt": "Homeopathic Medicines for Numbness in Hands and Fingers"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fmedicine%2Fhomeopathic-medicines-for-numbness-in-hands-fingers%2F&t=8%20Homeopathic%20Medicines%20for%20Numbness%20in%20Hands%20and%20Fingers", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fmedicine%2Fhomeopathic-medicines-for-numbness-in-hands-fingers%2F&title=8%20Homeopathic%20Medicines%20for%20Numbness%20in%20Hands%20and%20Fingers", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2017/10/sore-muscles.jpg"], "authors": [], "publish_date": "2019-04-18T11:22:25+00:00"}