{"result_id": "370031", "URL": "https://www.drhomeo.com/author/admin/page/29/", "timestamp": "2023-04-25 18:27:46 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/author/admin/page/29/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Dr. Vikas Sharma MD, Author at - Page 29 of 96", "cleaned_text": "There are para nasal sinuses (air – filled spaces) located inside the cheek bones, forehead, behind the bridge of nose and between the eyes. These can get inflamed from infection or from allergies. As a result they swell, become congested with mucus and can not drain properly resulting in pressure build up and pain which is referred to as sinus headache. Homeopathic remedies for sinus headache offer a very natural, safe and effective treatment. The sinus headache can be felt on one or both sides of the head. Additionally pain and pressure can be felt in any of the sinus areas like around the eyes and cheeks, bridge of the nose. Sinus headaches and migraines are easily confused with each other due to similar symptoms like nasal congestion, nasal discharge, facial pain. However, sinus headache is not attended with nausea / vomiting which is present in migraine. Worsening of headache from noise and bright light is also a feature of migraine and not sinus headache. The duration of sinus headache is for many days together but migraines mostly last few hours or for one or two days. They most commonly occur in case of inflamed para nasal sinus (sinusitis). These sinuses can get inflamed from infections or from allergies (hay fever). Sinus infections can lead to sinus headaches. The infections cause mucus build up in the sinuses and cause congestion and headache. The infections can occur from common cold; seasonal allergies; nasal polyps and deviated nasal septum that blocks drainage of mucus from sinus and favours growth of germs that inflame sinus. Person having sinus headache may feel fullness pressure or pain in forehead, in cheeks, bridge of the nose or brows. The affected sinus area can also be tender to touch and red. The pain tends to get worse when first getting up out of bed, from moving your head suddenly and from leaning forward. Its other symptoms include sinus infection like stuffy nose, thick, green or yellow coloured mucus discharge from the nose, post nasal discharge (PND), swelling or puffiness of face, fever, aching in the upper jaw, fatigue. In case of infection of frontal sinus pain / pressure is felt in the forehead, above the eyes. In case of maxillary sinus involvement pain or pressure is felt in the cheek area. In ethmoidal sinusitis pain occurs between / behind the eyes, and the sides of the upper nasal area (medial canthi). When sphenoidal sinus is affected pain appears behind eyes, top of head or back of head. Homeopathic systems offer a very natural, safe and effective treatment for sinus headache cases. Homeopathic medicines help to relieve sinus headache by reducing the sinus congestion by treating the root cause behind it. It targets to treat the cause like infections, nasal allergies linked with sinus inflammation leading to sinus headache. These medicines are effective in both acute as well as chronic cases of sinus headache. Along with relieving the headache it also manages the attending nasal symptoms like stuffiness, nasal discharges , sneezing, post nasal discharge. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is a very effective medicine for sinus headache. It works very well in cases of frontal and maxillary sinusitis. In cases needing it, the frontal headache is marked. A pressive sensation or pressure in the forehead is felt where it is required. This worsens on motion and stooping. It also worsens from going in the open air. Next symptom that indicates its use is swelling of the cheek with pain of burning nature. Face may be red with warmth. Pain in the jaw , especially tearing in nature may also be present. Kali Bichrome is another well indicated medicine for these cases. Persons needing it complain of headaches in the forehead especially over one of the eyes. They usually feel shooting pains over the eyebrow. Next they can complain of pain in the forehead in the morning on awaking. They feel distress, fullness, severe pain in frontal sinuses. With this they discharge from the eyes and nose. They also feel weak along with this and may also have fever. Another main symptom that they have is post nasal discharge. Pain, tightness, fullness or pressure sensation at the root of the nose is also felt. With this they have a constant feeling of a stoppage of their nose. They may have a burning sensation in their nose. They may also feel a fetid smell in the nose. They feel their noses are constantly full of thick mucus. Discharge from the nose of tough, yellow or green color which is stringy, ropy or lumpy is passed. Sometimes there is discharge of crusts from the nose which are tinged with blood. Next they may have pain, shooting in nature in the cheeks mainly left sided. Pressure is also felt in the same region. This pain is also felt across the bridge of the nose.\n• Silicea – For Pain in Forehead and Nasal Discharge This is the next prominent medicine when pain is felt in the forehead. The pain for using this medicine is mostly throbbing, pulsating type. The pain may worsen from motion, stooping or cold air exposure. Wrapping up your head warmly gives relief. Along with the headache the head also feels very heavy. A major attending symptom is thick, green – yellow, offensive discharge from nose after getting up. Nose may feel stopped in the morning with this.\n• Hepar Sulph – When There is Pain at Root of The Nose This medicine is particularly helpful when there is pain at the root of the nose. This pain is most felt in morning time. An attending symptom is a stoppage of the nose in the morning. Thick, offensive smelling discharge from nose can accompany. This discharge may be sometimes blood tinged. A heated sensation and burning is felt in nostrils. Nose is painful and sensitive to touch. Other than this there may be headaches over eyes. Headache worsens when shaking the head.\n• Natrum Mur – For Heaviness / Pain in Forehead with Sneezing, Nasal Discharge It is a very important medicine when there is heaviness / pain in the forehead with sneezing and nasal discharge. A pressing sensation or a sensation of weight may also be felt in the forehead. This worsens from bending your head down. This sneezing is violent and worse in the early morning. The nasal discharge is watery and sometimes there is alteration between nasal discharge and nasal dryness. It’s a top listed medicine for nasal allergies. This medicine is prepared from the fresh root of the plant Hydrastis canadensis. This plant is commonly known as Golden Seal, Orange-root and Yellow Puccoon. This plant belongs to family ranunculaceae. This medicine offers great help in case of frontal headache over the eyes. A main accompanying symptom is dropping of mucus from back of nose into throat (post nasal discharge). In many cases the nose feels stuffed up. There is also discharge of thick, white, yellow or green tenacious, stringy mucus from the nose.\n• Pulsatilla – For Pain in Maxillary Sinus (Cheek), Nasal Stuffiness and Thick Nasal Discharge This medicine is prepared from plants named Pulsatilla Nigricans commonly known as wind flower or pasque flower. This plant belongs to family ranunculaceae. It is indicated when there is pain in maxillary sinus (located in cheeks), nasal stoppage and thick nasal discharge. The pain in maxillary sinus is tearing in nature that may extend into the ear. The nasal discharges are thick, yellow green coloured. They get worse indoors and get better in open air. In some cases requiring it dull, heavy sensation over frontal sinuses is also there.\n• Merc Sol – For Inflamed Frontal and Maxillary Sinus with Headache and Fluent Nasal Discharge This medicine is recommended for inflammation of frontal and maxillary sinus. Cases needing it present with headaches of pulsating kind in forehead. There is also pain in cheeks, and aching in jaws. Fluent nasal discharges are present with above symptoms. The discharge is acrid that causes rawness, soreness of nostrils. Sneezing is also there.\n• Sticta – For Pain in Forehead and Root of Nose, with Stuffy Nose It is another significant medicine for sinus headache. The key indication for using it is pain in forehead, root of nose along with stuffy nose. Sometimes heaviness and pressure is felt in the forehead. The nasal obstruction gets worse at night. In cases needing it the nasal secretions dry quickly and form scabs and are difficult to be discharged. Excessive sneezing attends it.\n• Bryonia – For Pain, Heaviness in Forehead Worsening from Stooping This medicine is prepared from the root of a plant named Bryonia alba or wild hops. This plant belongs to the family cucurbitaceae. It is beneficial for persons who complain of pain, heaviness in the forehead specifically from stooping. It may also worsen from motion. Fullness or pressure may also be felt in the forehead where this medicine is needed. It is also indicated for pain in the back of the head. Last indication for its use is pain on top of head in the morning on waking. This pain is mostly throbbing.\n• Kali Iodatum – For Pain Over Eyes and Watery Nasal Discharge This medicine works well in cases where pain over the eyes is present along with watery discharge from the nose. The discharge is hot, acrid and worsens in cold air. The frontal sinuses are inflamed. Violent sneezing is also there. Tightness at the root of the nose is also felt.\n• Gelsemium – For Pain Over Eyes and Back of Head This medicine is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. Its use is suggested for cases presenting with pain over eyes and back of head. A sensation of band around the head accompanies. The nasal symptoms that occur with this are sneezing in early morning, fullness at the root of nose and thin watery nasal discharge. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Red eyes refers to redness of the white portion of the eye (sclera).Here the white of the eye may look pink, red, bloodshot or may appear to have pink/red lines on it. The eye redness occurs from dilatation of blood vessels on the surface of the eye from various reasons like irritation or an infection or inflammation. It can occur in one or both the eyes. Homeopathic medicines for red eyes offers very effective treatment and aims to treat the root cause behind it. In many cases redness of eyes occurs without any other symptoms. while in rest of the cases the symptoms that can attend it includes irritation or itching, burning in the eyes. Some other symptoms that may accompany it include discharge from the eye, watering from eyes, pain in eye and dryness in the eyes. Few other symptoms include sensitivity to light (photophobia) and blurred vision. Redness of eyes is very common and can arise from various causes. Firstly it can arise from many irritants that can inflame the eyes. These irritants include dust, dry air, sun exposure, air pollution, smoke. Secondly, it can occur from eye allergies, hay fever / allergic rhinitis (an allergic disorder that arise from exaggerated response of the immune cells to allergic substances causing running nose, sneezing, nasal blockage and eye symptoms like irritation, redness, itching and watering from eyes) It can also arise from infection (bacterial and viral) and inflammation of the eyes. There are various inflammatory conditions of the eyes that can cause redness of eyes. It includes conjunctivitis (inflammation of the conjunctiva which refers to a membrane that covers the white of the eye). It also includes scleritis (an inflammation and redness of sclera – white of eye which is the outer, tough fibrous protective layer of the eyeball). It can occur in episcleritis (inflammation of the thin layer present on the white part of the eye / sclera). Another inflammatory condition of the eye linked with redness of the eye is iritis (swelling and inflammation in the coloured ring that surrounds the pupil of the eye). Other eye inflammatory conditions are keratitis (an inflammation of the cornea which is the clear, dome shaped tissue in front of eye which covers the pupil and iris) and uveitis (inflammation of the middle layer of eye called uvea that is the pigmented layer lying between the inner retina and the outer fibrous layer composed of the sclera and cornea). Apart from above eye redness can happen in blepharitis (inflammation of the margins of the eyelids where eyelashes grow). In addition to above, it can arise in case of Chalazion (a type of cyst forming in the eyelid from blockage of meibomian gland responsible for producing an oily substance that lubricates the eye) and stye ( red, painful lump near the edge of eyelid either upper or lower occurring from a bacterial infection). Corneal ulcer, a scratch /abrasion on cornea, herpetic infection of cornea can lead to eye redness too. Rest of the reasons include excessive screen time on computer /mobiles, dryness of the eyes, foreign object in eye, trauma / injury to eye, inward turning of eyelid (entropion), outward turning of eyelid (ectropion), side effect of using eye drops, complication of eye surgery or complication from use of contact lens, subconjunctival haemorrhage ( bleeding arising from broken blood vessel immediately beneath the surface of the eye), infection of tissue around the eyes (orbital cellulitis), glaucoma (an eye disorder characterised by increase of intraocular pressure and optic nerve damage). Homeopathy offers very effective treatment for cases of red eyes. The homeopathic medicines aim to treat the root cause behind it like inflammation, infection to decrease the redness of eyes. Additionally they also help to relieve the attending symptoms like itching, burning in the eyes, discharge from eye, watering from eyes, pain in the eye and dryness in the eyes. Red eyes can arise from mild causes to serious causes that require emergency medical attention. Homeopathic medicines can help in cases where no serious causes are linked to it. But in case of serious cause behind red eyes it is advisable to seek immediate medical help from the conventional mode of treatment. Eye redness attended with sudden changes in vision, pain in eye, intense headache, fever, sensitivity to light, white rings, or halos around light, nausea or vomiting are some of the indications of serious issues. Other than this serious issues includes red eyes arising from an injury, from entry of chemicals or a foreign object in the eye. Before starting homeopathic medicines for red eyes it is strictly advisable to consult a homeopathic physician who can best judge the homeopathic medicines that will suit a particular case and can guide if urgent help is needed from conventional mode in case of some serious cause. It is a natural medicine prepared from plant deadly nightshade. This plant belongs to family solanaceae. It is a top listed medicine for cases of red eyes. In cases needing it the eyes look very red, congested. It works well in inflammatory conditions of the eyes mainly conjunctivitis. Other than redness, persons needing it also have dryness and burning pain in their eyes. They may also have shooting pain in their eyes. Another attending complaint that they have is watering from the eyes. Other attending symptoms are soreness, redness and swelling of eyelids. Sometimes there is sensitivity to bright light also. This medicine is prepared from plant Euphrasia Officinalis commonly known as eye – bright. This plant belongs to family scrophulariaceae. It is a very effective medicine for redness of eyes along with watering and itching of eyes. The eye watering causes smarting and burns in the eyes. A sensation of sand in eyes attends these symptoms. It is very helpful in case of iritis, conjunctivitis. Along with above symptoms pain in the eye may be present that is worse at night. Sometimes photophobia is also there. Aconite is prepared from plant Aconitum Napellus commonly known as monkshood. This plant belongs to family ranunculaceae. This is very helpful medicine for cases of red, bloodshot, inflamed eyes. With this burning, shooting pains are present that appear mainly on moving eyeballs. Another attending symptom is watering from eyes that is worse in evening and night time. Roughness sensation in the eyes as from sand also appears with this. Apart from above burning, a smarting sensation and itching in the eyes is present which worsens in evening. 4. Apis Mellifica – For Bright Red Eyes with Smarting, Burning, Cutting Pain in Eyes It is a well indicated medicine for cases where there is bright redness of eyes along with smarting, burning, cutting pain in eyes. The white of the eye is full of dark blood vessels. Along with this the eyes are very sensitive to light. Eyes are itchy too. It is well indicated for cases of conjunctivitis, keratitis and blepharitis. 5. Natrum Mur – For Eye Redness with Watering from Eyes This medicine is a prominent medicine for persons who complain of eye redness along with watering from eyes. They feel that the watering worsens in open air. This watering is acrid that leads to redness and soreness in eyes. They also have swelling of eyelids. Lids appear red, raw, ulcerated along with burning. The eyelids are sticky in the morning and covered with thick scabs. It is a well indicated medicine for eye redness and eye discharge. It is indicated especially for conjunctivitis and blepharitis. In cases needing it the eye appears intensely pink or red along with profuse discharge of mucopurulent nature. The white of the eye is congested, swollen. With this the eyelid margins are red, swollen and thick. Eyelids are also sore and crusty. The eyelids get stuck together in the morning. Itching and burning, biting in eyes is felt with this. This is a very useful medicine for cases where the eyes are red, itchy watery with frequent sneezing. Hence its use is considered in cases of hay fever (allergic rhinitis). The eyes are also sensitive to touch. Runny noses also accompany these symptoms. 8. Merc Sol – For Redness of Eye Attended with Burning Pains This medicine works well in cases of eye redness accompanied with burning pains. In cases needing it white of the eye is markedly red. Sensitivity to bright light is also there. The eyelids, especially the upper one, are thick, red and swollen . Copious watering from eyes is also there along with above symptoms. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly known as Arbor Vitae. This plant belongs to family Coniferae. Its use is considered in cases where eyes appear blood red. Along with this excessive tearing (watering) from eyes is present. The eyelids may be dry, scaly and sticky at night. Burning and stinging in the eyelids attend this. It is a leading medicine for treating styes and chalazion. It is also one of the major medicines for treating scleritis. Sulphur is a great medicine when the eyes are red along with itching and burning sensation. A feeling of sand in the eyes is also prominent with this. Sometimes stitching, smarting or stinging is felt in the eyes. This medicine also plays a supportive help for managing eye redness and light sensitivity in cases of corneal ulcers. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Sebaceous cysts are non-cancerous (benign) bumps under the skin that are filled with semi – solid material. They are very common and mostly found on the scalp, face, neck and back, though can develop anywhere on skin except the palms of hands and the soles of feet. Homeopathic remedies for sebaceous cysts help in resolving cysts by discharging and clearing off the contents & gradually shrink and dissolve these cysts. The term sebaceous cyst refers to either an epidermoid cyst which originates from the epidermis (top layer of the skin) or a pilar cyst that originate from the hair follicles. As these cyst don’t originate from sebaceous glands and don’t contain sebum, So the term sebaceous cyst is inappropriate for them. The true sebaceous cysts are the ones that originate from sebaceous glands (glands in the skin having an opening in the hair follicle gland where it secrete oily matter known as sebum). These cyst contain sebum (an oily matter produced by sebaceous glands that aid lubrication of the hair and skin). They are very rare and are known as steatocystoma simplex. The epidermoid cysts develop from the skin. The surface of the skin, known as the epidermis consists of thin layers of cells. These cells are constantly shed off. The epidermoid cysts develop from inward movement and trapping of skin cells and multiplying there in spite of moving out on the skin surface and shedding outside. They can also develop from any damage that causes cells on top of the skin to be implanted in the lower layer. They can follow irritation or injury to the skin too. The true sebaceous cysts can form due to deformed, damage or blockage of the duct of the sebaceous gland (this duct act a passage from where the sebum / oil is able to leave). It can follow a trauma like a surgical wound or scratch on the skin. Sometimes the cyst is linked to genetic conditions like Gardner’s syndrome (a rare genetic disorder in which there occurs multiple polyps in the colon i.e. large intestine along with some other tumours outside the colon. The other tumours outside the colon may include fibromas, epidermoid cyst, desmoid tumours, osteomas of skull). In many cases no cause can be ruled out behind the sebaceous cyst. They are felt as a lump under the skin. They grow very slowly, are harmless and usually do not cause any problem but can be uncomfortable and cosmetically look bad. Though they can occur on any body part, they are more common on the scalp, face, neck, back, chest and ears. In males they commonly develop in scrotum and chest. They may contain fibrous tissue, fluids. They may also contain keratin (a strong protein present in the skin, nails and also teeth). Next they may be filled with somewhat viscous, serosanguineous fluid that contains pus and blood. The type of the contents of the cyst vary depending on if the cyst is infected or not. The size can vary from a few mm to around 5 cm. These are round in shape and when touched these cyst feels smooth, mostly soft and movable. The small cyst are not painful and tender to touch. But when they are large they can be painful and cause pressure on the surrounding parts. They also become painful if they get infected, damaged or inflamed. When infected or inflamed the skin over the cyst becomes red, tender and sore. A thick, yellow, cheesy, bad smelling material may sometimes drain from the cyst. The cyst should not be scratched, pricked popped or squeezed to prevent chance of infection. These cysts are commonly found in the hairy areas of the body. In long standing cases the hair on the surface of skin above the cyst may be lost. Most times no complications occur in it. But sometimes few complications can arise. The first complication that can arise is its fixation if it extends deep in the body and connects to underlying tissue and forms a fixed lump that does not move. Next complication is infection (when bacteria gain entry in the cyst) resulting in abscess formation. Other complications include inflammation and rupture of the sebaceous cysts. Very rarely epidermoid cysts can lead to skin cancer. Homeopathy carries a good scope to treat these cysts. There are numerous homeopathic medicines that can help in dissolving, shrinking these cysts. These medicines halt further growth and increase the size of these cysts. The results vary from case to case depending upon the size and duration of the cyst. The medicines for its treatment are of natural origin so they treat them in a very safe, mild, gentle way without any side effects. These medicines are very effective and may even subside the need of surgical intervention in many cases of cyst. Silicea is a very effective homeopathic medicine for treating cases of different types of cysts including sebaceous cyst. It possesses a great ability to shrink and dissolve the cysts. It is also indicated for cases where infection has occurred with abscess formation. In such cases pus discharge is present. The pus is scanty. It has a bad smell. Its use is also recommended for sebaceous cyst on the scalp. Such cyst are smooth and appear shiny where this medicine is required. This is the next very beneficial medicine for treatment of various kind of cysts and tumours. It is most prominently indicated for cyst on the scalp. Scalp may be sensitive to touch in cases needing it. Apart from this it offers help in case of fatty tumours, swollen and hard indurated glands. Graphites is yet another well-indicated medicine having a marked action on dissolving the cysts. Like Baryta Carb, it is also a significant medicine for treating sebaceous cyst on the scalp. For using it the cyst is large and smooth. Scalp is hairy. Itching and marked heat may be present on the scalp. It is natural medicine prepared from fresh green twigs of plant Thuja occidentalis commonly known as Arbor Vitae. This plant belongs to family Coniferae. It is the next medicine in the list to treat many sorts of cyst and tumours. Firstly it is useful to treat sebaceous cyst. Next it is helpful to treat cyst in the breast and ovaries. Other than these it is an important medicine for spongy and fatty tumours. Like medicine Silicea, this medicine possesses a great power to manage cases where infection has occurred and abscess has formed. In such cases it works well when there is pus discharge that can be blood stained also. With this there is throbbing or splinter like pain present in the infected site. The abscess is also tender and sensitive to touch. The skin overlying the abscess is inflamed and appears warm to touch. It is also an important medicine for treating sebaceous cyst. Not only these cysts it also have a marked affinity to treat many other types of cyst and tumours. Among them ovarian cyst, fibroids and fatty tumours are the ones well treated with this medicine. It is prepared from plant puke weed either with fresh plant when in flower and seed or its dried leaves. This plant belongs to the family lobeliaceae. This medicine has a tendency to resolve most obstinate cysts on the scalp. It either makes the cyst dissolve gradually or resolves it by aiding the discharge of its contents. In addition to above some of the other important medicines indicated for treating sebaceous cysts include Conium, Phytolacca, Calcarea Carb, Agaricus and Spongia. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Burning feet is the sensation of excessive heat in the feet. It is a very common sensation that usually is experienced at night. Sometimes burning feet may be painful enough to interfere with sleep. Mostly it arises from nerve damage. The intensity can vary from mild or severe. It can be constant or intermittent. Homeopathic medicines for burning feet offer natural, gentle, effective treatment for a variety of cases. Burning feet may also be attended with tingling, prickling, pins- needles sensation or numbness, redness, swelling, increased sweating, pain in feet. It most commonly occurs from nerve damage. The nerve damage can be from various reasons. The most common reason is diabetes (diabetes neuropathy). Uncontrolled high levels of sugar in blood for a long time damages blood vessels and nerves. The nerve damage hinders normal travel of nerve signals to many body parts and also feet. Nerve damage in legs and feet refers to peripheral neuropathy. Persons who have high blood pressure, take alcohol, are overweight and smoke are at high risk of nerve damage. In case of diabetic neuropathy along with burning sensations, tingling, numbness, sharp pain, weakness in hands and feet can also accompany. Secondly, it can arise from excessive alcohol use that causes nerve damage called alcoholic neuropathy. Thirdly, it can occur from certain nutritional deficiencies. Deficiency of vitamin B12, B6, folate can lead to nerve damage and burning sensation in feet. Vitamin B deficiency also causes anaemia that contributes to it. Another reason is small fiber sensory neuropathy (SFSN) which is a type of peripheral neuropathy affecting small nerve fibers in the skin. In this painful burning in the feet arise. Hypothyroidism (an underactive thyroid) is yet another reason behind burning feet. In this condition swelling appears which puts pressure on nerves and causes a burning sensation. Other symptoms of this condition include weight gain, loss of energy, hair loss, dry skin. Other than these, it can occur in Charcot – Marie – Tooth disease (CMT). A Common form of hereditary neuropathy that causes nerve damage in arms and legs. Burning, pins and needles in the feet / hands is among the initial symptoms. Another reason is Athlete’s foot (Fungal infection of the foot). It is also known as tinea pedis. In this condition burning, tingling, itching sensation between the toes or in the soles of the feet arise. Other than these fluid filled eruptions (blisters) cracked skin, peeling of skin, dry or raw skin on the feet may occur. Sometimes toenails get thick, discoloured, crumble and get detached from the nail bed. Long term or chronic kidney disease – When kidneys get damaged and are not able to carry their function properly means not able to remove toxins from the body then these toxins build up in blood and damages the nerves. Erythromelalgia – it is a rare vascular disorder in which blood vessels in lower limbs or hands get blocked on and off followed by hyperemia (excess blood flow) and inflammation. Redness, congestion, heat and pain in feet occur though symptoms can also occur in hands, arms, ears, legs, face and other body parts. Peripheral artery disease (PAD) – In this condition the arteries that carry blood to the legs and feet becomes narrow. It leads to burning in feet and legs. Complex regional pain syndrome (CRPS) – A condition causing severe pain usually in just one arm or leg and develops typically after an injury or a surgery. Its symptoms are swelling, burning pain, swelling, skin colour or texture change. Tarsal tunnel syndrome – It is a condition arising from compression of nerves that runs from the ankle to the foot. It can arise from swelling or an injury. In this there occurs pain, burning, tingling or numbness in the foot. Guillain – Barre syndrome (GBS) – It is an autoimmune disease in which the immune cells attack and cause damage to the peripheral nervous system. In the beginning it is mostly present with numbness, tingling, and weakness in feet. Some other diseases can have burning feet as one of its symptoms. Some examples include Lyme disease ( a tick-borne, infectious disease caused by a bacteria of the type borrelia), HIV, shingles (a viral disease caused by Varicella zoster virus in which painful skin rash with blisters appears). Pregnancy and menopause – Burning feet may be complained about by some women during pregnancy and menopause. This is due to hormonal changes leading to increase of body temperature. Heavy metal poisoning can also cause it. Exposure to heavy metals like arsenic, mercury and lead can lead to burning sensation in the feet. Side effects of certain medicines like chemotherapy drugs, some medicine used to treat HIV and seizures (fits), overdose of vitamin B6. It can also occur from wearing poor footwear and standing / walking for an extended time period. Homeopathic medicines offer natural, gentle, effective treatment for cases of burning feet. These medicines focus to address the root cause behind it to bring great improvement in these cases. These medicines in addition to relieving the burning of feet also helps to improve attending symptoms. Such symptoms include tingling, prickling, sensation, numbness, redness and swelling, increased sweating and pain in feet. As burning of feet can arise from numerous reasons, its important to take homeopathic medicines after complete case analysis by a homoeopathic physician and self medication be avoided. Sulphur is a leading medicine for burning sensation in feet. Persons needing it have burning especially in soles of feet. They wish to place them on a cool place to get relief. The burning worsens at night and they put them out of bed to cool them. They may also feel burning in soles on stepping after sitting for a long time. Itching may also be present on soles in addition to the above complaint. Another symptom that can attend it is prickling in balls of feet when putting feet to ground.\n• Kali Phos – For Burning in Soles and Toes It is a great nerve remedy. It is a very suitable medicine for cases having burning in soles and toes. In some cases needing it stinging sensation in soles may be present. It is also indicated when prickling sensation is present in the feet. This medicine works well in case of burning, swelling on feet. There is internal burning but when touched the feet feels cold from outside. Red spots on the feet may be present with this. Other additional symptoms that can accompany numbness and weakness of feet.\n• Medorrhinum – For Burning of Feet and Sharp Pain This medicine is beneficial for cases of burning feet and sharp pain in soles. Persons needing it uncovers the feet and fan them to aid relief. The sharp pain in soles is felt while taking the first step on them in the morning. They may also have swelling of feet. Sore feeling under feet especially on the left side may be present.\n• Apis Mellifica – For Burning in the Toes This medicine is prominent for burning sensation in toes. With this there is redness in toes. Sometimes numbness is felt in feet. Swelling in feet may be present too.\n• Pulsatilla – For Burning in Back of Feet This medicine is prepared from plant Pulsatilla Nigricans commonly known as wind flower or pasque flower. This plant belongs to family ranunculaceae. It is well indicated for burning in the back of feet. Redness and swelling of feet can be present with this. Tearing pain from back of foot to heel is present sometimes. Soles of feet may also be painful and feel sore. Some people requiring it also have a tingling sensation in feet while standing.\n• Phosphorus – For Burning Sensation in Feet and Numbness of Toes This medicine is helpful for burning sensation in feet and numbness of toes. Burning sensation can be felt in legs also. Swelling of feet may also be there. Pain in soles as if from ulceration can be felt during walking. Another symptom that can attend is a shock like sensation in feet.\n• Silicea – For Burning and Tingling in Soles This medicine is very useful for burning in soles and also tingling sensation in soles. The burning is most marked in evening and night time where it is required. Along with this there is swelling of feet with redness. A peculiar accompanying symptom is excessive sweating on feet. The sweat is offensive. Soreness of feet is also there in some cases. It is also one of the best medicines for cases of athlete’s foot. This medicine is prepared from a plant named Arnica Montana having the common name Leopard’s – bane or fallkraut. This plant belongs to family compositae. Its use is recommended in cases presenting with violent burning in feet. Along with this tingling sensation may be marked in feet. Sometimes there is attending numbness of feet.\n• Natrum Carb – For Burning in Feet While Walking This medicine helps cases of burning in feet while walking. Burning is mainly present in soles for using this medicine. Swelling with stinging in feet may also attend while walking. In the right foot stitches as from needles can be felt. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Breast pain is medically known as mastalgia It is very common and many women at some point of their lives have experienced breast pain. It can be felt as discomfort, heaviness, tightness, mild tingling, dull ache, sharp pain or burning pain in the breast. Fullness in breasts, soreness, tenderness in breast and swelling in the breast can accompany this. The breast pain can sometimes radiate to arms. The pain can be present in one breast or both breasts or in the underarm. In some cases the pain is felt constantly and in others it occurs occasionally. The intensity also varies from mild to severe from case to case. Homeopathy for breast pain works to treat the root cause behind it to bring major pain relief. Though pain can occur in women at any age but is more common in women before reaching menopause. Pain in both breasts that occurs before periods is not serious. But pain in one breast along with a hard lump in breast or nipple discharge is a reason of concern and needs to be further investigated. Firstly, it can arise from changes in the reproductive hormones (estrogen and progesterone). Pain from this reason is frequently seen during puberty, pregnancy, breastfeeding and menopause. In case of breast pain from hormonal changes the pain mostly gets worse 2 or 3 days before the menstrual period. The pain may sometimes also be there during periods. Second reason is breast cyst (fluid filled sac or lump in the breast. It is non cancerous. It is mostly painless but may be painful in some cases. These lumps have a tendency to enlarge in size around periods and they go away after menopause. Thirdly it can arise from use of certain medicines. Some of these medicines include oral birth control pills, some of the hormonal medicine used for infertility treatment, use of estrogen and progesterone therapies after menopause. Other medicines include antidepressants (selective serotonin reuptake inhibitor – SSRI), some of the diuretics and steroids. Next it can arise during breastfeeding sometimes. It can occur during breastfeeding from engorgement of breast when they become excessively full with milk, improper latching by baby during feeding (cracked and sore nipples can occur with this) and mastitis (infection of milk ducts occurring commonly during breastfeeding from clogged milk duct but can also occur at other times). Along with breast pain other symptoms of mastitis are swelling, redness, warmth of breast, fever, chills. Itching, cracking, burning or blister formation can also occur on the nipples. Some other factors that contribute to breast pain include large breasts size (it can cause pain in neck, shoulder and back in addition to breast), breast surgery, some dietary factors (like eating food high in fat and refined carbohydrates), smoking. In some cases pain in breast occurs from reason outside the breast (extramammary breast pain). For example this can arise from irritation of the muscles of the chest, arms, back or muscle pull in the chest. It can also happen from costochondritis (inflammation of the cartilage connecting the ribs and breastbone). In many cases however the reason is not found. Breast pain may cause fear in women thinking of it as arising from breast cancer but majority of times breast pain arises from a benign (non cancerous) condition of breast and is very rarely indicative of breast cancer. Breast pain is classified as cyclical or non cyclical breast pain. It is the pain that is linked with the menstrual cycle and is worse a few days before periods. It usually resolves during and after periods. It is described as a heavy, dull ache in the breast. The pain can radiate to underarm. It usually occurs in both breast (portion affected is upper and outer portion) and the breast can be lumpy. It can be attended with swelling and tenderness in the breast. Women between 20 yrs and 30yrs of age and in their 40’s before menopause are affected with this. It is not linked to the menstrual cycle. It is mainly present in one breast and feels soreness, burning and tightness in breast. Women after menopause are affected with this. It can occur from breast injury, mastitis and origin from surrounding muscles or tissues (extra mammary pain) Homeopathic medicines offer a very safe, gentle and effective treatment for cases of breast pain. These medicines also help to manage any attending swelling, tenderness in the breast. These medicines are prepared from naturally occurring substances so are very safe to use without any side effects.\n• Conium – For Breast Pain Especially Before Periods This medicine is very beneficial for breast pain that occurs before periods. Pain is worse from every step. In cases needing it the breast may also enlarge, and swell before periods. Soreness is also present in the breast. It is also indicated for stitching pain in the breast especially at night time or from walking. It is a prominent medicine for hard lumps in the breast with stitching pain. Lastly it is indicated for pain in the breast from fall or blows. This medicine is prepared from plant deadly nightshade. It is very effective for cases of pain in the breast with swelling, redness and heat. For using this medicine pain may be stinging or throbbing type. The breast may also feel heavy. It is a well indicated medicine for inflammation of breasts from weaning.\n• Phytolacca – For Pain with Inflamed Breast and Hard Lumps This medicine is prepared from plant Phytolacca decandra also known as Poke – root and Red Ink Plant. This plant belongs to family phytolaccaceae. It is a leading medicine for breast pain with inflamed breast. It is also top listed for treating hard, painful lumps in the breast. In case of inflammation, the breast is painful, intensely swollen, hard, sensitive and tender. Along with this the nipples may be sore, cracked, fissured and excoriated. In this case pain begins from the nipple and extends to the whole body. It is a very suitable medicine for severe stinging pains in breasts during breastfeeding. Another indication for using it is a lump in the breast which is sensitive and painful that is worse at menstrual period. The pain may extend down to the arm of the affected side. Lastly it is helpful for the hardness of the breast as hard as stone after weaning. This medicine is well indicated for pain in the breast along with swelling and hardness of the breast. It can also be reddened and sensitive to touch. Along with this burning sensation is felt. There can be high fever with this. Next important symptom pointing to its use is sharp pain in the breast while breastfeeding. Apart from these it is also useful for hard lumps in the breast.\n• Lac Caninum – For Pain in Breast with Soreness and Sensitivity to Pressure This medicine offers great help in cases where there is pain in the breast along with soreness and sensitivity to least pressure. The pain worsens from the least jar where it is required. Fullness in breast and its enlargement may also be felt along with above symptoms.\n• Pulsatilla – For Painful Lumps in Breast of Young Girls Pulsatilla is a natural medicine prepared from plant Pulsatilla Nigricans commonly known as wind flower or pasque flower. This plant belongs to family ranunculaceae. It is a very effective medicine to treat painful lumps in the breasts of young girls. The pain may radiate to the arm of the affected side. Another complaint to use this medicine is swollen, tensed, sore breasts with continuation of milk secretion after weaning. This medicine is prepared from the root of a plant named Bryonia alba or wild hops. This plant belongs to the family cucurbitaceae. Its use is done for burning or tearing pain in the breast. Females who need it also feel stony heaviness and hardness in the breasts. They also feel a heated sensation in the breast. Its use is also recommended when there is inflammation of the breast with heaviness, hardness and complaint worsens from motion. Next complaint that it helps is inflamed breasts with suppression milk flow.\n• Merc Sol – For Pain in Breast with Swelling and Ulcerated Nipples This medicine is considered when the breast is painful along with swelling and ulcerated nipples. It is also hard and sore. It is also used in cases where nipples are raw and sore during breastfeeding in case of mastitis. Its another significant symptom is hardness, swelling and pain in breast during menses. Along with this milk may fill in breast in non pregnant females.\n• Croton Tig – For Pain Extending to Back during Breastfeeding The main indication for using this medicine is pain in the breast going through the chest to back during breastfeeding. Nipple may be very sore to touch with this. Next it is indicated for inflamed, swollen and hard breasts when pain from the nipple goes through to the back.\n• Castor Equi – For Swollen Breast with Pain on Touch Castor Equi is a beneficial medicine for cases of swollen breasts with pain on touch. Additionally it is a very useful medicine for healing cracked, sore nipples in breastfeeding women. The nipples are very much tender with this complaint. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Lazy eye is medically known as amblyopia. In this condition the brain focuses more on one eye and does not fully acknowledge the images seen by the amblyopic eye usually due to poor vision in this eye. With passing time the brain begins to favour the healthy eye and starts to ignore signals from lazy eye. It results in decreased vision or if not treated in time even loss of vision in lazy eye. Homeopathic remedies for lazy eye offer supportive help along with conventional treatment. It is a leading cause of decreased vision in one eye in children and younger adults. In this condition almost always one eye is affected but rarely vision in both eyes can be affected. It occurs due to developmental problems in the brain. In this condition the nerve pathways in areas of the brain responsible for processing sight do not function in a correctly needed manner. It is a neurological condition in which the nerve pathway connecting the eye to the brain is not working properly so the problem is in the brain and not in the eye, so lazy eye is a misleading term. In the early period of visual and brain development of a child usually between birth to 6 yrs any sort of interference occurs with focusing and getting clear vision in either eye predisposes towards a lazy eye. The interference makes a person start using one eye more than the other and the eye which is used less becomes weaker over time. The common cause behind it include constant strabismus or squint (A condition in which the eyes are not able to align properly with each other when looking at an object. So they look in different directions and not at the same object at the same time. It occurs from imbalance in the muscles that position the eyes and the eyes can cross in or turn out while looking at an object). Next cause is the difference in level of vision and or prescription between both the eyes. It could be from farsightedness (in this condition a person can see distant objects clearly but the nearby objects appear blurry), nearsightedness (in this condition a person can see near objects clearly but objects farther away appear blurry to him) or astigmatism (in this the lens of the eye or the cornea has an irregular curve that change the way light passes or refracts on retina causing distorted or blurry vision). This type is known as anisometropic amblyopia or refractive amblyopia. Another cause is blockage of vision in one eye as from cataract ( opacification of the lens of the eye which is normally clear), corneal ulcer / a scar, ptosis (drooping of the eyelid), injury to eye, eye surgery. Other causes include glaucoma (increased intraocular pressure which can cause vision problems and blindness), vitamin A deficiency. Premature birth, family history of lazy eye and developmental disabilities are some of the risk factors. It usually develops in childhood between birth to age of 7 yrs. Amblyopia mostly occurs in only one eye. In this condition there is inability to focus properly with one eye but the other eye is normal and can see clearly. The affected eye otherwise appears normal when looked at so it may not be detected by children and parents. It may not be diagnosed till it becomes severe or is only diagnosed during a routine eye test of the child. Some of its signs and symptoms include wandering of an eye inward or outward, squint, head tilting, blurred vision, double vision (diplopia), eyes appearing to not work together, and poor depth perception (problem in estimating distance and telling how near or far away something is). Homeopathic medicines aim to halt its further progression and provide symptomatic relief to the person. Use of these medicines should be considered in early stages. There are chances of good improvement when the treatment is started at a young age soon after being diagnosed usually before the age of 7yrs. It is advisable to take these medicines along with conventional treatment to get best possible conjoined help from both these systems of treatment. This condition can lead to permanent blindness if not treated properly at a right time. So one must use any homeopathic medicine under the supervision and guidance of a homeopathic physician after proper case study and avoid self prescription. It is a leading medicine for cases of lazy eye. It is highly useful to manage blurring or dimness of vision. Persons needing it may have nearsightedness that is gradually or rapidly increasing. They can see near objects but the distant objects appear blurred as if covered in a smoke. It is one of the best medicines for managing the cases of glaucoma (with shooting eye pain, sparks or flickering before eyes). So in a case where glaucoma is linked with a lazy eye, use of this medicine can be considered.\n• Gelsemium – For Difficulty Following Movement of Objects It is the next prominent medicine for cases of lazy eye. This medicine is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. Persons needing it have dimness of vision. Due to dim vision there is difficulty following movements of objects. There is also difficulty in reading and writing. They may also have double vision. Double vision is mainly present when looking sideways. Apart from these it is a very effective medicine for managing glaucoma, squint, astigmatism and drooping of eyelids (ptosis). So this medicine can also be used if any of these conditions is linked with lazy eye. Homeopathic medicine Ruta is prepared from a plant named Ruta graveolens commonly known as Rue. The plant belongs to the family rutaceae. It is also a very beneficial medicine for managing cases of lazy eye. Its use is mainly recommended when lazy eye is associated with errors of refraction (nearsightedness, farsightedness, astigmatism). In cases requiring it weakness of vision, dullness of sight, obscured vision for distance are usually present. The vision dimness worsens from straining the eyes. With blurred vision pain in and over eyes can also be present.\n• Natrum Mur – For Dimness of Sight and Double Vision It is another important medicine for cases of lazy eye. It is indicated when there is complaint of dimness of sight and double vision. In such cases there is sensation as if objects are covered with cloth. There appears pressure in the eyes when intently looking at anything. There is obscuration of sight mainly while walking, reading, writing. It is also a great medicine for ulcers of the cornea (with photophobia means sensitivity to light, much eye discharge, smarting, burning in eyes and sensation of sand in eyes). Next it is also an important medicine for cases of strabismus since childhood.\n• China – For Weakness of Vision for Distant Objects This medicine is prepared from dried bark of plant Cinchona officinalis commonly known as Peruvian bark. It belongs to the family rubiaceae. It is indicated when there is marked weakness of vision for distant objects. In cases needing it only large objects could be distinguished at distance. There may be better vision in the morning. Other than this, there is also difficulty in reading where letters seem to run together. This medicine also covers ulceration of cornea. This medicine is specifically indicated for traumatic amblyopia occurring from a blow. People needing it see smoke before them. They sometimes also see a black spot before eyes that worsens at night. They have dimness of sight especially at night and in morning. They feel objects look clearer in clear weather. They also feel fatigue in their eyes after reading. This medicine is prepared from fresh plant named Drosera rotundifolia. Commonly known as round – leaved sundew. It belongs to the family droseraceae. It is a useful medicine when a person has difficulty in reading and letters appear blurred and run together during reading. There is frequent vanishing of sight while reading. People experience farsightedness. There is a weakness of eyes when looking at small objects. This is yet another helpful medicine for lazy eye. It helps cases when there is weak, dim vision. There are also frequent episodes of temporary loss of vision. In some cases that require it there are always dark spots or a sensation of cloud before the sight. Heated sensation and watering from eyes is a symptom that can attend to it. This medicine is prepared from plant thorn apple that belongs to the family solanaceae. It is well indicated for dimness of vision especially in the morning time. Persons needing it feels as if vision is cloudy or there is a fog before eyes. In the morning they tend to bump into objects as if they are in the dark. They also have problems while reading, at that time letters appear blurred and as if they are moving. Apart from above it is one of the best medicines for cases of strabismus (squint) so can be used in lazy eye cases with this complaint. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Esophagitis refers to inflammation of the esophagus (a tube through which food and drink passes from mouth to stomach). It can lead to damage of tissue of the esophagus, alter its structure or cause problems with its normal function. Homeopathic Remedies for Esophagitis help to reduce the inflammation of esophagus and effectively manage its symptoms. It can have various causes. The most common cause behind it is GERD (gastroesophageal reflux disease). In this condition there is backflow of stomach acid in the food pipe that can irritate its lining and lead to inflammation. Next it can arise from infections. Another reason behind it is use of certain medicines (NSAIDs , some antibiotics, steroids). Apart from this risk factors for it includes alcohol abuse, excessive cigarette use, radiation therapy, chemotherapy, chemical injury by alkaline or acid solutions, physical injury, weak immune system, stress, allergies, crohn’s disease (an autoimmune disease that causes inflammation and damage to gastrointestinal system), chronic vomiting, obesity, hiatal hernia (condition in which stomach bulges out from hiatus opening in diaphragm into chest), intense use of Vitamins and supplements, surgery in the chest area. This type usually results from GERD (gastroesophageal reflux disease). In this disease there is backflow of stomach acid upwards in the food pipe. There is a valve known as LES – lower esophageal sphincter, that keeps the stomach acid in the stomach and prevents its back flow. This valve opens only when food has to enter the stomach from the food pipe and is closed at all other times. When this valve opens at times other than eating or doesn’t close rightly then the stomach contents can get back in the food pipe. If this occurs frequently for a long time then acid content from the stomach can inflame and damage the lining of the food pipe and this condition is known as reflux esophagitis. There are some factors that increase the chance of GERD and inflammation of esophagus due to stomach acid. This includes taking excessive alcohol, coffee, chocolate, smoking, eating excessive fat and going to bed immediately after eating. This type occurs from an excessive number of eosinophils (a type of WBC – white blood cell that plays a role in allergic reactions) in the esophagus usually from an over reactive response to an allergen or acid reflux. There are some of the common food triggers for it, for eg, foods such as milk, eggs, soy, peanuts, wheat and shellfish. It can also result from inhaling an allergen like pollen. It is a rare type that occurs from an excessive number of lymphocytes (a type of white blood cells) in the esophageal lining. Crohn’s disease, GERD are some diseases associated with it. This results from taking some of the oral medicines with a very little amount of water. It increases the contact time of medicine with the lining of the food pipe. Some of the examples of these medicines include pain relievers (aspirin,ibuprofen), antibiotics (tetracycline), bisphosphonates, quinidine and potassium chloride. It is rare and can occur from a bacterial, viral, fungal or parasitic infection in the esophagus. This type mostly affects people having weak immune systems. Among infections fungus called Candida albicans is common cause of this type. These fungal infections are common in people with low immunity, people who are diabetic, have cancer or those who use steroids. Its symptoms include difficulty swallowing, pain while swallowing, heartburn, pain in the chest behind the breastbone while eating, food getting stuck in the food pipe. Other symptoms that can occur includes nausea, vomiting, decrease in appetite, epigastric pain, sore throat, hoarse voice and cough. Young children may have feeding difficulty and failure to thrive. If not treated well in time there can occur changes in the structure and function of the esophagus. Firstly it can lead to scarring, narrowing (stricture) in the esophagus. Next there can occur ulcers in the esophagus. Another complication is tearing or perforation of the esophagus. Lastly it can lead to Barrett’s esophagus (it is a precancerous condition in which there occurs damage to esophageal lining and changes in cells that line the esophagus which increases the risk of esophageal cancer). Homeopathy offers a very effective treatment for cases of esophagitis. Homeopathic medicines help to reduce the inflammation of esophagus and effectively manage its symptoms. Symptoms including difficult swallowing, painful swallowing, heartburn, sensation of food getting stuck in the food pipe, nausea, vomiting, epigastric pain can be well managed with these medicines. In mild to moderate cases they can be used as per the symptoms present. But in severe and complicated cases one must consider use of conventional treatment. Arsenic Album is a leading medicine for treating cases of esophagitis. Persons needing it have marked burning in the food pipe (heartburn). Burning is felt when swallowing the food. The burning is so intense as if esophagus is made raw by an acidic substance. Along with this nausea may attend. They may also have stinging sensation in the esophagus as from a splinter. Another complaint that they have is very difficult and painful swallowing. They also have a sensation as if everything swallowed gets lodged in the esophagus. Soreness of the throat and pain in the throat may also be felt by them. Vomiting may also be present in addition to above symptoms. This medicine is prepared from the root of the plant commonly named Blue flag. This plant belongs to the family Iridaceae. It is a highly recommended medicine for managing heartburn. In cases needing it there can also be continuous nausea. Vomiting is there which is sour, acrid in nature. This medicine is prepared from plant Robinia Pseudoacacia. This plant belongs to family leguminosae. It is a very suitable medicine to manage heartburn and acid reflux. Persons who need it mainly get heartburn at night time on lying down. They also have nausea. Another important symptom that is present is vomiting of intensely sour fluid.\n• Causticum – When There is Sensation of Food Lodging in Esophagus This medicine is beneficial for the cases when there is sensation of food lodging in the esophagus. Other than this there is nausea during or after a meal in cases that require this medicine. Next attending symptom is vomiting of acidic water or food. In many cases pressive, cramp – like pains or shooting type of pain is felt in the abdomen in the epigastric region. Phosphorus is another prominent medicine for these cases. It is indicated when the esophagus is there. Along with this there is difficulty swallowing liquids. Nausea and vomiting may also be present along with this. It is also a medicine for managing cases of stricture of esophagus. Alumina is a beneficial medicine to manage painful swallowing. Persons needing it have difficulty in swallowing solid food. They can take food in small pieces only. They feel taking warm drinks help to relieve this complaint. They also feel pressure pain in the region of esophagus as if it is contracted or compressed. This occurs mostly during swallowing.\n• Carbo veg – With Heartburn and Pain in Epigastrium Carbo veg is helpful for managing heartburn and pain in epigastrium. The pain in epigastrium can be aching or burning type. The pain gets worse after eating. Epigastric region is also very sensitive. Sensation of rawness in the food pipe and stomach are also felt. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage complaints of difficult and painful swallowing. Persons needing it have to swallow water to move down the solid food. They also feel burning, stinging and dryness in the food pipe. Sometimes contraction in esophagus is also felt. Along with this, pain in stomach, nausea, vomiting may also be present. It is a significant medicine for cases having difficulty swallowing. In such cases there is difficulty and pain in swallowing solids. When food reaches a particular point in the food pipe it gets difficult to go down further from inflammation at this point. This medicine is also indicated for managing cases of esophagitis occurring after corrosive substances. This medicine is prepared from the fresh root of a plant commonly known as American White Hellebore also called as Indian Poke. It belongs to the family melanthiaceae of the Liliaceae. Use of this medicine is considered when there is nausea and vomiting in these cases. Along with this burning is marked in the food pipe with constant desire to swallow. It is most helpful for acute cases of esophagitis.\n• Gelsemium – With Sensation of Something Lodged in Esophagus Homeopathic medicine Gelsemium is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. The main indication to use this medicine is sensation of something lodged in the esophagus. Pain attends to this. Cramping sensation is also felt in esophagus. Another accompanying symptom is burning in esophagus that can extend to the stomach.\n• Iodum – For Inflammation and Ulcers of Esophagus This medicine is prominent for cases in which inflammation and ulcers of esophagus are there. Persons needing it have a sensation of burning and scraping in the food pipe. They also feel pain in the food pipe. Swallowing is also difficult among them. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Albuminuria refers to a condition in which albumin (a type of protein) abnormally passes in the urine. Albumin is a major type of protein made in the liver that normally circulates in the blood. Homeopathic medicines for albuminuria mainly play a supportive role in managing such cases. Albumin is the most abundant and significant protein in the blood circulation. It helps in maintaining the right amount of fluid flowing throughout the body and acts as a carrier for fatty acid, thyroid hormones and steroids. The protein should remain in blood and never enter urine under normal circumstances. But when the protein albumin abnormally seeps in the urine it is referred to as albuminuria. The kidneys function to filter the blood in the body. When blood passes through the kidneys it keeps the things required by the body like protein but eliminates the things not needed out of the body as urine. The kidneys have got glomeruli which act as filters. When functioning normally, the protein cannot pass through the filter and enter urine or a very little trace of protein can pass in urine. But in case of damaged kidney excessive albumin can leak out of the kidneys into urine. Some of the conditions that cause a temporary increase of albumin in urine includes dehydration, stress, intense physical activity, cold weather, fever and side effects of some medications. Furthermore, the medical conditions that can lead to rise of albumin levels in the urine. First among them is diabetes, hypertension (high blood pressure – B.P.), kidney inflammation – nephritis, glomerulonephritis (inflammation of the glomeruli which are the structures made of tiny blood vessels in kidneys that filter blood), nephrotic syndrome (a kidney disorder in which body to pass too much protein in urine). physical trauma to the kidneys, cardiovascular disease like endocarditis (inflammation of the endocardium which is the inner layer of the heart). These medical conditions need urgent medical help as these can result in severe complications like kidney failure. People with diabetes, high blood pressure, elderly people above age of 65 yrs, individuals having family history of kidney disease are at high risk of albuminuria. Such people need to get tested for urine albumin quite frequently so that any kidney damage is detected and managed in time and further complications be prevented. It denotes the start of kidney damage with moderate increase in the albumin levels in the urine. When kidney damage is slight the albumin passes in urine in small quantities ( around 30mg to 300mg within the twenty four hour time frame ). When kidney function is greatly affected there is excessive passing of albumin in the urine denoting macroalbuminuria. The kidney allows passage of large amounts of albumin into the urine (more than 300 mg within the twenty four hour time frame). It indicates a serious kidney condition. It is mostly asymptomatic in the beginning stages. But when there is passage of a large amount of albumin in urine, there maybe some signs that give an indication towards it. First among them is urine having whitish foam or urine looking frothy. Next sign is swelling of the ankles, hands, eyes, face, legs, belly. The swelling occurs when abundant albumin passes in urine and results in low levels of protein in the blood. The low protein levels in blood leads to movement of fluid through the blood vessels walls into tissue. Cases of albuminuria need immediate medical attention to prevent serious complications. Homeopathic medicines mainly play a supportive role in managing cases of albuminuria. These medicines can be used along with conventional treatment for halting its further progression. Additionally they help in reducing oedema (swelling ) linked with it. Other than these homeopathic medicines also work towards managing associated symptoms like burning / painful urine, frequent urine, scanty urine, kidney pain. Albuminuria can have serious effects on the body and can lead to kidney damage. So one should use homeopathic medicines along with conventional treatment, that too under supervision of a homeopathic physician and never self prescribe any of these medicines. Apis Mellifica is a leading medicine for albuminuria. In cases needing it urine is frothy. Urine is also scanty. It can also contain blood. Urine is hot and can have an offensive smell. Along with this there is marked oedema. Here swelling is present on the face, hands, legs, and there is puffing of eyelids. Burning while urinating may also be present. Other than this sudden pain along the ureter can occur frequently. It is also considered for albuminuria with nephritis. This medicine is well indicated for early stages of albuminuria. Along with albumin, blood can also appear in urine where it is required. Pain, especially dull, aching type over kidney region may also be felt. There is swelling of lids, face and feet along with above symptoms. The urine is scanty and appears cloudy. Urine may also be fetid. It is also a prominent medicine for cases of nephritis.\n• Calcarea Arsenicosa – For Frequent Urine with Excessive Albumin in Urine It is a significant medicine for cases with frequent urine and excessive amounts of albumin in urine. People requiring it pass urine almost every hour. There is burning while urination and urine is scanty. Along with this great sensitivity of the kidney region to pressure is present. Swelling over the face and back of hands is also there. It is also a well indicated medicine for albuminuria during pregnancy.\n• Merc Cor – When Urine is Scanty and Have Albumin and Blood Merc Cor is a valuable medicine for cases where urine is scanty and contains albumin and blood. Urine is also hot, burning. There is frequent urge to urinate. Urine passes with pain and sometimes in drops. Swelling of the face is also there.\n• Nitric Acid – For Albuminuria with Pressure in Kidney Region This medicine is indicated for albuminuria with pressure in the kidney region. Urine is highly offensive in cases needing it. Urine appears turbid. Along with albumin urine may also contain mucus, pus and blood. There is frequent urging to urinate with scanty discharge. Oedema of feet, excessive weakness and nausea are other complaints that can attend. Cantharis is a very beneficial medicine when there is albuminuria and burning, painful urination. The pain and burning can be felt before, during or after urination. It is a top listed medicine for nephritis with blood in urine. Persons who need it may have pain in the kidney area. Kidney region may also be sensitive to the slightest touch. They have frequent urges to urinate but pass only scanty urine. The urine is turbid and scanty. It may appear cloudy during the night with white sediment. Urine may also contain blood and cylindrical casts.\n• Plumbum Met – When Urine is Scanty and Contains Albumin, Oxalate, Epithelial Cells, Hyaline Casts Plumbum Met is used when urine is scanty and contains albumin, oxalate, epithelial cells, hyaline casts. It may also contain RBC’s (red blood cells). Along with this there is excessive oedema (swelling) of eyelids. Intense weakness can accompany these symptoms.\n• Dulcamara -For Albumin in Urine, Swelling and Kidney Pain This medicine is prepared from fresh green stems and leaves of plant Solanum dulcamara having the common name Woody Nightshade and Bitter – sweet. This plant belongs to family solanaceae. It is indicated when the urine contains albumin and there is swelling in body tissue and pain in the kidney region. Along with this there is a constant desire to urinate. Urine is turbid, scanty, offensive and may contain tough, jelly – like, white or red mucus. This is a well indicated medicine for albuminuria and diabetes. There is swelling of lower limbs where it is required. There may also be pain in the kidney , especially the left side. The urine is frequent and profuse. It may be thick and have milky / white sediment. This medicine is prepared from the root of plant Helonias dioica also known as Blazing Star. This plant belongs to family melanthiaceae. Its use is suggested when there is kidney pain with albumin in urine. Other than this weight and burning sensation is felt in the kidneys. The right kidney may be sensitive. There is frequent urge to urinate and burning scalding pain can be felt when urinating.\n• Uranium Nitricum – For Albuminuria and Constant Pain and Soreness in Nack The indicating feature to use this medicine is albuminuria and constant pain and soreness in back. With this the urine is profuse and can be painful. It can be milky and have specific ammoniacal odour. There is frequent urination mainly at night. Excessive weakness and heaviness / pain, weariness in legs are few other accompanying symptoms. This medicine is prepared from plant Chimaphila Umbellata commonly known as Pipsissewa and Ground Holly. It belongs to the family pyroleae. This medicine is indicated for the last stages of albuminuria. In cases needing it constant pain is felt in the kidney region. Urine is scanty, fetid, very thick and contains albumin. Sometimes urine contains thick, ropy, bloody mucus. There is frequent desire to urinate with scanty urine. Scalding and smarting pain is felt during and after urination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Vaccines during childhood give protection to children against many serious diseases. For example DPT vaccine protects against diphtheria, tetanus, whooping cough (pertussis); MMR vaccine protects against measles, mumps, rubella; OPV protects against polio; HiB vaccine protects against Haemophilus influenzae type B infection. Though vaccine use is safe but like many other medicines any of the vaccine can cause some side-effects though mild in most cases. This occurs from a natural response of the body while it is directed towards immunity building against the disease for which vaccination is given. These side effects last from a few hours to one or two days after vaccination. Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination. Some of the side effects that can occur after inactivated poliovirus vaccine (IPV), DPT, Pneumococcal conjugate vaccine (PCV), Haemophilus influenzae type B vaccine (HiB vaccine). They mostly appear within 24 hrs of vaccination. These include mild fever; pain, soreness, tenderness, swelling or redness at the site of the injection; loss of appetite; diarrhoea; vomiting; tiredness; sluggishness and irritability; fussiness; secondary blister elsewhere on the body. Other than this side effects can occur 6 to 10 days after injection in case of MMR vaccine. These include mild fever, measles like rash, cough, runny nose, puffy eyes, swelling of salivary glands and loss of appetite. Next vaccine is rotavirus vaccine that can sometimes lead to diarrhoea, abdominal pain, restlessness and irritability in children. Other side effects that can occur after vaccination include small, red lump at the injection site. In some vaccines temporary headache, muscle or joint pain, runny nose, nasal congestion, trouble sleeping or drowsiness and being sleepy than usual. In case of high temperature rarely febrile seizures or fits can occur in young children. The chance of febrile seizure is high if a child has a history of such seizure earlier in his life or have a family history of seizures. In any of the vaccinations there are very rare chances (even less than one in million) of severe allergic reaction known as anaphylaxis. Swelling of face, hives, difficulty in breathing and even collapse can occur in severe allergic reactions. This tends to happen within minutes of taking the vaccination. This needs medical help right away without any delay. Homeopathy offers a very natural, effective, safe and gentle management of various ailments that arise after vaccination. These medicines are helpful to manage complaints of fever, diarrhoea, stomach pain, skin complaints, sleeplessness, redness, inflammation and swelling of arm, weakness headache, excessive sleep , runny nose, nasal congestion, cough, muscle or joint pain. In case of seizures use of homeopathic medicine should be considered along with conventional treatment. It is to be noted that homeopathic medicines have their own limitations to treat cases of severe reaction – anaphylaxis ( some of its signs and symptoms are swelling of tongue, throat, trouble breathing, rapid heartbeat, sudden drop of blood pressure). In such cases one must take immediate medical help from conventional mode of treatment without delay as it is a life threatening condition. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly named as Arbor Vitae. This plant belongs to family Coniferae. It is a leading medicine for managing numerous complaints arising after vaccination. Firstly it is indicated for diarrhoea after vaccination. It also helps in stomach pain in such cases. Secondly it is indicated for skin complaints, skin eruptions and skin growths that follow vaccination. Its third indication in these cases is seizures. Next it works effectively to manage sleeplessness that follows vaccination. Lastly it helps cases of weakness of legs that occur after re vaccination. Silicea is another highly valuable medicine for managing many issues that follows vaccination. Here it is well indicated for managing redness, inflammation and swelling of the arm that can appear after vaccination. Next it helps to manage weakness and lack of stamina in such cases. Another main indication for its use is nausea and loose motion that appear after vaccination sometimes. Headache, excessive sleep from vaccination are also well managed with this medicine. Apart from above indication seizures and weight loss are the rest of complaints where this medicine is indicated.\n• Ledum Pal – For Swelling, Redness and Inflammation of Arm This medicine is prepared from plant Ledum Palustre commonly known as wild rosemary and also marsh cistus. This plant belongs to family ericaceae. It is a foremost medicine in homeopathy for puncture wounds as arising from needle prick. Here it is beneficial medicine to manage swelling, redness and inflammation of the arm after vaccination injection. This medicine is also considered as a preventive for side effects of vaccination. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage fever after vaccination. In cases needing it the heat stage is prominent. There is burning heat over the whole body but especially most prominent in the head and face. Body feels burning hot like fire. With this redness of face is also there. Anxiety and restlessness is present with the internal heat of the body. There is excessive thirst during the heat stage. The heat stage alternates with the chill stage. In this stage there is coldness of limbs with heat in head. Violent chill is felt in the back. Apart from above it can also be used for managing redness, inflammation and swelling of the arm appearing after vaccination injection. This medicine is prepared from plant Podophyllum peltatum commonly known as May Apple. This plant belongs to the family berberidaceae. It is a well indicated medicine to manage diarrhoea. In cases requiring it the stool is watery, profuse and gushing. It can be yellowish or greenish in colour and has a very offensive smell. The stool can be frothy and have mucus in it sometimes. There is a sudden urge to pass stool. Fetid flatus is present with this. There is an urge for stool immediately after eating and drinking. Diarrhoea is usually painless where it is required. Intense nausea can be present before passing the stool. After passing stool, extreme weakness is felt by the person. It is a prominent medicine for managing skin rash appearing after vaccination. Violent itching is present in the rash where it is required. The itching is worse from warmth of bed and is better in the open air. Stinging and burning is marked in the rash. Skin is also sensitive to the slightest touch along with above symptoms. It is a very beneficial medicine for skin eruptions that can occur after vaccination. The eruptions are pustular where it is required. These eruptions are most marked on the scalp, face, and legs. It is also indicated for scabby eruptions on scalp, arms and legs appearing after vaccination. Arsenic Album is a very helpful medicine for managing runny nose and nasal congestion. In cases needing it there is profuse and watery discharge from the nose. It can lead to burning sensation, excoriation in the nostrils. In some cases stoppage of the nose and fluent runny nose alternate with each other that requires this medicine. Great weakness may attend the above symptoms. This medicine is prepared from plant Drosera Rotundifolia having a common name round – leaved sundew. This plant belongs to family droseraceae. It is an effective medicine to manage dry irritative cough. Along with cough roughness, dryness and tickling sensation is felt in the fauces. People needing it mainly complain of cough getting worse from lying down in the evening and from warmth. This medicine offers great help in cases of loose cough with rattling of mucus in the chest. Cough is present day and night. Chest feels congested from mucus in the chest. Scanty, thick, phlegm is expectorated in these cases. Expectoration is difficult. Rhus Tox is a very effective medicine to manage joint pain and muscle pain. It brings great relief in this complaint. The pain may be worse at rest and better by motion where this medicine is required. In cases needing it, stiffness of joints may also be present. The stiffness tends to get better by warmth and also by massage. This medicine is prepared from the fresh root of plant Cicuta Virosa having the common name water hemlock. This plant belongs to the family umbelliferae. This medicine can be used along with conventional treatment for managing seizures after vaccination. In cases needing it the fits occur with frightful distortion of the limbs or whole body. Loss of consciousness and frothing at mouth may occur with this. High fever is present along with above symptoms. Homeopathic medicine Malandrium is particularly indicated for managing cases where dryness, hardness and roughness of skin occurs after vaccination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Angioedema refers to edema or swelling underneath the skin that can become severe. It usually occurs from an allergic reaction. This swelling can appear with hives that’s why it is sometimes called giant hives. Hives also known as urticaria refers to itchy, elevated, red welts/wheals or bumps on the skin surface that occur mostly from an allergic reaction. Homeopathic Remedies for Angioedema are beneficial in all types of angioedema with symptoms having mild to moderate intensity. Angioedema is a harmless condition in most cases and gets well in a few days. However, in serious cases the tongue that can cause blockage of airways and difficulty in breathing that needs prompt medical help. Severe angioedema may be a part of a dangerous medical condition called anaphylaxis needing emergency treatment. Anaphylaxis is a severe allergic reaction in which there appears swelling of lips, tongue and throat that blocks airways and leads to breathing problems, rapid heartbeat, sudden drop of blood pressure, dizziness and sometimes fainting. Anaphylaxis is a severe life threatening condition that should be urgently treated with conventional treatment. It most commonly arises from an allergic reaction and this type is known as allergic angioedema. The allergic reaction can occur from certain foods like eggs, peanuts, fish, shellfish and milk. This reaction can also occur from insect bites, pollen, animal dander, latex and poison ivy. The body detects a substance (like any of the above) as something dangerous. Following this there is release of histamine by the body that causes dilatation of the blood vessels and fluid leakage. In severe cases of allergic angioedema, anaphylaxis can occur with swelling of throat, difficulty in breathing and sudden drop in blood pressure. It is a medical emergency needing immediate medical help. It can also arise from the use of certain medicines called drug – induced angioedema. Few medicines that can lead to it include aspirin, NSAID’s (non steroidal anti inflammatory drugs), penicillin, antibiotics and some of the medicines used to control high BP (blood pressure). Thirdly, it may occur after an infection or with illnesses like SLE (It is an autoimmune disease in which the immune system attacks and damages healthy tissues of the body. It can affect skin, kidneys, blood vessels, lungs, heart, nervous system, muscles, bones, eyes). Another medical condition linked with it is leukaemia (cancer of blood cells). Other than this a medical condition lymphoma is associated with it. Lymphoma refers to a cancer beginning in lymphocytes which are cells of the immune system that help to fight with infection. In case of lymphoma these lymphocytes change and keep multiplying out of control. Rarely it can occur in people having a family history of it where it is called as hereditary angioedema. Here a person has inherited this condition from a parent through genetic transmission. In hereditary angioedema the body is unable to make a blood protein called C1 esterase inhibitor in the right amount that results in fluid movement from the blood into tissues resulting in swelling. Other than this it can arise if a person has a weak immune system where it is called as acquired angioedema. Lastly, it can be idiopathic type where no cause is ruled out behind swelling. Some factors linked with it include stress, anxiety, intense exercise, exposure to heat and cold and minor infection. Its main sign is swelling below the skin. The swelling can develop suddenly or gradually in a few hours. Sometimes it may be attended with swelling and welts on the surface of the skin (hives) that may be painful and itchy. Redness, warmth and pain can appear in the swollen area. The swelling mainly occurs on the face especially around the eyes, lips; around the mouth; hands, feet, arms, legs; tongue. In severe cases the swelling can spread to other body parts. The swelling can also occur around the genitals and in intestines. Apart from above abdominal cramping, intense vomiting, redness irritation of eyes, diarrhoea (loose motion), weakness and dizziness can also occur. In some cases swelling appears in the throat with hoarseness, and difficulty in breathing. In case of swelling of the throat and tongue with difficult breathing, urgent medical help needs to be taken as it can be dangerous. There is a great scope of treating angioedema in homeopathy. There are many natural homeopathic medicines that are very effective for reducing the swelling in these cases and treating hives. In case of allergic cases it brings great recovery by moderating the immune system which is causing allergic reaction. Homeopathic medicines are helpful to manage recent cases and long standing or recurrent cases. It is to be noted that homeopathic medicines can be safely taken as long as there is no swelling of throat, airways, tongue attended with difficulty breathing. In the severe cases where there is swelling of throat, airways, tongue that obstructs breathing immediate treatment with conventional mode is needed. Also homeopathy has a limitation in treating cases of anaphylaxis reaction where urgent help from conventional treatment is required without any delay. Apis Mellifica is a leading medicine for cases of angioedema. Persons needing it have swelling over the face mainly eyelids, lips; mouth; and hands, feet. Redness and heat in the face is marked. In males swelling can also appear in testicles. In females the swelling can occur on labia. Burning stinging pains are complained in the area of swelling. Along with these symptoms there are hives with wheals on skin. The wheals are red with intense burning, stinging sensation. They are painful, tender and itchy. The itching mostly gets worse at night time. Apart from above symptoms there may be redness and itching in the eyes. Symptoms of angioedema occurring after bee sting are also well treated with this medicine. These symptoms include stinging, burning sharp prickling pain in skin and excessive swelling.\n• Urtica Urens – For Hives and Marked Swelling of Face, Hands, Feet It is prepared from a plant called Stinging – nettle that belongs to the family Urticaceae. The fresh plant in flowers is used for preparing homeopathic medicine. It is well indicated for hives and marked swelling of face, hands, feet. In cases needing it the fingers and hands are much swollen with itching. Lumps and red spots on hands are present. The face, hands and feet are swollen with stinging, burning and redness. The eyelids are intensely swollen and can be scarcely opened. In the case of hives raised red blotches are there on skin. This is attended with itching, burning and stinging. It also helps cases of hives from eating shellfish.\n• Rhus Tox – For Hives with Oedema of Lids It is a very beneficial medicine like above to medicines for cases where hives are present with oedema of eyelids. For using this medicine the hives usually occur from getting wet and in cold air. The hives have burning and itching in it. Affected skin appears tense and shining. The wheals are excessive mostly on hand and forearm. There is marked stitching pain in the eruption This medicine is prominently indicated when oedematous swellings are attended with burning pain. Along with this urticarial eruptions are present. These eruptions also have much burning in them. Marked restlessness attends this. A general weakness may accompany the above symptoms. This medicine also helps to manage vomiting and loose stool in these cases. Urticaria from eating shellfish is also an indicating feature for using this medicine. It is the next important medicine for cases of angioedema. For using it the main symptoms are swelling, itching, redness, burning of skin. There appears circumscribed oedematous lesions. Itching is there that changes place on scratching. Hepar Sulph is a very useful medicine for cases of angioedema and long standing recurring urticaria. Swelling is mainly present on upper lip, hands and feet in cases requiring it. The wheals mainly appear on hands and fingers. Few general symptoms that are present include sticking, pricking on skin and sensitivity of skin to slightest touch.\n• Antipyrinum – Another Well Indicated Medicine For Angioedema Antipyrinum is also a well indicated medicine for angioedema. People needing it also have urticaria. In them the urticaria appears and disappears suddenly. It may be attended with internal coldness. Most intense itching is present in the eruptions. For using it the eruptions are mostly present between the fingers. This medicine is prepared from the root of a plant called Helleborus Niger commonly known as Black Hellebore and Christmas Rose. It belongs to family ranunculaceae. It is indicated when there occurs sudden swelling of skin. Edema occurs on the face along with redness. Edema also appears on legs. Legal Disclaimer -None of the medicines mentioned including services , mentioned at Drhomeo.com should be used without clearance from your physician or health care provider. We do not claim to cure any disease which is considered' incurable ' on the basis of scientific facts by modern medicine .The website’s content is not a substitute for direct, personal, professional medical care and diagnosis. . They most commonly occur in case of inflamed para nasal sinus (sinusitis). These sinuses can get inflamed from infections or from allergies (hay fever). Sinus infections can lead to sinus headaches. The infections cause mucus build up in the sinuses and cause congestion and headache. The infections can occur from common cold; seasonal allergies; nasal polyps and deviated nasal septum that blocks drainage of mucus from sinus and favours growth of germs that inflame sinus. Person having sinus headache may feel fullness pressure or pain in forehead, in cheeks, bridge of the nose or brows. The affected sinus area can also be tender to touch and red. The pain tends to get worse when first getting up out of bed, from moving your head suddenly and from leaning forward. Its other symptoms include sinus infection like stuffy nose, thick, green or yellow coloured mucus discharge from the nose, post nasal discharge (PND), swelling or puffiness of face, fever, aching in the upper jaw, fatigue. In case of infection of frontal sinus pain / pressure is felt in the forehead, above the eyes. In case of maxillary sinus involvement pain or pressure is felt in the cheek area. In ethmoidal sinusitis pain occurs between / behind the eyes, and the sides of the upper nasal area (medial canthi). When sphenoidal sinus is affected pain appears behind eyes, top of head or back of head. Homeopathic systems offer a very natural, safe and effective treatment for sinus headache cases. Homeopathic medicines help to relieve sinus headache by reducing the sinus congestion by treating the root cause behind it. It targets to treat the cause like infections, nasal allergies linked with sinus inflammation leading to sinus headache. These medicines are effective in both acute as well as chronic cases of sinus headache. Along with relieving the headache it also manages the attending nasal symptoms like stuffiness, nasal discharges , sneezing, post nasal discharge. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is a very effective medicine for sinus headache. It works very well in cases of frontal and maxillary sinusitis. In cases needing it, the frontal headache is marked. A pressive sensation or pressure in the forehead is felt where it is required. This worsens on motion and stooping. It also worsens from going in the open air. Next symptom that indicates its use is swelling of the cheek with pain of burning nature. Face may be red with warmth. Pain in the jaw , especially tearing in nature may also be present. Kali Bichrome is another well indicated medicine for these cases. Persons needing it complain of headaches in the forehead especially over one of the eyes. They usually feel shooting pains over the eyebrow. Next they can complain of pain in the forehead in the morning on awaking. They feel distress, fullness, severe pain in frontal sinuses. With this they discharge from the eyes and nose. They also feel weak along with this and may also have fever. Another main symptom that they have is post nasal discharge. Pain, tightness, fullness or pressure sensation at the root of the nose is also felt. With this they have a constant feeling of a stoppage of their nose. They may have a burning sensation in their nose. They may also feel a fetid smell in the nose. They feel their noses are constantly full of thick mucus. Discharge from the nose of tough, yellow or green color which is stringy, ropy or lumpy is passed. Sometimes there is discharge of crusts from the nose which are tinged with blood. Next they may have pain, shooting in nature in the cheeks mainly left sided. Pressure is also felt in the same region. This pain is also felt across the bridge of the nose.\n• Silicea – For Pain in Forehead and Nasal Discharge This is the next prominent medicine when pain is felt in the forehead. The pain for using this medicine is mostly throbbing, pulsating type. The pain may worsen from motion, stooping or cold air exposure. Wrapping up your head warmly gives relief. Along with the headache the head also feels very heavy. A major attending symptom is thick, green – yellow, offensive discharge from nose after getting up. Nose may feel stopped in the morning with this.\n• Hepar Sulph – When There is Pain at Root of The Nose This medicine is particularly helpful when there is pain at the root of the nose. This pain is most felt in morning time. An attending symptom is a stoppage of the nose in the morning. Thick, offensive smelling discharge from nose can accompany. This discharge may be sometimes blood tinged. A heated sensation and burning is felt in nostrils. Nose is painful and sensitive to touch. Other than this there may be headaches over eyes. Headache worsens when shaking the head.\n• Natrum Mur – For Heaviness / Pain in Forehead with Sneezing, Nasal Discharge It is a very important medicine when there is heaviness / pain in the forehead with sneezing and nasal discharge. A pressing sensation or a sensation of weight may also be felt in the forehead. This worsens from bending your head down. This sneezing is violent and worse in the early morning. The nasal discharge is watery and sometimes there is alteration between nasal discharge and nasal dryness. It’s a top listed medicine for nasal allergies. This medicine is prepared from the fresh root of the plant Hydrastis canadensis. This plant is commonly known as Golden Seal, Orange-root and Yellow Puccoon. This plant belongs to family ranunculaceae. This medicine offers great help in case of frontal headache over the eyes. A main accompanying symptom is dropping of mucus from back of nose into throat (post nasal discharge). In many cases the nose feels stuffed up. There is also discharge of thick, white, yellow or green tenacious, stringy mucus from the nose.\n• Pulsatilla – For Pain in Maxillary Sinus (Cheek), Nasal Stuffiness and Thick Nasal Discharge This medicine is prepared from plants named Pulsatilla Nigricans commonly known as wind flower or pasque flower. This plant belongs to family ranunculaceae. It is indicated when there is pain in maxillary sinus (located in cheeks), nasal stoppage and thick nasal discharge. The pain in maxillary sinus is tearing in nature that may extend into the ear. The nasal discharges are thick, yellow green coloured. They get worse indoors and get better in open air. In some cases requiring it dull, heavy sensation over frontal sinuses is also there.\n• Merc Sol – For Inflamed Frontal and Maxillary Sinus with Headache and Fluent Nasal Discharge This medicine is recommended for inflammation of frontal and maxillary sinus. Cases needing it present with headaches of pulsating kind in forehead. There is also pain in cheeks, and aching in jaws. Fluent nasal discharges are present with above symptoms. The discharge is acrid that causes rawness, soreness of nostrils. Sneezing is also there.\n• Sticta – For Pain in Forehead and Root of Nose, with Stuffy Nose It is another significant medicine for sinus headache. The key indication for using it is pain in forehead, root of nose along with stuffy nose. Sometimes heaviness and pressure is felt in the forehead. The nasal obstruction gets worse at night. In cases needing it the nasal secretions dry quickly and form scabs and are difficult to be discharged. Excessive sneezing attends it.\n• Bryonia – For Pain, Heaviness in Forehead Worsening from Stooping This medicine is prepared from the root of a plant named Bryonia alba or wild hops. This plant belongs to the family cucurbitaceae. It is beneficial for persons who complain of pain, heaviness in the forehead specifically from stooping. It may also worsen from motion. Fullness or pressure may also be felt in the forehead where this medicine is needed. It is also indicated for pain in the back of the head. Last indication for its use is pain on top of head in the morning on waking. This pain is mostly throbbing.\n• Kali Iodatum – For Pain Over Eyes and Watery Nasal Discharge This medicine works well in cases where pain over the eyes is present along with watery discharge from the nose. The discharge is hot, acrid and worsens in cold air. The frontal sinuses are inflamed. Violent sneezing is also there. Tightness at the root of the nose is also felt.\n• Gelsemium – For Pain Over Eyes and Back of Head This medicine is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. Its use is suggested for cases presenting with pain over eyes and back of head. A sensation of band around the head accompanies. The nasal symptoms that occur with this are sneezing in early morning, fullness at the root of nose and thin watery nasal discharge.\n\nRed eyes refers to redness of the white portion of the eye (sclera).Here the white of the eye may look pink, red, bloodshot or may appear to have pink/red lines on it. The eye redness occurs from dilatation of blood vessels on the surface of the eye from various reasons like irritation or an infection or inflammation. It can occur in one or both the eyes. Homeopathic medicines for red eyes offers very effective treatment and aims to treat the root cause behind it. In many cases redness of eyes occurs without any other symptoms. while in rest of the cases the symptoms that can attend it includes irritation or itching, burning in the eyes. Some other symptoms that may accompany it include discharge from the eye, watering from eyes, pain in eye and dryness in the eyes. Few other symptoms include sensitivity to light (photophobia) and blurred vision. Redness of eyes is very common and can arise from various causes. Firstly it can arise from many irritants that can inflame the eyes. These irritants include dust, dry air, sun exposure, air pollution, smoke. Secondly, it can occur from eye allergies, hay fever / allergic rhinitis (an allergic disorder that arise from exaggerated response of the immune cells to allergic substances causing running nose, sneezing, nasal blockage and eye symptoms like irritation, redness, itching and watering from eyes) It can also arise from infection (bacterial and viral) and inflammation of the eyes. There are various inflammatory conditions of the eyes that can cause redness of eyes. It includes conjunctivitis (inflammation of the conjunctiva which refers to a membrane that covers the white of the eye). It also includes scleritis (an inflammation and redness of sclera – white of eye which is the outer, tough fibrous protective layer of the eyeball). It can occur in episcleritis (inflammation of the thin layer present on the white part of the eye / sclera). Another inflammatory condition of the eye linked with redness of the eye is iritis (swelling and inflammation in the coloured ring that surrounds the pupil of the eye). Other eye inflammatory conditions are keratitis (an inflammation of the cornea which is the clear, dome shaped tissue in front of eye which covers the pupil and iris) and uveitis (inflammation of the middle layer of eye called uvea that is the pigmented layer lying between the inner retina and the outer fibrous layer composed of the sclera and cornea). Apart from above eye redness can happen in blepharitis (inflammation of the margins of the eyelids where eyelashes grow). In addition to above, it can arise in case of Chalazion (a type of cyst forming in the eyelid from blockage of meibomian gland responsible for producing an oily substance that lubricates the eye) and stye ( red, painful lump near the edge of eyelid either upper or lower occurring from a bacterial infection). Corneal ulcer, a scratch /abrasion on cornea, herpetic infection of cornea can lead to eye redness too. Rest of the reasons include excessive screen time on computer /mobiles, dryness of the eyes, foreign object in eye, trauma / injury to eye, inward turning of eyelid (entropion), outward turning of eyelid (ectropion), side effect of using eye drops, complication of eye surgery or complication from use of contact lens, subconjunctival haemorrhage ( bleeding arising from broken blood vessel immediately beneath the surface of the eye), infection of tissue around the eyes (orbital cellulitis), glaucoma (an eye disorder characterised by increase of intraocular pressure and optic nerve damage). Homeopathy offers very effective treatment for cases of red eyes. The homeopathic medicines aim to treat the root cause behind it like inflammation, infection to decrease the redness of eyes. Additionally they also help to relieve the attending symptoms like itching, burning in the eyes, discharge from eye, watering from eyes, pain in the eye and dryness in the eyes. Red eyes can arise from mild causes to serious causes that require emergency medical attention. Homeopathic medicines can help in cases where no serious causes are linked to it. But in case of serious cause behind red eyes it is advisable to seek immediate medical help from the conventional mode of treatment. Eye redness attended with sudden changes in vision, pain in eye, intense headache, fever, sensitivity to light, white rings, or halos around light, nausea or vomiting are some of the indications of serious issues. Other than this serious issues includes red eyes arising from an injury, from entry of chemicals or a foreign object in the eye. Before starting homeopathic medicines for red eyes it is strictly advisable to consult a homeopathic physician who can best judge the homeopathic medicines that will suit a particular case and can guide if urgent help is needed from conventional mode in case of some serious cause. It is a natural medicine prepared from plant deadly nightshade. This plant belongs to family solanaceae. It is a top listed medicine for cases of red eyes. In cases needing it the eyes look very red, congested. It works well in inflammatory conditions of the eyes mainly conjunctivitis. Other than redness, persons needing it also have dryness and burning pain in their eyes. They may also have shooting pain in their eyes. Another attending complaint that they have is watering from the eyes. Other attending symptoms are soreness, redness and swelling of eyelids. Sometimes there is sensitivity to bright light also. This medicine is prepared from plant Euphrasia Officinalis commonly known as eye – bright. This plant belongs to family scrophulariaceae. It is a very effective medicine for redness of eyes along with watering and itching of eyes. The eye watering causes smarting and burns in the eyes. A sensation of sand in eyes attends these symptoms. It is very helpful in case of iritis, conjunctivitis. Along with above symptoms pain in the eye may be present that is worse at night. Sometimes photophobia is also there. Aconite is prepared from plant Aconitum Napellus commonly known as monkshood. This plant belongs to family ranunculaceae. This is very helpful medicine for cases of red, bloodshot, inflamed eyes. With this burning, shooting pains are present that appear mainly on moving eyeballs. Another attending symptom is watering from eyes that is worse in evening and night time. Roughness sensation in the eyes as from sand also appears with this. Apart from above burning, a smarting sensation and itching in the eyes is present which worsens in evening. 4. Apis Mellifica – For Bright Red Eyes with Smarting, Burning, Cutting Pain in Eyes It is a well indicated medicine for cases where there is bright redness of eyes along with smarting, burning, cutting pain in eyes. The white of the eye is full of dark blood vessels. Along with this the eyes are very sensitive to light. Eyes are itchy too. It is well indicated for cases of conjunctivitis, keratitis and blepharitis. 5. Natrum Mur – For Eye Redness with Watering from Eyes This medicine is a prominent medicine for persons who complain of eye redness along with watering from eyes. They feel that the watering worsens in open air. This watering is acrid that leads to redness and soreness in eyes. They also have swelling of eyelids. Lids appear red, raw, ulcerated along with burning. The eyelids are sticky in the morning and covered with thick scabs. It is a well indicated medicine for eye redness and eye discharge. It is indicated especially for conjunctivitis and blepharitis. In cases needing it the eye appears intensely pink or red along with profuse discharge of mucopurulent nature. The white of the eye is congested, swollen. With this the eyelid margins are red, swollen and thick. Eyelids are also sore and crusty. The eyelids get stuck together in the morning. Itching and burning, biting in eyes is felt with this. This is a very useful medicine for cases where the eyes are red, itchy watery with frequent sneezing. Hence its use is considered in cases of hay fever (allergic rhinitis). The eyes are also sensitive to touch. Runny noses also accompany these symptoms. 8. Merc Sol – For Redness of Eye Attended with Burning Pains This medicine works well in cases of eye redness accompanied with burning pains. In cases needing it white of the eye is markedly red. Sensitivity to bright light is also there. The eyelids, especially the upper one, are thick, red and swollen . Copious watering from eyes is also there along with above symptoms. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly known as Arbor Vitae. This plant belongs to family Coniferae. Its use is considered in cases where eyes appear blood red. Along with this excessive tearing (watering) from eyes is present. The eyelids may be dry, scaly and sticky at night. Burning and stinging in the eyelids attend this. It is a leading medicine for treating styes and chalazion. It is also one of the major medicines for treating scleritis. Sulphur is a great medicine when the eyes are red along with itching and burning sensation. A feeling of sand in the eyes is also prominent with this. Sometimes stitching, smarting or stinging is felt in the eyes. This medicine also plays a supportive help for managing eye redness and light sensitivity in cases of corneal ulcers. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Sebaceous cysts are non-cancerous (benign) bumps under the skin that are filled with semi – solid material. They are very common and mostly found on the scalp, face, neck and back, though can develop anywhere on skin except the palms of hands and the soles of feet. Homeopathic remedies for sebaceous cysts help in resolving cysts by discharging and clearing off the contents & gradually shrink and dissolve these cysts. The term sebaceous cyst refers to either an epidermoid cyst which originates from the epidermis (top layer of the skin) or a pilar cyst that originate from the hair follicles. As these cyst don’t originate from sebaceous glands and don’t contain sebum, So the term sebaceous cyst is inappropriate for them. The true sebaceous cysts are the ones that originate from sebaceous glands (glands in the skin having an opening in the hair follicle gland where it secrete oily matter known as sebum). These cyst contain sebum (an oily matter produced by sebaceous glands that aid lubrication of the hair and skin). They are very rare and are known as steatocystoma simplex. The epidermoid cysts develop from the skin. The surface of the skin, known as the epidermis consists of thin layers of cells. These cells are constantly shed off. The epidermoid cysts develop from inward movement and trapping of skin cells and multiplying there in spite of moving out on the skin surface and shedding outside. They can also develop from any damage that causes cells on top of the skin to be implanted in the lower layer. They can follow irritation or injury to the skin too. The true sebaceous cysts can form due to deformed, damage or blockage of the duct of the sebaceous gland (this duct act a passage from where the sebum / oil is able to leave). It can follow a trauma like a surgical wound or scratch on the skin. Sometimes the cyst is linked to genetic conditions like Gardner’s syndrome (a rare genetic disorder in which there occurs multiple polyps in the colon i.e. large intestine along with some other tumours outside the colon. The other tumours outside the colon may include fibromas, epidermoid cyst, desmoid tumours, osteomas of skull). In many cases no cause can be ruled out behind the sebaceous cyst. They are felt as a lump under the skin. They grow very slowly, are harmless and usually do not cause any problem but can be uncomfortable and cosmetically look bad. Though they can occur on any body part, they are more common on the scalp, face, neck, back, chest and ears. In males they commonly develop in scrotum and chest. They may contain fibrous tissue, fluids. They may also contain keratin (a strong protein present in the skin, nails and also teeth). Next they may be filled with somewhat viscous, serosanguineous fluid that contains pus and blood. The type of the contents of the cyst vary depending on if the cyst is infected or not. The size can vary from a few mm to around 5 cm. These are round in shape and when touched these cyst feels smooth, mostly soft and movable. The small cyst are not painful and tender to touch. But when they are large they can be painful and cause pressure on the surrounding parts. They also become painful if they get infected, damaged or inflamed. When infected or inflamed the skin over the cyst becomes red, tender and sore. A thick, yellow, cheesy, bad smelling material may sometimes drain from the cyst. The cyst should not be scratched, pricked popped or squeezed to prevent chance of infection. These cysts are commonly found in the hairy areas of the body. In long standing cases the hair on the surface of skin above the cyst may be lost. Most times no complications occur in it. But sometimes few complications can arise. The first complication that can arise is its fixation if it extends deep in the body and connects to underlying tissue and forms a fixed lump that does not move. Next complication is infection (when bacteria gain entry in the cyst) resulting in abscess formation. Other complications include inflammation and rupture of the sebaceous cysts. Very rarely epidermoid cysts can lead to skin cancer. Homeopathy carries a good scope to treat these cysts. There are numerous homeopathic medicines that can help in dissolving, shrinking these cysts. These medicines halt further growth and increase the size of these cysts. The results vary from case to case depending upon the size and duration of the cyst. The medicines for its treatment are of natural origin so they treat them in a very safe, mild, gentle way without any side effects. These medicines are very effective and may even subside the need of surgical intervention in many cases of cyst. Silicea is a very effective homeopathic medicine for treating cases of different types of cysts including sebaceous cyst. It possesses a great ability to shrink and dissolve the cysts. It is also indicated for cases where infection has occurred with abscess formation. In such cases pus discharge is present. The pus is scanty. It has a bad smell. Its use is also recommended for sebaceous cyst on the scalp. Such cyst are smooth and appear shiny where this medicine is required. This is the next very beneficial medicine for treatment of various kind of cysts and tumours. It is most prominently indicated for cyst on the scalp. Scalp may be sensitive to touch in cases needing it. Apart from this it offers help in case of fatty tumours, swollen and hard indurated glands. Graphites is yet another well-indicated medicine having a marked action on dissolving the cysts. Like Baryta Carb, it is also a significant medicine for treating sebaceous cyst on the scalp. For using it the cyst is large and smooth. Scalp is hairy. Itching and marked heat may be present on the scalp. It is natural medicine prepared from fresh green twigs of plant Thuja occidentalis commonly known as Arbor Vitae. This plant belongs to family Coniferae. It is the next medicine in the list to treat many sorts of cyst and tumours. Firstly it is useful to treat sebaceous cyst. Next it is helpful to treat cyst in the breast and ovaries. Other than these it is an important medicine for spongy and fatty tumours. Like medicine Silicea, this medicine possesses a great power to manage cases where infection has occurred and abscess has formed. In such cases it works well when there is pus discharge that can be blood stained also. With this there is throbbing or splinter like pain present in the infected site. The abscess is also tender and sensitive to touch. The skin overlying the abscess is inflamed and appears warm to touch. It is also an important medicine for treating sebaceous cyst. Not only these cysts it also have a marked affinity to treat many other types of cyst and tumours. Among them ovarian cyst, fibroids and fatty tumours are the ones well treated with this medicine. It is prepared from plant puke weed either with fresh plant when in flower and seed or its dried leaves. This plant belongs to the family lobeliaceae. This medicine has a tendency to resolve most obstinate cysts on the scalp. It either makes the cyst dissolve gradually or resolves it by aiding the discharge of its contents. In addition to above some of the other important medicines indicated for treating sebaceous cysts include Conium, Phytolacca, Calcarea Carb, Agaricus and Spongia. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Burning feet is the sensation of excessive heat in the feet. It is a very common sensation that usually is experienced at night. Sometimes burning feet may be painful enough to interfere with sleep. Mostly it arises from nerve damage. The intensity can vary from mild or severe. It can be constant or intermittent. Homeopathic medicines for burning feet offer natural, gentle, effective treatment for a variety of cases. Burning feet may also be attended with tingling, prickling, pins- needles sensation or numbness, redness, swelling, increased sweating, pain in feet. It most commonly occurs from nerve damage. The nerve damage can be from various reasons. The most common reason is diabetes (diabetes neuropathy). Uncontrolled high levels of sugar in blood for a long time damages blood vessels and nerves. The nerve damage hinders normal travel of nerve signals to many body parts and also feet. Nerve damage in legs and feet refers to peripheral neuropathy. Persons who have high blood pressure, take alcohol, are overweight and smoke are at high risk of nerve damage. In case of diabetic neuropathy along with burning sensations, tingling, numbness, sharp pain, weakness in hands and feet can also accompany. Secondly, it can arise from excessive alcohol use that causes nerve damage called alcoholic neuropathy. Thirdly, it can occur from certain nutritional deficiencies. Deficiency of vitamin B12, B6, folate can lead to nerve damage and burning sensation in feet. Vitamin B deficiency also causes anaemia that contributes to it. Another reason is small fiber sensory neuropathy (SFSN) which is a type of peripheral neuropathy affecting small nerve fibers in the skin. In this painful burning in the feet arise. Hypothyroidism (an underactive thyroid) is yet another reason behind burning feet. In this condition swelling appears which puts pressure on nerves and causes a burning sensation. Other symptoms of this condition include weight gain, loss of energy, hair loss, dry skin. Other than these, it can occur in Charcot – Marie – Tooth disease (CMT). A Common form of hereditary neuropathy that causes nerve damage in arms and legs. Burning, pins and needles in the feet / hands is among the initial symptoms. Another reason is Athlete’s foot (Fungal infection of the foot). It is also known as tinea pedis. In this condition burning, tingling, itching sensation between the toes or in the soles of the feet arise. Other than these fluid filled eruptions (blisters) cracked skin, peeling of skin, dry or raw skin on the feet may occur. Sometimes toenails get thick, discoloured, crumble and get detached from the nail bed. Long term or chronic kidney disease – When kidneys get damaged and are not able to carry their function properly means not able to remove toxins from the body then these toxins build up in blood and damages the nerves. Erythromelalgia – it is a rare vascular disorder in which blood vessels in lower limbs or hands get blocked on and off followed by hyperemia (excess blood flow) and inflammation. Redness, congestion, heat and pain in feet occur though symptoms can also occur in hands, arms, ears, legs, face and other body parts. Peripheral artery disease (PAD) – In this condition the arteries that carry blood to the legs and feet becomes narrow. It leads to burning in feet and legs. Complex regional pain syndrome (CRPS) – A condition causing severe pain usually in just one arm or leg and develops typically after an injury or a surgery. Its symptoms are swelling, burning pain, swelling, skin colour or texture change. Tarsal tunnel syndrome – It is a condition arising from compression of nerves that runs from the ankle to the foot. It can arise from swelling or an injury. In this there occurs pain, burning, tingling or numbness in the foot. Guillain – Barre syndrome (GBS) – It is an autoimmune disease in which the immune cells attack and cause damage to the peripheral nervous system. In the beginning it is mostly present with numbness, tingling, and weakness in feet. Some other diseases can have burning feet as one of its symptoms. Some examples include Lyme disease ( a tick-borne, infectious disease caused by a bacteria of the type borrelia), HIV, shingles (a viral disease caused by Varicella zoster virus in which painful skin rash with blisters appears). Pregnancy and menopause – Burning feet may be complained about by some women during pregnancy and menopause. This is due to hormonal changes leading to increase of body temperature. Heavy metal poisoning can also cause it. Exposure to heavy metals like arsenic, mercury and lead can lead to burning sensation in the feet. Side effects of certain medicines like chemotherapy drugs, some medicine used to treat HIV and seizures (fits), overdose of vitamin B6. It can also occur from wearing poor footwear and standing / walking for an extended time period. Homeopathic medicines offer natural, gentle, effective treatment for cases of burning feet. These medicines focus to address the root cause behind it to bring great improvement in these cases. These medicines in addition to relieving the burning of feet also helps to improve attending symptoms. Such symptoms include tingling, prickling, sensation, numbness, redness and swelling, increased sweating and pain in feet. As burning of feet can arise from numerous reasons, its important to take homeopathic medicines after complete case analysis by a homoeopathic physician and self medication be avoided. Sulphur is a leading medicine for burning sensation in feet. Persons needing it have burning especially in soles of feet. They wish to place them on a cool place to get relief. The burning worsens at night and they put them out of bed to cool them. They may also feel burning in soles on stepping after sitting for a long time. Itching may also be present on soles in addition to the above complaint. Another symptom that can attend it is prickling in balls of feet when putting feet to ground.\n• Kali Phos – For Burning in Soles and Toes It is a great nerve remedy. It is a very suitable medicine for cases having burning in soles and toes. In some cases needing it stinging sensation in soles may be present. It is also indicated when prickling sensation is present in the feet. This medicine works well in case of burning, swelling on feet. There is internal burning but when touched the feet feels cold from outside. Red spots on the feet may be present with this. Other additional symptoms that can accompany numbness and weakness of feet.\n• Medorrhinum – For Burning of Feet and Sharp Pain This medicine is beneficial for cases of burning feet and sharp pain in soles. Persons needing it uncovers the feet and fan them to aid relief. The sharp pain in soles is felt while taking the first step on them in the morning. They may also have swelling of feet. Sore feeling under feet especially on the left side may be present.\n• Apis Mellifica – For Burning in the Toes This medicine is prominent for burning sensation in toes. With this there is redness in toes. Sometimes numbness is felt in feet. Swelling in feet may be present too.\n• Pulsatilla – For Burning in Back of Feet This medicine is prepared from plant Pulsatilla Nigricans commonly known as wind flower or pasque flower. This plant belongs to family ranunculaceae. It is well indicated for burning in the back of feet. Redness and swelling of feet can be present with this. Tearing pain from back of foot to heel is present sometimes. Soles of feet may also be painful and feel sore. Some people requiring it also have a tingling sensation in feet while standing.\n• Phosphorus – For Burning Sensation in Feet and Numbness of Toes This medicine is helpful for burning sensation in feet and numbness of toes. Burning sensation can be felt in legs also. Swelling of feet may also be there. Pain in soles as if from ulceration can be felt during walking. Another symptom that can attend is a shock like sensation in feet.\n• Silicea – For Burning and Tingling in Soles This medicine is very useful for burning in soles and also tingling sensation in soles. The burning is most marked in evening and night time where it is required. Along with this there is swelling of feet with redness. A peculiar accompanying symptom is excessive sweating on feet. The sweat is offensive. Soreness of feet is also there in some cases. It is also one of the best medicines for cases of athlete’s foot. This medicine is prepared from a plant named Arnica Montana having the common name Leopard’s – bane or fallkraut. This plant belongs to family compositae. Its use is recommended in cases presenting with violent burning in feet. Along with this tingling sensation may be marked in feet. Sometimes there is attending numbness of feet.\n• Natrum Carb – For Burning in Feet While Walking This medicine helps cases of burning in feet while walking. Burning is mainly present in soles for using this medicine. Swelling with stinging in feet may also attend while walking. In the right foot stitches as from needles can be felt. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Breast pain is medically known as mastalgia It is very common and many women at some point of their lives have experienced breast pain. It can be felt as discomfort, heaviness, tightness, mild tingling, dull ache, sharp pain or burning pain in the breast. Fullness in breasts, soreness, tenderness in breast and swelling in the breast can accompany this. The breast pain can sometimes radiate to arms. The pain can be present in one breast or both breasts or in the underarm. In some cases the pain is felt constantly and in others it occurs occasionally. The intensity also varies from mild to severe from case to case. Homeopathy for breast pain works to treat the root cause behind it to bring major pain relief. Though pain can occur in women at any age but is more common in women before reaching menopause. Pain in both breasts that occurs before periods is not serious. But pain in one breast along with a hard lump in breast or nipple discharge is a reason of concern and needs to be further investigated. Firstly, it can arise from changes in the reproductive hormones (estrogen and progesterone). Pain from this reason is frequently seen during puberty, pregnancy, breastfeeding and menopause. In case of breast pain from hormonal changes the pain mostly gets worse 2 or 3 days before the menstrual period. The pain may sometimes also be there during periods. Second reason is breast cyst (fluid filled sac or lump in the breast. It is non cancerous. It is mostly painless but may be painful in some cases. These lumps have a tendency to enlarge in size around periods and they go away after menopause. Thirdly it can arise from use of certain medicines. Some of these medicines include oral birth control pills, some of the hormonal medicine used for infertility treatment, use of estrogen and progesterone therapies after menopause. Other medicines include antidepressants (selective serotonin reuptake inhibitor – SSRI), some of the diuretics and steroids. Next it can arise during breastfeeding sometimes. It can occur during breastfeeding from engorgement of breast when they become excessively full with milk, improper latching by baby during feeding (cracked and sore nipples can occur with this) and mastitis (infection of milk ducts occurring commonly during breastfeeding from clogged milk duct but can also occur at other times). Along with breast pain other symptoms of mastitis are swelling, redness, warmth of breast, fever, chills. Itching, cracking, burning or blister formation can also occur on the nipples. Some other factors that contribute to breast pain include large breasts size (it can cause pain in neck, shoulder and back in addition to breast), breast surgery, some dietary factors (like eating food high in fat and refined carbohydrates), smoking. In some cases pain in breast occurs from reason outside the breast (extramammary breast pain). For example this can arise from irritation of the muscles of the chest, arms, back or muscle pull in the chest. It can also happen from costochondritis (inflammation of the cartilage connecting the ribs and breastbone). In many cases however the reason is not found. Breast pain may cause fear in women thinking of it as arising from breast cancer but majority of times breast pain arises from a benign (non cancerous) condition of breast and is very rarely indicative of breast cancer. Breast pain is classified as cyclical or non cyclical breast pain. It is the pain that is linked with the menstrual cycle and is worse a few days before periods. It usually resolves during and after periods. It is described as a heavy, dull ache in the breast. The pain can radiate to underarm. It usually occurs in both breast (portion affected is upper and outer portion) and the breast can be lumpy. It can be attended with swelling and tenderness in the breast. Women between 20 yrs and 30yrs of age and in their 40’s before menopause are affected with this. It is not linked to the menstrual cycle. It is mainly present in one breast and feels soreness, burning and tightness in breast. Women after menopause are affected with this. It can occur from breast injury, mastitis and origin from surrounding muscles or tissues (extra mammary pain) Homeopathic medicines offer a very safe, gentle and effective treatment for cases of breast pain. These medicines also help to manage any attending swelling, tenderness in the breast. These medicines are prepared from naturally occurring substances so are very safe to use without any side effects.\n• Conium – For Breast Pain Especially Before Periods This medicine is very beneficial for breast pain that occurs before periods. Pain is worse from every step. In cases needing it the breast may also enlarge, and swell before periods. Soreness is also present in the breast. It is also indicated for stitching pain in the breast especially at night time or from walking. It is a prominent medicine for hard lumps in the breast with stitching pain. Lastly it is indicated for pain in the breast from fall or blows. This medicine is prepared from plant deadly nightshade. It is very effective for cases of pain in the breast with swelling, redness and heat. For using this medicine pain may be stinging or throbbing type. The breast may also feel heavy. It is a well indicated medicine for inflammation of breasts from weaning.\n• Phytolacca – For Pain with Inflamed Breast and Hard Lumps This medicine is prepared from plant Phytolacca decandra also known as Poke – root and Red Ink Plant. This plant belongs to family phytolaccaceae. It is a leading medicine for breast pain with inflamed breast. It is also top listed for treating hard, painful lumps in the breast. In case of inflammation, the breast is painful, intensely swollen, hard, sensitive and tender. Along with this the nipples may be sore, cracked, fissured and excoriated. In this case pain begins from the nipple and extends to the whole body. It is a very suitable medicine for severe stinging pains in breasts during breastfeeding. Another indication for using it is a lump in the breast which is sensitive and painful that is worse at menstrual period. The pain may extend down to the arm of the affected side. Lastly it is helpful for the hardness of the breast as hard as stone after weaning. This medicine is well indicated for pain in the breast along with swelling and hardness of the breast. It can also be reddened and sensitive to touch. Along with this burning sensation is felt. There can be high fever with this. Next important symptom pointing to its use is sharp pain in the breast while breastfeeding. Apart from these it is also useful for hard lumps in the breast.\n• Lac Caninum – For Pain in Breast with Soreness and Sensitivity to Pressure This medicine offers great help in cases where there is pain in the breast along with soreness and sensitivity to least pressure. The pain worsens from the least jar where it is required. Fullness in breast and its enlargement may also be felt along with above symptoms.\n• Pulsatilla – For Painful Lumps in Breast of Young Girls Pulsatilla is a natural medicine prepared from plant Pulsatilla Nigricans commonly known as wind flower or pasque flower. This plant belongs to family ranunculaceae. It is a very effective medicine to treat painful lumps in the breasts of young girls. The pain may radiate to the arm of the affected side. Another complaint to use this medicine is swollen, tensed, sore breasts with continuation of milk secretion after weaning. This medicine is prepared from the root of a plant named Bryonia alba or wild hops. This plant belongs to the family cucurbitaceae. Its use is done for burning or tearing pain in the breast. Females who need it also feel stony heaviness and hardness in the breasts. They also feel a heated sensation in the breast. Its use is also recommended when there is inflammation of the breast with heaviness, hardness and complaint worsens from motion. Next complaint that it helps is inflamed breasts with suppression milk flow.\n• Merc Sol – For Pain in Breast with Swelling and Ulcerated Nipples This medicine is considered when the breast is painful along with swelling and ulcerated nipples. It is also hard and sore. It is also used in cases where nipples are raw and sore during breastfeeding in case of mastitis. Its another significant symptom is hardness, swelling and pain in breast during menses. Along with this milk may fill in breast in non pregnant females.\n• Croton Tig – For Pain Extending to Back during Breastfeeding The main indication for using this medicine is pain in the breast going through the chest to back during breastfeeding. Nipple may be very sore to touch with this. Next it is indicated for inflamed, swollen and hard breasts when pain from the nipple goes through to the back.\n• Castor Equi – For Swollen Breast with Pain on Touch Castor Equi is a beneficial medicine for cases of swollen breasts with pain on touch. Additionally it is a very useful medicine for healing cracked, sore nipples in breastfeeding women. The nipples are very much tender with this complaint. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Lazy eye is medically known as amblyopia. In this condition the brain focuses more on one eye and does not fully acknowledge the images seen by the amblyopic eye usually due to poor vision in this eye. With passing time the brain begins to favour the healthy eye and starts to ignore signals from lazy eye. It results in decreased vision or if not treated in time even loss of vision in lazy eye. Homeopathic remedies for lazy eye offer supportive help along with conventional treatment. It is a leading cause of decreased vision in one eye in children and younger adults. In this condition almost always one eye is affected but rarely vision in both eyes can be affected. It occurs due to developmental problems in the brain. In this condition the nerve pathways in areas of the brain responsible for processing sight do not function in a correctly needed manner. It is a neurological condition in which the nerve pathway connecting the eye to the brain is not working properly so the problem is in the brain and not in the eye, so lazy eye is a misleading term. In the early period of visual and brain development of a child usually between birth to 6 yrs any sort of interference occurs with focusing and getting clear vision in either eye predisposes towards a lazy eye. The interference makes a person start using one eye more than the other and the eye which is used less becomes weaker over time. The common cause behind it include constant strabismus or squint (A condition in which the eyes are not able to align properly with each other when looking at an object. So they look in different directions and not at the same object at the same time. It occurs from imbalance in the muscles that position the eyes and the eyes can cross in or turn out while looking at an object). Next cause is the difference in level of vision and or prescription between both the eyes. It could be from farsightedness (in this condition a person can see distant objects clearly but the nearby objects appear blurry), nearsightedness (in this condition a person can see near objects clearly but objects farther away appear blurry to him) or astigmatism (in this the lens of the eye or the cornea has an irregular curve that change the way light passes or refracts on retina causing distorted or blurry vision). This type is known as anisometropic amblyopia or refractive amblyopia. Another cause is blockage of vision in one eye as from cataract ( opacification of the lens of the eye which is normally clear), corneal ulcer / a scar, ptosis (drooping of the eyelid), injury to eye, eye surgery. Other causes include glaucoma (increased intraocular pressure which can cause vision problems and blindness), vitamin A deficiency. Premature birth, family history of lazy eye and developmental disabilities are some of the risk factors. It usually develops in childhood between birth to age of 7 yrs. Amblyopia mostly occurs in only one eye. In this condition there is inability to focus properly with one eye but the other eye is normal and can see clearly. The affected eye otherwise appears normal when looked at so it may not be detected by children and parents. It may not be diagnosed till it becomes severe or is only diagnosed during a routine eye test of the child. Some of its signs and symptoms include wandering of an eye inward or outward, squint, head tilting, blurred vision, double vision (diplopia), eyes appearing to not work together, and poor depth perception (problem in estimating distance and telling how near or far away something is). Homeopathic medicines aim to halt its further progression and provide symptomatic relief to the person. Use of these medicines should be considered in early stages. There are chances of good improvement when the treatment is started at a young age soon after being diagnosed usually before the age of 7yrs. It is advisable to take these medicines along with conventional treatment to get best possible conjoined help from both these systems of treatment. This condition can lead to permanent blindness if not treated properly at a right time. So one must use any homeopathic medicine under the supervision and guidance of a homeopathic physician after proper case study and avoid self prescription. It is a leading medicine for cases of lazy eye. It is highly useful to manage blurring or dimness of vision. Persons needing it may have nearsightedness that is gradually or rapidly increasing. They can see near objects but the distant objects appear blurred as if covered in a smoke. It is one of the best medicines for managing the cases of glaucoma (with shooting eye pain, sparks or flickering before eyes). So in a case where glaucoma is linked with a lazy eye, use of this medicine can be considered.\n• Gelsemium – For Difficulty Following Movement of Objects It is the next prominent medicine for cases of lazy eye. This medicine is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. Persons needing it have dimness of vision. Due to dim vision there is difficulty following movements of objects. There is also difficulty in reading and writing. They may also have double vision. Double vision is mainly present when looking sideways. Apart from these it is a very effective medicine for managing glaucoma, squint, astigmatism and drooping of eyelids (ptosis). So this medicine can also be used if any of these conditions is linked with lazy eye. Homeopathic medicine Ruta is prepared from a plant named Ruta graveolens commonly known as Rue. The plant belongs to the family rutaceae. It is also a very beneficial medicine for managing cases of lazy eye. Its use is mainly recommended when lazy eye is associated with errors of refraction (nearsightedness, farsightedness, astigmatism). In cases requiring it weakness of vision, dullness of sight, obscured vision for distance are usually present. The vision dimness worsens from straining the eyes. With blurred vision pain in and over eyes can also be present.\n• Natrum Mur – For Dimness of Sight and Double Vision It is another important medicine for cases of lazy eye. It is indicated when there is complaint of dimness of sight and double vision. In such cases there is sensation as if objects are covered with cloth. There appears pressure in the eyes when intently looking at anything. There is obscuration of sight mainly while walking, reading, writing. It is also a great medicine for ulcers of the cornea (with photophobia means sensitivity to light, much eye discharge, smarting, burning in eyes and sensation of sand in eyes). Next it is also an important medicine for cases of strabismus since childhood.\n• China – For Weakness of Vision for Distant Objects This medicine is prepared from dried bark of plant Cinchona officinalis commonly known as Peruvian bark. It belongs to the family rubiaceae. It is indicated when there is marked weakness of vision for distant objects. In cases needing it only large objects could be distinguished at distance. There may be better vision in the morning. Other than this, there is also difficulty in reading where letters seem to run together. This medicine also covers ulceration of cornea. This medicine is specifically indicated for traumatic amblyopia occurring from a blow. People needing it see smoke before them. They sometimes also see a black spot before eyes that worsens at night. They have dimness of sight especially at night and in morning. They feel objects look clearer in clear weather. They also feel fatigue in their eyes after reading. This medicine is prepared from fresh plant named Drosera rotundifolia. Commonly known as round – leaved sundew. It belongs to the family droseraceae. It is a useful medicine when a person has difficulty in reading and letters appear blurred and run together during reading. There is frequent vanishing of sight while reading. People experience farsightedness. There is a weakness of eyes when looking at small objects. This is yet another helpful medicine for lazy eye. It helps cases when there is weak, dim vision. There are also frequent episodes of temporary loss of vision. In some cases that require it there are always dark spots or a sensation of cloud before the sight. Heated sensation and watering from eyes is a symptom that can attend to it. This medicine is prepared from plant thorn apple that belongs to the family solanaceae. It is well indicated for dimness of vision especially in the morning time. Persons needing it feels as if vision is cloudy or there is a fog before eyes. In the morning they tend to bump into objects as if they are in the dark. They also have problems while reading, at that time letters appear blurred and as if they are moving. Apart from above it is one of the best medicines for cases of strabismus (squint) so can be used in lazy eye cases with this complaint. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Esophagitis refers to inflammation of the esophagus (a tube through which food and drink passes from mouth to stomach). It can lead to damage of tissue of the esophagus, alter its structure or cause problems with its normal function. Homeopathic Remedies for Esophagitis help to reduce the inflammation of esophagus and effectively manage its symptoms. It can have various causes. The most common cause behind it is GERD (gastroesophageal reflux disease). In this condition there is backflow of stomach acid in the food pipe that can irritate its lining and lead to inflammation. Next it can arise from infections. Another reason behind it is use of certain medicines (NSAIDs , some antibiotics, steroids). Apart from this risk factors for it includes alcohol abuse, excessive cigarette use, radiation therapy, chemotherapy, chemical injury by alkaline or acid solutions, physical injury, weak immune system, stress, allergies, crohn’s disease (an autoimmune disease that causes inflammation and damage to gastrointestinal system), chronic vomiting, obesity, hiatal hernia (condition in which stomach bulges out from hiatus opening in diaphragm into chest), intense use of Vitamins and supplements, surgery in the chest area. This type usually results from GERD (gastroesophageal reflux disease). In this disease there is backflow of stomach acid upwards in the food pipe. There is a valve known as LES – lower esophageal sphincter, that keeps the stomach acid in the stomach and prevents its back flow. This valve opens only when food has to enter the stomach from the food pipe and is closed at all other times. When this valve opens at times other than eating or doesn’t close rightly then the stomach contents can get back in the food pipe. If this occurs frequently for a long time then acid content from the stomach can inflame and damage the lining of the food pipe and this condition is known as reflux esophagitis. There are some factors that increase the chance of GERD and inflammation of esophagus due to stomach acid. This includes taking excessive alcohol, coffee, chocolate, smoking, eating excessive fat and going to bed immediately after eating. This type occurs from an excessive number of eosinophils (a type of WBC – white blood cell that plays a role in allergic reactions) in the esophagus usually from an over reactive response to an allergen or acid reflux. There are some of the common food triggers for it, for eg, foods such as milk, eggs, soy, peanuts, wheat and shellfish. It can also result from inhaling an allergen like pollen. It is a rare type that occurs from an excessive number of lymphocytes (a type of white blood cells) in the esophageal lining. Crohn’s disease, GERD are some diseases associated with it. This results from taking some of the oral medicines with a very little amount of water. It increases the contact time of medicine with the lining of the food pipe. Some of the examples of these medicines include pain relievers (aspirin,ibuprofen), antibiotics (tetracycline), bisphosphonates, quinidine and potassium chloride. It is rare and can occur from a bacterial, viral, fungal or parasitic infection in the esophagus. This type mostly affects people having weak immune systems. Among infections fungus called Candida albicans is common cause of this type. These fungal infections are common in people with low immunity, people who are diabetic, have cancer or those who use steroids. Its symptoms include difficulty swallowing, pain while swallowing, heartburn, pain in the chest behind the breastbone while eating, food getting stuck in the food pipe. Other symptoms that can occur includes nausea, vomiting, decrease in appetite, epigastric pain, sore throat, hoarse voice and cough. Young children may have feeding difficulty and failure to thrive. If not treated well in time there can occur changes in the structure and function of the esophagus. Firstly it can lead to scarring, narrowing (stricture) in the esophagus. Next there can occur ulcers in the esophagus. Another complication is tearing or perforation of the esophagus. Lastly it can lead to Barrett’s esophagus (it is a precancerous condition in which there occurs damage to esophageal lining and changes in cells that line the esophagus which increases the risk of esophageal cancer). Homeopathy offers a very effective treatment for cases of esophagitis. Homeopathic medicines help to reduce the inflammation of esophagus and effectively manage its symptoms. Symptoms including difficult swallowing, painful swallowing, heartburn, sensation of food getting stuck in the food pipe, nausea, vomiting, epigastric pain can be well managed with these medicines. In mild to moderate cases they can be used as per the symptoms present. But in severe and complicated cases one must consider use of conventional treatment. Arsenic Album is a leading medicine for treating cases of esophagitis. Persons needing it have marked burning in the food pipe (heartburn). Burning is felt when swallowing the food. The burning is so intense as if esophagus is made raw by an acidic substance. Along with this nausea may attend. They may also have stinging sensation in the esophagus as from a splinter. Another complaint that they have is very difficult and painful swallowing. They also have a sensation as if everything swallowed gets lodged in the esophagus. Soreness of the throat and pain in the throat may also be felt by them. Vomiting may also be present in addition to above symptoms. This medicine is prepared from the root of the plant commonly named Blue flag. This plant belongs to the family Iridaceae. It is a highly recommended medicine for managing heartburn. In cases needing it there can also be continuous nausea. Vomiting is there which is sour, acrid in nature. This medicine is prepared from plant Robinia Pseudoacacia. This plant belongs to family leguminosae. It is a very suitable medicine to manage heartburn and acid reflux. Persons who need it mainly get heartburn at night time on lying down. They also have nausea. Another important symptom that is present is vomiting of intensely sour fluid.\n• Causticum – When There is Sensation of Food Lodging in Esophagus This medicine is beneficial for the cases when there is sensation of food lodging in the esophagus. Other than this there is nausea during or after a meal in cases that require this medicine. Next attending symptom is vomiting of acidic water or food. In many cases pressive, cramp – like pains or shooting type of pain is felt in the abdomen in the epigastric region. Phosphorus is another prominent medicine for these cases. It is indicated when the esophagus is there. Along with this there is difficulty swallowing liquids. Nausea and vomiting may also be present along with this. It is also a medicine for managing cases of stricture of esophagus. Alumina is a beneficial medicine to manage painful swallowing. Persons needing it have difficulty in swallowing solid food. They can take food in small pieces only. They feel taking warm drinks help to relieve this complaint. They also feel pressure pain in the region of esophagus as if it is contracted or compressed. This occurs mostly during swallowing.\n• Carbo veg – With Heartburn and Pain in Epigastrium Carbo veg is helpful for managing heartburn and pain in epigastrium. The pain in epigastrium can be aching or burning type. The pain gets worse after eating. Epigastric region is also very sensitive. Sensation of rawness in the food pipe and stomach are also felt. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage complaints of difficult and painful swallowing. Persons needing it have to swallow water to move down the solid food. They also feel burning, stinging and dryness in the food pipe. Sometimes contraction in esophagus is also felt. Along with this, pain in stomach, nausea, vomiting may also be present. It is a significant medicine for cases having difficulty swallowing. In such cases there is difficulty and pain in swallowing solids. When food reaches a particular point in the food pipe it gets difficult to go down further from inflammation at this point. This medicine is also indicated for managing cases of esophagitis occurring after corrosive substances. This medicine is prepared from the fresh root of a plant commonly known as American White Hellebore also called as Indian Poke. It belongs to the family melanthiaceae of the Liliaceae. Use of this medicine is considered when there is nausea and vomiting in these cases. Along with this burning is marked in the food pipe with constant desire to swallow. It is most helpful for acute cases of esophagitis.\n• Gelsemium – With Sensation of Something Lodged in Esophagus Homeopathic medicine Gelsemium is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. The main indication to use this medicine is sensation of something lodged in the esophagus. Pain attends to this. Cramping sensation is also felt in esophagus. Another accompanying symptom is burning in esophagus that can extend to the stomach.\n• Iodum – For Inflammation and Ulcers of Esophagus This medicine is prominent for cases in which inflammation and ulcers of esophagus are there. Persons needing it have a sensation of burning and scraping in the food pipe. They also feel pain in the food pipe. Swallowing is also difficult among them. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Albuminuria refers to a condition in which albumin (a type of protein) abnormally passes in the urine. Albumin is a major type of protein made in the liver that normally circulates in the blood. Homeopathic medicines for albuminuria mainly play a supportive role in managing such cases. Albumin is the most abundant and significant protein in the blood circulation. It helps in maintaining the right amount of fluid flowing throughout the body and acts as a carrier for fatty acid, thyroid hormones and steroids. The protein should remain in blood and never enter urine under normal circumstances. But when the protein albumin abnormally seeps in the urine it is referred to as albuminuria. The kidneys function to filter the blood in the body. When blood passes through the kidneys it keeps the things required by the body like protein but eliminates the things not needed out of the body as urine. The kidneys have got glomeruli which act as filters. When functioning normally, the protein cannot pass through the filter and enter urine or a very little trace of protein can pass in urine. But in case of damaged kidney excessive albumin can leak out of the kidneys into urine. Some of the conditions that cause a temporary increase of albumin in urine includes dehydration, stress, intense physical activity, cold weather, fever and side effects of some medications. Furthermore, the medical conditions that can lead to rise of albumin levels in the urine. First among them is diabetes, hypertension (high blood pressure – B.P.), kidney inflammation – nephritis, glomerulonephritis (inflammation of the glomeruli which are the structures made of tiny blood vessels in kidneys that filter blood), nephrotic syndrome (a kidney disorder in which body to pass too much protein in urine). physical trauma to the kidneys, cardiovascular disease like endocarditis (inflammation of the endocardium which is the inner layer of the heart). These medical conditions need urgent medical help as these can result in severe complications like kidney failure. People with diabetes, high blood pressure, elderly people above age of 65 yrs, individuals having family history of kidney disease are at high risk of albuminuria. Such people need to get tested for urine albumin quite frequently so that any kidney damage is detected and managed in time and further complications be prevented. It denotes the start of kidney damage with moderate increase in the albumin levels in the urine. When kidney damage is slight the albumin passes in urine in small quantities ( around 30mg to 300mg within the twenty four hour time frame ). When kidney function is greatly affected there is excessive passing of albumin in the urine denoting macroalbuminuria. The kidney allows passage of large amounts of albumin into the urine (more than 300 mg within the twenty four hour time frame). It indicates a serious kidney condition. It is mostly asymptomatic in the beginning stages. But when there is passage of a large amount of albumin in urine, there maybe some signs that give an indication towards it. First among them is urine having whitish foam or urine looking frothy. Next sign is swelling of the ankles, hands, eyes, face, legs, belly. The swelling occurs when abundant albumin passes in urine and results in low levels of protein in the blood. The low protein levels in blood leads to movement of fluid through the blood vessels walls into tissue. Cases of albuminuria need immediate medical attention to prevent serious complications. Homeopathic medicines mainly play a supportive role in managing cases of albuminuria. These medicines can be used along with conventional treatment for halting its further progression. Additionally they help in reducing oedema (swelling ) linked with it. Other than these homeopathic medicines also work towards managing associated symptoms like burning / painful urine, frequent urine, scanty urine, kidney pain. Albuminuria can have serious effects on the body and can lead to kidney damage. So one should use homeopathic medicines along with conventional treatment, that too under supervision of a homeopathic physician and never self prescribe any of these medicines. Apis Mellifica is a leading medicine for albuminuria. In cases needing it urine is frothy. Urine is also scanty. It can also contain blood. Urine is hot and can have an offensive smell. Along with this there is marked oedema. Here swelling is present on the face, hands, legs, and there is puffing of eyelids. Burning while urinating may also be present. Other than this sudden pain along the ureter can occur frequently. It is also considered for albuminuria with nephritis. This medicine is well indicated for early stages of albuminuria. Along with albumin, blood can also appear in urine where it is required. Pain, especially dull, aching type over kidney region may also be felt. There is swelling of lids, face and feet along with above symptoms. The urine is scanty and appears cloudy. Urine may also be fetid. It is also a prominent medicine for cases of nephritis.\n• Calcarea Arsenicosa – For Frequent Urine with Excessive Albumin in Urine It is a significant medicine for cases with frequent urine and excessive amounts of albumin in urine. People requiring it pass urine almost every hour. There is burning while urination and urine is scanty. Along with this great sensitivity of the kidney region to pressure is present. Swelling over the face and back of hands is also there. It is also a well indicated medicine for albuminuria during pregnancy.\n• Merc Cor – When Urine is Scanty and Have Albumin and Blood Merc Cor is a valuable medicine for cases where urine is scanty and contains albumin and blood. Urine is also hot, burning. There is frequent urge to urinate. Urine passes with pain and sometimes in drops. Swelling of the face is also there.\n• Nitric Acid – For Albuminuria with Pressure in Kidney Region This medicine is indicated for albuminuria with pressure in the kidney region. Urine is highly offensive in cases needing it. Urine appears turbid. Along with albumin urine may also contain mucus, pus and blood. There is frequent urging to urinate with scanty discharge. Oedema of feet, excessive weakness and nausea are other complaints that can attend. Cantharis is a very beneficial medicine when there is albuminuria and burning, painful urination. The pain and burning can be felt before, during or after urination. It is a top listed medicine for nephritis with blood in urine. Persons who need it may have pain in the kidney area. Kidney region may also be sensitive to the slightest touch. They have frequent urges to urinate but pass only scanty urine. The urine is turbid and scanty. It may appear cloudy during the night with white sediment. Urine may also contain blood and cylindrical casts.\n• Plumbum Met – When Urine is Scanty and Contains Albumin, Oxalate, Epithelial Cells, Hyaline Casts Plumbum Met is used when urine is scanty and contains albumin, oxalate, epithelial cells, hyaline casts. It may also contain RBC’s (red blood cells). Along with this there is excessive oedema (swelling) of eyelids. Intense weakness can accompany these symptoms.\n• Dulcamara -For Albumin in Urine, Swelling and Kidney Pain This medicine is prepared from fresh green stems and leaves of plant Solanum dulcamara having the common name Woody Nightshade and Bitter – sweet. This plant belongs to family solanaceae. It is indicated when the urine contains albumin and there is swelling in body tissue and pain in the kidney region. Along with this there is a constant desire to urinate. Urine is turbid, scanty, offensive and may contain tough, jelly – like, white or red mucus. This is a well indicated medicine for albuminuria and diabetes. There is swelling of lower limbs where it is required. There may also be pain in the kidney , especially the left side. The urine is frequent and profuse. It may be thick and have milky / white sediment. This medicine is prepared from the root of plant Helonias dioica also known as Blazing Star. This plant belongs to family melanthiaceae. Its use is suggested when there is kidney pain with albumin in urine. Other than this weight and burning sensation is felt in the kidneys. The right kidney may be sensitive. There is frequent urge to urinate and burning scalding pain can be felt when urinating.\n• Uranium Nitricum – For Albuminuria and Constant Pain and Soreness in Nack The indicating feature to use this medicine is albuminuria and constant pain and soreness in back. With this the urine is profuse and can be painful. It can be milky and have specific ammoniacal odour. There is frequent urination mainly at night. Excessive weakness and heaviness / pain, weariness in legs are few other accompanying symptoms. This medicine is prepared from plant Chimaphila Umbellata commonly known as Pipsissewa and Ground Holly. It belongs to the family pyroleae. This medicine is indicated for the last stages of albuminuria. In cases needing it constant pain is felt in the kidney region. Urine is scanty, fetid, very thick and contains albumin. Sometimes urine contains thick, ropy, bloody mucus. There is frequent desire to urinate with scanty urine. Scalding and smarting pain is felt during and after urination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Vaccines during childhood give protection to children against many serious diseases. For example DPT vaccine protects against diphtheria, tetanus, whooping cough (pertussis); MMR vaccine protects against measles, mumps, rubella; OPV protects against polio; HiB vaccine protects against Haemophilus influenzae type B infection. Though vaccine use is safe but like many other medicines any of the vaccine can cause some side-effects though mild in most cases. This occurs from a natural response of the body while it is directed towards immunity building against the disease for which vaccination is given. These side effects last from a few hours to one or two days after vaccination. Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination. Some of the side effects that can occur after inactivated poliovirus vaccine (IPV), DPT, Pneumococcal conjugate vaccine (PCV), Haemophilus influenzae type B vaccine (HiB vaccine). They mostly appear within 24 hrs of vaccination. These include mild fever; pain, soreness, tenderness, swelling or redness at the site of the injection; loss of appetite; diarrhoea; vomiting; tiredness; sluggishness and irritability; fussiness; secondary blister elsewhere on the body. Other than this side effects can occur 6 to 10 days after injection in case of MMR vaccine. These include mild fever, measles like rash, cough, runny nose, puffy eyes, swelling of salivary glands and loss of appetite. Next vaccine is rotavirus vaccine that can sometimes lead to diarrhoea, abdominal pain, restlessness and irritability in children. Other side effects that can occur after vaccination include small, red lump at the injection site. In some vaccines temporary headache, muscle or joint pain, runny nose, nasal congestion, trouble sleeping or drowsiness and being sleepy than usual. In case of high temperature rarely febrile seizures or fits can occur in young children. The chance of febrile seizure is high if a child has a history of such seizure earlier in his life or have a family history of seizures. In any of the vaccinations there are very rare chances (even less than one in million) of severe allergic reaction known as anaphylaxis. Swelling of face, hives, difficulty in breathing and even collapse can occur in severe allergic reactions. This tends to happen within minutes of taking the vaccination. This needs medical help right away without any delay. Homeopathy offers a very natural, effective, safe and gentle management of various ailments that arise after vaccination. These medicines are helpful to manage complaints of fever, diarrhoea, stomach pain, skin complaints, sleeplessness, redness, inflammation and swelling of arm, weakness headache, excessive sleep , runny nose, nasal congestion, cough, muscle or joint pain. In case of seizures use of homeopathic medicine should be considered along with conventional treatment. It is to be noted that homeopathic medicines have their own limitations to treat cases of severe reaction – anaphylaxis ( some of its signs and symptoms are swelling of tongue, throat, trouble breathing, rapid heartbeat, sudden drop of blood pressure). In such cases one must take immediate medical help from conventional mode of treatment without delay as it is a life threatening condition. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly named as Arbor Vitae. This plant belongs to family Coniferae. It is a leading medicine for managing numerous complaints arising after vaccination. Firstly it is indicated for diarrhoea after vaccination. It also helps in stomach pain in such cases. Secondly it is indicated for skin complaints, skin eruptions and skin growths that follow vaccination. Its third indication in these cases is seizures. Next it works effectively to manage sleeplessness that follows vaccination. Lastly it helps cases of weakness of legs that occur after re vaccination. Silicea is another highly valuable medicine for managing many issues that follows vaccination. Here it is well indicated for managing redness, inflammation and swelling of the arm that can appear after vaccination. Next it helps to manage weakness and lack of stamina in such cases. Another main indication for its use is nausea and loose motion that appear after vaccination sometimes. Headache, excessive sleep from vaccination are also well managed with this medicine. Apart from above indication seizures and weight loss are the rest of complaints where this medicine is indicated.\n• Ledum Pal – For Swelling, Redness and Inflammation of Arm This medicine is prepared from plant Ledum Palustre commonly known as wild rosemary and also marsh cistus. This plant belongs to family ericaceae. It is a foremost medicine in homeopathy for puncture wounds as arising from needle prick. Here it is beneficial medicine to manage swelling, redness and inflammation of the arm after vaccination injection. This medicine is also considered as a preventive for side effects of vaccination. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage fever after vaccination. In cases needing it the heat stage is prominent. There is burning heat over the whole body but especially most prominent in the head and face. Body feels burning hot like fire. With this redness of face is also there. Anxiety and restlessness is present with the internal heat of the body. There is excessive thirst during the heat stage. The heat stage alternates with the chill stage. In this stage there is coldness of limbs with heat in head. Violent chill is felt in the back. Apart from above it can also be used for managing redness, inflammation and swelling of the arm appearing after vaccination injection. This medicine is prepared from plant Podophyllum peltatum commonly known as May Apple. This plant belongs to the family berberidaceae. It is a well indicated medicine to manage diarrhoea. In cases requiring it the stool is watery, profuse and gushing. It can be yellowish or greenish in colour and has a very offensive smell. The stool can be frothy and have mucus in it sometimes. There is a sudden urge to pass stool. Fetid flatus is present with this. There is an urge for stool immediately after eating and drinking. Diarrhoea is usually painless where it is required. Intense nausea can be present before passing the stool. After passing stool, extreme weakness is felt by the person. It is a prominent medicine for managing skin rash appearing after vaccination. Violent itching is present in the rash where it is required. The itching is worse from warmth of bed and is better in the open air. Stinging and burning is marked in the rash. Skin is also sensitive to the slightest touch along with above symptoms. It is a very beneficial medicine for skin eruptions that can occur after vaccination. The eruptions are pustular where it is required. These eruptions are most marked on the scalp, face, and legs. It is also indicated for scabby eruptions on scalp, arms and legs appearing after vaccination. Arsenic Album is a very helpful medicine for managing runny nose and nasal congestion. In cases needing it there is profuse and watery discharge from the nose. It can lead to burning sensation, excoriation in the nostrils. In some cases stoppage of the nose and fluent runny nose alternate with each other that requires this medicine. Great weakness may attend the above symptoms. This medicine is prepared from plant Drosera Rotundifolia having a common name round – leaved sundew. This plant belongs to family droseraceae. It is an effective medicine to manage dry irritative cough. Along with cough roughness, dryness and tickling sensation is felt in the fauces. People needing it mainly complain of cough getting worse from lying down in the evening and from warmth. This medicine offers great help in cases of loose cough with rattling of mucus in the chest. Cough is present day and night. Chest feels congested from mucus in the chest. Scanty, thick, phlegm is expectorated in these cases. Expectoration is difficult. Rhus Tox is a very effective medicine to manage joint pain and muscle pain. It brings great relief in this complaint. The pain may be worse at rest and better by motion where this medicine is required. In cases needing it, stiffness of joints may also be present. The stiffness tends to get better by warmth and also by massage. This medicine is prepared from the fresh root of plant Cicuta Virosa having the common name water hemlock. This plant belongs to the family umbelliferae. This medicine can be used along with conventional treatment for managing seizures after vaccination. In cases needing it the fits occur with frightful distortion of the limbs or whole body. Loss of consciousness and frothing at mouth may occur with this. High fever is present along with above symptoms. Homeopathic medicine Malandrium is particularly indicated for managing cases where dryness, hardness and roughness of skin occurs after vaccination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Angioedema refers to edema or swelling underneath the skin that can become severe. It usually occurs from an allergic reaction. This swelling can appear with hives that’s why it is sometimes called giant hives. Hives also known as urticaria refers to itchy, elevated, red welts/wheals or bumps on the skin surface that occur mostly from an allergic reaction. Homeopathic Remedies for Angioedema are beneficial in all types of angioedema with symptoms having mild to moderate intensity. Angioedema is a harmless condition in most cases and gets well in a few days. However, in serious cases the tongue that can cause blockage of airways and difficulty in breathing that needs prompt medical help. Severe angioedema may be a part of a dangerous medical condition called anaphylaxis needing emergency treatment. Anaphylaxis is a severe allergic reaction in which there appears swelling of lips, tongue and throat that blocks airways and leads to breathing problems, rapid heartbeat, sudden drop of blood pressure, dizziness and sometimes fainting. Anaphylaxis is a severe life threatening condition that should be urgently treated with conventional treatment. It most commonly arises from an allergic reaction and this type is known as allergic angioedema. The allergic reaction can occur from certain foods like eggs, peanuts, fish, shellfish and milk. This reaction can also occur from insect bites, pollen, animal dander, latex and poison ivy. The body detects a substance (like any of the above) as something dangerous. Following this there is release of histamine by the body that causes dilatation of the blood vessels and fluid leakage. In severe cases of allergic angioedema, anaphylaxis can occur with swelling of throat, difficulty in breathing and sudden drop in blood pressure. It is a medical emergency needing immediate medical help. It can also arise from the use of certain medicines called drug – induced angioedema. Few medicines that can lead to it include aspirin, NSAID’s (non steroidal anti inflammatory drugs), penicillin, antibiotics and some of the medicines used to control high BP (blood pressure). Thirdly, it may occur after an infection or with illnesses like SLE (It is an autoimmune disease in which the immune system attacks and damages healthy tissues of the body. It can affect skin, kidneys, blood vessels, lungs, heart, nervous system, muscles, bones, eyes). Another medical condition linked with it is leukaemia (cancer of blood cells). Other than this a medical condition lymphoma is associated with it. Lymphoma refers to a cancer beginning in lymphocytes which are cells of the immune system that help to fight with infection. In case of lymphoma these lymphocytes change and keep multiplying out of control. Rarely it can occur in people having a family history of it where it is called as hereditary angioedema. Here a person has inherited this condition from a parent through genetic transmission. In hereditary angioedema the body is unable to make a blood protein called C1 esterase inhibitor in the right amount that results in fluid movement from the blood into tissues resulting in swelling. Other than this it can arise if a person has a weak immune system where it is called as acquired angioedema. Lastly, it can be idiopathic type where no cause is ruled out behind swelling. Some factors linked with it include stress, anxiety, intense exercise, exposure to heat and cold and minor infection. Its main sign is swelling below the skin. The swelling can develop suddenly or gradually in a few hours. Sometimes it may be attended with swelling and welts on the surface of the skin (hives) that may be painful and itchy. Redness, warmth and pain can appear in the swollen area. The swelling mainly occurs on the face especially around the eyes, lips; around the mouth; hands, feet, arms, legs; tongue. In severe cases the swelling can spread to other body parts. The swelling can also occur around the genitals and in intestines. Apart from above abdominal cramping, intense vomiting, redness irritation of eyes, diarrhoea (loose motion), weakness and dizziness can also occur. In some cases swelling appears in the throat with hoarseness, and difficulty in breathing. In case of swelling of the throat and tongue with difficult breathing, urgent medical help needs to be taken as it can be dangerous. There is a great scope of treating angioedema in homeopathy. There are many natural homeopathic medicines that are very effective for reducing the swelling in these cases and treating hives. In case of allergic cases it brings great recovery by moderating the immune system which is causing allergic reaction. Homeopathic medicines are helpful to manage recent cases and long standing or recurrent cases. It is to be noted that homeopathic medicines can be safely taken as long as there is no swelling of throat, airways, tongue attended with difficulty breathing. In the severe cases where there is swelling of throat, airways, tongue that obstructs breathing immediate treatment with conventional mode is needed. Also homeopathy has a limitation in treating cases of anaphylaxis reaction where urgent help from conventional treatment is required without any delay. Apis Mellifica is a leading medicine for cases of angioedema. Persons needing it have swelling over the face mainly eyelids, lips; mouth; and hands, feet. Redness and heat in the face is marked. In males swelling can also appear in testicles. In females the swelling can occur on labia. Burning stinging pains are complained in the area of swelling. Along with these symptoms there are hives with wheals on skin. The wheals are red with intense burning, stinging sensation. They are painful, tender and itchy. The itching mostly gets worse at night time. Apart from above symptoms there may be redness and itching in the eyes. Symptoms of angioedema occurring after bee sting are also well treated with this medicine. These symptoms include stinging, burning sharp prickling pain in skin and excessive swelling.\n• Urtica Urens – For Hives and Marked Swelling of Face, Hands, Feet It is prepared from a plant called Stinging – nettle that belongs to the family Urticaceae. The fresh plant in flowers is used for preparing homeopathic medicine. It is well indicated for hives and marked swelling of face, hands, feet. In cases needing it the fingers and hands are much swollen with itching. Lumps and red spots on hands are present. The face, hands and feet are swollen with stinging, burning and redness. The eyelids are intensely swollen and can be scarcely opened. In the case of hives raised red blotches are there on skin. This is attended with itching, burning and stinging. It also helps cases of hives from eating shellfish.\n• Rhus Tox – For Hives with Oedema of Lids It is a very beneficial medicine like above to medicines for cases where hives are present with oedema of eyelids. For using this medicine the hives usually occur from getting wet and in cold air. The hives have burning and itching in it. Affected skin appears tense and shining. The wheals are excessive mostly on hand and forearm. There is marked stitching pain in the eruption This medicine is prominently indicated when oedematous swellings are attended with burning pain. Along with this urticarial eruptions are present. These eruptions also have much burning in them. Marked restlessness attends this. A general weakness may accompany the above symptoms. This medicine also helps to manage vomiting and loose stool in these cases. Urticaria from eating shellfish is also an indicating feature for using this medicine. It is the next important medicine for cases of angioedema. For using it the main symptoms are swelling, itching, redness, burning of skin. There appears circumscribed oedematous lesions. Itching is there that changes place on scratching. Hepar Sulph is a very useful medicine for cases of angioedema and long standing recurring urticaria. Swelling is mainly present on upper lip, hands and feet in cases requiring it. The wheals mainly appear on hands and fingers. Few general symptoms that are present include sticking, pricking on skin and sensitivity of skin to slightest touch.\n• Antipyrinum – Another Well Indicated Medicine For Angioedema Antipyrinum is also a well indicated medicine for angioedema. People needing it also have urticaria. In them the urticaria appears and disappears suddenly. It may be attended with internal coldness. Most intense itching is present in the eruptions. For using it the eruptions are mostly present between the fingers. This medicine is prepared from the root of a plant called Helleborus Niger commonly known as Black Hellebore and Christmas Rose. It belongs to family ranunculaceae. It is indicated when there occurs sudden swelling of skin. Edema occurs on the face along with redness. Edema also appears on legs. Legal Disclaimer -None of the medicines mentioned including services , mentioned at Drhomeo.com should be used without clearance from your physician or health care provider. We do not claim to cure any disease which is considered' incurable ' on the basis of scientific facts by modern medicine .The website’s content is not a substitute for direct, personal, professional medical care and diagnosis. . In many cases redness of eyes occurs without any other symptoms. while in rest of the cases the symptoms that can attend it includes irritation or itching, burning in the eyes. Some other symptoms that may accompany it include discharge from the eye, watering from eyes, pain in eye and dryness in the eyes. Few other symptoms include sensitivity to light (photophobia) and blurred vision. Redness of eyes is very common and can arise from various causes. Firstly it can arise from many irritants that can inflame the eyes. These irritants include dust, dry air, sun exposure, air pollution, smoke. Secondly, it can occur from eye allergies, hay fever / allergic rhinitis (an allergic disorder that arise from exaggerated response of the immune cells to allergic substances causing running nose, sneezing, nasal blockage and eye symptoms like irritation, redness, itching and watering from eyes) It can also arise from infection (bacterial and viral) and inflammation of the eyes. There are various inflammatory conditions of the eyes that can cause redness of eyes. It includes conjunctivitis (inflammation of the conjunctiva which refers to a membrane that covers the white of the eye). It also includes scleritis (an inflammation and redness of sclera – white of eye which is the outer, tough fibrous protective layer of the eyeball). It can occur in episcleritis (inflammation of the thin layer present on the white part of the eye / sclera). Another inflammatory condition of the eye linked with redness of the eye is iritis (swelling and inflammation in the coloured ring that surrounds the pupil of the eye). Other eye inflammatory conditions are keratitis (an inflammation of the cornea which is the clear, dome shaped tissue in front of eye which covers the pupil and iris) and uveitis (inflammation of the middle layer of eye called uvea that is the pigmented layer lying between the inner retina and the outer fibrous layer composed of the sclera and cornea). Apart from above eye redness can happen in blepharitis (inflammation of the margins of the eyelids where eyelashes grow). In addition to above, it can arise in case of Chalazion (a type of cyst forming in the eyelid from blockage of meibomian gland responsible for producing an oily substance that lubricates the eye) and stye ( red, painful lump near the edge of eyelid either upper or lower occurring from a bacterial infection). Corneal ulcer, a scratch /abrasion on cornea, herpetic infection of cornea can lead to eye redness too. Rest of the reasons include excessive screen time on computer /mobiles, dryness of the eyes, foreign object in eye, trauma / injury to eye, inward turning of eyelid (entropion), outward turning of eyelid (ectropion), side effect of using eye drops, complication of eye surgery or complication from use of contact lens, subconjunctival haemorrhage ( bleeding arising from broken blood vessel immediately beneath the surface of the eye), infection of tissue around the eyes (orbital cellulitis), glaucoma (an eye disorder characterised by increase of intraocular pressure and optic nerve damage). Homeopathy offers very effective treatment for cases of red eyes. The homeopathic medicines aim to treat the root cause behind it like inflammation, infection to decrease the redness of eyes. Additionally they also help to relieve the attending symptoms like itching, burning in the eyes, discharge from eye, watering from eyes, pain in the eye and dryness in the eyes. Red eyes can arise from mild causes to serious causes that require emergency medical attention. Homeopathic medicines can help in cases where no serious causes are linked to it. But in case of serious cause behind red eyes it is advisable to seek immediate medical help from the conventional mode of treatment. Eye redness attended with sudden changes in vision, pain in eye, intense headache, fever, sensitivity to light, white rings, or halos around light, nausea or vomiting are some of the indications of serious issues. Other than this serious issues includes red eyes arising from an injury, from entry of chemicals or a foreign object in the eye. Before starting homeopathic medicines for red eyes it is strictly advisable to consult a homeopathic physician who can best judge the homeopathic medicines that will suit a particular case and can guide if urgent help is needed from conventional mode in case of some serious cause. It is a natural medicine prepared from plant deadly nightshade. This plant belongs to family solanaceae. It is a top listed medicine for cases of red eyes. In cases needing it the eyes look very red, congested. It works well in inflammatory conditions of the eyes mainly conjunctivitis. Other than redness, persons needing it also have dryness and burning pain in their eyes. They may also have shooting pain in their eyes. Another attending complaint that they have is watering from the eyes. Other attending symptoms are soreness, redness and swelling of eyelids. Sometimes there is sensitivity to bright light also. This medicine is prepared from plant Euphrasia Officinalis commonly known as eye – bright. This plant belongs to family scrophulariaceae. It is a very effective medicine for redness of eyes along with watering and itching of eyes. The eye watering causes smarting and burns in the eyes. A sensation of sand in eyes attends these symptoms. It is very helpful in case of iritis, conjunctivitis. Along with above symptoms pain in the eye may be present that is worse at night. Sometimes photophobia is also there. Aconite is prepared from plant Aconitum Napellus commonly known as monkshood. This plant belongs to family ranunculaceae. This is very helpful medicine for cases of red, bloodshot, inflamed eyes. With this burning, shooting pains are present that appear mainly on moving eyeballs. Another attending symptom is watering from eyes that is worse in evening and night time. Roughness sensation in the eyes as from sand also appears with this. Apart from above burning, a smarting sensation and itching in the eyes is present which worsens in evening. 4. Apis Mellifica – For Bright Red Eyes with Smarting, Burning, Cutting Pain in Eyes It is a well indicated medicine for cases where there is bright redness of eyes along with smarting, burning, cutting pain in eyes. The white of the eye is full of dark blood vessels. Along with this the eyes are very sensitive to light. Eyes are itchy too. It is well indicated for cases of conjunctivitis, keratitis and blepharitis. 5. Natrum Mur – For Eye Redness with Watering from Eyes This medicine is a prominent medicine for persons who complain of eye redness along with watering from eyes. They feel that the watering worsens in open air. This watering is acrid that leads to redness and soreness in eyes. They also have swelling of eyelids. Lids appear red, raw, ulcerated along with burning. The eyelids are sticky in the morning and covered with thick scabs. It is a well indicated medicine for eye redness and eye discharge. It is indicated especially for conjunctivitis and blepharitis. In cases needing it the eye appears intensely pink or red along with profuse discharge of mucopurulent nature. The white of the eye is congested, swollen. With this the eyelid margins are red, swollen and thick. Eyelids are also sore and crusty. The eyelids get stuck together in the morning. Itching and burning, biting in eyes is felt with this. This is a very useful medicine for cases where the eyes are red, itchy watery with frequent sneezing. Hence its use is considered in cases of hay fever (allergic rhinitis). The eyes are also sensitive to touch. Runny noses also accompany these symptoms. 8. Merc Sol – For Redness of Eye Attended with Burning Pains This medicine works well in cases of eye redness accompanied with burning pains. In cases needing it white of the eye is markedly red. Sensitivity to bright light is also there. The eyelids, especially the upper one, are thick, red and swollen . Copious watering from eyes is also there along with above symptoms. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly known as Arbor Vitae. This plant belongs to family Coniferae. Its use is considered in cases where eyes appear blood red. Along with this excessive tearing (watering) from eyes is present. The eyelids may be dry, scaly and sticky at night. Burning and stinging in the eyelids attend this. It is a leading medicine for treating styes and chalazion. It is also one of the major medicines for treating scleritis. Sulphur is a great medicine when the eyes are red along with itching and burning sensation. A feeling of sand in the eyes is also prominent with this. Sometimes stitching, smarting or stinging is felt in the eyes. This medicine also plays a supportive help for managing eye redness and light sensitivity in cases of corneal ulcers.\n\nEsophagitis refers to inflammation of the esophagus (a tube through which food and drink passes from mouth to stomach). It can lead to damage of tissue of the esophagus, alter its structure or cause problems with its normal function. Homeopathic Remedies for Esophagitis help to reduce the inflammation of esophagus and effectively manage its symptoms. It can have various causes. The most common cause behind it is GERD (gastroesophageal reflux disease). In this condition there is backflow of stomach acid in the food pipe that can irritate its lining and lead to inflammation. Next it can arise from infections. Another reason behind it is use of certain medicines (NSAIDs , some antibiotics, steroids). Apart from this risk factors for it includes alcohol abuse, excessive cigarette use, radiation therapy, chemotherapy, chemical injury by alkaline or acid solutions, physical injury, weak immune system, stress, allergies, crohn’s disease (an autoimmune disease that causes inflammation and damage to gastrointestinal system), chronic vomiting, obesity, hiatal hernia (condition in which stomach bulges out from hiatus opening in diaphragm into chest), intense use of Vitamins and supplements, surgery in the chest area. This type usually results from GERD (gastroesophageal reflux disease). In this disease there is backflow of stomach acid upwards in the food pipe. There is a valve known as LES – lower esophageal sphincter, that keeps the stomach acid in the stomach and prevents its back flow. This valve opens only when food has to enter the stomach from the food pipe and is closed at all other times. When this valve opens at times other than eating or doesn’t close rightly then the stomach contents can get back in the food pipe. If this occurs frequently for a long time then acid content from the stomach can inflame and damage the lining of the food pipe and this condition is known as reflux esophagitis. There are some factors that increase the chance of GERD and inflammation of esophagus due to stomach acid. This includes taking excessive alcohol, coffee, chocolate, smoking, eating excessive fat and going to bed immediately after eating. This type occurs from an excessive number of eosinophils (a type of WBC – white blood cell that plays a role in allergic reactions) in the esophagus usually from an over reactive response to an allergen or acid reflux. There are some of the common food triggers for it, for eg, foods such as milk, eggs, soy, peanuts, wheat and shellfish. It can also result from inhaling an allergen like pollen. It is a rare type that occurs from an excessive number of lymphocytes (a type of white blood cells) in the esophageal lining. Crohn’s disease, GERD are some diseases associated with it. This results from taking some of the oral medicines with a very little amount of water. It increases the contact time of medicine with the lining of the food pipe. Some of the examples of these medicines include pain relievers (aspirin,ibuprofen), antibiotics (tetracycline), bisphosphonates, quinidine and potassium chloride. It is rare and can occur from a bacterial, viral, fungal or parasitic infection in the esophagus. This type mostly affects people having weak immune systems. Among infections fungus called Candida albicans is common cause of this type. These fungal infections are common in people with low immunity, people who are diabetic, have cancer or those who use steroids. Its symptoms include difficulty swallowing, pain while swallowing, heartburn, pain in the chest behind the breastbone while eating, food getting stuck in the food pipe. Other symptoms that can occur includes nausea, vomiting, decrease in appetite, epigastric pain, sore throat, hoarse voice and cough. Young children may have feeding difficulty and failure to thrive. If not treated well in time there can occur changes in the structure and function of the esophagus. Firstly it can lead to scarring, narrowing (stricture) in the esophagus. Next there can occur ulcers in the esophagus. Another complication is tearing or perforation of the esophagus. Lastly it can lead to Barrett’s esophagus (it is a precancerous condition in which there occurs damage to esophageal lining and changes in cells that line the esophagus which increases the risk of esophageal cancer). Homeopathy offers a very effective treatment for cases of esophagitis. Homeopathic medicines help to reduce the inflammation of esophagus and effectively manage its symptoms. Symptoms including difficult swallowing, painful swallowing, heartburn, sensation of food getting stuck in the food pipe, nausea, vomiting, epigastric pain can be well managed with these medicines. In mild to moderate cases they can be used as per the symptoms present. But in severe and complicated cases one must consider use of conventional treatment. Arsenic Album is a leading medicine for treating cases of esophagitis. Persons needing it have marked burning in the food pipe (heartburn). Burning is felt when swallowing the food. The burning is so intense as if esophagus is made raw by an acidic substance. Along with this nausea may attend. They may also have stinging sensation in the esophagus as from a splinter. Another complaint that they have is very difficult and painful swallowing. They also have a sensation as if everything swallowed gets lodged in the esophagus. Soreness of the throat and pain in the throat may also be felt by them. Vomiting may also be present in addition to above symptoms. This medicine is prepared from the root of the plant commonly named Blue flag. This plant belongs to the family Iridaceae. It is a highly recommended medicine for managing heartburn. In cases needing it there can also be continuous nausea. Vomiting is there which is sour, acrid in nature. This medicine is prepared from plant Robinia Pseudoacacia. This plant belongs to family leguminosae. It is a very suitable medicine to manage heartburn and acid reflux. Persons who need it mainly get heartburn at night time on lying down. They also have nausea. Another important symptom that is present is vomiting of intensely sour fluid.\n• Causticum – When There is Sensation of Food Lodging in Esophagus This medicine is beneficial for the cases when there is sensation of food lodging in the esophagus. Other than this there is nausea during or after a meal in cases that require this medicine. Next attending symptom is vomiting of acidic water or food. In many cases pressive, cramp – like pains or shooting type of pain is felt in the abdomen in the epigastric region. Phosphorus is another prominent medicine for these cases. It is indicated when the esophagus is there. Along with this there is difficulty swallowing liquids. Nausea and vomiting may also be present along with this. It is also a medicine for managing cases of stricture of esophagus. Alumina is a beneficial medicine to manage painful swallowing. Persons needing it have difficulty in swallowing solid food. They can take food in small pieces only. They feel taking warm drinks help to relieve this complaint. They also feel pressure pain in the region of esophagus as if it is contracted or compressed. This occurs mostly during swallowing.\n• Carbo veg – With Heartburn and Pain in Epigastrium Carbo veg is helpful for managing heartburn and pain in epigastrium. The pain in epigastrium can be aching or burning type. The pain gets worse after eating. Epigastric region is also very sensitive. Sensation of rawness in the food pipe and stomach are also felt. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage complaints of difficult and painful swallowing. Persons needing it have to swallow water to move down the solid food. They also feel burning, stinging and dryness in the food pipe. Sometimes contraction in esophagus is also felt. Along with this, pain in stomach, nausea, vomiting may also be present. It is a significant medicine for cases having difficulty swallowing. In such cases there is difficulty and pain in swallowing solids. When food reaches a particular point in the food pipe it gets difficult to go down further from inflammation at this point. This medicine is also indicated for managing cases of esophagitis occurring after corrosive substances. This medicine is prepared from the fresh root of a plant commonly known as American White Hellebore also called as Indian Poke. It belongs to the family melanthiaceae of the Liliaceae. Use of this medicine is considered when there is nausea and vomiting in these cases. Along with this burning is marked in the food pipe with constant desire to swallow. It is most helpful for acute cases of esophagitis.\n• Gelsemium – With Sensation of Something Lodged in Esophagus Homeopathic medicine Gelsemium is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. The main indication to use this medicine is sensation of something lodged in the esophagus. Pain attends to this. Cramping sensation is also felt in esophagus. Another accompanying symptom is burning in esophagus that can extend to the stomach.\n• Iodum – For Inflammation and Ulcers of Esophagus This medicine is prominent for cases in which inflammation and ulcers of esophagus are there. Persons needing it have a sensation of burning and scraping in the food pipe. They also feel pain in the food pipe. Swallowing is also difficult among them. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Albuminuria refers to a condition in which albumin (a type of protein) abnormally passes in the urine. Albumin is a major type of protein made in the liver that normally circulates in the blood. Homeopathic medicines for albuminuria mainly play a supportive role in managing such cases. Albumin is the most abundant and significant protein in the blood circulation. It helps in maintaining the right amount of fluid flowing throughout the body and acts as a carrier for fatty acid, thyroid hormones and steroids. The protein should remain in blood and never enter urine under normal circumstances. But when the protein albumin abnormally seeps in the urine it is referred to as albuminuria. The kidneys function to filter the blood in the body. When blood passes through the kidneys it keeps the things required by the body like protein but eliminates the things not needed out of the body as urine. The kidneys have got glomeruli which act as filters. When functioning normally, the protein cannot pass through the filter and enter urine or a very little trace of protein can pass in urine. But in case of damaged kidney excessive albumin can leak out of the kidneys into urine. Some of the conditions that cause a temporary increase of albumin in urine includes dehydration, stress, intense physical activity, cold weather, fever and side effects of some medications. Furthermore, the medical conditions that can lead to rise of albumin levels in the urine. First among them is diabetes, hypertension (high blood pressure – B.P.), kidney inflammation – nephritis, glomerulonephritis (inflammation of the glomeruli which are the structures made of tiny blood vessels in kidneys that filter blood), nephrotic syndrome (a kidney disorder in which body to pass too much protein in urine). physical trauma to the kidneys, cardiovascular disease like endocarditis (inflammation of the endocardium which is the inner layer of the heart). These medical conditions need urgent medical help as these can result in severe complications like kidney failure. People with diabetes, high blood pressure, elderly people above age of 65 yrs, individuals having family history of kidney disease are at high risk of albuminuria. Such people need to get tested for urine albumin quite frequently so that any kidney damage is detected and managed in time and further complications be prevented. It denotes the start of kidney damage with moderate increase in the albumin levels in the urine. When kidney damage is slight the albumin passes in urine in small quantities ( around 30mg to 300mg within the twenty four hour time frame ). When kidney function is greatly affected there is excessive passing of albumin in the urine denoting macroalbuminuria. The kidney allows passage of large amounts of albumin into the urine (more than 300 mg within the twenty four hour time frame). It indicates a serious kidney condition. It is mostly asymptomatic in the beginning stages. But when there is passage of a large amount of albumin in urine, there maybe some signs that give an indication towards it. First among them is urine having whitish foam or urine looking frothy. Next sign is swelling of the ankles, hands, eyes, face, legs, belly. The swelling occurs when abundant albumin passes in urine and results in low levels of protein in the blood. The low protein levels in blood leads to movement of fluid through the blood vessels walls into tissue. Cases of albuminuria need immediate medical attention to prevent serious complications. Homeopathic medicines mainly play a supportive role in managing cases of albuminuria. These medicines can be used along with conventional treatment for halting its further progression. Additionally they help in reducing oedema (swelling ) linked with it. Other than these homeopathic medicines also work towards managing associated symptoms like burning / painful urine, frequent urine, scanty urine, kidney pain. Albuminuria can have serious effects on the body and can lead to kidney damage. So one should use homeopathic medicines along with conventional treatment, that too under supervision of a homeopathic physician and never self prescribe any of these medicines. Apis Mellifica is a leading medicine for albuminuria. In cases needing it urine is frothy. Urine is also scanty. It can also contain blood. Urine is hot and can have an offensive smell. Along with this there is marked oedema. Here swelling is present on the face, hands, legs, and there is puffing of eyelids. Burning while urinating may also be present. Other than this sudden pain along the ureter can occur frequently. It is also considered for albuminuria with nephritis. This medicine is well indicated for early stages of albuminuria. Along with albumin, blood can also appear in urine where it is required. Pain, especially dull, aching type over kidney region may also be felt. There is swelling of lids, face and feet along with above symptoms. The urine is scanty and appears cloudy. Urine may also be fetid. It is also a prominent medicine for cases of nephritis.\n• Calcarea Arsenicosa – For Frequent Urine with Excessive Albumin in Urine It is a significant medicine for cases with frequent urine and excessive amounts of albumin in urine. People requiring it pass urine almost every hour. There is burning while urination and urine is scanty. Along with this great sensitivity of the kidney region to pressure is present. Swelling over the face and back of hands is also there. It is also a well indicated medicine for albuminuria during pregnancy.\n• Merc Cor – When Urine is Scanty and Have Albumin and Blood Merc Cor is a valuable medicine for cases where urine is scanty and contains albumin and blood. Urine is also hot, burning. There is frequent urge to urinate. Urine passes with pain and sometimes in drops. Swelling of the face is also there.\n• Nitric Acid – For Albuminuria with Pressure in Kidney Region This medicine is indicated for albuminuria with pressure in the kidney region. Urine is highly offensive in cases needing it. Urine appears turbid. Along with albumin urine may also contain mucus, pus and blood. There is frequent urging to urinate with scanty discharge. Oedema of feet, excessive weakness and nausea are other complaints that can attend. Cantharis is a very beneficial medicine when there is albuminuria and burning, painful urination. The pain and burning can be felt before, during or after urination. It is a top listed medicine for nephritis with blood in urine. Persons who need it may have pain in the kidney area. Kidney region may also be sensitive to the slightest touch. They have frequent urges to urinate but pass only scanty urine. The urine is turbid and scanty. It may appear cloudy during the night with white sediment. Urine may also contain blood and cylindrical casts.\n• Plumbum Met – When Urine is Scanty and Contains Albumin, Oxalate, Epithelial Cells, Hyaline Casts Plumbum Met is used when urine is scanty and contains albumin, oxalate, epithelial cells, hyaline casts. It may also contain RBC’s (red blood cells). Along with this there is excessive oedema (swelling) of eyelids. Intense weakness can accompany these symptoms.\n• Dulcamara -For Albumin in Urine, Swelling and Kidney Pain This medicine is prepared from fresh green stems and leaves of plant Solanum dulcamara having the common name Woody Nightshade and Bitter – sweet. This plant belongs to family solanaceae. It is indicated when the urine contains albumin and there is swelling in body tissue and pain in the kidney region. Along with this there is a constant desire to urinate. Urine is turbid, scanty, offensive and may contain tough, jelly – like, white or red mucus. This is a well indicated medicine for albuminuria and diabetes. There is swelling of lower limbs where it is required. There may also be pain in the kidney , especially the left side. The urine is frequent and profuse. It may be thick and have milky / white sediment. This medicine is prepared from the root of plant Helonias dioica also known as Blazing Star. This plant belongs to family melanthiaceae. Its use is suggested when there is kidney pain with albumin in urine. Other than this weight and burning sensation is felt in the kidneys. The right kidney may be sensitive. There is frequent urge to urinate and burning scalding pain can be felt when urinating.\n• Uranium Nitricum – For Albuminuria and Constant Pain and Soreness in Nack The indicating feature to use this medicine is albuminuria and constant pain and soreness in back. With this the urine is profuse and can be painful. It can be milky and have specific ammoniacal odour. There is frequent urination mainly at night. Excessive weakness and heaviness / pain, weariness in legs are few other accompanying symptoms. This medicine is prepared from plant Chimaphila Umbellata commonly known as Pipsissewa and Ground Holly. It belongs to the family pyroleae. This medicine is indicated for the last stages of albuminuria. In cases needing it constant pain is felt in the kidney region. Urine is scanty, fetid, very thick and contains albumin. Sometimes urine contains thick, ropy, bloody mucus. There is frequent desire to urinate with scanty urine. Scalding and smarting pain is felt during and after urination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Vaccines during childhood give protection to children against many serious diseases. For example DPT vaccine protects against diphtheria, tetanus, whooping cough (pertussis); MMR vaccine protects against measles, mumps, rubella; OPV protects against polio; HiB vaccine protects against Haemophilus influenzae type B infection. Though vaccine use is safe but like many other medicines any of the vaccine can cause some side-effects though mild in most cases. This occurs from a natural response of the body while it is directed towards immunity building against the disease for which vaccination is given. These side effects last from a few hours to one or two days after vaccination. Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination. Some of the side effects that can occur after inactivated poliovirus vaccine (IPV), DPT, Pneumococcal conjugate vaccine (PCV), Haemophilus influenzae type B vaccine (HiB vaccine). They mostly appear within 24 hrs of vaccination. These include mild fever; pain, soreness, tenderness, swelling or redness at the site of the injection; loss of appetite; diarrhoea; vomiting; tiredness; sluggishness and irritability; fussiness; secondary blister elsewhere on the body. Other than this side effects can occur 6 to 10 days after injection in case of MMR vaccine. These include mild fever, measles like rash, cough, runny nose, puffy eyes, swelling of salivary glands and loss of appetite. Next vaccine is rotavirus vaccine that can sometimes lead to diarrhoea, abdominal pain, restlessness and irritability in children. Other side effects that can occur after vaccination include small, red lump at the injection site. In some vaccines temporary headache, muscle or joint pain, runny nose, nasal congestion, trouble sleeping or drowsiness and being sleepy than usual. In case of high temperature rarely febrile seizures or fits can occur in young children. The chance of febrile seizure is high if a child has a history of such seizure earlier in his life or have a family history of seizures. In any of the vaccinations there are very rare chances (even less than one in million) of severe allergic reaction known as anaphylaxis. Swelling of face, hives, difficulty in breathing and even collapse can occur in severe allergic reactions. This tends to happen within minutes of taking the vaccination. This needs medical help right away without any delay. Homeopathy offers a very natural, effective, safe and gentle management of various ailments that arise after vaccination. These medicines are helpful to manage complaints of fever, diarrhoea, stomach pain, skin complaints, sleeplessness, redness, inflammation and swelling of arm, weakness headache, excessive sleep , runny nose, nasal congestion, cough, muscle or joint pain. In case of seizures use of homeopathic medicine should be considered along with conventional treatment. It is to be noted that homeopathic medicines have their own limitations to treat cases of severe reaction – anaphylaxis ( some of its signs and symptoms are swelling of tongue, throat, trouble breathing, rapid heartbeat, sudden drop of blood pressure). In such cases one must take immediate medical help from conventional mode of treatment without delay as it is a life threatening condition. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly named as Arbor Vitae. This plant belongs to family Coniferae. It is a leading medicine for managing numerous complaints arising after vaccination. Firstly it is indicated for diarrhoea after vaccination. It also helps in stomach pain in such cases. Secondly it is indicated for skin complaints, skin eruptions and skin growths that follow vaccination. Its third indication in these cases is seizures. Next it works effectively to manage sleeplessness that follows vaccination. Lastly it helps cases of weakness of legs that occur after re vaccination. Silicea is another highly valuable medicine for managing many issues that follows vaccination. Here it is well indicated for managing redness, inflammation and swelling of the arm that can appear after vaccination. Next it helps to manage weakness and lack of stamina in such cases. Another main indication for its use is nausea and loose motion that appear after vaccination sometimes. Headache, excessive sleep from vaccination are also well managed with this medicine. Apart from above indication seizures and weight loss are the rest of complaints where this medicine is indicated.\n• Ledum Pal – For Swelling, Redness and Inflammation of Arm This medicine is prepared from plant Ledum Palustre commonly known as wild rosemary and also marsh cistus. This plant belongs to family ericaceae. It is a foremost medicine in homeopathy for puncture wounds as arising from needle prick. Here it is beneficial medicine to manage swelling, redness and inflammation of the arm after vaccination injection. This medicine is also considered as a preventive for side effects of vaccination. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage fever after vaccination. In cases needing it the heat stage is prominent. There is burning heat over the whole body but especially most prominent in the head and face. Body feels burning hot like fire. With this redness of face is also there. Anxiety and restlessness is present with the internal heat of the body. There is excessive thirst during the heat stage. The heat stage alternates with the chill stage. In this stage there is coldness of limbs with heat in head. Violent chill is felt in the back. Apart from above it can also be used for managing redness, inflammation and swelling of the arm appearing after vaccination injection. This medicine is prepared from plant Podophyllum peltatum commonly known as May Apple. This plant belongs to the family berberidaceae. It is a well indicated medicine to manage diarrhoea. In cases requiring it the stool is watery, profuse and gushing. It can be yellowish or greenish in colour and has a very offensive smell. The stool can be frothy and have mucus in it sometimes. There is a sudden urge to pass stool. Fetid flatus is present with this. There is an urge for stool immediately after eating and drinking. Diarrhoea is usually painless where it is required. Intense nausea can be present before passing the stool. After passing stool, extreme weakness is felt by the person. It is a prominent medicine for managing skin rash appearing after vaccination. Violent itching is present in the rash where it is required. The itching is worse from warmth of bed and is better in the open air. Stinging and burning is marked in the rash. Skin is also sensitive to the slightest touch along with above symptoms. It is a very beneficial medicine for skin eruptions that can occur after vaccination. The eruptions are pustular where it is required. These eruptions are most marked on the scalp, face, and legs. It is also indicated for scabby eruptions on scalp, arms and legs appearing after vaccination. Arsenic Album is a very helpful medicine for managing runny nose and nasal congestion. In cases needing it there is profuse and watery discharge from the nose. It can lead to burning sensation, excoriation in the nostrils. In some cases stoppage of the nose and fluent runny nose alternate with each other that requires this medicine. Great weakness may attend the above symptoms. This medicine is prepared from plant Drosera Rotundifolia having a common name round – leaved sundew. This plant belongs to family droseraceae. It is an effective medicine to manage dry irritative cough. Along with cough roughness, dryness and tickling sensation is felt in the fauces. People needing it mainly complain of cough getting worse from lying down in the evening and from warmth. This medicine offers great help in cases of loose cough with rattling of mucus in the chest. Cough is present day and night. Chest feels congested from mucus in the chest. Scanty, thick, phlegm is expectorated in these cases. Expectoration is difficult. Rhus Tox is a very effective medicine to manage joint pain and muscle pain. It brings great relief in this complaint. The pain may be worse at rest and better by motion where this medicine is required. In cases needing it, stiffness of joints may also be present. The stiffness tends to get better by warmth and also by massage. This medicine is prepared from the fresh root of plant Cicuta Virosa having the common name water hemlock. This plant belongs to the family umbelliferae. This medicine can be used along with conventional treatment for managing seizures after vaccination. In cases needing it the fits occur with frightful distortion of the limbs or whole body. Loss of consciousness and frothing at mouth may occur with this. High fever is present along with above symptoms. Homeopathic medicine Malandrium is particularly indicated for managing cases where dryness, hardness and roughness of skin occurs after vaccination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Angioedema refers to edema or swelling underneath the skin that can become severe. It usually occurs from an allergic reaction. This swelling can appear with hives that’s why it is sometimes called giant hives. Hives also known as urticaria refers to itchy, elevated, red welts/wheals or bumps on the skin surface that occur mostly from an allergic reaction. Homeopathic Remedies for Angioedema are beneficial in all types of angioedema with symptoms having mild to moderate intensity. Angioedema is a harmless condition in most cases and gets well in a few days. However, in serious cases the tongue that can cause blockage of airways and difficulty in breathing that needs prompt medical help. Severe angioedema may be a part of a dangerous medical condition called anaphylaxis needing emergency treatment. Anaphylaxis is a severe allergic reaction in which there appears swelling of lips, tongue and throat that blocks airways and leads to breathing problems, rapid heartbeat, sudden drop of blood pressure, dizziness and sometimes fainting. Anaphylaxis is a severe life threatening condition that should be urgently treated with conventional treatment. It most commonly arises from an allergic reaction and this type is known as allergic angioedema. The allergic reaction can occur from certain foods like eggs, peanuts, fish, shellfish and milk. This reaction can also occur from insect bites, pollen, animal dander, latex and poison ivy. The body detects a substance (like any of the above) as something dangerous. Following this there is release of histamine by the body that causes dilatation of the blood vessels and fluid leakage. In severe cases of allergic angioedema, anaphylaxis can occur with swelling of throat, difficulty in breathing and sudden drop in blood pressure. It is a medical emergency needing immediate medical help. It can also arise from the use of certain medicines called drug – induced angioedema. Few medicines that can lead to it include aspirin, NSAID’s (non steroidal anti inflammatory drugs), penicillin, antibiotics and some of the medicines used to control high BP (blood pressure). Thirdly, it may occur after an infection or with illnesses like SLE (It is an autoimmune disease in which the immune system attacks and damages healthy tissues of the body. It can affect skin, kidneys, blood vessels, lungs, heart, nervous system, muscles, bones, eyes). Another medical condition linked with it is leukaemia (cancer of blood cells). Other than this a medical condition lymphoma is associated with it. Lymphoma refers to a cancer beginning in lymphocytes which are cells of the immune system that help to fight with infection. In case of lymphoma these lymphocytes change and keep multiplying out of control. Rarely it can occur in people having a family history of it where it is called as hereditary angioedema. Here a person has inherited this condition from a parent through genetic transmission. In hereditary angioedema the body is unable to make a blood protein called C1 esterase inhibitor in the right amount that results in fluid movement from the blood into tissues resulting in swelling. Other than this it can arise if a person has a weak immune system where it is called as acquired angioedema. Lastly, it can be idiopathic type where no cause is ruled out behind swelling. Some factors linked with it include stress, anxiety, intense exercise, exposure to heat and cold and minor infection. Its main sign is swelling below the skin. The swelling can develop suddenly or gradually in a few hours. Sometimes it may be attended with swelling and welts on the surface of the skin (hives) that may be painful and itchy. Redness, warmth and pain can appear in the swollen area. The swelling mainly occurs on the face especially around the eyes, lips; around the mouth; hands, feet, arms, legs; tongue. In severe cases the swelling can spread to other body parts. The swelling can also occur around the genitals and in intestines. Apart from above abdominal cramping, intense vomiting, redness irritation of eyes, diarrhoea (loose motion), weakness and dizziness can also occur. In some cases swelling appears in the throat with hoarseness, and difficulty in breathing. In case of swelling of the throat and tongue with difficult breathing, urgent medical help needs to be taken as it can be dangerous. There is a great scope of treating angioedema in homeopathy. There are many natural homeopathic medicines that are very effective for reducing the swelling in these cases and treating hives. In case of allergic cases it brings great recovery by moderating the immune system which is causing allergic reaction. Homeopathic medicines are helpful to manage recent cases and long standing or recurrent cases. It is to be noted that homeopathic medicines can be safely taken as long as there is no swelling of throat, airways, tongue attended with difficulty breathing. In the severe cases where there is swelling of throat, airways, tongue that obstructs breathing immediate treatment with conventional mode is needed. Also homeopathy has a limitation in treating cases of anaphylaxis reaction where urgent help from conventional treatment is required without any delay. Apis Mellifica is a leading medicine for cases of angioedema. Persons needing it have swelling over the face mainly eyelids, lips; mouth; and hands, feet. Redness and heat in the face is marked. In males swelling can also appear in testicles. In females the swelling can occur on labia. Burning stinging pains are complained in the area of swelling. Along with these symptoms there are hives with wheals on skin. The wheals are red with intense burning, stinging sensation. They are painful, tender and itchy. The itching mostly gets worse at night time. Apart from above symptoms there may be redness and itching in the eyes. Symptoms of angioedema occurring after bee sting are also well treated with this medicine. These symptoms include stinging, burning sharp prickling pain in skin and excessive swelling.\n• Urtica Urens – For Hives and Marked Swelling of Face, Hands, Feet It is prepared from a plant called Stinging – nettle that belongs to the family Urticaceae. The fresh plant in flowers is used for preparing homeopathic medicine. It is well indicated for hives and marked swelling of face, hands, feet. In cases needing it the fingers and hands are much swollen with itching. Lumps and red spots on hands are present. The face, hands and feet are swollen with stinging, burning and redness. The eyelids are intensely swollen and can be scarcely opened. In the case of hives raised red blotches are there on skin. This is attended with itching, burning and stinging. It also helps cases of hives from eating shellfish.\n• Rhus Tox – For Hives with Oedema of Lids It is a very beneficial medicine like above to medicines for cases where hives are present with oedema of eyelids. For using this medicine the hives usually occur from getting wet and in cold air. The hives have burning and itching in it. Affected skin appears tense and shining. The wheals are excessive mostly on hand and forearm. There is marked stitching pain in the eruption This medicine is prominently indicated when oedematous swellings are attended with burning pain. Along with this urticarial eruptions are present. These eruptions also have much burning in them. Marked restlessness attends this. A general weakness may accompany the above symptoms. This medicine also helps to manage vomiting and loose stool in these cases. Urticaria from eating shellfish is also an indicating feature for using this medicine. It is the next important medicine for cases of angioedema. For using it the main symptoms are swelling, itching, redness, burning of skin. There appears circumscribed oedematous lesions. Itching is there that changes place on scratching. Hepar Sulph is a very useful medicine for cases of angioedema and long standing recurring urticaria. Swelling is mainly present on upper lip, hands and feet in cases requiring it. The wheals mainly appear on hands and fingers. Few general symptoms that are present include sticking, pricking on skin and sensitivity of skin to slightest touch.\n• Antipyrinum – Another Well Indicated Medicine For Angioedema Antipyrinum is also a well indicated medicine for angioedema. People needing it also have urticaria. In them the urticaria appears and disappears suddenly. It may be attended with internal coldness. Most intense itching is present in the eruptions. For using it the eruptions are mostly present between the fingers. This medicine is prepared from the root of a plant called Helleborus Niger commonly known as Black Hellebore and Christmas Rose. It belongs to family ranunculaceae. It is indicated when there occurs sudden swelling of skin. Edema occurs on the face along with redness. Edema also appears on legs. Legal Disclaimer -None of the medicines mentioned including services , mentioned at Drhomeo.com should be used without clearance from your physician or health care provider. We do not claim to cure any disease which is considered' incurable ' on the basis of scientific facts by modern medicine .The website’s content is not a substitute for direct, personal, professional medical care and diagnosis. . It can have various causes. The most common cause behind it is GERD (gastroesophageal reflux disease). In this condition there is backflow of stomach acid in the food pipe that can irritate its lining and lead to inflammation. Next it can arise from infections. Another reason behind it is use of certain medicines (NSAIDs , some antibiotics, steroids). Apart from this risk factors for it includes alcohol abuse, excessive cigarette use, radiation therapy, chemotherapy, chemical injury by alkaline or acid solutions, physical injury, weak immune system, stress, allergies, crohn’s disease (an autoimmune disease that causes inflammation and damage to gastrointestinal system), chronic vomiting, obesity, hiatal hernia (condition in which stomach bulges out from hiatus opening in diaphragm into chest), intense use of Vitamins and supplements, surgery in the chest area. This type usually results from GERD (gastroesophageal reflux disease). In this disease there is backflow of stomach acid upwards in the food pipe. There is a valve known as LES – lower esophageal sphincter, that keeps the stomach acid in the stomach and prevents its back flow. This valve opens only when food has to enter the stomach from the food pipe and is closed at all other times. When this valve opens at times other than eating or doesn’t close rightly then the stomach contents can get back in the food pipe. If this occurs frequently for a long time then acid content from the stomach can inflame and damage the lining of the food pipe and this condition is known as reflux esophagitis. There are some factors that increase the chance of GERD and inflammation of esophagus due to stomach acid. This includes taking excessive alcohol, coffee, chocolate, smoking, eating excessive fat and going to bed immediately after eating. This type occurs from an excessive number of eosinophils (a type of WBC – white blood cell that plays a role in allergic reactions) in the esophagus usually from an over reactive response to an allergen or acid reflux. There are some of the common food triggers for it, for eg, foods such as milk, eggs, soy, peanuts, wheat and shellfish. It can also result from inhaling an allergen like pollen. It is a rare type that occurs from an excessive number of lymphocytes (a type of white blood cells) in the esophageal lining. Crohn’s disease, GERD are some diseases associated with it. This results from taking some of the oral medicines with a very little amount of water. It increases the contact time of medicine with the lining of the food pipe. Some of the examples of these medicines include pain relievers (aspirin,ibuprofen), antibiotics (tetracycline), bisphosphonates, quinidine and potassium chloride. It is rare and can occur from a bacterial, viral, fungal or parasitic infection in the esophagus. This type mostly affects people having weak immune systems. Among infections fungus called Candida albicans is common cause of this type. These fungal infections are common in people with low immunity, people who are diabetic, have cancer or those who use steroids. Its symptoms include difficulty swallowing, pain while swallowing, heartburn, pain in the chest behind the breastbone while eating, food getting stuck in the food pipe. Other symptoms that can occur includes nausea, vomiting, decrease in appetite, epigastric pain, sore throat, hoarse voice and cough. Young children may have feeding difficulty and failure to thrive. If not treated well in time there can occur changes in the structure and function of the esophagus. Firstly it can lead to scarring, narrowing (stricture) in the esophagus. Next there can occur ulcers in the esophagus. Another complication is tearing or perforation of the esophagus. Lastly it can lead to Barrett’s esophagus (it is a precancerous condition in which there occurs damage to esophageal lining and changes in cells that line the esophagus which increases the risk of esophageal cancer). Homeopathy offers a very effective treatment for cases of esophagitis. Homeopathic medicines help to reduce the inflammation of esophagus and effectively manage its symptoms. Symptoms including difficult swallowing, painful swallowing, heartburn, sensation of food getting stuck in the food pipe, nausea, vomiting, epigastric pain can be well managed with these medicines. In mild to moderate cases they can be used as per the symptoms present. But in severe and complicated cases one must consider use of conventional treatment. Arsenic Album is a leading medicine for treating cases of esophagitis. Persons needing it have marked burning in the food pipe (heartburn). Burning is felt when swallowing the food. The burning is so intense as if esophagus is made raw by an acidic substance. Along with this nausea may attend. They may also have stinging sensation in the esophagus as from a splinter. Another complaint that they have is very difficult and painful swallowing. They also have a sensation as if everything swallowed gets lodged in the esophagus. Soreness of the throat and pain in the throat may also be felt by them. Vomiting may also be present in addition to above symptoms. This medicine is prepared from the root of the plant commonly named Blue flag. This plant belongs to the family Iridaceae. It is a highly recommended medicine for managing heartburn. In cases needing it there can also be continuous nausea. Vomiting is there which is sour, acrid in nature. This medicine is prepared from plant Robinia Pseudoacacia. This plant belongs to family leguminosae. It is a very suitable medicine to manage heartburn and acid reflux. Persons who need it mainly get heartburn at night time on lying down. They also have nausea. Another important symptom that is present is vomiting of intensely sour fluid.\n• Causticum – When There is Sensation of Food Lodging in Esophagus This medicine is beneficial for the cases when there is sensation of food lodging in the esophagus. Other than this there is nausea during or after a meal in cases that require this medicine. Next attending symptom is vomiting of acidic water or food. In many cases pressive, cramp – like pains or shooting type of pain is felt in the abdomen in the epigastric region. Phosphorus is another prominent medicine for these cases. It is indicated when the esophagus is there. Along with this there is difficulty swallowing liquids. Nausea and vomiting may also be present along with this. It is also a medicine for managing cases of stricture of esophagus. Alumina is a beneficial medicine to manage painful swallowing. Persons needing it have difficulty in swallowing solid food. They can take food in small pieces only. They feel taking warm drinks help to relieve this complaint. They also feel pressure pain in the region of esophagus as if it is contracted or compressed. This occurs mostly during swallowing.\n• Carbo veg – With Heartburn and Pain in Epigastrium Carbo veg is helpful for managing heartburn and pain in epigastrium. The pain in epigastrium can be aching or burning type. The pain gets worse after eating. Epigastric region is also very sensitive. Sensation of rawness in the food pipe and stomach are also felt. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage complaints of difficult and painful swallowing. Persons needing it have to swallow water to move down the solid food. They also feel burning, stinging and dryness in the food pipe. Sometimes contraction in esophagus is also felt. Along with this, pain in stomach, nausea, vomiting may also be present. It is a significant medicine for cases having difficulty swallowing. In such cases there is difficulty and pain in swallowing solids. When food reaches a particular point in the food pipe it gets difficult to go down further from inflammation at this point. This medicine is also indicated for managing cases of esophagitis occurring after corrosive substances. This medicine is prepared from the fresh root of a plant commonly known as American White Hellebore also called as Indian Poke. It belongs to the family melanthiaceae of the Liliaceae. Use of this medicine is considered when there is nausea and vomiting in these cases. Along with this burning is marked in the food pipe with constant desire to swallow. It is most helpful for acute cases of esophagitis.\n• Gelsemium – With Sensation of Something Lodged in Esophagus Homeopathic medicine Gelsemium is prepared from the bark of the root of plant Gelsemium Sempervirens commonly known as yellow jasmine. This plant belongs to family loganiaceae. The main indication to use this medicine is sensation of something lodged in the esophagus. Pain attends to this. Cramping sensation is also felt in esophagus. Another accompanying symptom is burning in esophagus that can extend to the stomach.\n• Iodum – For Inflammation and Ulcers of Esophagus This medicine is prominent for cases in which inflammation and ulcers of esophagus are there. Persons needing it have a sensation of burning and scraping in the food pipe. They also feel pain in the food pipe. Swallowing is also difficult among them.\n\nAlbuminuria refers to a condition in which albumin (a type of protein) abnormally passes in the urine. Albumin is a major type of protein made in the liver that normally circulates in the blood. Homeopathic medicines for albuminuria mainly play a supportive role in managing such cases. Albumin is the most abundant and significant protein in the blood circulation. It helps in maintaining the right amount of fluid flowing throughout the body and acts as a carrier for fatty acid, thyroid hormones and steroids. The protein should remain in blood and never enter urine under normal circumstances. But when the protein albumin abnormally seeps in the urine it is referred to as albuminuria. The kidneys function to filter the blood in the body. When blood passes through the kidneys it keeps the things required by the body like protein but eliminates the things not needed out of the body as urine. The kidneys have got glomeruli which act as filters. When functioning normally, the protein cannot pass through the filter and enter urine or a very little trace of protein can pass in urine. But in case of damaged kidney excessive albumin can leak out of the kidneys into urine. Some of the conditions that cause a temporary increase of albumin in urine includes dehydration, stress, intense physical activity, cold weather, fever and side effects of some medications. Furthermore, the medical conditions that can lead to rise of albumin levels in the urine. First among them is diabetes, hypertension (high blood pressure – B.P.), kidney inflammation – nephritis, glomerulonephritis (inflammation of the glomeruli which are the structures made of tiny blood vessels in kidneys that filter blood), nephrotic syndrome (a kidney disorder in which body to pass too much protein in urine). physical trauma to the kidneys, cardiovascular disease like endocarditis (inflammation of the endocardium which is the inner layer of the heart). These medical conditions need urgent medical help as these can result in severe complications like kidney failure. People with diabetes, high blood pressure, elderly people above age of 65 yrs, individuals having family history of kidney disease are at high risk of albuminuria. Such people need to get tested for urine albumin quite frequently so that any kidney damage is detected and managed in time and further complications be prevented. It denotes the start of kidney damage with moderate increase in the albumin levels in the urine. When kidney damage is slight the albumin passes in urine in small quantities ( around 30mg to 300mg within the twenty four hour time frame ). When kidney function is greatly affected there is excessive passing of albumin in the urine denoting macroalbuminuria. The kidney allows passage of large amounts of albumin into the urine (more than 300 mg within the twenty four hour time frame). It indicates a serious kidney condition. It is mostly asymptomatic in the beginning stages. But when there is passage of a large amount of albumin in urine, there maybe some signs that give an indication towards it. First among them is urine having whitish foam or urine looking frothy. Next sign is swelling of the ankles, hands, eyes, face, legs, belly. The swelling occurs when abundant albumin passes in urine and results in low levels of protein in the blood. The low protein levels in blood leads to movement of fluid through the blood vessels walls into tissue. Cases of albuminuria need immediate medical attention to prevent serious complications. Homeopathic medicines mainly play a supportive role in managing cases of albuminuria. These medicines can be used along with conventional treatment for halting its further progression. Additionally they help in reducing oedema (swelling ) linked with it. Other than these homeopathic medicines also work towards managing associated symptoms like burning / painful urine, frequent urine, scanty urine, kidney pain. Albuminuria can have serious effects on the body and can lead to kidney damage. So one should use homeopathic medicines along with conventional treatment, that too under supervision of a homeopathic physician and never self prescribe any of these medicines. Apis Mellifica is a leading medicine for albuminuria. In cases needing it urine is frothy. Urine is also scanty. It can also contain blood. Urine is hot and can have an offensive smell. Along with this there is marked oedema. Here swelling is present on the face, hands, legs, and there is puffing of eyelids. Burning while urinating may also be present. Other than this sudden pain along the ureter can occur frequently. It is also considered for albuminuria with nephritis. This medicine is well indicated for early stages of albuminuria. Along with albumin, blood can also appear in urine where it is required. Pain, especially dull, aching type over kidney region may also be felt. There is swelling of lids, face and feet along with above symptoms. The urine is scanty and appears cloudy. Urine may also be fetid. It is also a prominent medicine for cases of nephritis.\n• Calcarea Arsenicosa – For Frequent Urine with Excessive Albumin in Urine It is a significant medicine for cases with frequent urine and excessive amounts of albumin in urine. People requiring it pass urine almost every hour. There is burning while urination and urine is scanty. Along with this great sensitivity of the kidney region to pressure is present. Swelling over the face and back of hands is also there. It is also a well indicated medicine for albuminuria during pregnancy.\n• Merc Cor – When Urine is Scanty and Have Albumin and Blood Merc Cor is a valuable medicine for cases where urine is scanty and contains albumin and blood. Urine is also hot, burning. There is frequent urge to urinate. Urine passes with pain and sometimes in drops. Swelling of the face is also there.\n• Nitric Acid – For Albuminuria with Pressure in Kidney Region This medicine is indicated for albuminuria with pressure in the kidney region. Urine is highly offensive in cases needing it. Urine appears turbid. Along with albumin urine may also contain mucus, pus and blood. There is frequent urging to urinate with scanty discharge. Oedema of feet, excessive weakness and nausea are other complaints that can attend. Cantharis is a very beneficial medicine when there is albuminuria and burning, painful urination. The pain and burning can be felt before, during or after urination. It is a top listed medicine for nephritis with blood in urine. Persons who need it may have pain in the kidney area. Kidney region may also be sensitive to the slightest touch. They have frequent urges to urinate but pass only scanty urine. The urine is turbid and scanty. It may appear cloudy during the night with white sediment. Urine may also contain blood and cylindrical casts.\n• Plumbum Met – When Urine is Scanty and Contains Albumin, Oxalate, Epithelial Cells, Hyaline Casts Plumbum Met is used when urine is scanty and contains albumin, oxalate, epithelial cells, hyaline casts. It may also contain RBC’s (red blood cells). Along with this there is excessive oedema (swelling) of eyelids. Intense weakness can accompany these symptoms.\n• Dulcamara -For Albumin in Urine, Swelling and Kidney Pain This medicine is prepared from fresh green stems and leaves of plant Solanum dulcamara having the common name Woody Nightshade and Bitter – sweet. This plant belongs to family solanaceae. It is indicated when the urine contains albumin and there is swelling in body tissue and pain in the kidney region. Along with this there is a constant desire to urinate. Urine is turbid, scanty, offensive and may contain tough, jelly – like, white or red mucus. This is a well indicated medicine for albuminuria and diabetes. There is swelling of lower limbs where it is required. There may also be pain in the kidney , especially the left side. The urine is frequent and profuse. It may be thick and have milky / white sediment. This medicine is prepared from the root of plant Helonias dioica also known as Blazing Star. This plant belongs to family melanthiaceae. Its use is suggested when there is kidney pain with albumin in urine. Other than this weight and burning sensation is felt in the kidneys. The right kidney may be sensitive. There is frequent urge to urinate and burning scalding pain can be felt when urinating.\n• Uranium Nitricum – For Albuminuria and Constant Pain and Soreness in Nack The indicating feature to use this medicine is albuminuria and constant pain and soreness in back. With this the urine is profuse and can be painful. It can be milky and have specific ammoniacal odour. There is frequent urination mainly at night. Excessive weakness and heaviness / pain, weariness in legs are few other accompanying symptoms. This medicine is prepared from plant Chimaphila Umbellata commonly known as Pipsissewa and Ground Holly. It belongs to the family pyroleae. This medicine is indicated for the last stages of albuminuria. In cases needing it constant pain is felt in the kidney region. Urine is scanty, fetid, very thick and contains albumin. Sometimes urine contains thick, ropy, bloody mucus. There is frequent desire to urinate with scanty urine. Scalding and smarting pain is felt during and after urination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Vaccines during childhood give protection to children against many serious diseases. For example DPT vaccine protects against diphtheria, tetanus, whooping cough (pertussis); MMR vaccine protects against measles, mumps, rubella; OPV protects against polio; HiB vaccine protects against Haemophilus influenzae type B infection. Though vaccine use is safe but like many other medicines any of the vaccine can cause some side-effects though mild in most cases. This occurs from a natural response of the body while it is directed towards immunity building against the disease for which vaccination is given. These side effects last from a few hours to one or two days after vaccination. Homeopathic remedies for vaccine side effects offer a very natural, effective, safe and gentle management of various ailments that arise after vaccination. Some of the side effects that can occur after inactivated poliovirus vaccine (IPV), DPT, Pneumococcal conjugate vaccine (PCV), Haemophilus influenzae type B vaccine (HiB vaccine). They mostly appear within 24 hrs of vaccination. These include mild fever; pain, soreness, tenderness, swelling or redness at the site of the injection; loss of appetite; diarrhoea; vomiting; tiredness; sluggishness and irritability; fussiness; secondary blister elsewhere on the body. Other than this side effects can occur 6 to 10 days after injection in case of MMR vaccine. These include mild fever, measles like rash, cough, runny nose, puffy eyes, swelling of salivary glands and loss of appetite. Next vaccine is rotavirus vaccine that can sometimes lead to diarrhoea, abdominal pain, restlessness and irritability in children. Other side effects that can occur after vaccination include small, red lump at the injection site. In some vaccines temporary headache, muscle or joint pain, runny nose, nasal congestion, trouble sleeping or drowsiness and being sleepy than usual. In case of high temperature rarely febrile seizures or fits can occur in young children. The chance of febrile seizure is high if a child has a history of such seizure earlier in his life or have a family history of seizures. In any of the vaccinations there are very rare chances (even less than one in million) of severe allergic reaction known as anaphylaxis. Swelling of face, hives, difficulty in breathing and even collapse can occur in severe allergic reactions. This tends to happen within minutes of taking the vaccination. This needs medical help right away without any delay. Homeopathy offers a very natural, effective, safe and gentle management of various ailments that arise after vaccination. These medicines are helpful to manage complaints of fever, diarrhoea, stomach pain, skin complaints, sleeplessness, redness, inflammation and swelling of arm, weakness headache, excessive sleep , runny nose, nasal congestion, cough, muscle or joint pain. In case of seizures use of homeopathic medicine should be considered along with conventional treatment. It is to be noted that homeopathic medicines have their own limitations to treat cases of severe reaction – anaphylaxis ( some of its signs and symptoms are swelling of tongue, throat, trouble breathing, rapid heartbeat, sudden drop of blood pressure). In such cases one must take immediate medical help from conventional mode of treatment without delay as it is a life threatening condition. This medicine is prepared from fresh green twigs of plant Thuja occidentalis commonly named as Arbor Vitae. This plant belongs to family Coniferae. It is a leading medicine for managing numerous complaints arising after vaccination. Firstly it is indicated for diarrhoea after vaccination. It also helps in stomach pain in such cases. Secondly it is indicated for skin complaints, skin eruptions and skin growths that follow vaccination. Its third indication in these cases is seizures. Next it works effectively to manage sleeplessness that follows vaccination. Lastly it helps cases of weakness of legs that occur after re vaccination. Silicea is another highly valuable medicine for managing many issues that follows vaccination. Here it is well indicated for managing redness, inflammation and swelling of the arm that can appear after vaccination. Next it helps to manage weakness and lack of stamina in such cases. Another main indication for its use is nausea and loose motion that appear after vaccination sometimes. Headache, excessive sleep from vaccination are also well managed with this medicine. Apart from above indication seizures and weight loss are the rest of complaints where this medicine is indicated.\n• Ledum Pal – For Swelling, Redness and Inflammation of Arm This medicine is prepared from plant Ledum Palustre commonly known as wild rosemary and also marsh cistus. This plant belongs to family ericaceae. It is a foremost medicine in homeopathy for puncture wounds as arising from needle prick. Here it is beneficial medicine to manage swelling, redness and inflammation of the arm after vaccination injection. This medicine is also considered as a preventive for side effects of vaccination. This medicine is prepared from plant deadly nightshade. It belongs to family solanaceae. It is very effective to manage fever after vaccination. In cases needing it the heat stage is prominent. There is burning heat over the whole body but especially most prominent in the head and face. Body feels burning hot like fire. With this redness of face is also there. Anxiety and restlessness is present with the internal heat of the body. There is excessive thirst during the heat stage. The heat stage alternates with the chill stage. In this stage there is coldness of limbs with heat in head. Violent chill is felt in the back. Apart from above it can also be used for managing redness, inflammation and swelling of the arm appearing after vaccination injection. This medicine is prepared from plant Podophyllum peltatum commonly known as May Apple. This plant belongs to the family berberidaceae. It is a well indicated medicine to manage diarrhoea. In cases requiring it the stool is watery, profuse and gushing. It can be yellowish or greenish in colour and has a very offensive smell. The stool can be frothy and have mucus in it sometimes. There is a sudden urge to pass stool. Fetid flatus is present with this. There is an urge for stool immediately after eating and drinking. Diarrhoea is usually painless where it is required. Intense nausea can be present before passing the stool. After passing stool, extreme weakness is felt by the person. It is a prominent medicine for managing skin rash appearing after vaccination. Violent itching is present in the rash where it is required. The itching is worse from warmth of bed and is better in the open air. Stinging and burning is marked in the rash. Skin is also sensitive to the slightest touch along with above symptoms. It is a very beneficial medicine for skin eruptions that can occur after vaccination. The eruptions are pustular where it is required. These eruptions are most marked on the scalp, face, and legs. It is also indicated for scabby eruptions on scalp, arms and legs appearing after vaccination. Arsenic Album is a very helpful medicine for managing runny nose and nasal congestion. In cases needing it there is profuse and watery discharge from the nose. It can lead to burning sensation, excoriation in the nostrils. In some cases stoppage of the nose and fluent runny nose alternate with each other that requires this medicine. Great weakness may attend the above symptoms. This medicine is prepared from plant Drosera Rotundifolia having a common name round – leaved sundew. This plant belongs to family droseraceae. It is an effective medicine to manage dry irritative cough. Along with cough roughness, dryness and tickling sensation is felt in the fauces. People needing it mainly complain of cough getting worse from lying down in the evening and from warmth. This medicine offers great help in cases of loose cough with rattling of mucus in the chest. Cough is present day and night. Chest feels congested from mucus in the chest. Scanty, thick, phlegm is expectorated in these cases. Expectoration is difficult. Rhus Tox is a very effective medicine to manage joint pain and muscle pain. It brings great relief in this complaint. The pain may be worse at rest and better by motion where this medicine is required. In cases needing it, stiffness of joints may also be present. The stiffness tends to get better by warmth and also by massage. This medicine is prepared from the fresh root of plant Cicuta Virosa having the common name water hemlock. This plant belongs to the family umbelliferae. This medicine can be used along with conventional treatment for managing seizures after vaccination. In cases needing it the fits occur with frightful distortion of the limbs or whole body. Loss of consciousness and frothing at mouth may occur with this. High fever is present along with above symptoms. Homeopathic medicine Malandrium is particularly indicated for managing cases where dryness, hardness and roughness of skin occurs after vaccination. Call Dr. Sharma's Clinic - From United States and Canada call 703-659-0873. Patients From rest of the world and India call +91-6283487321 Angioedema refers to edema or swelling underneath the skin that can become severe. It usually occurs from an allergic reaction. This swelling can appear with hives that’s why it is sometimes called giant hives. Hives also known as urticaria refers to itchy, elevated, red welts/wheals or bumps on the skin surface that occur mostly from an allergic reaction. Homeopathic Remedies for Angioedema are beneficial in all types of angioedema with symptoms having mild to moderate intensity. Angioedema is a harmless condition in most cases and gets well in a few days. However, in serious cases the tongue that can cause blockage of airways and difficulty in breathing that needs prompt medical help. Severe angioedema may be a part of a dangerous medical condition called anaphylaxis needing emergency treatment. Anaphylaxis is a severe allergic reaction in which there appears swelling of lips, tongue and throat that blocks airways and leads to breathing problems, rapid heartbeat, sudden drop of blood pressure, dizziness and sometimes fainting. Anaphylaxis is a severe life threatening condition that should be urgently treated with conventional treatment. It most commonly arises from an allergic reaction and this type is known as allergic angioedema. The allergic reaction can occur from certain foods like eggs, peanuts, fish, shellfish and milk. This reaction can also occur from insect bites, pollen, animal dander, latex and poison ivy. The body detects a substance (like any of the above) as something dangerous. Following this there is release of histamine by the body that causes dilatation of the blood vessels and fluid leakage. In severe cases of allergic angioedema, anaphylaxis can occur with swelling of throat, difficulty in breathing and sudden drop in blood pressure. It is a medical emergency needing immediate medical help. It can also arise from the use of certain medicines called drug – induced angioedema. Few medicines that can lead to it include aspirin, NSAID’s (non steroidal anti inflammatory drugs), penicillin, antibiotics and some of the medicines used to control high BP (blood pressure). Thirdly, it may occur after an infection or with illnesses like SLE (It is an autoimmune disease in which the immune system attacks and damages healthy tissues of the body. It can affect skin, kidneys, blood vessels, lungs, heart, nervous system, muscles, bones, eyes). Another medical condition linked with it is leukaemia (cancer of blood cells). Other than this a medical condition lymphoma is associated with it. Lymphoma refers to a cancer beginning in lymphocytes which are cells of the immune system that help to fight with infection. In case of lymphoma these lymphocytes change and keep multiplying out of control. Rarely it can occur in people having a family history of it where it is called as hereditary angioedema. Here a person has inherited this condition from a parent through genetic transmission. In hereditary angioedema the body is unable to make a blood protein called C1 esterase inhibitor in the right amount that results in fluid movement from the blood into tissues resulting in swelling. Other than this it can arise if a person has a weak immune system where it is called as acquired angioedema. Lastly, it can be idiopathic type where no cause is ruled out behind swelling. Some factors linked with it include stress, anxiety, intense exercise, exposure to heat and cold and minor infection. Its main sign is swelling below the skin. The swelling can develop suddenly or gradually in a few hours. Sometimes it may be attended with swelling and welts on the surface of the skin (hives) that may be painful and itchy. Redness, warmth and pain can appear in the swollen area. The swelling mainly occurs on the face especially around the eyes, lips; around the mouth; hands, feet, arms, legs; tongue. In severe cases the swelling can spread to other body parts. The swelling can also occur around the genitals and in intestines. Apart from above abdominal cramping, intense vomiting, redness irritation of eyes, diarrhoea (loose motion), weakness and dizziness can also occur. In some cases swelling appears in the throat with hoarseness, and difficulty in breathing. In case of swelling of the throat and tongue with difficult breathing, urgent medical help needs to be taken as it can be dangerous. There is a great scope of treating angioedema in homeopathy. There are many natural homeopathic medicines that are very effective for reducing the swelling in these cases and treating hives. In case of allergic cases it brings great recovery by moderating the immune system which is causing allergic reaction. Homeopathic medicines are helpful to manage recent cases and long standing or recurrent cases. It is to be noted that homeopathic medicines can be safely taken as long as there is no swelling of throat, airways, tongue attended with difficulty breathing. In the severe cases where there is swelling of throat, airways, tongue that obstructs breathing immediate treatment with conventional mode is needed. Also homeopathy has a limitation in treating cases of anaphylaxis reaction where urgent help from conventional treatment is required without any delay. Apis Mellifica is a leading medicine for cases of angioedema. Persons needing it have swelling over the face mainly eyelids, lips; mouth; and hands, feet. Redness and heat in the face is marked. In males swelling can also appear in testicles. In females the swelling can occur on labia. Burning stinging pains are complained in the area of swelling. Along with these symptoms there are hives with wheals on skin. The wheals are red with intense burning, stinging sensation. They are painful, tender and itchy. The itching mostly gets worse at night time. Apart from above symptoms there may be redness and itching in the eyes. Symptoms of angioedema occurring after bee sting are also well treated with this medicine. These symptoms include stinging, burning sharp prickling pain in skin and excessive swelling.\n• Urtica Urens – For Hives and Marked Swelling of Face, Hands, Feet It is prepared from a plant called Stinging – nettle that belongs to the family Urticaceae. The fresh plant in flowers is used for preparing homeopathic medicine. It is well indicated for hives and marked swelling of face, hands, feet. In cases needing it the fingers and hands are much swollen with itching. Lumps and red spots on hands are present. The face, hands and feet are swollen with stinging, burning and redness. The eyelids are intensely swollen and can be scarcely opened. In the case of hives raised red blotches are there on skin. This is attended with itching, burning and stinging. It also helps cases of hives from eating shellfish.\n• Rhus Tox – For Hives with Oedema of Lids It is a very beneficial medicine like above to medicines for cases where hives are present with oedema of eyelids. For using this medicine the hives usually occur from getting wet and in cold air. The hives have burning and itching in it. Affected skin appears tense and shining. The wheals are excessive mostly on hand and forearm. There is marked stitching pain in the eruption This medicine is prominently indicated when oedematous swellings are attended with burning pain. Along with this urticarial eruptions are present. These eruptions also have much burning in them. Marked restlessness attends this. A general weakness may accompany the above symptoms. This medicine also helps to manage vomiting and loose stool in these cases. Urticaria from eating shellfish is also an indicating feature for using this medicine. It is the next important medicine for cases of angioedema. For using it the main symptoms are swelling, itching, redness, burning of skin. There appears circumscribed oedematous lesions. Itching is there that changes place on scratching. Hepar Sulph is a very useful medicine for cases of angioedema and long standing recurring urticaria. Swelling is mainly present on upper lip, hands and feet in cases requiring it. The wheals mainly appear on hands and fingers. Few general symptoms that are present include sticking, pricking on skin and sensitivity of skin to slightest touch.\n• Antipyrinum – Another Well Indicated Medicine For Angioedema Antipyrinum is also a well indicated medicine for angioedema. People needing it also have urticaria. In them the urticaria appears and disappears suddenly. It may be attended with internal coldness. Most intense itching is present in the eruptions. For using it the eruptions are mostly present between the fingers. This medicine is prepared from the root of a plant called Helleborus Niger commonly known as Black Hellebore and Christmas Rose. It belongs to family ranunculaceae. It is indicated when there occurs sudden swelling of skin. Edema occurs on the face along with redness. Edema also appears on legs. Legal Disclaimer -None of the medicines mentioned including services , mentioned at Drhomeo.com should be used without clearance from your physician or health care provider. We do not claim to cure any disease which is considered' incurable ' on the basis of scientific facts by modern medicine .The website’s content is not a substitute for direct, personal, professional medical care and diagnosis. . Some of the conditions that cause a temporary increase of albumin in urine includes dehydration, stress, intense physical activity, cold weather, fever and side effects of some medications. Furthermore, the medical conditions that can lead to rise of albumin levels in the urine. First among them is diabetes, hypertension (high blood pressure – B.P.), kidney inflammation – nephritis, glomerulonephritis (inflammation of the glomeruli which are the structures made of tiny blood vessels in kidneys that filter blood), nephrotic syndrome (a kidney disorder in which body to pass too much protein in urine). physical trauma to the kidneys, cardiovascular disease like endocarditis (inflammation of the endocardium which is the inner layer of the heart). These medical conditions need urgent medical help as these can result in severe complications like kidney failure. People with diabetes, high blood pressure, elderly people above age of 65 yrs, individuals having family history of kidney disease are at high risk of albuminuria. Such people need to get tested for urine albumin quite frequently so that any kidney damage is detected and managed in time and further complications be prevented. It denotes the start of kidney damage with moderate increase in the albumin levels in the urine. When kidney damage is slight the albumin passes in urine in small quantities ( around 30mg to 300mg within the twenty four hour time frame ). When kidney function is greatly affected there is excessive passing of albumin in the urine denoting macroalbuminuria. The kidney allows passage of large amounts of albumin into the urine (more than 300 mg within the twenty four hour time frame). It indicates a serious kidney condition. It is mostly asymptomatic in the beginning stages. But when there is passage of a large amount of albumin in urine, there maybe some signs that give an indication towards it. First among them is urine having whitish foam or urine looking frothy. Next sign is swelling of the ankles, hands, eyes, face, legs, belly. The swelling occurs when abundant albumin passes in urine and results in low levels of protein in the blood. The low protein levels in blood leads to movement of fluid through the blood vessels walls into tissue. Cases of albuminuria need immediate medical attention to prevent serious complications. Homeopathic medicines mainly play a supportive role in managing cases of albuminuria. These medicines can be used along with conventional treatment for halting its further progression. Additionally they help in reducing oedema (swelling ) linked with it. Other than these homeopathic medicines also work towards managing associated symptoms like burning / painful urine, frequent urine, scanty urine, kidney pain. Albuminuria can have serious effects on the body and can lead to kidney damage. So one should use homeopathic medicines along with conventional treatment, that too under supervision of a homeopathic physician and never self prescribe any of these medicines. Apis Mellifica is a leading medicine for albuminuria. In cases needing it urine is frothy. Urine is also scanty. It can also contain blood. Urine is hot and can have an offensive smell. Along with this there is marked oedema. Here swelling is present on the face, hands, legs, and there is puffing of eyelids. Burning while urinating may also be present. Other than this sudden pain along the ureter can occur frequently. It is also considered for albuminuria with nephritis. This medicine is well indicated for early stages of albuminuria. Along with albumin, blood can also appear in urine where it is required. Pain, especially dull, aching type over kidney region may also be felt. There is swelling of lids, face and feet along with above symptoms. The urine is scanty and appears cloudy. Urine may also be fetid. It is also a prominent medicine for cases of nephritis.\n• Calcarea Arsenicosa – For Frequent Urine with Excessive Albumin in Urine It is a significant medicine for cases with frequent urine and excessive amounts of albumin in urine. People requiring it pass urine almost every hour. There is burning while urination and urine is scanty. Along with this great sensitivity of the kidney region to pressure is present. Swelling over the face and back of hands is also there. It is also a well indicated medicine for albuminuria during pregnancy.\n• Merc Cor – When Urine is Scanty and Have Albumin and Blood Merc Cor is a valuable medicine for cases where urine is scanty and contains albumin and blood. Urine is also hot, burning. There is frequent urge to urinate. Urine passes with pain and sometimes in drops. Swelling of the face is also there.\n• Nitric Acid – For Albuminuria with Pressure in Kidney Region This medicine is indicated for albuminuria with pressure in the kidney region. Urine is highly offensive in cases needing it. Urine appears turbid. Along with albumin urine may also contain mucus, pus and blood. There is frequent urging to urinate with scanty discharge. Oedema of feet, excessive weakness and nausea are other complaints that can attend. Cantharis is a very beneficial medicine when there is albuminuria and burning, painful urination. The pain and burning can be felt before, during or after urination. It is a top listed medicine for nephritis with blood in urine. Persons who need it may have pain in the kidney area. Kidney region may also be sensitive to the slightest touch. They have frequent urges to urinate but pass only scanty urine. The urine is turbid and scanty. It may appear cloudy during the night with white sediment. Urine may also contain blood and cylindrical casts.\n• Plumbum Met – When Urine is Scanty and Contains Albumin, Oxalate, Epithelial Cells, Hyaline Casts Plumbum Met is used when urine is scanty and contains albumin, oxalate, epithelial cells, hyaline casts. It may also contain RBC’s (red blood cells). Along with this there is excessive oedema (swelling) of eyelids. Intense weakness can accompany these symptoms.\n• Dulcamara -For Albumin in Urine, Swelling and Kidney Pain This medicine is prepared from fresh green stems and leaves of plant Solanum dulcamara having the common name Woody Nightshade and Bitter – sweet. This plant belongs to family solanaceae. It is indicated when the urine contains albumin and there is swelling in body tissue and pain in the kidney region. Along with this there is a constant desire to urinate. Urine is turbid, scanty, offensive and may contain tough, jelly – like, white or red mucus. This is a well indicated medicine for albuminuria and diabetes. There is swelling of lower limbs where it is required. There may also be pain in the kidney , especially the left side. The urine is frequent and profuse. It may be thick and have milky / white sediment. This medicine is prepared from the root of plant Helonias dioica also known as Blazing Star. This plant belongs to family melanthiaceae. Its use is suggested when there is kidney pain with albumin in urine. Other than this weight and burning sensation is felt in the kidneys. The right kidney may be sensitive. There is frequent urge to urinate and burning scalding pain can be felt when urinating.\n• Uranium Nitricum – For Albuminuria and Constant Pain and Soreness in Nack The indicating feature to use this medicine is albuminuria and constant pain and soreness in back. With this the urine is profuse and can be painful. It can be milky and have specific ammoniacal odour. There is frequent urination mainly at night. Excessive weakness and heaviness / pain, weariness in legs are few other accompanying symptoms. This medicine is prepared from plant Chimaphila Umbellata commonly known as Pipsissewa and Ground Holly. It belongs to the family pyroleae. This medicine is indicated for the last stages of albuminuria. In cases needing it constant pain is felt in the kidney region. Urine is scanty, fetid, very thick and contains albumin. Sometimes urine contains thick, ropy, bloody mucus. There is frequent desire to urinate with scanty urine. Scalding and smarting pain is felt during and after urination.", "opengraph": {"locale": "en_US", "type": "object", "title": "Dr. Vikas Sharma MD, Author at Homeopathy at DrHomeo.com - Page 29 of 96", "url": "https://www.drhomeo.com/author/admin/page/29/", "site_name": "Homeopathy at DrHomeo.com"}, "tags": [], "tweets": [], "movies": [], "links": ["tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-sinus-headache/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/09/Homeopathic-Remedies-For-Sinus-Headache.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-medicines-for-red-eyes/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/09/Homeopathic-Medicines-For-Red-Eyes.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-sebaceous-cysts/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/cyst-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/10-homeopathic-medicines-for-burning-feet/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/burning-feet.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-breast-pain-top-10-remedies/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/woman-with-breast-pain-teaser.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-lazy-eye/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/b2ap3_amp_lazy-eye.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/effective-homeopathic-remedies-for-esophagitis/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/herpes-esophagitis_thumb.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/12-homeopathic-medicines-for-albuminuria/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/microalbuminuria-test_thumb-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/8-homeopathic-remedies-for-angioedema/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/Angioedema2010-scaled.jpg", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/", "https://www.drhomeo.com/author/admin/page/27/", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/page/29/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/author/admin/page/31/", "https://www.drhomeo.com/author/admin/page/96/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/contact/", "https://drhomeo.wpenginepowered.com/wp-content/uploads/2014/01/ghhh.jpg", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/payment/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/12/AUTISM.jpg", "http://www.drhomeo.com", "http://twitter.com/viksharma", "http://www.drhomeo.com/contact/", "http://www.drhomeo.com", "https://www.drhomeo.com/homeopathy-treatment/", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/diseases/", "https://www.drhomeo.com/testimonials/", "https://www.drhomeo.com/autism-treatment-2/", "http://www.drhomeo.com/disclaimers", "https://www.drhomeo.com/disclaimers/", "https://www.drhomeo.com/side-effects-of-homeopathy/", "https://www.drhomeo.com/scientific/", "https://www.drhomeo.com/criticism-of-homeopathy/", "https://www.drhomeo.com/disclaimers/privacy-policy/", "https://www.drhomeo.com/disclaimers/terms-of-use/", "https://www.drhomeo.com/disclaimers/refund-policy/", "https://www.drhomeo.com/online-protection/", "https://www.drhomeo.com/shipping-policy/", "https://www.drhomeo.com/contact/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-medicines-for-red-eyes/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/09/Homeopathic-Medicines-For-Red-Eyes.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-sebaceous-cysts/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/cyst-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/10-homeopathic-medicines-for-burning-feet/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/burning-feet.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-breast-pain-top-10-remedies/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/woman-with-breast-pain-teaser.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-lazy-eye/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/b2ap3_amp_lazy-eye.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/effective-homeopathic-remedies-for-esophagitis/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/herpes-esophagitis_thumb.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/12-homeopathic-medicines-for-albuminuria/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/microalbuminuria-test_thumb-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/8-homeopathic-remedies-for-angioedema/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/Angioedema2010-scaled.jpg", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/", "https://www.drhomeo.com/author/admin/page/27/", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/page/29/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/author/admin/page/31/", "https://www.drhomeo.com/author/admin/page/96/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/contact/", "https://drhomeo.wpenginepowered.com/wp-content/uploads/2014/01/ghhh.jpg", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/payment/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/12/AUTISM.jpg", "http://www.drhomeo.com", "http://twitter.com/viksharma", "http://www.drhomeo.com/contact/", "http://www.drhomeo.com", "https://www.drhomeo.com/homeopathy-treatment/", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/diseases/", "https://www.drhomeo.com/testimonials/", "https://www.drhomeo.com/autism-treatment-2/", "http://www.drhomeo.com/disclaimers", "https://www.drhomeo.com/disclaimers/", "https://www.drhomeo.com/side-effects-of-homeopathy/", "https://www.drhomeo.com/scientific/", "https://www.drhomeo.com/criticism-of-homeopathy/", "https://www.drhomeo.com/disclaimers/privacy-policy/", "https://www.drhomeo.com/disclaimers/terms-of-use/", "https://www.drhomeo.com/disclaimers/refund-policy/", "https://www.drhomeo.com/online-protection/", "https://www.drhomeo.com/shipping-policy/", "https://www.drhomeo.com/contact/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-sebaceous-cysts/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/cyst-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/10-homeopathic-medicines-for-burning-feet/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/burning-feet.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathy-for-breast-pain-top-10-remedies/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/woman-with-breast-pain-teaser.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/homeopathic-remedies-for-lazy-eye/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/b2ap3_amp_lazy-eye.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/effective-homeopathic-remedies-for-esophagitis/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/herpes-esophagitis_thumb.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/12-homeopathic-medicines-for-albuminuria/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/microalbuminuria-test_thumb-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/8-homeopathic-remedies-for-angioedema/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/Angioedema2010-scaled.jpg", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/", "https://www.drhomeo.com/author/admin/page/27/", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/page/29/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/author/admin/page/31/", "https://www.drhomeo.com/author/admin/page/96/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/contact/", "https://drhomeo.wpenginepowered.com/wp-content/uploads/2014/01/ghhh.jpg", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/payment/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/12/AUTISM.jpg", "http://www.drhomeo.com", "http://twitter.com/viksharma", "http://www.drhomeo.com/contact/", "http://www.drhomeo.com", "https://www.drhomeo.com/homeopathy-treatment/", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/diseases/", "https://www.drhomeo.com/testimonials/", "https://www.drhomeo.com/autism-treatment-2/", "http://www.drhomeo.com/disclaimers", "https://www.drhomeo.com/disclaimers/", "https://www.drhomeo.com/side-effects-of-homeopathy/", "https://www.drhomeo.com/scientific/", "https://www.drhomeo.com/criticism-of-homeopathy/", "https://www.drhomeo.com/disclaimers/privacy-policy/", "https://www.drhomeo.com/disclaimers/terms-of-use/", "https://www.drhomeo.com/disclaimers/refund-policy/", "https://www.drhomeo.com/online-protection/", "https://www.drhomeo.com/shipping-policy/", "https://www.drhomeo.com/contact/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/12-homeopathic-medicines-for-albuminuria/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/microalbuminuria-test_thumb-1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/8-homeopathic-remedies-for-angioedema/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/Angioedema2010-scaled.jpg", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/", "https://www.drhomeo.com/author/admin/page/27/", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/page/29/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/author/admin/page/31/", "https://www.drhomeo.com/author/admin/page/96/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/contact/", "https://drhomeo.wpenginepowered.com/wp-content/uploads/2014/01/ghhh.jpg", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/payment/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/12/AUTISM.jpg", "http://www.drhomeo.com", "http://twitter.com/viksharma", "http://www.drhomeo.com/contact/", "http://www.drhomeo.com", "https://www.drhomeo.com/homeopathy-treatment/", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/diseases/", "https://www.drhomeo.com/testimonials/", "https://www.drhomeo.com/autism-treatment-2/", "http://www.drhomeo.com/disclaimers", "https://www.drhomeo.com/disclaimers/", "https://www.drhomeo.com/side-effects-of-homeopathy/", "https://www.drhomeo.com/scientific/", "https://www.drhomeo.com/criticism-of-homeopathy/", "https://www.drhomeo.com/disclaimers/privacy-policy/", "https://www.drhomeo.com/disclaimers/terms-of-use/", "https://www.drhomeo.com/disclaimers/refund-policy/", "https://www.drhomeo.com/online-protection/", "https://www.drhomeo.com/shipping-policy/", "https://www.drhomeo.com/contact/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/vaccine-side-effects-homeopathy-can-help/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/homeopathy-homeopathic.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/homeopathic-treatment/8-homeopathic-remedies-for-angioedema/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/08/Angioedema2010-scaled.jpg", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/", "https://www.drhomeo.com/author/admin/page/27/", "https://www.drhomeo.com/author/admin/page/28/", "https://www.drhomeo.com/author/admin/page/29/", "https://www.drhomeo.com/author/admin/page/30/", "https://www.drhomeo.com/author/admin/page/31/", "https://www.drhomeo.com/author/admin/page/96/", "https://www.drhomeo.com/author/admin/page/30/"], "authors": [], "publish_date": null}