{"result_id": "370001", "URL": "https://www.drhomeo.com/fever/homeopathic-medicines-for-zika-virus-treatment-and-prevention/", "timestamp": "2023-04-25 18:27:09 CEST+0200", "meta": {"description": "Homeopathic medicines for zika virus prevention and treatment. Eupatorium is the best homeopathic medicine for prevention of zika virus", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/fever/homeopathic-medicines-for-zika-virus-treatment-and-prevention/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic Medicines for Zika Virus Treatment and Prevention", "cleaned_text": "Zika virus is transmitted to people through bite of an infected mosquito belonging to Aedes species. These mosquitoes are day biters and are the same ones involved in spreading the dengue and chikungunya fever. However the illness caused by Zika virus is much milder than that in dengue fever. The illness from Zika virus can last from few days to a week. Zika virus can also be transmitted from one person to another through sexual contact and also from infected mother to fetus. Severe complications and death are uncommon.\n\nEighty percent of the infected with Zika virus do not develop any symptoms. Those having symptoms complain of fever, skin rash of maculopapular nature, joint pains, headache and conjunctivitis. In December 2015 an association was found between serious birth defect called as microcephaly (small heads) in babies born in a mother having Zika infection during pregnancy due to transplacental crossing of virus. Microcephaly leads to developmental issues in children. Ongoing Researches are also trying to find out if any relation exists between this virus and Guillain –Barre syndrome where life threatening paralysis appears.\n\nHomeopathic medicines Eupatorium Perfoliatum, Belladonna, Rhus Tox can be safely used in Zika virus infection treatment. These medicines come the closest in treating the symptoms of Zika virus infection. In an epidemics when a huge number of person are attacked by acute and similar sufferings from similar cause, Homeopathy can be of great prophylactic help. Homeopathy has been highly successful in treating epidemic diseases. Among them are cholera, dengue fever, yellow fever typhus, and conjunctivitis. Records show that during epidemics , homeopathic medicines are of great help in reducing the mortality when compared to those put under conventional system of medicines. One very popular example is of homeopathic medicine Belladonna as prophylactic for treating scarlatina epidemics. In year 1801 when scarlatina prevailed epidemically among children, those who were given homeopathic medicine Belladonna as a prophylactic remained unaffected with this highly infectious disease. So homeopathy has a huge role to play as prophylactic when a disease spreads abruptly over a large area . So in such cases , a single medicine that is most closely allied to the symptoms picture of the disease can be used as a prophylactic. Thus , Homeopathic medicine Eupatorium Perfoliatum can be used as prophylactic in Zika virus infection as this medicine has the closest match to the symptom set presented in Zika virus infection.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic Medicines for Zika Virus Treatment and Prevention - Homeopathy at DrHomeo.com", "description": "Homeopathic medicines for zika virus prevention and treatment. Eupatorium is the best homeopathic medicine for prevention of zika virus", "url": "https://www.drhomeo.com/fever/homeopathic-medicines-for-zika-virus-treatment-and-prevention/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "Fever", "article:published_time": "2016-01-30T10:30:43+00:00", "article:modified_time": "2016-01-30T10:35:10+00:00", "updated_time": "2016-01-30T10:35:10+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2016/01/BITACORA-ZIKA-2.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2016/01/BITACORA-ZIKA-2.jpg", "image:width": "880", "image:height": "495"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Ffever%2Fhomeopathic-medicines-for-zika-virus-treatment-and-prevention%2F&t=Homeopathic%20Medicines%20for%20Zika%20Virus%20Treatment%20and%20Prevention", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Ffever%2Fhomeopathic-medicines-for-zika-virus-treatment-and-prevention%2F&title=Homeopathic%20Medicines%20for%20Zika%20Virus%20Treatment%20and%20Prevention", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/01/BITACORA-ZIKA-2.jpg"], "authors": [], "publish_date": "2016-01-30T10:30:43+00:00"}