{"result_id": "370024", "URL": "https://www.drhomeo.com/homeopathic-treatment/homeopathic-medicines-for-hallucinations/", "timestamp": "2023-04-25 18:27:39 CEST+0200", "meta": {"description": "Homeopathic medicines for hallucinations help to target the root cause behind it and manage the complaint and its symptoms quite well.", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/homeopathic-treatment/homeopathic-medicines-for-hallucinations/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Homeopathic Medicines For Hallucinations - DrHomeo Homeopathy", "cleaned_text": "Hallucinations are sensory perceptions experienced in the absence of external stimulus. For example a person with this can hear a voice which is not actually present or see an image which doesn’t exist in reality and is created only by his/her mind. Homeopathic medicines for hallucinations help to target the root cause behind it and manage the complaint quite well.\n\nThese can be related to any of the five senses. These can be heard, smelled, seen, felt or tasted. These can be accompanied by aggressive behaviour, depression, anxiety and headache.\n\nThese are the most common type of hallucinations among all the types. In this a person hears sounds (like hissing, whistling etc) or voices, music which are not there in reality. Sometimes he may hear someone telling / commanding him to do certain things. The voices he hears may be familiar or can be unfamiliar. They may be heard in a friendly or aggressive tone. Perception of sound is termed elementary hallucinations while perception of the voices or music is known as complex hallucinations. Persons having these types see things in the environment that are not actually present. For example, they may see a person, an animal, an object, light or colours which are not present in the environment and no other person can see as they don’t exist in reality. Seeing colours, geometric shapes, lights are termed as simple visual hallucinations while seeing life like images eg., persons, animals or objects are referred to as complex visual hallucinations In this type a person smells something which is not actually there. This type is also called phantosmia. For example he may smell a foul unpleasant odour, or some odour of something rotten, spoiled or burnt. These are related to a sense of taste where a person feels a taste of something in the mouth that has not been eaten. Mostly there are unpleasant strange tastes in the mouth like metallic taste. In this a person feels something or someone has touched them or they may feel some movement in the body. Some examples of it are feeling as if bugs are crawling on the skin, someone has touched the body, or organs in the body are moving around. In this a person feels as if his/her body is mutilated, disfigured, torn or some internal organs are removed from the body. There may also be a perception as if some animal has invaded the internal organ or his flesh is decomposing. It can be caused by multiple reasons. Firstly, it can arise from various psychological conditions among which the most common is schizophrenia (a psychological disorder in which reality is interpreted abnormally and the sufferer have hallucinations, delusions, and disordered thinking). Next such conditions include delirium (abrupt changes in the brain resulting in confused thinking, reduced awareness of the environment and emotional disruption) and dementia (A category of brain diseases which causes decreased ability to think and remember severe enough to affect daily functioning). Secondly, it can result from drinking excessive alcohol, taking drugs like cocaine and drugs that induce hallucinations (hallucinogens). Some of the examples of hallucinogens include LSD, dimethyltryptamine (DMT). It can also occur from taking medicines for some health conditions. Some examples are certain medicines used for treating epilepsy, depression, parkinson’s disease and psychosis. Apart from above it can also arise from lack of sleep. Other than this it can be linked with seizures (fits), migraine, anxiety, depression, high fever, postpartum (means after child birth) mental health disorders, PTSD (post traumatic stress disorder), parkinson’s disease, Alzheimer’s disease, head injury, kidney/liver failure, brain cancer, vision problems, vision loss and hearing loss. Homeopathic medicines can be of great help in managing the cases of hallucinations. These medicines target the root cause behind it and manage the complaint quite well. The homeopathic medicines are recommended for cases of mild to moderate intensity. In such cases with help of these medicines the intensity and frequency of complaint gradually reduces but in cases of severe intensity it is advised to take help from conventional mode of treatment. There are no specific medicines in homeopathy for this complaint and the medicine needed for a case is selected as per the symptom present in every individual case. So it is advised to take any homeopathic medicine after consulting a homeopathic physician who can after detailed case analysis find the medicine that will best suit a given case. In no case self medication should be done. It is a natural medicine prepared from a layer of nuts between the shell and kernel of plant Anacardium Orientale commonly known as marking Nut. It belongs to family anacardiaceae. It is a leading medicine for cases where auditory hallucinations are prominent. It is indicated when a person hears voices of persons far away. Sometimes he may hear voices of dead people or spirits. In some cases the voices may be specifically saying that he is going to die. Other than this it is indicated for hallucination as if a demon is sitting on one shoulder commanding him to do offensive things while on the other shoulder an angel is sitting that is commanding him to do good things. Along with above symptoms there may be excessive anger from slightest cause with tendency to use foul language. It is a top listed medicine for cases of schizophrenia with auditory hallucinations.\n• Stramonium – For Visual As Well As Auditory Hallucinations This medicine is prepared from a plant known as thorn – apple. This plant belongs to family solanaceae. Firstly it is beneficial when there are visual hallucinations. Here it is indicated for persons who see animals (cats, rats and dogs), ghosts, horrifying images, black objects and strangers. These terrify, frighten them. They may also see people coming out of all corners of a room. Next it is well indicated where a person says he sees god and is communicating with god. Thirdly it is helpful for auditory hallucinations where a person hears voices and talks with absent persons or spirits. It is also useful when a person hears scolding voices and also when he hears music. Along with above symptoms there is sudden mood changes from joy to sadness. Uncontrollable anger may be also present. This medicine is indicated for cases where a person has hallucination of fire mainly at night time. Persons needing it may have chronic depression. Here intense sadness and anxiety are present. Violent anger can also be there. Apart from above it is a leading medicine for cases of schizophrenia. It is prepared from root stocks of plant White Hellebore that belongs to the family melanthiaceae of liliaceae. Persons requiring this sees many people crowding in a room. They carry conversation with them. There may be violent anger outburst with this attended with desire to strike others. Other than this it is considered in cases where a person sees god and communicates with god. This medicine is beneficial for cases in which a person hears music. It is valuable when a person hears numberless bells ringing sweetly. Lastly it is indicated where a person feels that someone is calling him. Some of the attending symptoms include absent mindedness, poor concentration and uncontrollable laughter. This medicine is prepared from plant deadly nightshade. This plant belongs to family solanaceae. This medicine is of great help for hallucination in persons seeing ghosts and animals. They also see monsters, hideous faces and insects. In the case of animals they often see dogs, wolves and black animals. Its use is also done for persons who see fire. Restlessness, mania with biting, spitting on others, striking, tearing things are some of the symptoms that can accompany.\n• Thuja – For Hallucination Of Some Animal In Abdomen It is prepared from fresh twigs of plant Thuja Occidentalis having the common name Arbor Vitae. This plant belongs to family coniferae. It is specifically indicated for cases where hallucination as if there is some animal in the abdomen is marked. Person needing it feels movements in the abdomen as if something alive is lying in it. Other than this it also works well where a person has hallucination of some strange person present on his side. This medicine is prepared from plant mescal buttons of family cactaceae. It is also indicated for visual hallucinations. It is considered for persons who see monsters in front of them. They may also have sadness and dullness. Sudden mood changes can be there. They have loss of contact with the outside world. This is a medicine which is considered when a person have hallucinations of imaginary smells Both these medicines are indicated for hallucinations of taste. Legal Disclaimer -None of the medicines mentioned including services , mentioned at Drhomeo.com should be used without clearance from your physician or health care provider. We do not claim to cure any disease which is considered' incurable ' on the basis of scientific facts by modern medicine .The website’s content is not a substitute for direct, personal, professional medical care and diagnosis. .\n\nThese are the most common type of hallucinations among all the types. In this a person hears sounds (like hissing, whistling etc) or voices, music which are not there in reality. Sometimes he may hear someone telling / commanding him to do certain things. The voices he hears may be familiar or can be unfamiliar. They may be heard in a friendly or aggressive tone. Perception of sound is termed elementary hallucinations while perception of the voices or music is known as complex hallucinations.\n\nPersons having these types see things in the environment that are not actually present. For example, they may see a person, an animal, an object, light or colours which are not present in the environment and no other person can see as they don’t exist in reality. Seeing colours, geometric shapes, lights are termed as simple visual hallucinations while seeing life like images eg., persons, animals or objects are referred to as complex visual hallucinations\n\nIn this type a person smells something which is not actually there. This type is also called phantosmia. For example he may smell a foul unpleasant odour, or some odour of something rotten, spoiled or burnt.\n\nThese are related to a sense of taste where a person feels a taste of something in the mouth that has not been eaten. Mostly there are unpleasant strange tastes in the mouth like metallic taste.\n\nIn this a person feels something or someone has touched them or they may feel some movement in the body. Some examples of it are feeling as if bugs are crawling on the skin, someone has touched the body, or organs in the body are moving around.\n\nIn this a person feels as if his/her body is mutilated, disfigured, torn or some internal organs are removed from the body. There may also be a perception as if some animal has invaded the internal organ or his flesh is decomposing.\n\nIt can be caused by multiple reasons.\n\nFirstly, it can arise from various psychological conditions among which the most common is schizophrenia (a psychological disorder in which reality is interpreted abnormally and the sufferer have hallucinations, delusions, and disordered thinking). Next such conditions include delirium (abrupt changes in the brain resulting in confused thinking, reduced awareness of the environment and emotional disruption) and dementia (A category of brain diseases which causes decreased ability to think and remember severe enough to affect daily functioning).\n\nSecondly, it can result from drinking excessive alcohol, taking drugs like cocaine and drugs that induce hallucinations (hallucinogens). Some of the examples of hallucinogens include LSD, dimethyltryptamine (DMT).\n\nIt can also occur from taking medicines for some health conditions. Some examples are certain medicines used for treating epilepsy, depression, parkinson’s disease and psychosis.\n\nApart from above it can also arise from lack of sleep. Other than this it can be linked with seizures (fits), migraine, anxiety, depression, high fever, postpartum (means after child birth) mental health disorders, PTSD (post traumatic stress disorder), parkinson’s disease, Alzheimer’s disease, head injury, kidney/liver failure, brain cancer, vision problems, vision loss and hearing loss.\n\nHomeopathic medicines can be of great help in managing the cases of hallucinations. These medicines target the root cause behind it and manage the complaint quite well. The homeopathic medicines are recommended for cases of mild to moderate intensity. In such cases with help of these medicines the intensity and frequency of complaint gradually reduces but in cases of severe intensity it is advised to take help from conventional mode of treatment. There are no specific medicines in homeopathy for this complaint and the medicine needed for a case is selected as per the symptom present in every individual case. So it is advised to take any homeopathic medicine after consulting a homeopathic physician who can after detailed case analysis find the medicine that will best suit a given case. In no case self medication should be done.\n\nIt is a natural medicine prepared from a layer of nuts between the shell and kernel of plant Anacardium Orientale commonly known as marking Nut. It belongs to family anacardiaceae. It is a leading medicine for cases where auditory hallucinations are prominent. It is indicated when a person hears voices of persons far away. Sometimes he may hear voices of dead people or spirits. In some cases the voices may be specifically saying that he is going to die. Other than this it is indicated for hallucination as if a demon is sitting on one shoulder commanding him to do offensive things while on the other shoulder an angel is sitting that is commanding him to do good things. Along with above symptoms there may be excessive anger from slightest cause with tendency to use foul language. It is a top listed medicine for cases of schizophrenia with auditory hallucinations.\n• Stramonium – For Visual As Well As Auditory Hallucinations\n\nThis medicine is prepared from a plant known as thorn – apple. This plant belongs to family solanaceae. Firstly it is beneficial when there are visual hallucinations. Here it is indicated for persons who see animals (cats, rats and dogs), ghosts, horrifying images, black objects and strangers. These terrify, frighten them. They may also see people coming out of all corners of a room. Next it is well indicated where a person says he sees god and is communicating with god. Thirdly it is helpful for auditory hallucinations where a person hears voices and talks with absent persons or spirits. It is also useful when a person hears scolding voices and also when he hears music. Along with above symptoms there is sudden mood changes from joy to sadness. Uncontrollable anger may be also present.\n\nThis medicine is indicated for cases where a person has hallucination of fire mainly at night time. Persons needing it may have chronic depression. Here intense sadness and anxiety are present. Violent anger can also be there. Apart from above it is a leading medicine for cases of schizophrenia.\n\nIt is prepared from root stocks of plant White Hellebore that belongs to the family melanthiaceae of liliaceae. Persons requiring this sees many people crowding in a room. They carry conversation with them. There may be violent anger outburst with this attended with desire to strike others. Other than this it is considered in cases where a person sees god and communicates with god.\n\nThis medicine is beneficial for cases in which a person hears music. It is valuable when a person hears numberless bells ringing sweetly. Lastly it is indicated where a person feels that someone is calling him. Some of the attending symptoms include absent mindedness, poor concentration and uncontrollable laughter.\n\nThis medicine is prepared from plant deadly nightshade. This plant belongs to family solanaceae. This medicine is of great help for hallucination in persons seeing ghosts and animals. They also see monsters, hideous faces and insects. In the case of animals they often see dogs, wolves and black animals. Its use is also done for persons who see fire. Restlessness, mania with biting, spitting on others, striking, tearing things are some of the symptoms that can accompany.\n• Thuja – For Hallucination Of Some Animal In Abdomen\n\nIt is prepared from fresh twigs of plant Thuja Occidentalis having the common name Arbor Vitae. This plant belongs to family coniferae. It is specifically indicated for cases where hallucination as if there is some animal in the abdomen is marked. Person needing it feels movements in the abdomen as if something alive is lying in it. Other than this it also works well where a person has hallucination of some strange person present on his side.\n\nThis medicine is prepared from plant mescal buttons of family cactaceae. It is also indicated for visual hallucinations. It is considered for persons who see monsters in front of them. They may also have sadness and dullness. Sudden mood changes can be there. They have loss of contact with the outside world.\n\nThis is a medicine which is considered when a person have hallucinations of imaginary smells\n\nBoth these medicines are indicated for hallucinations of taste.", "opengraph": {"locale": "en_US", "type": "article", "title": "Homeopathic Medicines For Hallucinations - DrHomeo Homeopathy", "description": "Homeopathic medicines for hallucinations help to target the root cause behind it and manage the complaint and its symptoms quite well.", "url": "https://www.drhomeo.com/homeopathic-treatment/homeopathic-medicines-for-hallucinations/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "HOMEOPATHIC TREATMENT", "article:published_time": "2020-10-25T13:23:15+00:00", "article:modified_time": "2021-04-23T11:09:49+00:00", "updated_time": "2021-04-23T11:09:49+00:00"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathic-medicines-for-hallucinations%2F&t=Effective%20Homeopathic%20Medicines%20For%20Hallucinations", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fhomeopathic-treatment%2Fhomeopathic-medicines-for-hallucinations%2F&title=Effective%20Homeopathic%20Medicines%20For%20Hallucinations", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2020/10/Homeopathic-medicines-for-hallucinations-.jpg", "https://www.drhomeo.com/contact/", "https://drhomeo.wpenginepowered.com/wp-content/uploads/2014/01/ghhh.jpg", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/payment/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/12/AUTISM.jpg", "http://www.drhomeo.com", "http://twitter.com/viksharma", "http://www.drhomeo.com/contact/", "http://www.drhomeo.com", "https://www.drhomeo.com/homeopathy-treatment/", "https://www.drhomeo.com/about/", "https://www.drhomeo.com/diseases/", "https://www.drhomeo.com/testimonials/", "https://www.drhomeo.com/autism-treatment-2/", "http://www.drhomeo.com/disclaimers", "https://www.drhomeo.com/disclaimers/", "https://www.drhomeo.com/side-effects-of-homeopathy/", "https://www.drhomeo.com/scientific/", "https://www.drhomeo.com/criticism-of-homeopathy/", "https://www.drhomeo.com/disclaimers/privacy-policy/", "https://www.drhomeo.com/disclaimers/terms-of-use/", "https://www.drhomeo.com/disclaimers/refund-policy/", "https://www.drhomeo.com/online-protection/", "https://www.drhomeo.com/shipping-policy/", "https://www.drhomeo.com/contact/"], "authors": [], "publish_date": "2020-10-25T13:23:15+00:00"}