{"result_id": "370019", "URL": "https://www.drhomeo.com/skin/top-10-homeopathic-medicines-for-measles/", "timestamp": "2023-04-25 18:27:33 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/skin/top-10-homeopathic-medicines-for-measles/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Top 10 Homeopathic Medicines For Measles", "cleaned_text": "Measles is a viral infection caused by measles virus ( belonging to genus Morbillivirus and family Paramyxoviridae). It is also known as rubeola and is a highly contagious infection.\n\nIt usually occurs in children but adults can get infected too. Originating in the respiratory system, the infection in some cases can be serious and fatal. This infection was very common earlier but now vaccination is commonly used as a preventive measure.\n\nHomeopathy plays a supportive role in case of measles. Homeopathic medicines can be taken along with conventional treatment for symptom management of measles. They help by boosting the body’s natural healing mechanism to fight viral infection. These medicines decrease the intensity of the symptoms and speed up recovery. Measles can have serious complications, so the use of homeopathic medicines should be considered only along with conventional treatment and not independently. Homeopathic medicines should be taken under the supervision of a homeopathic physician and self-medication should be avoided.\n\nTop Homeopathic Medicines For Managing Its Signs And Symptoms\n\nIt is a natural medicine prepared from plant Aconitum Napellus commonly known ‘monkshood’. It belongs to family Ranunculaceae. It is indicated for cases where dry barking cough is there. The redness of eyes is an important symptom along with inability to bear light, hoarseness of voice and restlessness. Joint pains and excessive sweating attend the above symptoms. Besides, there is dry, burning heat, along with excessive thirst.\n\nThis medicine can be used to manage runny nose and sneezing. Persons who need it also feel burning and itching in nose. Nose blockage may be felt in the nose. Symptoms may worsen in open air while there is relief indoors. Other than this, it is well-indicated for managing persistent burning on the skin. In cases needing it, the rash may appear too soon or disappear suddenly. Restlessness, anxiety and weakness can accompany above symptoms.\n\nIt is a very useful medicine for managing sore throat and fever. It is prepared from a plant ‘deadly nightshade’. It belongs to family Solanaceae. Persons requiring it have redness and swelling in throat, and inflamed tonsils. Along with this, there is dryness, heat and a feeling of lump in the throat. There is difficulty in swallowing, especially liquids. Pain is marked in the throat which can be shooting or stinging type, especially while swallowing. Along with this, there is fever with burning heat and redness of skin.\n\nIn homeopathy, this medicine is considered a prophylactic (medicine that prevents disease) against measles and also to clear infection in cases it occurs.\n\nIt is prepared from a plant Euphrasia Officinalis also called ‘eye bright’. This plant belongs to family Scrophulariaceae. It is usually indicated for initial stages of this infection. In cases needing it, firstly there is inflammation of eyes. The eyes are red, have burning sensation and excessive discharge. There is also sensitivity to bright light (photophobia). Secondly, there is profuse watering from the nose. There is pressing/throbbing type of pain in the head. Other than the above, there is dry cough during the day. Chill followed by fever may be an accompanying symptom. Pain in the bones is also present, eruptions around the forehead and temporal region of head are also seen.\n\nThis natural medicine is prepared from plant Pulsatilla Nigricans with common name ‘wind flower’. This plant belongs to family Ranunculaceae. This medicine is effective to manage eye inflammation, cough and cold. It is indicated when there is discharge from nose and profuse watering from eyes. There is dry cough at night. Other than the above, it is indicated to manage earache and discharge from ear from one or both sides.\n\nThe use of this medicine can be considered for managing bodyache. Other than this, intolerable itching on skin and red rashes all over the skin also indicates its use.\n\nIt is a medicine beneficial for managing cough and coryza. Hoarseness of voice can attend too. The cough is dry, rough, barking type. It is short and irritating and may have a high crowing sound. Cough is caused by tickling in the larynx. There may be relief in cough from taking warm drinks. Roughness is also felt in the larynx. The whole respiratory tract feels dry. There is no expectoration with cough. Chilliness may be present.\n\n9. Drosera – For Cough During Or After Measles\n\nDrosera is prepared from plant Drosera Rotundifolia commonly known as ‘round – leaved sundew’. This plant belongs to family Droseraceae. This medicine works well for managing cough during or after measles. The main symptom for using it is dry, hoarse cough caused by tickling in the throat. Cough attacks usually occur when Drosera is needed which get worse in the afternoon and evening. Expectoration may occur that can be bloody and purulent (of pus). Excessive hoarseness of voice may also be there in addition to the above symptoms.\n\n10. Apis Mellifica – When Eruptions Don’t Come Out Properly\n\nThis medicine is indicated for cases in which the eruptions have not surfaced completely. It is attended with excessive weakness and drowsiness. Fever and cough are also there. It is also indicated for managing chronic diarrhea (loose stool) that follows this infection\n\nThis medicine is prepared from fresh bulb of plant Squilla Maritima commonly known as ‘sea onion’. It belongs to family Liliaceae. It is helpful for cases in which there is watering from eyes, sneezing and cough. The cough can be dry or short rattling in cases needing it.\n\nThe cough disturbs sleep, one can feel the mucus in the trachea. Cough gets worse after eating and from any kind of exertion. Other than the above, it is indicated for managing diarrhea with watery and offensive stool.\n\nThis medicine offers help to manage post-management of measles. Here, it is useful for managing chronic cough, diarrhea, discharge from ear and hardness of hearing.\n\nIt is a contagious infection (that spreads easily from person to person) caused by measles virus. It spreads when a person inhales air droplets that are infected with cough or sneeze of an infected person having measles. The infected droplets from cough and sneeze may fall on a surface or an object and remain active for a few hours. A person may get infected if he/she touches the infected surface and then puts the fingers in mouth, nose or rubs eyes without properly washing the hands. The infection can be contracted from physical contact with a person suffering from measles. The chance of getting infected is around 90% if one gets exposed to the virus.\n\nThe ones who have not got vaccinated against this infection are at high risk of getting infected. Other than this, vitamin A deficiency results in severe symptoms and complications.\n\nWhat Are Its Signs And Symptoms?\n\nIn case of measles, symptoms occur in around 10 to 14 days after exposure to the virus. These include runny nose, sneezing, fever, dry cough, sore throat, red, inflamed eyes, body ache and little white spots with bluish white center inside the mouth on the inner lining of the cheek known as Koplik’s spots.\n\nSkin rashes appear around 14 days after virus exposure and can remain for around 7 days. They develop first on the head and spread to other body areas. The rash is maculopapular type that starts as large, flat, red spots but small bumps can occur on top and the spots flow into one another afterwards. The overall infection tends to resolve in around three- weeks’ time.\n\nWhat Are Its Complications?\n\nThe complications that can occur include bronchitis (inflamed bronchial tubes), laryngitis and pneumonia (inflamed air sacs of lungs) which can be fatal especially in persons who have compromised immunity. Measles can result in diarrhea and ear infection, a very common complication. Other than this seizures (fits), blindness and encephalitis (brain inflammation) can also occur. Lastly, if a pregnant woman contracts this infection, it can result in low birth weight of child, preterm labor and even death of the mother.", "opengraph": {"locale": "en_US", "type": "article", "title": "Top 10 Homeopathic Medicines For Measles - Homeopathy at DrHomeo.com", "description": "0 Measles is a viral infection caused by measles virus ( belonging to genus Morbillivirus and family Paramyxoviridae). It is also known as rubeola and is a highly contagious infection. It usually occurs in children but adults can get infected too. Originating in the respiratory system, the infection in some cases can be serious and fatal. …", "url": "https://www.drhomeo.com/skin/top-10-homeopathic-medicines-for-measles/", "site_name": "Homeopathy at DrHomeo.com", "article:publisher": "https://www.facebook.com/pages/DrHomeo/292178394174737?", "article:section": "SKIN", "article:published_time": "2022-09-27T08:06:43+00:00", "article:modified_time": "2022-10-11T15:46:54+00:00", "updated_time": "2022-10-11T15:46:54+00:00", "image": "https://www.drhomeo.com/wp-content/uploads/2022/09/measles1.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2022/09/measles1.jpg", "image:width": "474", "image:height": "360"}, "tags": [], "tweets": [], "movies": [], "links": ["https://plus.google.com/share?url=https%3A%2F%2Fwww.drhomeo.com%2Fskin%2Ftop-10-homeopathic-medicines-for-measles%2F&t=Top%2010%20Homeopathic%20Medicines%20For%20Measles", "#", "http://www.linkedin.com/shareArticle?mini=true&url=https%3A%2F%2Fwww.drhomeo.com%2Fskin%2Ftop-10-homeopathic-medicines-for-measles%2F&title=Top%2010%20Homeopathic%20Medicines%20For%20Measles"], "authors": [], "publish_date": "2022-09-27T08:06:43+00:00"}