{"result_id": "370026", "URL": "https://www.drhomeo.com/", "timestamp": "2023-04-25 18:27:42 CEST+0200", "meta": {"description": "Dr. Vikas Sharma is fourth generation Homeopath. He is homeopathic doctor in Chandigarh, India", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Dr Vikas Sharma Blogs on Homeopathy", "cleaned_text": "Eczema (dermatitis) of hands refers to inflammatory condition of skin on the hands. It usually affects the palms though it can affect other parts of the hands too like back of hands, fingers, space between fingers, etc. Hand eczema usually occurs from chemical exposure or hands getting exposed to some irritant. Those who have jobs […]\n\nTop 11 Homeopathic Medicines to treat Constipation in Old People Constipation means having three or less than three bowel movements in a week, passing hard stool or incomplete bowel evacuation. Accumulation of stool in the colon for a long time makes stool hard and dry which passes out with difficulty requiring straining efforts for expulsion. Constipation is a very common problem in old age. The […]\n\nA number of symptoms, like mood swings, bloating, headache, fatigue, etc show up in a woman before her periods and breast pain can be one among them. Breast pain before the periods is also known as premenstrual breast pain or cyclic mastalgia. Along with pain, there may occur heaviness, swelling and tenderness (pain on touch) […]\n\nUterine fibroids are non-cancerous growths made of muscle and connective tissue developing in the uterus. These can lead to various symptoms among which heavy menses is the most important. Heavy menses means bleeding more than the typical menstrual blood loss or passing of large clots frequently in bleeding which may last for more than 7 […]\n\nHeadache along with Eye Pain? Treat with Homeopathy Headache is sometimes accompanied with eye pain. It could be because of different reasons, but the first one that comes to mind is eye strain. It may be because of uncorrected refractive errors (myopia and hypermetropia). Other causes include migraine, cluster headache, sinus headache, tension headache and glaucoma. Depending on the causes behind it, apart from […]\n\nA common problem, acne develops when the pores of the skin get clogged with sebum (an oily substance produced by sebaceous gland in skin) and dead skin cells. The acne may appear as small raised red bumps (papules) or these may be pus-filled (pustules). In some cases, these may be hard and sometimes form large […]\n\nLosing Balance while Walking? Causes and its Homeopathic remedies While walking we tend to have a certain level of balance, with which we are able to walk straight and do not fall. Sometimes, a person may have trouble standing with feet together and walking straight. It may simply be a part of ageing or could be arising from a medical condition. The main problem […]\n\nUrine infection or Urinary Tract Infection (UTI) can trouble a lot of women. Though men also get urine infections, women are four times more at risk of acquiring UTI than men. Urine infection happens when bacteria gain entry into the urinary tract via urethra and start multiplying in the urinary bladder. The most common bacteria […]\n\nA very common medical health problem, fungal infection in private parts is caused by Candida (mainly candida albicans). It is the most common fungus (yeast) that tends to cause fungal infection in private parts. Its infection is known as candidiasis or thrush or yeast infection. Candida infection is more common in women than men. In […]\n\nWhat Causes Weakness in Legs and its Homeopathic treatment Sometimes we feel weak in the legs and we don’t know why. It may be in one leg or both, may arise suddenly or gradually over weeks. The reason may be mild like over-activity/overexertion of leg muscles. In some cases, it is linked to some underlying medical cause (like slip disc, peripheral neuropathy). But in […]\n\nEnlarged prostate causes many urinary problems and frequent urination is one of the most commonly occurring complaint from enlarged prostate. Prostate gland is a walnut size gland that surrounds the first part of urethra underneath the bladder in males. It secretes prostatic fluid and also functions to expel semen during ejaculation. The enlargement of prostate […]\n\nHeadache is a very common symptom when a person is suffering from cold. About 50 – 60 pc persons suffering from cold tend to get headache as one of the attending symptoms. The reason behind it is stuffiness in the nose from swollen mucus membrane that lines nasal passages and sinuses (air-filled cavities inside the […]\n\nCan’t sleep well at night due to Itchy Anus, try these Homeopathic remedies Anal itching, medically known as pruritis ani, can be quite annoying as well as embarrassing. Though anal itching can occur any time but is more common at night or gets worse at night. Though scratching can give a bit of relief but it can irritate and damage the anal area that increases chances of skin […]", "opengraph": {"locale": "en_US", "type": "website", "title": "Homeopathy at DrHomeo.com - Dr Vikas Sharma Blogs on Homeopathy", "description": "Dr. Vikas Sharma is fourth generation Homeopath. He is homeopathic doctor in Chandigarh, India", "url": "https://www.drhomeo.com/", "site_name": "Homeopathy at DrHomeo.com", "image": "https://www.drhomeo.com/wp-content/uploads/2023/04/eczema1.jpg", "image:secure_url": "https://www.drhomeo.com/wp-content/uploads/2023/04/eczema1.jpg", "image:width": "360", "image:height": "540"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.drhomeo.com/eczema/top-homeopathic-medicines-for-eczema-of-hands/", "https://www.drhomeo.com/eczema/top-homeopathic-medicines-for-eczema-of-hands/", "https://www.drhomeo.com/constipation/top-11-homeopathic-medicines-to-treat-constipation-in-old-people/", "https://www.drhomeo.com/constipation/top-11-homeopathic-medicines-to-treat-constipation-in-old-people/", "https://www.drhomeo.com/breast/effective-homeopathic-medicines-for-breast-pain-before-periods/", "https://www.drhomeo.com/breast/effective-homeopathic-medicines-for-breast-pain-before-periods/", "https://www.drhomeo.com/menses/top-homeopathic-medicines-for-heavy-bleeding-from-uterine-fibroids/", "https://www.drhomeo.com/menses/top-homeopathic-medicines-for-heavy-bleeding-from-uterine-fibroids/", "https://www.drhomeo.com/headache/headache-eye-pain-treat-homeopathy/", "https://www.drhomeo.com/headache/headache-eye-pain-treat-homeopathy/", "https://www.drhomeo.com/acne/top-9-homeopathic-medicines-acne-hormonal-imbalance/", "https://www.drhomeo.com/acne/top-9-homeopathic-medicines-acne-hormonal-imbalance/", "https://www.drhomeo.com/homeopathic-treatment/losing-balance-while-walking-causes-and-its-homeopathic-remedies/", "https://www.drhomeo.com/homeopathic-treatment/losing-balance-while-walking-causes-and-its-homeopathic-remedies/", "https://www.drhomeo.com/uncategorized/top-9-homeopathic-medicines-for-uti-in-women/", "https://www.drhomeo.com/uncategorized/top-9-homeopathic-medicines-for-uti-in-women/", "https://www.drhomeo.com/candida/top-homeopathic-remedies-for-fungal-infection-in-private-parts/", "https://www.drhomeo.com/candida/top-homeopathic-remedies-for-fungal-infection-in-private-parts/", "https://www.drhomeo.com/homeopathic-treatment/what-causes-weakness-in-legs-and-its-homeopathic-treatment/", "https://www.drhomeo.com/homeopathic-treatment/what-causes-weakness-in-legs-and-its-homeopathic-treatment/", "https://www.drhomeo.com/urine/frequent-urination-from-enlarged-prostate-causing-trouble-try-homeopathy/", "https://www.drhomeo.com/urine/frequent-urination-from-enlarged-prostate-causing-trouble-try-homeopathy/", "https://www.drhomeo.com/common-cold/top-5-homeopathic-medicines-for-relieving-headache-due-to-cold/", "https://www.drhomeo.com/common-cold/top-5-homeopathic-medicines-for-relieving-headache-due-to-cold/", "https://www.drhomeo.com/anal/cant-sleep-well-at-night-due-to-itchy-anus-try-these-homeopathic-remedies/", "https://www.drhomeo.com/anal/cant-sleep-well-at-night-due-to-itchy-anus-try-these-homeopathic-remedies/", "https://www.drhomeo.com/muscle/top-8-homeopathic-medicines-for-relieving-muscle-cramps/", "https://www.drhomeo.com/muscle/top-8-homeopathic-medicines-for-relieving-muscle-cramps/", "https://www.drhomeo.com/stomach/how-to-handle-stomach-pain-due-to-gas-in-homeopathy/", "https://www.drhomeo.com/stomach/how-to-handle-stomach-pain-due-to-gas-in-homeopathy/"], "authors": [], "publish_date": null}