{"result_id": "370004", "URL": "https://www.drhomeo.com/category/autism/", "timestamp": "2023-04-25 18:27:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://drhomeo.wpenginepowered.com/wp-content/themes/news/images/favicon.ico", "canonical": "https://www.drhomeo.com/category/autism/", "encoding": "UTF-8"}, "image": null, "domain": "www.drhomeo.com", "title": "Autism Archives", "cleaned_text": "Legal Disclaimer: Results may vary, and testimonials are not claimed to represent typical results. The testimonials are real, and these patients have been helped with homeopathy from our clinic . However, these results are meant as a showcase of what best, homeopathy can do with the disease condtions and should not be taken as average or typical results.\n\n Homeopathy is much more of a choice than people often think it to be. One of its philosophy’s greatest breakthroughs is the realization that the body is not an object but a process with no pre-ordained limits. The scorching, cruel heat of summer was just setting in the first year of the new century when Mr and Mrs Puri (not their real names) approached us with their only child Ravi (not his real name) who was then four. Two years earlier, at the age of two, he was diagnosed as being autistic. We tested him on the ATEC (Autism Testing and Evaluation Checklist) and his rating was in the moderate to high category. His problem was more in speech/communication and sensory/cognitive areas.\n\n Besides the classical symptoms of autism, the symptoms that actually led us to prescribe Carcinocin were the history of an early eruption of teeth and hairiness. A leading characteristic of Carcinocin is the desire for milk. There are many symptoms – a sweaty head, when sleeping, and physical heat in general; difficulty in falling asleep; the desire for things salty and for chocolate-like energetic foods. Than there are internal restlessness and fidgetiness and love for dancing. Strong passion and a very strong family history of cancer in the family are also noticed. The remedy was the boy’s similimum if there ever was one! Fitting him like a glove, it worked. Ravi has suffered no aggravation in the two years he has been on and off this remedy. The dosage chosen for him was similarly fitting – the LM dose. Positive results were obvious within the first month. Babbling turned into more formative words, hyperactive behaviour became rare and he started obeying simple commands. His self-stimulatory behaviour, too, was nearly gone. Very soon a big achievement came when Ravi started interacting with children and started playing with them. He is now five and is attending a normal school. There are still vestigial signs of his former autism though these are not really apparent to teachers or anyone else besides us (parents and the physicians). For example, his language is occasionally awkward. In moments of stress (e.g. if he is sick), he retreats into himself and utilizes echolalia as a speech strategy. To sum it up, none but the very discerning can make out that Ravi had this serious problem. I would now like to enlighten the readers about the intricacies and the sensitive approach necessary for the homeopathic intervention. Autism poses a challenge to homeopaths. It needs a hardcore-Hahnemannian approach. Valuable symptoms including reaction to vaccines, family medical history, thermal sensitivities and sleep postures form a part of the very detailed information that a physician would need. For the parents whose kids are undergoing such intervention, the stimulus/reaction model of symptoms and its significance to the homeopath need to be clearly understood. As the autistic child experiences stress, he responds with a reaction. This reaction becomes a symptom or a sign of characteristic importance. The real challenge is to understand what the child is expressing both verbally (if he is articulate) and nonverbally. By fully perceiving the patient, one may learn to understand the individual?s cycle of stress and response. It is only through such a deep understanding that a homeopath is able to prescribe effectively. The improvement following such intervention also needs to be evaluated regularly on the autism-rating scale. The extent to which the help can occur has a great degree of variability associated with it. Two homeopathic remedies require a special mention for their effectiveness in the recovery of autism Carcinocin and Baryta Carb . Baryta Carb is supposed stimulate the development of brain. This remedy has been found useful in cases of autism where signs of global developmental delay are present with the classical symptoms of the autism spectrum. Another important aspect of the homeopathy in autism is the usage of LM potencies… Homoeopathy in this scale are faster acting and at the same time gentler. It is able to hold the “slipping back” of the old symptoms and can be used for a longer period with frequent repetitions. Homeopathy is undergoing a very strong resurgence in the modern medical world, and one of the main reasons for it is its recent role in handling such illnesses. Homeopathic philosophy is a constant reminder that the greatest healing power lies within the body itself. Here is some more info on autism. This article on autism was written by me in Tribune about 2 yrs years back. Autism is a childhood disorder that begins in early childhood (typically during the first three years of life) which affects the child’s communication skills, social interactions, and causes restricted, repetitive and stereotyped patterns of behavior in varying degrees. Autism (also called as autism spectrum disorder or pervasive developmental disorder) can range from severe to a very milder form. This mild form is called Asperger’s syndrome. The actual cause for autism is not clear. Autism in the first two years of life is slightly difficult to diagnose. Parents are usually the first ones to notice the symptoms, which in the first two years of life are otherwise slightly difficult to find out; usually it is the nonresponsive behavior in the first two years that may make the parents feel concerned. In cases where the child has been growing normally, his sudden withdrawal from social interactions, nonresponsive behavior along with losing that little amount of speech that he had gained initially, may lead the parents to get their toddler screened for this disorder. By the age of three, autism spectrum disorder can be clearly diagnosed. Children with ASD (autism spectrum disorder) may not follow regular developmental pattern like other kids of their age. Verbal and non verbal communication, social interaction and patterns of repetitive behavior (also called as fixations)-like being fixated with carrying some object in the hand all the time e.g. Sticks, pencils, soap suds, etc. Rocking, spinning, excessively arranging things in one line and Behavioral issues like hyperactive behavior and inability to understand emotions are a part of this disorder for some kids. Autism is nowadays called autism spectrum disorder as there is a huge variation of symptoms that the child might suffer from. Key features that should help the parents in identifying this disorder are child’s inability to babble or make meaningful gestures (like social smile, pointing to objects like fan etc,) by 18 months of age. Inability to speak even a single word by the age of two, having a poor or no eye contact, giving the impression as if he is hard of hearing when being called out to. The ‘not in tune’ behavior of the child is the most important differentiating symptom although it is not very easy for a lay person to identify it. Homeopathy’s role in helping autism in kids is gaining quite a popularity all over the world. Clinical experience shows that results are much better when the intervention is started at an earlier age, even though at higher ages like six or seven some kids do show remarkable improvements; but Homoeopathic intervention at an early age(before much behavioral and emotional issues come up) has distinct advantages. One important aspect that I would clearly like to mention is the fact that results with homeopathy in autism are selective. This means that where one segment of kids may respond extremely favorable while others may fail to yield any relief. Even while on Homeopathic remedies the child needs to be rated on an autism rating scale. Periodical assessments on the autism rating scale are must to gauge the improvements in the child. Homeopathy is a holistic system of health; it takes into consideration the constitutional picture (complete physical and mental make up of the child) along with the necessary details of the disease while prescribing. Remedy that are very effective in helping autism are Carcinocin, Hyoscyamus, and Baryta Carb. The role of carcinocin in autism requires a special mention. This also does not mean that every child who has autism should be put on it; even for carcinocin to be prescribed the child has to fall within the constitutional picture\n\n Dr. Vikas Sharma is a Neuro-Developmental Specialist in homeopathy and has done his master in Homeopathy.The subject of his research (during his masters degree) was ‘The Role of homeopathy in Autism spectrum disorders .\n\nWhat Causes Autism? Understanding The Reasons Causing Autism Autism is a developmental and neurological disorder which occurs in during early childhood. While nobody exactly knows the reason for it, with years of research and studies we have been able to figure out the various known factors that can be the causes of autism. Out of these, the most common ones include genetics, vaccinations, ante-natal and perinatal factors, environmental factors, gut issues and some theories that suggest the role of heavy metals. However, we still cannot rule out any specific causes of autism and mostly rely on these probable factors that could have contributed to the risk of developing Autism. Understanding these factors has given some idea as to how they increase the tendency of a child to develop autism. Genes seem to have a significant influence in developing Autism. Studies do suggest that autism has a strong connection with the genetic variation and heritability. Various genotypes have been related to cause autism. The fact that it is more common in identical twins gives us substantial evidence of the role of genes in causing autism. Also, if there is any known case in the family, the chances of having autism is higher in the other kids.\n\n A consanguineous marriage (Married in blood relation) increases the probability of having autism, indicating the role of similar genetic coding as an important factor. In the genetic study of kids having autism, we have seen certain gene mutations are commonly found and are known to cause developmental, cognitive and intellectual disorders. There are various chromosomal duplications or deletions which are related to Autism. Some of the common genetic mutations found in autism are: Most of these chromosomal mutations are known to cause intellectual disabilities, delayed development, learning disabilities, seizures, microcephaly or behavioral issues in children. Genetic screening is therefore advised in a majority of the cases of autism to rule out the presence of any such genetic mutations. If present, genetic testing for both the parents is conducted to find similar genetic changes in either or both the parents. Also, a history of Down’s syndrome has been found in cases of autism. History of certain psychiatric disorders like depression is commonly seen in the family of kids with autism. Also, kids with autism spectrum are at high risk of developing depression, obsessive-compulsive disorder, and anxiety. So, the genes that make an individual vulnerable to develop a psychiatric disorder might also have some role to play.\n\n Also, there are many cases where we do not find any genetic mutations or known case of autism in the family. Further research work is still being carried out to find a definitive analysis of the role of genes in autism. There is a strong relationship observed between vaccines and the onset of autism. Sometimes, parents report a regression in the child after a vaccination shot. However, it is unclear what exactly is the role of vaccinations in autism. The most common vaccine that has been a suspected cause of autism is the MMR vaccine. It is a trivalent vaccination preserved in a mercury-based solution and is used against Measles-mumps-rubella virus. The mercury base of this vaccine is also thought to cause autism. Thimerosal is a mercury-based preservative found in many vaccinations. This heavy metal seems to have some toxic effect on the central nervous system (CNS) and increases the risk of autism. In the United States, vaccinations are now being prepared without the mercury or lead-base preservative. There are still some doubts that vaccines do increase the risk of autism in children. But many studies suggest that autism is more common in kids who received vaccination rather than in those who did not. Some conditions if present during pregnancy can increase the probability of Autism developing in the child. However, it is uncertain how significant a role these factors play in the development of autism. But there are certain conditions which are frequently found in the gestational history of autism cases. Below are some of those common complications or conditions: Infections like German measles or cytomegalovirus if present during pregnancy increases the risk of autism in the child. Also known as German measles, it can lead to some serious side effects on the baby’s development if a pregnant woman gets infected with it during pregnancy. The infected female might show some flu-like symptoms, for example, a low-grade fever, runny nose, headache, redness of eyes or joint pains. A rash usually follows these flu-like symptoms. It can cause some serious effects on the unborn baby, like congenital rubella syndrome, microcephaly, vision problems, premature baby, miscarriage, or stillbirth. The baby may also be born with some birth defects. It is a virus which is only carried by humans. Females infected with it mostly do not show any major symptoms, while some might complain of fever, swollen glands, cough or cold. Therefore, it is usually confirmed by the CMV test which is always recommended during pregnancy. CMV might not always have a significant impact on the baby, but in some cases, it can lead to a poor hearing, poor vision and also cause intellectual impairment in the baby. When a female develops diabetes (high blood sugar levels) during pregnancy, it is called gestational diabetes. It might not directly lead to autism, but its effects and consequences and can make the baby prone to develop autism. If a mother has diabetes, it can cause hypoxia, growth abnormalities, and the baby can be too large for the gestational age (This can increase the risk of having an assisted/instrumental delivery like vacuum/forceps or C-Section). It can also cause intra-uterine growth retardation and also makes the mother vulnerable to have premature labor. It can trigger the production of excessive insulin by the pancreas of the baby and causes hypoglycemia.\n\n Gestational diabetes also commonly causes depression in pregnant females. A newborn can develop hypocalcemia (low calcium levels) and hypomagnesemia (low magnesium levels). If the diabetes is not controlled during pregnancy, it can also lead to respiratory distress syndrome in the child. Having thyroid disorders during pregnancy is very common, and it is not mandatory that the child will develop some developmental issues because of it. However, it is one of the contributing factors which might increase the risk of intra-uterine growth retardation, miscarriage, preterm delivery or low IQ levels of the child. Also, there is some association of thyroxine deficiency which produces changes in the brain of the unborn baby and makes him vulnerable to develop autism. There have been some drugs identified, whose usage during pregnancy can increase the probability of having autism in the babies. Some of these drugs include anti-epileptic medicine, anti-depressants, and drugs used to prevent premature labor. There is no proven evidence that they do cause autism but it has been observed that their administration increases the risk of autism by three folds. The risk of developing autism is higher especially if the baby is exposed to these drugs during the last months of pregnancy. It is commonly seen that if a woman conceives after or around the age of 40 years, the child is at a higher risk of developing Autism or other developmental issues. Teenage pregnancy is also related to increasing the risk of autism in the child. Autism is commonly seen in the cases of twin or multiple pregnancies. Gene studies show that there is some relation between twin pregnancy and autism. Autism is especially more common in identical twins than in fraternal twins. Some other conditions which can increase the risk of autism include depression during pregnancy, oligohydramnios (reduced amniotic fluid), obesity in mothers, smoking, un-natural mode of conception like ovulation therapy, IVF. These factors have been identified in diagnosed cases of autism as a part of the history of pregnancy. Any condition which can cause fetal distress or delay the initial oxygen supply to the brain can be a factor predisposing the child to develop Autism or other developmental delays later. Many conditions are a part of the birth history which are related to autism. When a neonate aspirates (breathes in) the stool at the time of birth, it is called Meconium aspiration.\n\n Risk factors for Meconium aspiration include difficult or prolonged labor, post-maturity or advanced gestation age, or if the mother is a smoker. The aspiration of Meconium leads to the obstruction of airways of the fetus. If the aspiration is for a long duration, it causes increased lung resistance, acute Hypoxemia, fetal hypoxia, infection and pulmonary inflammation. The hypoxia at time of birth can lead to autism or other developmental disorders in the child. It also leads to a syndrome commonly known as Meconium Aspiration Syndrome. There are various complications at the time of birth that can cause reduced or delayed oxygen supply to the brain of the newborn baby.\n\n This delay in oxygen supply can lead to some significant developmental delays in the child. Prolonged labor that lasts very long can cause fetal distress, reduction in the fetal heart sound, or hypoxia. Assisted deliveries that make use of a vacuum pump, or a forceps delivery can be other reasons leading to reduced oxygen supply to the brain. They can also affect the head circumference of the neonate at birth. Another significant sign which indicates reduced or delayed oxygen supply to the brain at birth is a delayed birth cry. It is a critical factor and must be ruled out in every case of autism. An umbilical cord wrapped around a baby’s neck in case of a standard vaginal delivery can have a suffocating effect, again causing fetal distress or reduced oxygen supply. Hypoglycemia refers to low blood sugar levels, while neonatal hypoglycemia refers to a temporary drop in blood sugar in infants. It usually occurs at birth or within the first few days after birth. It is one of the common causes of brain injury in infants. The source of glucose during pregnancy is through the placenta, and after birth, it is the breast milk. The liver of the infant also produces a certain amount of glucose. The brain uses sugar or glucose for building up tissues and is an essential source of energy.\n• Kids born to diabetic mother are vulnerable to develop it\n• Lack of an adequate amount of breast milk being fed to the baby\n• Insufficient glucose being produced by the baby\n• Breathing issues, it may be fast, or there may be apnea If continued for a longer duration, hypoglycemia can result in neurological damage and can also cause any of the following severe conditions: Gut or gastrointestinal issues are some of the most common disorders associated with autism. There are various gut disorders, food allergies, and deficiencies that have been associated with autism. It is difficult to say if they play the causative role, but they contribute to developing autism. Some of the recent research also suggests the role of gut bacteria. Certain gut disorders related to autism are gluten sensitivity, coeliac disease, leaky gut syndrome, milk allergy, chronic constipation, diarrhea and irritable bowel syndrome.\n\n Presence of these gut issues in autistic kids can also increase their behavioral problems. Kids with autism respond very effectively to certain diets, which indicates the role of the gut in autism. Diets that are gluten-free, casein-free or anti-yeast help in controlling behavioral symptoms, sleep patterns, and hyperactivity in autistic children. Leaky gut syndrome causes chronic inflammation. Chronic inflammation also seems to trigger some symptoms of autism. The theory behind it is that chronic inflammation decreases the IgA levels. IgA (antibody immunoglobin A) plays an essential role in protecting the body against yeast infections. Yeast is considered to make the child vulnerable to develop sensory concerns that make the child more hyperactive, sleepless and frustrated.\n\n Deficiencies can also be considered as the contributing factors. Children with autism are commonly to found to be low on iron, B12, magnesium, etc. Vitamin B12 plays a vital role in the manufacture of the myelin sheath (layer on nerves), carbohydrates, and production of neurotransmitters. Low magnesium levels produce symptoms like poor focus and concentration, poor memory issues, tremors, muscle cramps, twitches and generalized seizures. Many neurological disorders have been associated with heavy metal toxicity. Exposure to certain heavy metals has been found to increase the risk of autism. Mercury, Lead, Aluminum, and Zinc are the most common ones.\n\n High levels of mercury may cause brain damage and increase the probability of neurodevelopmental delays. It doubles the risk of developing autism.\n\n Mercury is commonly found in various vaccinations as a preservative, especially in hepatitis-B vaccine and MMR.\n\n Fish is also a good source of mercury, eating an excess of fish can also raise mercury levels.\n\n There are also reports that if the mother is exposed to heavy metals or pesticides during pregnancy, it can affect the mental development of the fetus inside the womb. A seizure is a brain disorder which occurs due to excessive or abnormal neuronal activity in the brain. Epilepsy is a disorder where when one has a tendency of recurrent seizures.\n\n About one-fifth of kids with autism have an associated epileptic history. It can’t be exactly said that epilepsy causes autism or autism increases the chances of epilepsy. But both share some relation.\n\n Kids with epilepsy are more prone to develop autism. And there are some changes in the brain of the autistic kids which predispose them to develop epilepsy or seizures.\n\n A family history of epilepsy is also found in cases of autism, showing some relation between the two. Treating seizures in autism also helps lower the severity of the developmental delays and cognitive symptoms. There are also some genetic changes associated with autism in which we find epilepsy to be an important feature. A sleep EEG can help detect epileptic activity in children. Certain environmental conditions like air pollution, extreme cold weathers, and exposure to environmental chemicals during pregnancy can increase the risk of developing autism. Common environmental toxins like herbicides, insecticides or pesticides are harmful to the brain development of the baby in the womb. So, if a female is exposed to all these (especially during the last trimester of pregnancy), the probability of developing autism gets increased.\n\nIf your child is between the ages of two and three years and his development is keeping you worried please check with these following signs and symptoms. The child is withdrawn, avoids social contact even with kids and avoids playing with them; has no language or is losing language which he had already acquired; Fails to respond to his name; has poor eye contact; moves Constantly; shows patterns of repetitive behavior like rocking, spinning and hand flapping. If some or all of these signs are present in your child please make sure that you consul t a developmental specialist and have him evaluated for Autism. Autism or Autism spectrum disorder also called as pervasive development disorder (PDD) is catching our world by surprise. The Incidence of autism is on rise. This rise is very fast. The Centre for disease Control in United States also known as CDC has recently come up with their changed statistics and are showing that 1 in every 110 children In United states have Autism. This is very alarming and what is even more alarming and disturbing is the fact that this trend is on the increase. Although , we don’t have any clear data on the incidence of autism in India, but we know that Autism is on rise in India too. And what is more Troublesome is that, till date, no cause has been identified for Autism. Autism is Usually diagnosed between the ages of 18 months to 3 yrs. Although signs and symptoms of autism may be present earlier but are very difficult to identify. The Symptoms can range from very mild to very severe, hence autism is better known as autism Spectrum Disorder. This means that not every kid will develop the same amount of autism. Broadly speaking, Autism mainly affects the Verbal and non-verbal communication, social interaction and the behavior of the child. Communication is affected by delayed speech development, less speech, difficulty in using speech, repetitive speech and to a level where there is no speech. Nearly 40 percent of kids with Autism never develop speech. Social Interactions are affected by failure to establish friendships with children of same age, showing withdrawn behavior, lack of interest in sharing enjoyment, activities and achievements with others. They can also lack emotional understanding and reciprocity; this means that it is difficult for kids with autism to understand feelings of pain, sorrow and emotions of others. Autistic kids can have marked disability in expressing their own emotions whether verbally or non verbally. Behavior is usually affected signs of repetitive behavior or stereotyped behavior like hand flapping, spinning and can also signs of hyperactivity. Kids with autism show addictive tendency towards certain topics or objects like looking rotating objects, television advertisements, sticks , soaps or a particular toy. Homeopathy has help for kids with autism. Although not all kids with autism respond to homeopathy but a certain segment of kids with mild to moderate level of autism at times show great signs of Improvement and recovery. Autistic kids with speech (however little) and less hyperactivity show very favorable improvements with certain homeopathic medicines. Age of the child also has major affect on the homeopathic treatment outcome – younger the child better are the chances of improvement with homeopathic medicine.\n\n Dr. Vikas Sharma MD\n\nHow to help your Autistic Child Develop Good Eye Contact In social interactions, eye contact drives all non-verbal exchange. It is a measure of the other person’s interest in us and reaction to what we have to say. In fact, it helps us pick up several social cues during a conversation. For children with autism, this simple communication tool can be a formidable challenge. Making eye contact, for them, is often a most daunting, stressful task which if forced, could set off anxiety, inattention, confusion even. Adults with autism describe the feeling of helplessness, and complete and utter confusion resulting from the attempts by their well-meaning parents and teachers to get them to look people in the eye. Some of them say the stress left them further distracted and unable to focus on the conversation so that they just wanted to escape and would leave the scene.\n\n So, should we or should we not insist on eye contact in children with autism? “It depends”. Research says the best way out is to gauge what does or does not work for your child; look for the signs and see whether encouraging eye contact helps your child focus his attention better or makes him nervous and therefore, distracted. Two explanations for reduced eye contact in autistic children have been proposed. One says that children with autism avoid eye contact because they find it stressful and negative. The other says that autistic children do not see the social cues from eyes as particularly meaningful or of great use. A new research, conducted on the day the children were first diagnosed with autism, backs this view. It shows that young children with autism do not actively avoid eye contact and that they do not find other people’s eyes aversive. Children with autism look less in the eyes because they appear to miss the social significance of eye contact, the researchers said. Another plausible explanation could be that the poor motor skills in children with autism extend, during infancy, to a reduced ability to control eye movement.\n\n For the autistic person, all this adds up to a sort of sensory overload, more information and data to process for their already burdened mind. People with autism describe the feeling as “unnatural”. They do not know how long they should continue to look into the other person’s eyes, they say, which makes it difficult for them to focus on the actual content of the conversation.\n\n Avoiding eye contact does not show a lack of interest in the autistic person. Rather, it is an attempt to focus on the task at hand; a Dutch autistic girl was quoted as saying.\n\n “When I’m holding a conversation with someone, if I make eye contact, I would miss everything that the person is saying,” she said.\n\n “It’s a steady stream of extra-sensory or processing information in addition to what I’m already trying to sort in my brain.\n\n To me, eye contact seems like I’m being observed at, like I’m being examined and assessed. It makes me uneasy because I feel like I’m under enormous pressure, and the stress builds up, until finally, I have to look away.”\n\n Many autistic children fear that by making eye contact, they are revealing that they are socially awkward and odd. It makes their eyes burn and water, they complain.\n\n The entire experience is one of immense pain and discomfort. Looking away makes this pain go away. Eye contact is a treatable, reversible symptom of autism spectrum disorder. This is how it works: autism may be linked to the disruption of G proteins that control cellular signalling, as per research findings. Cellular signalling refers to the ability of cells to perceive and correctly respond – in short, communicate – in their micro environment. This defect, combined with a vitamin A deficiency, can result in immune dysregulation – an inappropriately robust of weak immune response – and metabolism of fats needed for brain development. G proteins are also important for normal retinoid receptor function, which is the basis for healthy visual processing. Vitamin A doses may help reconnect the retinoid receptors critical for vision, sensory perception, language processing and attention. Therefore, the first step in treating lack of eye contact in children with autism is to use a specific form of vitamin A to repair the G proteins to re-establish good visual processing.\n\n The eyes are the best of the fine motor skills. Visual motor planning relies on processing data. If a child wants to look at you, they need the visual processing centres in the brain working so they can integrate the information and then act on it. Depleted or defective vitamin A stores crash these visual processing centres, making it virtually impossible for the child to use this motor skill. Homeopathic medicine can helpful in overall improving the condition of autistic children thereby delivering significant improving the eye contact in autistic children. Homeopathic medicines are prescribed on the overall assesment of the case. Other measures to encourage eye contact in children with autism are as follows:\n• Eliciting a glance\n\n As a first step toward getting your child to look at you, pause before responding. So if your child asks a question or asks for something, pause before offering it to him. The pause may make him glance in your direction to see whether you heard him. When he does, respond immediately and praise him for making eye contact. This could be as simple as saying, “I like how you’re looking at me” or simply “nice looking.”\n• The next step is to build the length of this eye contact. Each time, lengthen the pause by a few seconds before you respond to him. During this break, you can tell him how his making eye contact encourages you to respond to his requests.\n• Building on interests\n\n Does your child loves to speak about a particular show or a unique set he has? Is he more disposed to look up at you when you engage him on these subjects? This is a an excellent way to encourage him.\n• Visual supports\n\n It could be that your child does not even make enough eye contact for you to be able to encourage or reinforce it on a regular basis. In that case, you will have to start by trying to first “catch his eye.” You could use a visual support or a simpler strategy like touching the corner of your eye with a motion that falls within his range of vision and repeat it till it catches his attention.\n• Behavioral therapy and social-skills groups\n\n A behavioural therapist engaged with an autistic child has a wonderful opportunity to build on the eye contact and attentiveness skills by working with him as a team. In fact, the therapist could educate the parents on a series of behavioural strategies that will help to gradually increase the child’s eye contact within his or her natural environment at home, school and at play. Three quick and simple techniques for getting eye contact:\n• Place yourself at or under his eye level consistently. It’s less eye stress and easier to look at you this way.\n• When you give your child an object, hold it to your eyes, so that he must reach out and grab it. You are right there, behind the object!\n• Positive reinforcement.\n\nEarly Signs of Autism In Infants and Homeopathic Treatment Early signs of autism in your child It is estimated that at least one child out of 100 is likely to be autistic. Autism is a clutch of closely related disorders with a common core of symptoms. Appearing in infancy and early childhood, it leads to tardy growth in many basic areas like learning to talk, play, and social interaction with others.As a parent, therefore, you need to look out for early signs of autism in your Infant. Its symptoms often surface between 12 and 18 months although an official diagnosis of autism isn’t generally furnished until a child attains the age of 2 or 3. Since it can be Autism can diagnosed in infants, the sooner it is identified for homeopathic medical intervention, the better are the chances of treatment. There are some early signs of autism in infants that show up as as early as two months and should set alarm bells ringing. If you find only one or two of these signs surfacing once in a while, it may not be so much a cause for concern as it may be some other kind of language or learning problem, or simply nothing at all.But it is a red flag if the baby shows lack of eye contact, such as not looking at you when being fed; doesn’t smile back when smiled at; shows lack of response to name or to the sound of a familiar voice; doesn’t follow objects visually; the baby shows lack of gestures for communication, like pointing, reaching, waving, showing things, etc. If the baby fails to make noises to draw your attention; doesn’t initiate or respond to cuddling; doesn’t make gestures to be picked up; doesn’t know how to play with toys or excessively lines up toys and other objects; or is overly attached to a toy or object, and isn’t sociable, doesn’t share interest and enjoyment, these signs should be chronicled and discussed with the doctor. These can early signs of autism in your baby. Specific Signs Of Autism in Infants at various stages of growth: There are some early milestones at specific stages that form the bedrock of a child’s growth. Among these is the yardstick of social reciprocity, which entails back and forth communication and continuous exchange of gestures. Here are some milestones that may be missing: By 2 to 3 months, the baby isn’t making frequent eye contact; by 3 months, the baby isn’t smiling at you, there are no cheerful or other joyful expressions; by 6 months, the baby doesn’t laugh; by 8 months, the baby isn’t following your gaze when you look away from him, and there is no reciprocal sharing of sounds, smiles, or other facial expressions; by 9 months, the baby hasn’t started babbling; by 1 year, the baby isn’t consistently turning to you when you call his name; by 1 year, the baby hasn’t begun to wave a goodbye; by 12 to 14 months, the baby hasn’t uttered a single word; by 14 months, the baby isn’t pointing or gesturing to evince interest; by 18 months, the baby doesn’t play “pretend”; and by 24 months, the baby is not uttering two-word meaningful phrases (sans imitation or repetition). Role of Homeopathic Intervention when there are early Signs of Autism in Infants. As a rule I never start any autism related homeopathic medicine in kids below the age of 18 months . But I have had success with development delay medicines …for example , I have used Calcarea Carb in very young kids and have seen great improvement in them . My Homeopathic recommendation in cases where there are early signs of autism in Infants is Calcarea Carb . I have used this in decimal scale with great success.\n\n13 essential Steps For your Child’s Recovery from Autism 13 essential Steps For your Child’s Recovery from Autism\n\n \n\n It is very natural for all parents to go through a ‘difficult period’ initially once they come to know about their child ‘s autism issue. My advise would be’ please don’t despair’ even if your pediatrician has taken away every bit of hope of your child’s recovery from autism. I have seen plenty of cases recovering or becoming quite significantly better after early behavior and Homeopathic intervention. You can believe me because I have huge experience in dealing with Autism. My Clinic deals with nearly 3-5 new cases of autism every day and a follow-up of at least dozen Autism cases every day. Start early. Once the diagnosis is done, it is very essential to come to terms with the diagnosis as fast as possible. I have seen that most of the parents struggle with the diagnosis for months or years together, which is extremely harmful for the child. Early intervention has a very important role in the recovery of the child from autism. Making sure of the Autism Diagnosis In a very young child, lets say between 18- 24 months, the diagnosis is difficult and it becomes all the more difficult if the child has mild problem. Taking the child to your Family doctor or a pediatrician can at times delay the diagnosis as some of them might be not clinically trained to identify Autism Spectrum Disorder ( I could be wrong here , as the clinical training differs from country to country and also the experience and the awareness has a strong bearing on the knowledge of the Pediatrician.). A Neuro developmental specialist is the right person for diagnosis. One diagnostic sign that I have always found very useful in diagnosing Autism Early is how the child reacts to his name being called out. Especially, when a stranger is calling it out. If out of ten, the child is responding less than 7 -8 times when a stranger calls out his name, there is a strong chance that the child could be falling in the Autism Spectrum. Bottom-line if you suspect that your child has autism; please take him to the right place for diagnosis as fast as possible. And if your fears are confirmed, Start Behavior and Homeopathic Intervention as fast as possible . Understand what has happened to your Child. If you can leave the medical diagnosis aside, Take a brief pause and understand what has happened to your Child ( it will help you in his recovery ). It seems that the child has slipped into his own world . He is less connected to the world around him . His mind is getting trained to be in his own world . He is self – stimulating because of that . Prevent that . This is stopping him from learning new things Autism Confirmed -Time to go all guns blazing Its now or never, you cant afford delay in this matter. Put all your energy into pulling your child out of the world that he has slipped into. ‘Concentrated effort’ is what is required , I have realized that parents who put in all their resources early ; whether it time or available manpower , stand a very good chance of seeing a recovery in their Child’s Autism problem. I was treating a child who was three and a half with moderate level of Autism and no speech . This child after 3-4 months of Homeopathic Treatment developed speech and could speak between 20-30 odd words although they were just single words . Then suddenly he started losing all what he had learnt. After good deal of discussion with the parents , I found out that the mother had put the child into a regular primary school . This School had no Special infrastructure for handling autism . I asked the mother to go and observe the child in the school . She reported back after 2- 3 days that the child was not being attended well in the class and was quite isolated . He was also self Stimulating in school. As per my advise , the parents withdrew him from school , he started gaining back his speech and was back on the road to recovery from autism . I would suggest that one should avoid school for kids with autism in early stage . Child should be only put in school , only if the school provides a dedicated shadow teacher . Regular schools should be completely avoided ; in fact they can work against your child’s improvement . The big reason for not putting your child into school is that it causes pure regression as the child gets good enough time to be into his own world, hence his learning is not happening and also his mind is getting trained be in his own self. It is you and not the therapist who is going to make the big difference . Taking the child to a therapist has a pitfall . Most parents get relaxed and they stop working with the child as much as they should, once they are seeking help from a therapist. They completely overlook the stimulation that should be given at home. Its my personal experience with thousands of cases that I am writing this feature and have seen this fallout of the therapy in quite a number of cases. I will try and make myself more clear – If you are taking your child for therapy make sure that when the child is back home ,he should not get any free time in the house to slip into his own world. This slipping into his own self is the biggest impediment to his recovery . Most of our learning occurs from what we learn passively. When a child with autism slips into his self , his passive learning is not taking place hence he is not learning. Taking the child to the best therapist or the best therapy centre makes the parents believe that they are doing their bit and the child will automatically or over a period of time recover from autism because of the therapy he is receiving; where as what is actually happening is that the all the good work that therapist is doing , is getting anti doted by the hours of isolated state that the child slips into when he is back home. Once back home , keep up with the stimulation . Play , talk , dance …do all kind of activities . Keep him engaged in a loop with you and the regular world around him Parents are the best Therapist for Autistic kids There is no harm in engaging a therapist or taking your child to the Autism therapy centre as long as you are spending a lot of time with the child. I have always suggested parents to take more pro-active role in the execution of therapies. I have seen that children recover from autism more when their parents are actively involved in giving therapy to the child at home . Autism therapies are no rocket science ; one can easily learn them . There is a lot of information and videos available on the net . Try Searching You Tube for videos and you will find thousands of them. You are the best Therapist For him. As I already said autism therapy is no rocket science , the basic fundamental behind every therapy is to constantly engage with the child ; Never leave him alone .Don’t let him slip into his own world . This is what is most damaging for the child with autism. His slipping into his own self is keeping him away from learning new things hence he is not speaking and doing things. Constantly stimulate the child ; talk , play , dance . Engage with him in every moment . Do not leave him alone. You have to train his mind to be out of the Inward State . The whole exercise aims at training the mind to be constantly connected with outer world so that he can passively learn things. I have already written about dangers of television watching in my previous post and its suspected linkage to Autism . Please keep them away from gadgets . He is not learning anything from it ; most of the times they are a big fixation for them and are making things worse . I have seen miraculous results in hundreds of cases where the kids were pulled away from gadgets . These gadgets promote their self stimulatory Behaviour. What Working mothers with Autistic Kids should do for recovery ? Its now or never . If you are not the only bread-earner in the family , leave your job and be with your child for an year( if you have caught him early) . Early intervention with Right Homeopathic treatment can really pull your child out of Autism Spectrum . Prioritise your child’s Recovery . Unfortunately you might not get this opportunity to revert back his state after an year . Another advise that I have always given to mothers and has really helped many kids is that the mothers should match their Sleep Rhythm with that off the child . It really helps them to focus more on the child and gives more ‘High energy Time’ for the mothers to engage with the child .It is about matching your peak energy hours with that of the child . I have often observed this ,that once the Parents come to know about their child’s autism issue , working mothers tend to do their office work from home ; this again can be a misleading situation . In my experience noting major is achieved by this in most of the cases.The child will still be getting a lot of time to be into his own world. For what I have said in the last few lines might differ from case to case , so use your own discretion but be aware of what I say – ‘working from home might not carry the full impetus that is needed to bring your child out of autism’ Get More People In the House Are nuclear families to be blamed for an increase in the incidence of autism , no one really knows the real answer ; but certainly human interaction has a lot to do with the child’s recovery in autism . Its my personal opinion that if there more people available in the house for kids to interact with their chances of recovery from autism are high – Remember it is beneficial only if those people spend time by playing and interacting with the child . A lot of learning happens passively in kids ; they learn a lot from what is going on around them . Kids with autism tend to slip into their own world , thus their passive learning is not happening . Constant stimulation trains their mind to be out of their state and they start learning things passively . So My advise is to give constant stimulation and avoid what is the conventional practise nowadays of taking the child to the therapist for an hour or two in the morning and then letting him be in their own world throughout the day. Do Not Focus only on Speech with your Autistic Child Speech is not a stand-alone feature of brain , it results from the cumulative development of various faculties of brain . Many parents mainly focus on making their kids speak a single word like Mama, papa or dada. I opine that parents should not do this and should focus on the overall stimulation of the child . Spontaneous speech is what we really look for in kids who start recovering from autism . A child having Spontaneous speech refers to a situation where the child can speak more than what he has been forced to learn. He is able to pickup words from his environment and speak on his own . The sad part in my years of hard work with autism , is that most of the parents do not provide any kind of testimonial once their kids have recovered from autism . Although they are not obliged to do so , yet it is something that I feel that they owe it back to the society . It is very frustrating and humiliating when you are refused a testimonial . I have explained the parents that it is not for me that they should do this but for those thousands of parents who are hopeless about their kids recovery from autism. Most of my request go in vain. Yet ,Some brave ones have given video testimonials of recovery which are available on my you tube channel. Homeopathic medicines have a big role to play in the field of Autism . Data analysis from my Thesis ( My Masters in Homeopathy has been in the Autism and the research on The role of homeopathic medicines in the field of Autism) has clearly indicated strong efficacy of certain homeopathic medicines in Treating autism spectrum disorders. There are plenty of features in this website that I have written on how homeopathy can be helpful in treating autism. Try the search facility in the site and read them.Briefly I will explain the modalities – Autism Recovery with homeopathy has certain factors attached to it. Age of the child , Hyperactivity and last the verbal development has a lot to do with the overall outcome in the case .Homeopathy can in some kids ,can be a big boon ( I am clearly stating that only some kids recover dramatically with homeopathy… not all ) .", "opengraph": {"locale": "en_US", "type": "object", "title": "Autism Archives - Homeopathy at DrHomeo.com", "url": "https://www.drhomeo.com/category/autism/", "site_name": "Homeopathy at DrHomeo.com"}, "tags": [], "tweets": [], "movies": [{"embed_type": "iframe", "provider": "youtube", "width": "560", "height": "315", "embed_code": "<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/LkWQIIMGGvg\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>", "src": "https://www.youtube.com/embed/LkWQIIMGGvg"}], "links": ["tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/homeopathic/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/05/New-Project-6.mp4", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/what-causes-autism/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2018/07/autistic-kid.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/autism-and-homeopathy/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/help-autistic-child-develop-good-eye-contact/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2017/01/mother-lie-their-kid-1024x512.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/autism-treatment-testimonials/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2016/05/New-Project-6.mp4", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/autism-recovery-infographic/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2014/01/Autism-13-steps1.jpg", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/natural-homeopathic-remedies-high-functioning-autism-treatment/", "http://www.drhomeo.com/asperger-syndrome/curing-asperger-syndrome/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/methods-diagnose-autism-children/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/early-signs-autism-in-infants-homeopathic-treatment/", "http://www.drhomeo.com/autism-treatment/autistic-children/", "tel:+1-703-659-0873", "tel:+91-6283487321", "https://www.drhomeo.com/autism/autistic-child-recovery-from-autism/", "http://drhomeo.wpenginepowered.com/wp-content/uploads/2012/11/AUTISMRECOVERY.jpg", "https://www.drhomeo.com/category/autism/", "https://www.drhomeo.com/category/autism/page/2/", "https://www.drhomeo.com/category/autism/page/2/"], "authors": [], "publish_date": null}