{"result_id": "371006", "URL": "https://www.planetayurveda.com/whooping-cough/", "timestamp": "2023-04-25 18:28:19 CEST+0200", "meta": {"description": "Planet Ayurveda offers best combination of effective herbal remedies such as Eosinophilia Care Pack for ayurvedic treatment of whooping cough.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/whooping-cough/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Ayurvedic Treatment of Whooping Cough", "cleaned_text": "The disease has been troubling mankind since the 16th century. The bacteria named Bordetella pertussis was first discovered in 1906. It was in 1942 that the first combination vaccine DPT for Diphtheria, Pertussis and Tetanus was first developed and has since been used successfully to save many lives.\n\nIt is a highly contagious infectious disease. Caused by a deadly bacteria named Bordetella pertusiss. It is also known as \"100 day cough\". Very common in children under five years of age, pertussis is one of the most difficult diseases to cure, especially in children. With the development of a specific vaccine for this disease example, DPT, pertussis can be easily controlled. DPT vaccine for diphtheria, pertussis and tetanus has been very successful with the children and has drastically brought down infant mortality rate.\n\nDespite the rapid advancement in sciences, whooping cough, a deadly bacterial infection, still manages to cause significant mortality among the people of the developing world.\n\nEvery year, millions of people particularly in the developing countries suffer from this disease. In infants, less than a year old, whooping cough accounts for approximately 2 % of deaths in that age group.\n\nPertussis also known as \"whooping cough\" or 100 - day cough is a contagious bacterial infection of the respiratory system. The bacteria are air borne and transmitted by the droplets of saliva present in air due to sneezing and coughing of other infected people.\n\nThe coughing may last for up to ten weeks or 100 days in which the patient suffers from marked coughing and feeling of vomiting which may be accompanied by extreme fatigue and malaise.\n\nThe coughing is so severe in children that they may end up breaking a rib or two. In infants, the coughing is not very severe and they usually have recurrent bouts of not breathing at all in between phases of normal breathing.\n• Sudden and recurrent attacks of cough with a peculiar inspiratory whoop is the characteristic feature of the condition.\n• Fainting due to extreme fatigue associated with recurrent, sever coughing.\n• Vomiting after coughing may also occur\n• Subconjunctival haemorrhage, rib fractures, hernias, urinary incontinence and vertebral artery dissection are the other complication associated with whooping cough.\n• Running nose, sneezing, mild coughing and other respiratory symptoms occur in the initial stages of the disease after which the deadly paroxysmal cough sets in.\n\nVaccination for the Prevention of Pertussis\n\nThe most effective and primary method of prevention for pertussis is vaccination.\n\nPertussis vaccine has been highly successful after recommendations by World Health Organization and The center for disease control and prevention.\n\nThe vaccine is up to 85 % effective and though it has not been able to eliminate the disease completely, the multicomponent a cellular vaccine has made deadly whooping cough as one of the most common vaccine preventable disease in the western world.\n\nInfection from Bordetella bacteria does occur in many cases even after immunization, but the symptoms are usually mild.\n\nMortality rate is particularly high in children and infants less than 1 year of age. It is almost fatal in this age group. For older, otherwise healthy children and adults, Pertussis is easily cured and patients usually recover fully with proper treatment.\n\nPlanet Ayurveda offers best combination of effective herbal remedies such as Eosinophilia Care Pack for ayurvedic treatment of whooping cough. We provides 100 percent pure and natural products. All of them are free from side effects and are safe to use. And they are formulated by MD Ayurveda doctors. All of the medicines from the house are made without the addition of chemicals or additives or preservatives in it.\n• Tulsi Capsules : One can take 1 capsule twice daily after meals with warm water.\n• Pranrakshak Churna : One can take 1 tsp. twice daily after meals with warm water.\n• Immune Booster : One can take 2 capsules twice daily after meals with warm water.\n• Aller-G Care : One can take 1 capsule twice daily after meals with warm water.\n• Laxmibilas Ras : One can take 1 tablet twice daily after meals with warm water.\n• Septrin Tablets : One can take 2 tablets twice daily after meals with warm water.\n\nTulsi is known as holy basil and have a significant religious value. It is among the oldest herbs used therapeutically in various diseases. The ursolic acid in Tulsi acts as anti allergic. Tulsi capsule manages immune related disorders very well. Tulsi capsule are an effective remedy for cough, cold, viral flu, influenza, allergies, asthma and respiratory tract infections. Regular use of Tulsi capsule builds strong immune system and helps body to fight various infections in an effective manner.\n\nPraanrakshak Churna is a herbal powdered formulation, which is effective in various allergic conditions. This formulation contains Shirish, Bharangi, Kantkari, Anantmool and Madhuyashti. These herbs act in a synergistic way and are very effective in chronic allergies, upper respiratory tract infections, respiratory tract infections, chronic bronchitis and asthma. Bharangi, Kantkari and Shirish are the herbs, which act as natural antihistaminics and are beneficial in acute and chronic asthma. Vasa and Madhuyashti breaks the mucous plug and are useful in cough, bleeding while coughing and repairs the respiratory tract. Anatamool or Typlophora asthmatica as the name signifies is another herb beneficial in asthma.\n\nAs the name indicates, Immune Booster capsule boosts immunity very fast. It protects from the free radicals produced due to oxidative stress, aging, chemicals and infections. Capsule Immune Booster have components, which are being used traditionally since ages to increase the immunity. Grape seed extract, Cow Colostrums, Phyllanthus niruri, amla are the ingredients of Immune Booster. Cow colostrums help in building a strong immune system. Phyllanthus niruri helps liver to remove toxins from the body. Phyllanthus niruri, Grape Seed extract and Green tea together builds a cellular defense mechanism to combat chronic ailments.\n\nAller G care is a unique combination of herbs, which are natural anti allergic and anti inflammatory. The herbs Haridra, Neem, Shirish and Ashwagandha makes this formulation very effective remedy for treating asthma, sinusitis , sneezing, rhinitis, dust and pollen allergy. Aller-G care capsules helps in removing toxins from the system as Haridra (Curcuma longa) is a well known natural anti biotic and anti inflammatory, Neem (Azadirachta indica) is natural blood purifier and anti inflammatory, Shirish (Albezzia lebback) is said to have anti poisonous, anti histaminic properties and mast cell stabilizing effect and Ashwagandha (Withania somnifera) is an immune boosting herb.\n\nThe chief ingredients of this polyherbal formulation are Swarna bhasma, Ropya bhasm, Abhraka Bhasma, Tamra bhasma, Vanga Bhasma, Lauh bhasma, Mandoor bhasam, Kantlauh bahsma, Nag bahsma, Sudh bachnabh bhasma, Mukta bhasma, Ras Sindoor. It is a potent classical herbal remedy which pacifies the vitiated doshas. Lakshmi vilas rasa boost up the devastated status of the respiratory tract and improve the symptoms of rhinitis. promote soothing effects in the throat and sinus. Hence it acts as an antipyretic, anti-inflammatory, antimicrobial herbal remedy.\n\nThis polyherbal formulation is loaded with potent herbs like. Guggul (Commiphora mukul), Haldi (Curcuma longa), Tulsi (Ocimum sanctum), Sonth (Zingiber officinale), Marich (Piper nigrum), Pippali (Piper longum). This formulation is a boon to the patients of cough, cold, rhinitis, obstructed nose, sore throat, allergic rhinitis, and sore throat. The herbs added are anti-inflammatory, antipyretic, analgesic and boost the immunity of the body. It is better to use this formulation of planet ayurveda instead of synthetic drugs so as to avoid the side effects.", "opengraph": {"locale": "en_US", "type": "article", "title": "Ayurvedic Treatment of Whooping Cough - Planet Ayurveda", "description": "Planet Ayurveda offers best combination of effective herbal remedies such as Eosinophilia Care Pack for ayurvedic treatment of whooping cough.", "url": "https://www.planetayurveda.com/whooping-cough/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:modified_time": "2021-12-18T08:19:33+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#introduction", "#remedies", "https://store.planetayurveda.com/products/eosinophilia-care-pack", "https://store.planetayurveda.com/products/eosinophilia-care-pack", "https://store.planetayurveda.com/products/eosinophilia-care-pack"], "authors": [], "publish_date": null}