{"result_id": "371027", "URL": "https://www.planetayurveda.com/library/vaccination-your-lifeline/", "timestamp": "2023-04-25 18:29:07 CEST+0200", "meta": {"description": "Vaccination is a simple safe method of protecting the people against harmful pathogens before they come in contact with the agents.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/vaccination-your-lifeline/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Vaccination Your Lifeline", "cleaned_text": "Prevention is always better than cure, especially for children. While we were all foetuses we were well protected by our mother’s antibodies, which only last for a few months after birth. After this span it starts to wear off and infants are at the risk of infections. So today we will discuss vaccination and its importance.\n\nImmunization is a global development and success story for millions of lives every year. It is a key component of primary health and an indispensable right of a man. Vaccines are also crucial to control and prevent the outbreaks of infectious agents like the very recent COVID 19. At a time when deadly diseases are around the corner, the risk of getting an infection has also shot up. While establishing a good immune base, vaccination is singularly the safest way to safeguard everyone in the community especially our children.\n\nVaccination is a simple safe method of protecting the people against harmful pathogens before they come in contact with the agents. Vaccines trigger and utilise the body’s natural defence system to build resistance against pathogens and retain the immune responses. Just as when we are exposed to the disease, while vaccinating, the body is trained to mimic this action and generate antibodies against the infecting agent. However, as vaccines only contain a small portion of killed or weakened pathogens, be it virus or bacteria, it does not cause the diseases or put you at risk of complications of the disease.\n\nMost vaccines are given as injections while there are a few which are administered orally and by means of nasal sprays. It is important to know that while you are getting vaccinated, you are not protecting yourself alone but also the ones around you. Some seriously ill individuals around you will be contraindicated from being vaccinated, so they depend on others to curb the spread of the disease.\n\nAmong all the other age groups, despite being not very active in the society, the children are always most prone to infections. Young children are exposed to infections from many different places and people, which pops them to serious risk. The WHO recommended vaccination schedule is designed to protect infants and children as early as possible. As their immune system is armature or developing, infants are less capable of fighting the pathogen on their own. Hence it becomes very vital to vaccinate them against these infectious agents at the recommended time.\n\nImmunization helps to prevent a wide variety of diseases in children including Whooping Cough, Tetanus, Measles, Chicken pox, German Measles, Polio, Hepatitis, etc. These diseases when not attended to can become fatal.\n\nThe National immunization programme recommends certain vaccines at certain times. It is always important to keep track of the vaccinations administered to your kid. For reference the schedule is as follows.\n• At birth : Oral Polio Vaccine (OPV), BCG and hepatitis B1 are taken.\n\nThis is the vaccination chart followed across India. As per the new amendment made by the World Health Organisation, if the initial doses of vaccination were skipped at the recommended time, it may be available till the child turns 2 years old. Despite having natural antibodies, pregnant women are also vaccinated to offer extra help. MMR, Tdap and flu vaccine is advised to be taken at pregnancy.\n\nVaccines are one of the most powerful tools in the history of public health. To offer the best protection for your child it is important to vaccinate at the right time without skipping any. According to the age-old science of life, Ayurveda empathises on the importance of optimal immune response or Vyadhi Kshamatva to be able to fight all pathogens. The immunity of the newborns and the infants were never compromised as they were offered oral immune supplements along with maintaining minimal contact with other people. These methods were a part of our lifestyle when vaccination was out of the question.\n\nNow with the opportunity to vaccinate our young ones it further helps to improve Vyadhi Kshmatva and improve the quality of immune response. Often some vaccines do have side effects like soreness at the site of injection to mild fever, but they are totally normal and do not cause other long term systemic disturbances.Babies are born with antibody protection and breastfed babies continue to receive those antibodies, but it is essential to vaccinate to protect our kids in the aftermath.\n\nSO, Immunize to Immunize the country.", "opengraph": {"locale": "en_US", "type": "article", "title": "Vaccination Your Lifeline - Planet Ayurveda", "description": "Vaccination is a simple safe method of protecting the people against harmful pathogens before they come in contact with the agents.", "url": "https://www.planetayurveda.com/library/vaccination-your-lifeline/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2021-06-24T06:21:37+00:00", "article:modified_time": "2021-06-24T06:22:57+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2021-06-24T06:21:37+00:00"}