{"result_id": "371004", "URL": "https://www.planetayurveda.com/library/hbsag-can-be-negative-by-ayurvedic-herbs/", "timestamp": "2023-04-25 18:28:14 CEST+0200", "meta": {"description": "", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/hbsag-can-be-negative-by-ayurvedic-herbs/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "How HBsAg Can Be Negative By Ayurvedic Herbs?", "cleaned_text": "How HBsAg Can Be Negative By Ayurvedic Herbs?\n\nHBsAg is a surface antigen for Hepatitis- B virus. It is also known as Australia antigen. Detection of HBs Ag signifies that you are suffering from Hepatitis-B infection.\n\nViral infections are very common now a days. Hepatitis is also one of them. \"Hepatitis\" comprises of two words \"Hepat\" and \"It is\"- \"Hepat\" stands for Liver and It is stands for inflammation, so Hepatitis stands for inflammation of the liver. It is of 4 types - Hepatitis - A, B, C, D and E. Hepatitis - B is one of them. It is caused due to Hepatitis - B virus and is mainly a liver infection which can cause acute or chronic diseases.\n\nHepatitis - B is a blood-borne infection which mainly spreads through contaminated blood, other body secretions of an infected person, from mother to baby during delivery having unprotected sex with the infected partner, using contaminated needles and syringes. Hepatitis - B is a very contagious and infectious disease because it can spread to a healthy person from an infected person through all the above mentioned modes of transmission.\n\nHepatitis - B virus even survive outside the body of an infected person for about 7 days, during which it can infect healthy persons who have not been vaccinated for the same. It is a life-threatening disease of the liver because it can lead to Liver Cirrhosis and can even cause Liver cancer, if not treated early. Its Incubation period is more than 75 days but the virus can be detected between 30-60 days of infection.\n\nHBsAg is the first marker which is detected in the blood of the patient, even before LFTs (Liver function tests) become abnormal. HBsAg can even be detected prior to development of signs and symptoms of Hepatitis - B infection.\n\nIf you are found positive for HBsAg then it means that you are infected from Hepatitis - B virus and you can infect a healthy person through your blood and other body secretions.\n\nAllopathy approaches the problem through drugs like Antiviral medications and Interferon injections. These drugs if used for a prolonged period of time, can prove very dangerous for that person. In Allopathy, there is no cure for it only short term relief is seen. It can only reduce the viral load but can damage your Liver. Liver transplant is the last option in allopathy if no medicine works. Vaccine for Hepatitis - B can prevent the Hepatitis - B but once you are infected then there is no cure for it in allopathy. These allopathic medicines will ultimately damage your Liver, leading to liver Cirrhosis, Liver Cancer and can ultimately prove fatal. Side effects of allopathic medicines used for Hepatitis - B treatment can be -\n• It can damage your Liver, if used for prolonged period of time and Liver transplant remains the last option.\n• Antiviral medications are given for Hepatitis - B, which may not work for everyone\n• You will have to take these allopathic medicines for a very long time, which will result in liver damage.\n• If you have had an organ transplant in the past, then you will not be able to take these allopathic medicines.\n• Allopathic medicines are only prescribed if your liver is damaged and your Hepatitis - B, and Liver enzymes are raised for at least 6 months.\n• Some antiviral medicines can make you very sick and can cause long term side effects if you are taking them on aregular basis.\n• Antiviral medicines can result in Cirrhosis of the liver which can result in various complications.\n\nAccording to Ayurveda when animbalance occurs between 3 energies - Vata, Pitta and Kapha, the disease occurs. In Ayurveda Hepatitis - B comes under \"Yakrit Roga\". \"Yakrit\" means Liver and \"Roga\" means disease. In Hepatitis - B, all the three doshas - Vata, Pitta, and Kapha, are disturbed but mainly Pitta dosha is aggravated.\n\nPlanet Ayurveda offers best herbal medicine for Hepatitis-B infection, known as Liver Care Pack. All these medicines are natural, pure and are vegetarian. They are free from any side effect and can be used safely for prolonged period of time. Liver Care Pack contains -\n\nThese capsules inactivate the Enzyme Reverse Transcriptase and inhibit the multiplication of Hepatitis - B, Herpes and Influenza virus. They have antiretroviral activity and helps in decreasing the growth of Hepatitis - B virus and further liver damage.\n\nDosage -2 capsules twice daily after meals with plain water.\n\nThis churna is a combination of wonderful herbs which are beneficial in treating Jaundice, Fatty liver, Liver Cirrhosis, and damage due to alcohol. They remove toxins from the liver and enhances bile juices formation.\n\nDosage - Add 1 teaspoonful powder in 400 ml water, Boil until it remains 50 ml. Strain it and drink it, leave the residue. Do it twice daily. Prepare fresh every time.\n\nThese capsules are antiviral in nature thus helps in thenormal functioning of the liver and inhibits the multiplication of thevirus. They are very beneficial in chronic liver infections, hepatitis, jaundice, and liver cirrhosis.\n\nThey mainly control the chronic liver inflammation caused due to Hepatitis - B virus. These capsules keep the Liver fit, improve skin texture, and remove toxins from the body, control blood sugar and cholesterol (LDL) levels. They also help in maintaining the proper levels of Bile juices and hormones.\n\nDosage -2 capsules twice daily after meals with plain water.\n\nThe Reference about this Herb is found in our Classics which is as follows -\n\nMeaning - Bhumi Amla is a synonym for Phyllanthusniruri. Its potency is cold and is sweet, bitter, and astringent in taste. It is used in cough, cold, polydipsia (excessive thirst), increases Vatadoshas (air) and digestive disorders. It is used in Kapha (congestion, bronchitis), itching, healing injuries, and blood disorders.", "opengraph": {"locale": "en_US", "type": "article", "title": "How HBsAg Can Be Negative By Ayurvedic Herbs? - Planet Ayurveda", "description": "Dr. Meenakshi ChauhanMD (ALT. MEDICINE) View Profile", "url": "https://www.planetayurveda.com/library/hbsag-can-be-negative-by-ayurvedic-herbs/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2019-08-06T09:52:06+00:00", "article:modified_time": "2022-06-24T05:58:21+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.planetayurveda.com/ayurvedic-treatment-for-liver-diseases/", "https://www.planetayurveda.com/ayurvedic-treatment-for-liver-diseases/", "https://store.planetayurveda.com/products/liver-care-pack", "https://store.planetayurveda.com/products/liver-care-pack", "https://www.planetayurveda.com/library/jaundice/", "https://www.planetayurveda.com/liver-cirrhosis-treatment/"], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2019-08-06T09:52:06+00:00"}