{"result_id": "371036", "URL": "https://store.planetayurveda.com/products/itp-care-pack-adults", "timestamp": "2023-04-25 18:29:27 CEST+0200", "meta": {"description": "Planet Ayurveda offers best combination of effective herbal remedies such as ITP Care Pack for ayurvedic treatment of Immune Thrombocytopenic Purpura (ITP).", "lang": "en", "keywords": "", "favicon": "//cdn.shopify.com/s/files/1/0126/4277/9200/t/4/assets/favicon.ico?v=183258124557545815581545394286", "canonical": "https://store.planetayurveda.com/products/itp-care-pack-adults", "encoding": "utf-8"}, "image": null, "domain": "store.planetayurveda.com", "title": "ITP CARE PACK (FOR ADULTS) [ID-160]", "cleaned_text": "\n• All herbs have distinct explanation in ancient Ayurvedic literature.\n\nPlanet Ayurveda Immune booster capsules are purely herbal. This herbal dietary supplement is manufactured from the pure and standardized extract of herbs named as bhumi amla (Phyllanthus niruri), grape seed (Vitis vinifera), Amalaki (Emblica officinalis), and cow colostrum (Bovine colostrums). It helps in promoting and maintaining a healthy digestive system, immune system, respiratory system, hepatobiliary system along with this, maintain the healthy skin of individuals and does not cause any kind of side-effects on usage.\n\nAshwagandha (Withania somnifera) is the widely used herb in the Ayurveda as its roots have multiple actions and properties. Planet Ayurveda's ashwagandha capsules contain good quality and standardized extract of single herb ashwagandha. It is the best herb to balance Vata dosha in the body, it also pacifies Kapha dosha and maintains balance in tridoshas. This product helps to support the nervous system, reproductive system, and endocrine system.\n\nGiloy or Guduchi (Tinospora cordifolia) is the herb that helps in pacifying and balancing all three doshas of the body. Giloy capsules manufactured by planet Ayurveda consists of an extract of single herb giloy in a pure and standardized form. These capsules promote healthy functioning of the blood-vascular system, immune system, digestive system, and nervous system. It is free from artificial colors, preservatives, and starch.\n\nGandhak rasayan tablets are manufactured in the Planet Ayurveda house. It is prepared by using pure, safe and standardized quality of shuddh gandhak (purified sulfur). It works by balancing Vata, Pitta and Kapha doshas (body energies). It helps to maintain the skin and blood vascular system healthy.\n\nPlanet Ayurveda has manufactured green essentials capsules by using green herbs of different properties which are enriched with nutrients that together in combination fulfill the daily requirements of the body. This product is manufactured from pure and high-quality herbs- green tea (Camellia sinensis), Wheatgrass (Triticum aestivum), Amla (Emblica officinalis), grape seed (Vitis vinifera) and spirulina (Spirulina platensis). It helps in supporting the healthy body and mind of all aged people.\n\nKumar Kalyan ras is the classical ayurvedic formulation to be used only to be used in kumaras (children). It is manufactured from herbs and different types of minerals or their ashes. Planet Ayurveda's Kumar Kalyan ras is manufactured by using good, safe, pure quality ingredients in pills form. It contains shuddha parad (purified mercury), loha bhasama (iron ash), makshika bhasama (ash of copper-iron pyrite), abhrak bhasma (processed and purified mica), Swarna bhasma (ash of gold), Mukta bhasma (ash of pearl) and ghritkumari rasa (extract of aloe vera juice). It helps to support and promote the healthy functioning of the cardiovascular system of children. It does not contain any starch, chemicals, artificial colors, preservatives.\n\nBrahmi (Bacopa monnieri) is a potent herb and is widely used In ayurvedic formulation related to nervous system conditions from ancient times. Planet Ayurveda's Brahmi chyawanprash is the poly herbo-mineral formulation in the form of avleha (jam form). It is formulated from 28 unique ingredients of standardized quality having various actions on our body. This product maintains equilibrium in tridoshas and helps to maintain healthy functions of the nervous system and immune system. It supports almost all systems of the body. It is a purely natural product and does not contain binders, preservatives, additives, yeast, and fillers in it.\n\nSuvarna basant malti ras manufactured by Planet Ayurveda is a classical ayurvedic herbo-mineral formulation. This formulation is manufactured by using all ingredients of high quality and standards extracts. It contains – Marich (Piper nigrum), kharpara bhasma (calamine in an incinerated form), shudha hingula (cinnabar in a purified form), Swarna bhasma (gold in an incinerated form), Mukta bhasma and nimbu swarsa (lemon juice) as bhavna dravya. This formulation effects Vata and Kapha doshas by pacifying them. It is called Rasayana in Ayurveda and helps to maintain healthy functions of the respiratory system and immune system.", "opengraph": {"type": "product", "title": "ITP CARE PACK (FOR ADULTS) [ID-160]", "image": "http://cdn.shopify.com/s/files/1/0126/4277/9200/products/itp-care-pack-for-adults_grande.jpg?v=1639985432", "image:secure_url": "https://cdn.shopify.com/s/files/1/0126/4277/9200/products/itp-care-pack-for-adults_grande.jpg?v=1639985432", "price:amount": "20,170.00", "price:currency": "INR", "description": "Planet Ayurveda offers best combination of effective herbal remedies such as ITP Care Pack for ayurvedic treatment of Immune Thrombocytopenic Purpura (ITP).", "url": "https://store.planetayurveda.com/products/itp-care-pack-adults", "site_name": "store.planetayurveda.com"}, "tags": [], "tweets": [], "movies": [], "links": [], "authors": [], "publish_date": null}