{"result_id": "371011", "URL": "https://www.planetayurveda.com/library/monkeypox-virus/", "timestamp": "2023-04-25 18:28:30 CEST+0200", "meta": {"description": "Monkeypox is an infectious condition caused by the monkeypox virus. In this article, we are going to discuss why monkeypox is trending and what medical advice people should follow, and along with this we also describe some ayurvedic remedies that are helpful in the monkeypox virus.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/monkeypox-virus/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Monkeypox", "cleaned_text": "Why is Monkeypox Trending? What is it & What Medical advice People should follow?\n\nAfter the coronavirus pandemic, the world health organization declared Monkeypox a global health emergency. It could again affect many people worldwide. In this article, we are going to discuss why monkeypox is trending and what medical advice people should follow, and along with this we also describe some ayurvedic remedies that are helpful in the monkeypox virus.\n\nMonkeypox is an infectious condition caused by the monkeypox virus. Monkeypox virus belongs to the same family as the Variola virus that causes the smallpox virus. Monkeypox virus symptoms are very similar to smallpox symptoms but the symptoms of monkeypox virus are more severe than the smallpox virus. Let's discuss!\n\nAyurvedic management depends on the pacification of the vitiated dosha and cleansing of the blood from the toxins produced by the infective organism. Furthermore, the condition is also managed by boosting immunity and other herbs which possess a number of properties that are against the factors which cause the illness.\n• Giloy decoction is of much help in the Monkeypox virus as it increases immunity and reduces fever.\n• Tulsi leaves can be boiled in the tea before consumption. Tulsi also reduces fever and acts as an antimicrobial agent.\n• Turmeric powder can be mixed in the milk before consumption as it fights the microbes in the body.\n\nPlanet Ayurveda is an esteemed GMP certified, ISO 9001:2015 certified, and US-FDA registered Ayurvedic Company, which sticks to the objective of producing quality Ayurvedic products as described in a number of ancient texts of Ayurveda. Planet Ayurveda has worldwide branches. Products are manufactured without additives and preservatives and other kinds of chemicals or artificial flavor enhancers which can cause a number of side effects on the human body. Products manufactured at Planet Ayurveda are pure and devoid of any kind of adulteration. The products are purely organic and vegetarian and gluten-free. Planet Ayurveda has manufactured some good products that can surely be of great help in managing the ongoing spread of the Monkeypox virus. Following is the product list of Planet Ayurveda which possesses enough strength to fight this monkeypox virus :\n• Curcumin Capsule: 1 capsule twice a day with plain water after meals.\n• Septrin Tablet: 1 tablet twice a day with plain water after meals.\n• Gandhak Rasayan: 1 tablet twice a day with lukewarm water after meals. Curcumin Capsules are filled with the standardized extract of haridra (Curcuma longa). Haridra possesses anti-inflammatory, analgesic, antimicrobial, and antiseptic properties which makes it an amazing herbal formulation to be used extensively in the Monkeypox condition. It kills the toxins produced by the virus. It reduces fever and soothes rashes or blisters. It also relieves symptoms related to the respiratory system. Septrin is composed of herbs including Haldi (Curcuma longa), pippali (Piper longum), Sonth (Zingiber officinale), Marich (Piper nigrum), tulsi (Ocimum sanctum), and guggul (Commiphora Mukul). The Septrin Tablets are used in a number of infectious conditions caused by a number of microbes including bacteria, virus, protozoa, fungi, etc. it possesses analgesic and antipyretic properties. Therefore it makes the fever go down and pain is alleviated. With all these properties Septrin tablets are best used in Monkeypox virus illness. Maha Sudarshan Kwath is a classical ayurvedic formulation that is composed of the goodness of the herbs namely haritaki (Terminalia chebula), amla (Emblica Officinalis), bibhitaki (Terminalia Billerica), Haldi (Curcuma longa), kachoor (Curcuma eodaria), sonth (Zingiber officinale), pippali (Piper longum), giloy (Tinospora cordifolia), kutki (Picrorhiza kurroa), pitta papada (Fumaria parviflora), Sugandhbala (Valeriana wallichii), ajwain (Trachyspermum Ammi), Vacha (Acorus calamus), vanshlochan (Bambusa arundinacea), etc. The Ayurvedic formulation is used in influenza-like infections and fever. Further, it enhances immunity and is thus beneficial in fighting infections. It improves the overall wellness of a person. It is of great help in the Monkeypox virus condition. Gandhak Rasayan is a formulation in tablet form and contains shuddha gandhak (purified sulfur). Gandhak Rasyan benefits the body in a number of ways. It reduces fever, treats skin conditions such as rashes and blisters, and acts as a potent antimicrobial, antiviral, antibacterial, anti-inflammatory, anthelmintic, antioxidant, and antipyretic agent. With all these properties Gandhak Rasayan is beneficial for the Monkeypox virus as it reduces inflammation, manages rashes, fights viruses, and improves overall wellness.\n\nMonkeypox is spreading its notorious infestation every day around the globe. It is a matter of concern for all the countries as the economies of different nations are still recovering from the damage caused by the coronavirus. And another virus is again knocking on the door. So it is the duty of the people to take preventive measures to stop the spread of the monkeypox virus and help the needy while protecting themselves. As we heard in our lifetime ‘prevention is better than cure, so this is the time we take preventive steps to check the spread of the monkeypox virus. With proper preventive measures, we all together can decelerate the viral spread of monkeypox. As we have learned about the monkeypox virus and how it spreads, therefore, we do know how to stop its transmission with adequate steps. The smallpox vaccine is a useful protective armor against the monkeypox virus. And we have discussed what herbal management is available for the monkeypox virus. So let’s choose the herbal way to defend ourselves and fight the ill and hurtful intentions of the monkeypox virus. Be Safe By Taking Preventive Measures Strictly!!!", "opengraph": {"locale": "en_US", "type": "article", "title": "Monkeypox - Planet Ayurveda", "description": "Monkeypox is an infectious condition caused by the monkeypox virus. In this article, we are going to discuss why monkeypox is trending and what medical advice people should follow, and along with this we also describe some ayurvedic remedies that are helpful in the monkeypox virus.", "url": "https://www.planetayurveda.com/library/monkeypox-virus/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2022-10-11T09:00:05+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://store.planetayurveda.com/", "https://store.planetayurveda.com/"], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2022-10-11T09:00:05+00:00"}