{"result_id": "371038", "URL": "https://www.planetayurveda.com/herbal-remedies-for-dengue/", "timestamp": "2023-04-25 18:29:30 CEST+0200", "meta": {"description": "Dengue fever caused by dengue virus. Herbal remedies very effective in dengue fever. They give relief from various symptoms associated with dengue naturally.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/herbal-remedies-for-dengue/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "HERBAL REMEDIES FOR DENGUE", "cleaned_text": "How can one make their life delightful and Healthy? In today's life unhealthy lifestyle has major role in ruining once lives. To keep healthy only one agenda is there and that is eat what you do not want, drink what you do not like, and do what you do not do, because prevention is better than cure and this tag is well suited in case of dengue fever. It is a fetal disease which cause severe fever and weakens immunity. 50 to 500 million people around the world that suffer from this ailment every year. There is no vaccination for it but the nature has fruitful bag of herbs that can effectively help to cure the problem of dengue. So the nature provides the best herbal remedies for dengue.\n\nHow much we know About Dengue?\n\nDengue fever is a flu illness, which spreads through a mosquito bite, known as Aedes mosquito. This dengue fever spreads via various kinds of one virus genus but the main kind through which dengue fever arise is DENV-1 type. These viruses consists of RNA virus line. This fever is known as break bone fever.\n\nIt is in four to seven days, in which virus express its effect in human body. Then this effect lasts for about four to ten days.\n\nThere are some warning signs through which one can guess the possibility of dengue virus presence.\n\nWhat is the Major Indication for Dengue Fever?\n\nA big drop in platelet numbers are the major indication, as its normal range is from 150,000 to 450,000. Decrease from 150,000 value is the recognizing symptom of dengue fever.\n\nHow this Dengue Reach and Proliferate a Human Body?\n\nWhen a mosquito carrying dengue virus bites a person, the virus enters the skin through mosquito's saliva. It binds to white blood cells and reproduces. The WBCs in response produce watchable symptoms like fever, severe pains and other symptoms. This can be cured with the help of natural herbal remedies.\n\nAyurveda and its View Point for Dengue\n\nThe term Ayurveda is taken from the Sanskrit words \"Ayur\", meaning \"life or lifespan\", and \"Veda\", meaning \"knowledge\". Basic principle of Ayurveda is to prevent and treat illness by maintaining balance in the body, mind, and consciousness through proper drinking, diet, and lifestyle. The nature is determined by the vital balance of the three physical energies - Vata, Pitta and Kapha. Any imbalance in these energies or the tridoshas leads to a disease.\n\nThe herbal remedies work very well to balance the dosha leading to dengue. In Ayurveda, dengue is known as dandaka jvara. Ayurveda put stress to strengthen the immunity and lowers the effect of Dengue Fever.\n\nPlanet Ayurveda recommends the following herbal remedies for the Treatment of Dengue. These herbal remedies are the best way to treat dengue & its associated symptoms.\n\nThese capsules are prepared from pure extract of Giloy (Tinospora cordifolia) herb. It carries anti-inflammatory and anti-pyretic properties hence helps to manage dengue disease. Giloy capsules treat fever & builds natural immunity in body to fight against infection.\n\nDose - 2 capsules twice daily with plain water after meals.\n\nIt is prepared from 100% natural wheatgrass (Triticum aestivum). This contains over 90% minerals, including high concentrations of the most alkaline minerals (potassium, calcium, and magnesium and sodium). Wheat Grass Powder is a great herbal remedy for Dengue as it builds up immunity that deals with related symptoms.\n\nDose - Mix 1 teaspoonful of this powder mixed in a glass of water to be taken twice or thrice daily.\n\nSpirulina is one of the most powerful antioxidant, and richest source of protein. It is the one of nature's richest source of vitamins, iron, protein, carbohydrates, micronutrients and beta carotene. The capsules prepared are totally organic and have great effect in dengue fever.\n\nDose - 2 capsules twice daily with plain water after meals.\n\nRegular Use of Amla Saar improves immunity, fight cancers, and rejuvenates the body. Amla Saar is very effective in treatment of Dengue and other diseases also. This is prepared from Amla (Emblica officinalis) herb.\n\nDose - 20 ml twice daily with equal amount of water.\n• Eating green leafy vegetables can provide the essential vitamins and minerals that can ward off the infection.\n• Chewing two cloves of garlic or drinking hot garlic vegetable soup can decrease the multiplication of viruses. It is good herbal remedy for Dengue.\n• To maintain the water and electrolyte balance of the body, oral rehydration solution should be given. This also helps in flushing out the viruses through the fluids excreted by the body---- One of the best herbal remedy for Dengue.\n• Eating red rice can quicken the healing process in dengue.\n• Drinking hot soups and herbal teas can generate heat in the body and prevent chills.\n• Roots of Amaltas herb or leaves of Coriander can be used as a tonic for reducing the fever.\n• Consuming fenugreek leaves (methi) or basil leaves (tulsi) can soothe and cleanse the system and also eases the symptoms.\n• Orange juice, Amla juice or Amla and Grape fruit can promote antibody production. Vitamin C present in these fruits can aid in preventing dengue hemorrhagic fever.\n• Caffeine and alcohol, known for their diuretic properties, are best avoided to prevent dehydration.\n• Avoiding junk food with empty calories, sugar products and fried food is must.\n• Squeeze and pound two pieces of raw papaya leaves with a filter clothes. Do not boil, cook it with hot water. A patient could take two tablespoon per serving daily. This will help to control dengue fever.\n• Neem leaves, Neem oil are a great purifying agent. Neem powder should be used in dosages of between 5 to 6 grams 2-3 times daily.\n• Chyavanprash can be taken as it is an immuno-booster, blood purifier and increases blood count.\n• Boiled basil leaves (tulsi) served in a warm drink like tea can prevent an outbreak of dengue. This is one another natural remedy for Dengue.\n• 10-15 Basil leaves should be chewed twice a day or these can be boiled in 200ml water on low heat. When half the quantity is left it can be taken 2-3 times a day. This strengthens the body's defence mechanism.\n• Use basil leaf 10 pieces and one black pepper. This should be the proportion. Grind it and make pea size pills, use it with warm water twice daily.\n• To increase the blood count pomegranate juice/black grape juice should be given.", "opengraph": {"locale": "en_US", "type": "article", "title": "HERBAL REMEDIES FOR DENGUE - Planet Ayurveda", "description": "Dengue fever caused by dengue virus. Herbal remedies very effective in dengue fever. They give relief from various symptoms associated with dengue naturally.", "url": "https://www.planetayurveda.com/herbal-remedies-for-dengue/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:modified_time": "2021-11-12T07:40:05+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#introduction", "#remedies", "#home", "https://www.planetayurveda.com/common-fever.htm", "https://store.planetayurveda.com/products/giloy-capsules", "https://store.planetayurveda.com/products/giloy-capsules", "https://store.planetayurveda.com/products/giloy-capsules", "https://store.planetayurveda.com/products/wheat-grass-powder", "https://store.planetayurveda.com/products/wheat-grass-powder", "https://store.planetayurveda.com/products/wheat-grass-powder", "https://store.planetayurveda.com/products/spirulina-capsules", "https://store.planetayurveda.com/products/spirulina-capsules", "https://store.planetayurveda.com/products/spirulina-capsules", "https://store.planetayurveda.com/products/amla-saar", "https://store.planetayurveda.com/products/amla-saar", "https://store.planetayurveda.com/products/amla-saar", "https://store.planetayurveda.com/products/neem-capsules", "https://www.planetayurveda.com/natural-blood-builder-and-blood-purifier.htm"], "authors": [], "publish_date": null}