{"result_id": "371018", "URL": "https://www.planetayurveda.com/what-is-curcumin/", "timestamp": "2023-04-25 18:28:46 CEST+0200", "meta": {"description": "Planet Ayurveda offers best quality Curcumin Capsules for your healthy body. Here we are going to explain about Uses, Benefits and Dosage of Curcumin Capsules.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/what-is-curcumin/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "CURCUMIN CAPSULES", "cleaned_text": "\n• Balance all the three doshas or physical energies (Vata, Pitta and Kapha) in body\n• Absolutely free from chemicals, additives, extra colors, fillers and yeast etc.\n\nIngredients - Curcumin Capsules of Planet Ayurveda are packed with standardized extract of Curcumin, a principal compound of turmeric.\n\nDosage - 1 to 2 capsules twice daily after half an hour of meal with plain water.\n\nWhat do You Understand by Curcumin?\n\nCurcumin is principal active compound present in turmeric. Turmeric is common house hold spice in Indian kitchens. Turmeric is yellowish in color which is due to presence of Curcumin. Curcumin is a diarylheptanoid which helps to maintain healthy cells, tissue and immune system. Curcumin supports healthy blood circulation so maintains healthy skin.\n\nWhat do You Understand by Allergy?\n\nAllergy is defined as the hyper sensitivity of the body to the external stimulus. The stimulus may be pollen allergy, asthma, allergic rhinitis and hay fever.\n\nAyurveda states that any disturbance in the levels of the tri-energies or also known as physical energies, i.e., Vata, Pitta and Kapha gives rise to allergic reactions. Pitta allergy takes place because of swollen sinus. Vata allergy takes place because of excessive dryness. Congestion leads to Kapha allergies.\n\nAllergies result in Hay Fever, Asthma, Allergic Rhinitis, Allergic Sinusitis, Chronic Cough and Pollen Grain Allergic Reaction etc.\n\nOur immune system is a complex system that defends the body against foreign particles or invaders like bacteria or virus.\n\nImmune system or called defense mechanism produces antibodies which help us to protect from various kind of infections. When we talk about allergies, our immune system reacts to allergens (foreign particles which produce allergic reactions) and itself causes inflammation of airways or skin as antibody identify particular allergen as harmful which is not so. IgE is the allergic antibody.\n\nSymptoms of allergy varies as per the type of allergy and also varies from minor to severe.\n\nIs there any Herbal Remedy for Allergy?\n\nIf you search over net for herbal remedies for allergy, you may get plenty of those for the same. Always look for natural products which contain pure extracts and are formulated under GMP guidelines. Also it is advised to consult any Ayurveda expert when you think to go for ayurvedic treatment so that you can be guided for right dose and vehicle.\n\nThough diet recommendations depends upon the type of allergy but here are general dietary guidelines:-\n• Avoid food products like dairy products, greasy foods, nuts and meat, sour fruits and yogurt.\n• Light and fat free diet should be followed.\n• Fresh and hot homemade food is an ideal option.\n• Pulses and cereals can be consumed by the patients.\n• Avoid the consumption of rice and eat lots of vegetables.\n• Broccoli, peas, cauliflower, French beans and carrots should be included in the diet.", "opengraph": {"locale": "en_US", "type": "article", "title": "CURCUMIN CAPSULES - Planet Ayurveda", "description": "Planet Ayurveda offers best quality Curcumin Capsules for your healthy body. Here we are going to explain about Uses, Benefits and Dosage of Curcumin Capsules.", "url": "https://www.planetayurveda.com/what-is-curcumin/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:modified_time": "2019-04-09T05:41:50+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://store.planetayurveda.com/products/curcumin-capsules", "https://store.planetayurveda.com/products/curcumin-capsules", "https://store.planetayurveda.com/products/curcumin-capsules"], "authors": [], "publish_date": null}