{"result_id": "371013", "URL": "https://www.planetayurveda.com/library/hepatitis/", "timestamp": "2023-04-25 18:28:35 CEST+0200", "meta": {"description": "Planet Ayurveda provides best combination of effective herbal remedies such as Liver Care Pack for natural treatment of hepatitis a, b, c, d and e.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/hepatitis/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Hepatitis", "cleaned_text": "Hepatitis is the inflammation of the liver. The main function of the liver is to filter toxins and chemicals from the blood. It converts the proteins and sugar into the useful substances, stores them and release them whenever, the body requires. It is most commonly caused due to the group of viruses that attack the liver.\n\nIt is a mild form of acute hepatitis. It is caused by the HAV and spread through the contaminated food and water. Anal-oral contact during sex can also be the cause. In rare cases, it can cause acute liver failure.\n\nSign and symptoms of the Hepatitis A are as follows:\n\nIt is a form of hepatitis that often starts with acute illness but may become chronic. This is a sexually transmitted disease. This is caused by the HBV and spread through infected blood, semen and fluids. The Person will get infection by using unsterilized syringe or may be while getting tattoo or sharing the personal items like toothbrush or razor.\n\nSigns and symptoms of the hepatitis B are as follows:-\n\nSymptoms become mild to severe in Hepatitis B.\n\nIt is a form of hepatitis that causes 20-30 percent acute illness and 70-80 percent chronic illness. It is usually spread through direct contact with the blood of a person who has a disease. It usually causes no symptoms until the later course of the chronic infection.\n\nSign and symptoms are as follows:\n\nIt is a less common form of hepatitis. The infection is caused due to HDV. The infection is spread through contact with infected blood, unprotected sex and needles.\n\nIt is also less common. The infection is caused by the HEV or through oral-anal sex.\n• Patient should take plenty of water\n• Patient should not get dehydrated\n• Patient should have balanced and healthy diet\n• If Patients appetite is poor, then they should have high fiber diet.\n• Most people diagnosed with hepatitis A, is cured within two or six months.\n• Some people with hepatitis B develop to chronic hepatitis. The risk ranges from about 90% in infants to 6-10% in adults.\n• About 15-20% people with hepatitis B can lead to chronic hepatitis.\n• About 75-80% people with hepatitis C can lead to chronic hepatitis.\n• People with hepatitis C are at high risk for serious illness than the sufferer with hepatitis B, hepatitis C.\n\nPlanet Ayurveda provides best combination of effective herbal remedies such as Liver Care Pack for natural treatment of hepatitis a, b, c, d and e. These herbal remedies are prepared from using best quality herbs and strictly follow the principles of Ayurveda. All these herbal remedies of Planet Ayurveda are 100 percent pure, natural and vegetarian. These are free from chemicals, additives and preservatives. These are safe to use as these are free from side effects.\n• Indian Echinacea - 2 capsule twice daily after meals with warm water.\n• Yakrit Plihantak Churna - You can boil the powder 1 teaspoonful in 400 ml water, keep it boiling until it remains 50 ml. Strain it and drink the water. Leave the residue. Do it twice daily. Make fresh every time.\n• Phyllanthus Niruri - 2 capsule twice daily after meals with warm water.\n• Liver Detox Capsules - 2 twice daily after meals with warm water.\n\nIt is another wonderful herb from the house of Planet Ayurveda for the hepatitis. It is the pure extract of Echinacea (Andrographis paniculata).\n\nThis herbal remedy helps to improve the immune system. It also helps to stimulate the enzymes which are responsible in secretion of the toxins from the body. It acts as a natural anti-biotic and anti-inflammatory. It helps in the proper circulation of the blood. It helps to prevent the cancer and auto-immune disease.\n\nIt is a blend of various herbs Bhumi Amla (Phyllanthus niruri), Kalmegh (Andrograhis paniculata), Bhringraj (Eclipta alba), Sharpunkha (Tephrosia purpurea), Kaasni (Cichorium intybus), Katuki (Picrorrhiza kurrao), Makoy (Solanum indicum) and Punarnava (Boerhavia diffusa).\n\nThis herbal formulation helps the liver in clearing away the toxins from the body. These remove excess fat from the liver and helps in the regeneration of the damaged liver cells. These herbs also help to increase the bile production and excretion. These also help to regenerate liver cells and are useful in liver enlargement and inflammation. This herbal formulation is the best remedy for all liver problems.\n\nIt is the pure extract of the herb Bhumi amla (Phyllanthus niruri). It is commonly name as Niruri.\n\nThis herb is used to treat the liver disorders, mainly for hepatitis A. It is also useful to cure the kidney disease as it acts as a diuretic. The herb has an analgesic, anti-spasmodic and anti-bacterial property. It helps to relieve the inflammation also.\n\nThis herbal formulation consists of katuki (Picorrhiza kurrao), Punaranava (Boerrhavia diffusa), Kalmegh (Andrographis paniculata), Makoy (Solanum nigrum), Kasni (Cichorium intybus), Biranjasipha (Achillea millefolium), Jhavuka (Tamarix gallica), Himsra (Capparis spinosa) and Haritaki (Terminalis chebula).\n\nIt is a great combination to clean and strengthen the most important organ of the body -\"Liver\". The formulation has herbs for liver detoxification, which helps to revive the liver cells and give new strength to the body. These herbs have a wonderful action on the hepatitis.\n\nImmunizations of children (1-18 years) consist of two or three doses of the vaccine. In adult's case, Adult needs booster dose six to 12 months following the first dose. The vaccine is effective for 15-20 years or more.\n\nVaccine recommends also available for hepatitis B .Prevention recommends to the all newborns and adults also. Three injections over a period of six to 12 months which provide full protection against the disease.\n• In general, one should wash hands properly after going to bathroom.\n• Use latex condoms, which may lower the risk of transmission.\n• One should avoid sharing the same drug needles.\n• One should avoid sharing the personal things with the infected person.\n• One should avoid tap water for drinking while travelling.", "opengraph": {"locale": "en_US", "type": "article", "title": "Hepatitis - Planet Ayurveda", "description": "Planet Ayurveda provides best combination of effective herbal remedies such as Liver Care Pack for natural treatment of hepatitis a, b, c, d and e.", "url": "https://www.planetayurveda.com/library/hepatitis/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2019-05-09T12:15:25+00:00", "article:modified_time": "2021-12-24T10:16:46+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#introduction", "#remedies", "https://store.planetayurveda.com/products/liver-care-pack", "https://store.planetayurveda.com/products/liver-care-pack", "https://store.planetayurveda.com/products/liver-care-pack"], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2019-05-09T12:15:25+00:00"}