{"result_id": "371008", "URL": "https://www.planetayurveda.com/library/chickenpox/", "timestamp": "2023-04-25 18:28:23 CEST+0200", "meta": {"description": "Varicella is a viral infection. Chickenpox caused by varicella-zoster virus. Learn more about Chickenpox causes, Symptoms, Remedies and Ayurvedic Treatment", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/chickenpox/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Chickenpox", "cleaned_text": "Chickenpox with another name, Varicella is a viral infection. Chickenpox is caused by varicella-zoster virus. A person hasn't been infected or vaccinated can get the disease. It's highly contagious but generally a non-serious and self-limiting infection, but it can be serious in case of babies, adults and people with weak immune system.\n\nChickenpox affects more commonly children between 5-10 years of age. This disease is characterized by itchy skin rash. It usually start appearing first on the chest, back and face then spreads to the rest of the body causing between 250 and 500 itchy blisters.\n\nChicken Pox in Ayurveda is known by name of \"Laghu Masurika\".\n• Causative factor for Chickenpox infection is varicella-zoster virus (VZV). The virus usually incubates for 14 to 16 days before a rash appears, although incubation can last from 10 days to 21 days.\n• VZV is communicable through direct skin-to-skin contact and via respiratory droplets (through coughing, sneezing) from the infected person.\n• Person suffering from chickenpox remain contagious until all the blisters get dried and scabs have formed.\n\nAyurveda explains the cause of most skin rashes because of unbalanced Vata and Kapha which could happen due to faulty food habits as well as wrong lifestyle. Other factors like mental stress, anxiety & tension also take a toll on the body, especially the skin.\n\nCharacteristic symptoms of chickenpox is red or pink rash that gets turned into itchy, fluid-filled blisters that eventually turn into scabs.\n\nThe rash may first appear on the face, chest and back then spreading to the rest of the body, which includes inside the mouth, eyelids or genital area. Usually all the blisters get converted to scabs about in one week.\n\nOther typical symptoms appearing 1-2 days before rashes come into notification and that includes:\n\nWomen if, exposed during pregnancy may bear children with birth defects including poor growth, small head size, intellectual disabilities and eye problems.\n\nAnyone who got infected with chickenpox in the past may develop shingles which is a delayed complication of Chickenpox. Shingles appearance is due to infection of a nerve and the area of skin supplied by the nerve. It causes a rash and pain in a local band-like area along the affected nerve. Chickenpox affects about 1 in 5 people at some time in their lives. It can occur at any age, but it is most commonly in people over the age of 50.\n\nThe reason why shingles may occur is because the virus does not go completely after you have chickenpox.\n\nWho are at Risk to get infected by Chickenpox?\n• Fetus of non-immune pregnant women infected with VZV between weeks eight and 20 of their pregnancy or during the final two weeks of the pregnancy.\n• Compromised immunity due any disease or medication in an individual.\n\nIn Ayurveda chickenpox is known by name of \"Laghu Masurika\". Mainly pitta dosha is involved in it along with vata and kapha dosha. Planet Ayurveda provides best combination of effective herbal remedies such as Skin Care Pack for Ayurvedic treatment of Chickenpox. These herbal remedies are prepared from using best quality herbs and strictly follow the principles of Ayurveda. All these herbal remedies of Planet Ayurveda are 100 percent pure, natural and vegetarian. These are free from chemicals, additives and preservatives. These are safe to use as these are free from side effects.\n• Neem Capsules - 1 capsule twice daily, with plain water after meals.\n• Radiant Skin Hair Nails Formula - 1 capsule twice daily, with plain water after meals.\n• Gandhak Rasayan - 2 tablets twice daily, with plain water after meals.\n• Manjishtha Capsules - 1 capsule twice daily, with plain water after meals.\n\nStandardized extract of Neem (Azadirachta indica) is used to prepare Neem capsules that possess all the medicinal properties of neem. These capsules help to treat any kind of skin ailment like psoriasis, eczema, ringworm and other infectious and non-infectious skin diseases. These capsules are full of medicinal properties just like the herb neem, possesses anti-inflammatory, antibacterial, antimicrobial, antioxidant and detoxifying properties.\n\nAs the name suggests these herbal capsules help to maintain the health of the skin and help to treat ailments like psoriasis, eczema, lichen planus, scabies etc. It helps in maintaining the elasticity, smoothness and firmness of the skin. Strength of hair and nails is also improved by these herbal capsules.\n\nThese herbal tablets help in maintaining the moisturized skin and remove the dead skin cells. Purified sulphur (shuddh gandhak) is used to prepare these herbal tablets. Gandhak rasayan tablets have the property of drawing the moisture from the surrounding atmosphere into the skin, hence preventing dryness. It also helps to treat many skin ailments like acne, leprosy, ringworm, scabies etc.\n\nRubia cordifolia (Manjistha) is the herb used in standardized form to prepare these herbal capsules. It possesses numerous medicinal properties like they act as a blood purifier, promote early wound healing, treat calcium deficiency, relieve skin ailments, relieve menstrual cramps, detoxify the body, destroy tumors and treat joint pains.\n\nVitex negundo is the main herb content of this oil that helps in relieving various skin complaints. There are also some other herbs in small proportion in Nirgundi oil to enhance its medicinal quality, like Manjistha, Kalihari and Haridra. It aids in faster wound healing, relieves pain, treats leprosy, inflammation of the skin, lesions on the skin, etc.\n\nTea tree oil is the main ingredient of this paraben free bathing soap. Aloe is also present in this herbal soap. Both of the herbs help in maintaining healthy and moisturized skin. It prevents infectious diseases of the skin and also helps to treat them. Regular use of this soap prevents dry skin, moisturizes the skin and clears off the infectious lesions present on the skin.\n\nWhat to eat in Chickenpox\n• Keeps your body hydrated by drinking lots of water.\n• Include plenty of fruits and vegetables in your diet like banana, watermelon, berries and guava etc. Avoid citric fruits as they may cause itching.", "opengraph": {"locale": "en_US", "type": "article", "title": "Chickenpox - Planet Ayurveda", "description": "Varicella is a viral infection. Chickenpox caused by varicella-zoster virus. Learn more about Chickenpox causes, Symptoms, Remedies & Ayurvedic Treatment", "url": "https://www.planetayurveda.com/library/chickenpox/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2019-04-25T10:28:44+00:00", "article:modified_time": "2022-04-05T10:26:13+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2019/04/Chickenpox-images-Chickenpox-Causes-Symptoms-remedies-and-Ayurvedic-Treatment.jpg", "image:width": "369", "image:height": "233", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#introduction", "#remedies", "#diet", "https://store.planetayurveda.com/", "http://store.planetayurveda.com/", "https://www.planetayurveda.com/neem-capsules/", "https://store.planetayurveda.com/products/gandhak-rasayan", "https://www.planetayurveda.com/library/manjistha-rubia-cordifolia/", "https://store.planetayurveda.com/products/skin-care-pack"], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2019-04-25T10:28:44+00:00"}