{"result_id": "371007", "URL": "https://www.planetayurveda.com/library/breastfeeding-ayurvedic-viewpoint/", "timestamp": "2023-04-25 18:28:21 CEST+0200", "meta": {"description": "Breastfeeding is the most essential part of post-partum, which means the delivery of a baby. It is a blessing not only for the mothers, but also to all humans who are lucky enough to have Mother's milk in their initial stage of life.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/breastfeeding-ayurvedic-viewpoint/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Ayurvedic View on Breastfeeding and its Benefits for Life", "cleaned_text": "Ayurvedic View on Breastfeeding and its Benefits for Life\n\nMotherhood is the most beautiful blessing to women gifted by the Almighty. People say women are weak, but if we start analyzing their capabilities, we will end up finding that the strongest creature on earth is a mother whether it is a human, an animal or any other living being. Daily, while surfing through social media and other platforms, we always see or read about the qualities of a woman, especially the mothers. Mother is the embodiment of the supreme soul. Each and every saying about Mother is beautiful, honorable and adorable. Although the qualities of a mother cannot be counted on fingertips, as they are enormous, wonderful and infinite. But, here we are trying to discuss about some amazing benefits of Breast milk that each and every human can enjoy.\n\nBreastfeeding is the most essential part of post-partum, which means the delivery of a baby. It is a blessing not only for the mothers, but also to all humans who are lucky enough to have Mother's milk in their initial stage of life. As per the highest medical authorities, such as American Academy of Pediatrics (AAP), American College of Obstetricians and Gynecologists (ACOG), World Health Organization (WHO), etc. Breastfeeding should be done for a minimum of 6 months, and maximum 2 years as per the situation and mother's wish. The frequency of breastfeeding depends upon the appetite and growth of the infant. Enrich and Shower your Blessings with Breast Feeding for Lifetime Nature is really a Magician, nobody can understand it completely, we can only enjoy and maintain its beauty. The composition of breast milk also changes as per the growth and changing needs of the infants. In the initial stages, breast produces a thick yellowish fluid, known as Colostrum. It is really a magnificent food that cannot be replaced with anything in this world. Let us now, know about the wonderful features of Breast Milk.\n\nAs Ayurveda considers, the balanced tridoshas are the main essence of health. So, it also applies here while talking about mother's milk. Mother's diet and the imbalance of tridoshas, directly affects the quality of breast milk, consequently can be the reason for baby's ill health. According to Ayurveda, Breast milk is Upadhaatu of Rasadhaatu, and has directly influence of the quality of Rasadhaatu. Rasadhaatu is created from the food we eat. To assess the quality of breast milk, Ayurvedic texts have provided a very easy and simple method. Pour a drop of milk into a bowl of water, it will react in three ways showing the results as below.\n• If it disperses - it shows the quality is Good.\n• If it floats - it shows the milk has aggravated Vata\n• If it sinks - it shows the heaviness of Kapha in Milk Thus, the mother needs to make it healthy accordingly by eliminating the factors responsible for both of the above conditions.\n\nAs today the lifestyles of the females has become really hectic and they do not even find to take care of their infants. Even, hiring a caretaker for babies is a trend. Working women do not want their work life to get more disturbed because of babies, which also affect their decisions of timely family planning leading to various other negative issues in life. In all this, the artificial feeding for babies is increasing rapidly as well as their ill effects on health that remains with the children forever, such as:\n• More chances of Diseases such as Diarrhea, Respiratory Infections, etc.\n• More time required for contraction of Uterus\n• Increased Risk of Diseases in mothers like Anemia, Breast and Ovarian cancer, etc.\n\nColostrum, the first milk of Mother is loaded with numerous beneficial nutrients such as protein, etc. It is low in sugar and helps the digestive tract of the newborn to develop intrinsically. Breast milk is naturally prepared inside the mother's body just after the child's birth and it is enriched with all the requirements. It changes its qualities according to the growth and need of the child and always maintains its easily digestible feature. Being rich in Antibodies, Breast Milk aids the infants to stay protected against the various types of viral and bacterial infections. Here, starts the strengthening of immunity. High amount of immunoglobulin A (IgA) in Colostrum, forms a shield in infant's throat, nose and digestive system, safeguarding them against the sickness. Breast milk reduces the risk of various mild and severe health disorders that may occur in the children who are deprived of it. Some of those ailments are Pneumonia, Diarrhea, Respiratory Tract infections, Cavities, Cold, Seasonal Allergies, Gut Infections, Intestinal tissue damage, Sinus infections, Sudden Infant Death Syndrome (SIDS), Diabetes, Childhood Obesity, necrotizing enterocolitis, Urinary tract Infections (UTIs), Leukemia, and Lymphoma.1 Leptin is the Key hormone, which is responsible for regulating appetite and storing fat. Breast milk is rich in this hormone therefore, results in balanced appetite and healthy fat in the body. Breast Milk is enriched with the balanced amount of nutrients that are the essence of growth and health of a person. Also, baby never drinks it more than his appetite and mothers also take care of the feeding patterns. Besides this, the good amounts of Leptin found in this (as already described above). All these factors help in maintaining weight of baby as well as mother. It is scientifically proved and experienced that breast milk supports in improving the IQ level of the person, which further leads to a better development of brain and other body parts. The babies, who have grown drinking Breast milk for maximum period, have higher intelligence, even with respect to the socioeconomic factors. The fatty acids, that are present in this milk act as the perfect natural brain boosters. The breast milk makes the Antibodies to response better, which in turn supports and increases the effectiveness of vaccinations. These also, consequently, help in boosting immunity and the overall strength of a person to fight diseases during his lifespan.\n\nBreast feeding babies should not be a trouble for mothers but it is a beautiful responsibility and phase of life. It does not only benefit the baby but the mother also and has the ability to make their lives better. During breast feeding, a mother's body experience many changes that affect her whole life. Some of the most common benefits of breast feeding for mothers are as below. Breastfeeding reduces the risk of diseases for mothers also. The breastfeeding mothers can be better at staying away from diseases such as High Blood Pressure, High Blood Fats, Type 2 Diabetes, Arthritis, Heart Diseases, UTIs, Breast and Ovarian Cancer, etc.1 as compared to those who don't. As per the researches and studies done till the time, the healthy breastfeeding provides complete nutrition to the babies and helps the mothers to burn calories at a rapid rate. This whole process happens naturally and changes with time according to the growth and need of the babies and mothers. Helps in Easy Contraction of Uterus & Decreased Postpartum bleeding and Cramps Pregnancy results in the immense growth of uterus, enlarging it to a bigger size as abdomen. After delivery of the baby, the process of involution starts in Uterus that helps in restoration of its normal size. The secretion of Oxytocin increases during pregnancy as well as breastfeeding, which aids the mother in different fields including easy contraction of Uterus, reduction of bleeding and pain after delivery. Oxytocin and prolactin, the two hormones those are mainly responsible for the emotional and behavioral changes increases during this time span. This increase is good for the mothers as it acts as anti-depressant and prevents stress, anxiety, depression and negative mood swings. Prolactin is a hormone which is also responsible for the ovulation process. Prolactin keeps estrogen and progesterone at bay. Decreased prolactin means ovulation and vice versa. As already mentioned, prolactin increases during this time period, thus it helps in preventing menstruation and allow the mothers to spend more good time with their babies. They also stay away from hormonal imbalances that generally occur during menstruation. This is the most special benefit of Breastfeeding. As we have already discussed clearly about the positive effects of breast milk on baby and mother's health, therefore we can easily say that it empowers the mothers in various ways. Breastfeeding allows the mothers to spend more and more time with their babies and to care for them; on the other hand it develops a beautiful bonding of both. We usually see that while drinking breast milk, babies show some cute, beautiful and wonderful expressions that can never be seen anywhere else. This tells that the baby feels safe and secure in mother's arms, which increases the happy hormones as well as the impact of breast milk naturally.", "opengraph": {"locale": "en_US", "type": "article", "title": "Ayurvedic View on Breastfeeding and its Benefits for Life - Planet Ayurveda", "description": "Breastfeeding is the most essential part of post-partum, which means the delivery of a baby. It is a blessing not only for the mothers, but also to all humans who are lucky enough to have Mother's milk in their initial stage of life.", "url": "https://www.planetayurveda.com/library/breastfeeding-ayurvedic-viewpoint/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2020-11-04T07:56:07+00:00", "article:modified_time": "2020-11-04T07:56:08+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.aap.org/en-us/advocacy-and-policy/aap-health-initiatives/Breastfeeding/Pages/Benefits-of-Breastfeeding.aspx", "http://www.tensteps.org/benefits-of-breastfeeding-for-the-mother.shtml"], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2020-11-04T07:56:07+00:00"}