{"result_id": "371026", "URL": "https://www.planetayurveda.com/dr-madan-gulati/", "timestamp": "2023-04-25 18:29:04 CEST+0200", "meta": {"description": "Dr. Madan Gulati is an expert Ayurvedic doctor based in Chandigarh, North India and one of the best ayurvedic doctors offering ayurveda consultations.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/dr-madan-gulati/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Dr. Madan Gulati", "cleaned_text": "Running his own Ayurvedic treatment center in Chandigarh, North India. The patients visit him for the consultation from all over world to his clinic located in most beautiful area of Chandigarh.\n\nThe patients who are suffering with complicated disease and are not getting relief from any other doctor but is getting good results after and relief. By taking the ayurvedic treatment from Dr. Gulati. - (Comments Written by Dr. Vikram Chauhan)...\n\nB.A.M.S. (Gold Medalist, 1st in the University), M.D.(Ayurveda), Diploma in Panchkarma and Yoga\n\nDeputy Director (Ayurveda) and Head of Ayurvedic Wing of the Directorate of AYUSH, Union Territory, Chandigarh, INDIA.\n\nVaidya Shiromani Award for Exemplary services in the field of Ayurveda by Advisor, Department of AYUSH, Govt. of India.\n• In-charge of all Ayurvedic Dispensaries as Controlling Officer and Head of Office for the more than 10 years i.e. from January, 1996.\n• Training in Hospital Administration from National Institute of Health and Family Welfare, Govt. of India, New Delhi, in February, 1999.\n• Training in reservation in services from Institute of Secretariat Training and Management, Govt. of India, New Delhi, in May, 2004 incorporation of the Board since November, 2001.\n• Technical Member and Additional Chief Executive Officer of the Medicinal Plant Board, U.T., Chandigarh since 2001\n• M.D. (Ayurvedic Pharmacology/Ras Shastra and Bhaishijya Kalpana) as in-service candidate from Panjabi University, Patiala, India (1990-1993). Subject of original research for M.D. was, “Potali Ras for the treatment of Ameobiasis”\n• Appointed distinguished Medical Scientist by the Vice Chancellor Punjab University, Chandigarh on 5.11.2001.\n\nDr. Madan Gulati conducting a workshop on uses of medicinal plants. The listeners are doctors from NHS (UK)\n\nDr. Madan Gulati with faculty of Science of Post Graduate Govt. College for Girls, Sector – 42, Chandigarh after delivering lecture on Health Care through Common Medicinal Plants\n• Honorary Lecturer at Dhanvantari Ayurvedic Medical College, Chandigarh (1979-1985) for Ayurvedic Medicine/Kaya Chikitsa, Ayurvedic Pathology/ Rog Nidan and Ayurvedic Physiology/Shareer Kriya Vigyaan.\n• Internship to more than 200 Ayurvedic Graduates (who got training in Ayurvedic dispensaries of Chandigarh) under my supervision and guidance.\n• Organized about a dozen camps in Yoga and Panchkarma in co-ordination with Divine Life Society, Rishikesh and Haridwar.\n• External Examiner of Physiology and Yoga for Panjab University, Chandigarh.\n• Expert member of selection committee for the appointment of Principal and Lecturers of Shri Dhanvantari Ayurvedic College, Chandigarh.\n• Visiting lecturer of Guest Faculty of Dhanvantari Ayurvedic College since July 2002 for overall enhancement of Ayurvedic education.\n• Conducted a Seminar and delivered lectures to British National Health Service Doctors on basic principles of Ayurveda and methods of Diagnosis and treatment according to Ayurveda and also introduced the Ayurvedic Medicinal Plants to the British Doctors on 25.2.2005.\n• Delivered lectures in Re-Orientation Training Prgoramme (ROTP) on Ras Shastra and Bhaishajya Kalpana (Pharmacology) on 24th November, 2003 - E Foreign Experience.\n• As visiting Ayurvedic Physician and Lecturer in Switzerland, France, Germany and Italy at different times since 1987 (Short term visits).\n• Attended conference of International level relating to development of Ayurvedic System. - F Social Services and Titles.\n• Life Member of All India Ayurvedic Congress, New Delhi.\n• From Director (AYUSH), Chandigarh Administration regarding keen interest in promotion of Ayurvedic System of Medicine and possessing good administrative and management skills.\n• Award of Honour was given on Dhanvantari Day Celebrations for development of Ayurvedic System of Medicine by Ayurvedic Sharnam, Chandigarh in Nov. 1997.\n• Award of Honour was given by was given on Dhanwatry Jayanti for promotion of Ayurvedic System of Medicine. - H Seminar/Workshops/Medical Camps/Health Melas Participation.\n• For the awareness and cultivation of Medicinal Plants by the farmers, delivered a lecture on importance of herbs used in Ayurvedic System of Medicine in the regional Seminar on exploratory studies of herbs for farming organized by Institute of Engineering and Technology, Bhadal, Punjab on 2.3.2002.\n• Participated as a resource person in various workshops and seminars organized by the and delivered lectures to the farmers and rural population in various villages of delivered lectures on cultivation and uses of Ayurvedic herbs.\n• Participated in the 3rd International Seminar on Ayurveda organized by the Gujarat Ayurvedic University , from .\n• Actively participated in “International Convention on Ayurveda” organized by All India Ayurvedic Congress on 10th April 1992 to 12th April 1992.\n• Actively participated in International Congress “Ayurveda 2000” organized by Sawparnika Ayurvedic Foundation for Research, Health and Education on 28th January to 30th January 2000 at Kamraj Memorial Hall Chennai. India.\n• Participated in National Conference on Development of Ayurveda organized by Rashtriya Ayurveda Parishad on 8th and 9th January, 1999.\n• Delivered a lecture on “Ayurveda – An Alternative System of Medicine” on 31st August, 2001 organized by Health and Education cell of Dayanand Medical College and Hospital, Ludhiana.\n• Participated in the seminar on Consumer Health organized by the Citizen Awareness Group and delivered a lecture on “The Need of Ayurveda for the Consumers in the present scenario”.\n• Participated in Patent Awareness Workshop at Central Research Institute (Ayurveda) at Patiala on 29.11.2004.\n• Participated in Agro Technology Fair held on 3-6.12.2004 and Educated the public about Ayurvedic Medicinal Plants.\n• Delivered lectures on “Promotion of Ayurveda” and “Cure of Diabetes Mellitus in Ayurveda” at Continued Medical Education programs organized by the Ayurvedic Study Circle, Ludhiana.\n• For the promotion and popularization of Ayurveda, participated in more than two dozen Ayurvedic medical camps organized by Chandigarh Ayurvedic Medical Association, Bharat Unnat Vikas Parishad, Lion’s Club, Citizens Awareness Group, Mahila Parishad, Servants of the People Society, Bengali Association and other NGO’s at various Colleges and Universities and delivered lectures on the benefits of Ayurveda time to time.\n• Participated in Arogya Seminar and Expo held on 31.3.2002 as Hotel Shivalik View organized by Institute of Tourism and Future Management Trends and delivered a talk on “Ayurveda Ancient Wisdom, Modern Science.”\n• Participated in Arogya 2001 fair held at Pargati Maidan, New Delhi 15th Dec. to 18th Dec. 2001 organized by Department of AYUSH, Govt. of India.\n• For the Promotion of Ayurveda, participated in 2 day workshop organized by Servants of People Society at Lajpat Rai Bhawan, Chandigarh From 19th to 20th Jan 2002 and delivered a lecture on methods of Diagnosis and treatment according to Ayurveda.\n• Participated in an exhibition and given a presentation on Ayurveda to Prince of Wales Prince Charles and his wife Duchess of Cornwall Camilla Bowles at National Institute of Pharmaceutical Education and Research (NIPER) on 28th March 2006.\n• Participated as a Resource Person in 10 days workshop on Ayush at National Institute of Nursing Education (NINE) PGI and delivered a lecture on Basic Concepts and Principles of Ayurveda on 17th April 2006.\n• He also delivered a Lecture at Post Graduate Govt. College for Girls Sector 42 Chandigarh on \"Health Care through common medicinal plants\" : 26th-Feb-2016\n• Dr. Gulati gave interview for a Newspaper in Latvia on 23rd Nov, 2016. Click Here to read this interview.\n• A big interview of Dr. Madan Gulati was published in a very prestigious Latvian portal \"Veselam\" meaning Healthy. Take a look although it's in Latvian. Click Here to read this interview.\n• Dr. Madan Gulati delivered a Lecture on Health Through Medicinal plants at Post Graduate Govt. College for Girls, Sector 11, Chandigarh. (Date:07-02-2017)\n• Medicinal Plants Board, Chandigarh Administration - Chandigarh, organized a workshop on Importance of Conservation of Medicinal Plants for the School Children, teachers and local Residents at Medicinal Plants Garden Sarangpur Chandigarh. On this occasion he delivered a Lecture on Importance of Medicinal Plants for improvement of our Health. (Date:16-02-2017)\n• World Health Day Celebrations were organized by the Institute of Technology and Future Management Trends ( ITFT ) at Tagore Theater Chandigarh. On this occasion, he delivered a Lecture on Role of Meditation to Cure Depression. (Date:7-04-2017)\n• He conferred upon Ayurveda Gaurav Award by Sh. Shripad Yesso Naik (Union Minster for AYUSH) on 4th June 2017 at Welingkar Institute of Management in Mumbai.\n• Dr. Gulati is a Former Deputy Director at Ayush Chandigarh, participated in the Seminar on Good Food for Good Health on 17th September 2017 organized by Arya Vaidya Sala Kottakkal Ayurvedic Hospital, Baddi.\n• Dr. Gulati Former Deputy Director Ayush Chandigarh, participated as Resource Person in a Seminar on Polycystic ovarian Syndrome (PCOS) on 21st September 2017 at PGIMER Chandigarh organized by School of Public Health PGIMER Chandigarh in collaboration with Department of Obstetrics and Gynecology PGIMER Chandigarh. He also delivered Lecture on Demedicalzation of treatment of PCOS: Evidence naturopathy.\n• Dr. Madan Gulati delivered a Lecture on \"Evidence for Naturopathy: Ayurvedic Principles of Treatment of PCOS. Role of Herbs and Diet\" at National Institute of Nursing Education, PGIMER, Chandigarh on 15th February 2018 in a Seminar organized by School of Public Health in collaboration with National Institute of Nursing Education PGIMER sponsored by ICSSR NORTH - WESTERN REGIONAL CENTRE.\n• On 8th October 2020, Dr. Madan Gulati addressed the teachers of Eco Clubs of various Schools of Chandigarh at Medicinal plants Garden at Sarangpur and told the uses of Medicinal Plants and need of establishing herbal gardens in various schools. Click Here to view the Media Clippings.\n• Dr. Madan Gulati given enlightening speech on \"Bringing Health with Herbal\" and \"Introducing Ayurveda in School Education\" to explore the scope from the basic levels of Generations, in State Level Seminar on Medicinal Plants & Herbal Gardens, held on 12th March, 2021, and organized by the Medicinal Plants Board, Eco Club of Dev Samaj College of Education and Yuvsatta (Youth for Peace) NGO.\n• Dr. Madan Gulati enlightened the people about importance of Swaran Prashan Samsakar on Pushya Nakshatar an Ayurvedic way of vaccination against various diseases to the children below 16 years. This event was Organised by Bharat Vikas Parishad at Sanatan Dharam Mandir - Sector 11, Chandigarh on 14th June, 2021.\n• Dr. Madan Gulati enlightened the Ayurvedic Doctors in the Faculty of Shuddhi Ayurveda Panchkarma Centre, Dera Bassi, about need and Importance of Ayurvedic System of Medicine in the present scenario on 4th July, 2021. Dr. Amar Singh Azad, Acharya Manish and Dr. Vikram Chauhan were also present in this event.\n• Dr. Madan Gulati attended the Inaugural Ceremony of Rajiv Dixit Memorial Hospital & Institute of Integrated Medical Sciences, Devinagar Near Dera Bassi. On this occasion Dr. Madan Gulati participated on launching the book on Delta 72 Corona Virus written by Dr. Biswaroop Roy Chowdhury. (On 11th July, 2021)\n• On the invitation of Director Ayush Chandigarh Administration Chandigarh, Dr. Madan Gulati delivered a Lecture on Role of Ayurveda in Kuposhan Mukat Bharat on the occasion of National Ayurveda Day celebrated at Directorate of Ayush Chandigarh Administration. (On 1st November, 2021)\n• Dr. Madan Gulati was invited as Guest Speaker in the workshop on Training on Wellness and Lifestyle organised by Direct Taxes Regional Training Institute (DTRTI) Kolkata. Dr. Gulati delivered a lecture on Role of Ayurveda in Modern Day Lifestyle to Indian Revenue Service (IRS) Officers of Income Tax Department Govt. of India. (On 10th December, 2021)\n• Dr. Madan Gulati was invited as Guest Speaker in the Workshop on Millets Awareness Program Organised by WICCI Punjab Rural Tourism Council at Planet Ayurveda. Dr. Gulati Delivered a lecture on Importance of Millets in Ayurvedic diet and their benefits related to health. He also explained the uses of millets in various disease and promote the healthy lifestyle. (On 03rd September, 2022)\n• Dr. Madan Gulati was invited as Guest Speaker in the webinar hosted by Naturefit in association with Dabur India. Dr. Gulati delivered a lecture on Ras Chikitsa in Life Style Disorders. (On 27th December, 2022)\n• Dr. Madan Gulati was invited as Guest Speaker in CME conducted by Ayurvedic and Unani Board Punjab. Dr. Gulati delivered a Lecture on Ayurvedic Methods of Diagnosis and Treatment with special reference to Ras Chikitsa to Govt. Ayurvedic Medical officers and Senior Ayurvedic Physicians of District Ludhiana. (On 31st December, 2022)\n\nDr. Madan Gulati and his wife Dr. Saras Gulati at Brahmakumaris Centre, Riga (Latvia)", "opengraph": {"locale": "en_US", "type": "article", "title": "Dr. Madan Gulati - Planet Ayurveda", "description": "Dr. Madan Gulati is an expert Ayurvedic doctor based in Chandigarh, North India and one of the best ayurvedic doctors offering ayurveda consultations.", "url": "https://www.planetayurveda.com/dr-madan-gulati/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:modified_time": "2023-03-18T07:25:48+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["https://www.planetayurveda.com/dr-madan-gulati-interview-newspaper-latvia/", "http://veselam.la.lv/2017/01/07/saruna-ar-ajurvedas-arstu-no-indijas-kam-izdevies-izarstet-diabetu-u-c-slimibas-bez-blakusparadibam-dazkart-tikai-ar-uzturu/", "https://www.planetayurveda.com/pa-wp-images/media-clippings-eco-club-teachers-workshop-8-oct-2020.pdf"], "authors": [], "publish_date": null}