{"result_id": "371019", "URL": "https://www.planetayurveda.com/library/swollen-lymph-nodes/", "timestamp": "2023-04-25 18:28:48 CEST+0200", "meta": {"description": "Planet Ayurveda provides best combination of effective herbal remedies such as Swollen Lymph Nodes Care Pack for ayurvedic treatment of swollen lymph nodes. These remedies are safe to use as these are free from side effects.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/library/swollen-lymph-nodes/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "Swollen Lymph Nodes", "cleaned_text": "In this modish world people have all the luxuries like good food, shelter to live, money and many more things which makes our life more relaxed and easy going. But when it comes to health, it is miserable that health issues are also increased despite decreasing. Our life style, improper eating habits and other various factors which lead to health complications. One of them is the swollen lymph nodes.\n\nLymph nodes are called as lymph glands and the integral part of immune system. They are present all over the body but more prominent in neck regions, groin, chin, behind ears and armpits. Lymph nodes are visible when they are enlarged or swollen. Major causes of swollen lymph nodes problems are due to infections like bacteria, viruses and parasites. There are varieties of infections, injury or tumor which are responsible for swollen lymph nodes.\n• Suppressed immune system due to HIV (Human immunodeficiency virus) which results in AIDS.\n• Viral infections by paramyxovirus that cause measles.\n• Lupus it is the condition when body's immune system start attacking body's joints and blood cells.\n• Parasitic infections (Toxoplasmosis) can also be the cause of swollen lymph nodes.\n• Medical history - Doctor study the patient's medical history. Doctor tries to know that when the swollen lymph nodes developed and symptoms associated with them.\n• Physical examination – Doctor observes the lymph nodes on the surface of skin which helps to diagnose the under beneath causes of problem.\n• Blood tests – Blood tests are done to detect the infections caused by bacteria, viruses and parasites.\n• X – Ray and CT (computerized tomography) is used to identify the affected regions.\n• Lymph node biopsy is also done for diagnostic purposes.\n\nWHAT IS THE CAUSE OF SWOLLEN LYMPH NODES IN AYURVEDA?\n\nIn Ayurveda swollen lymph nodes are due to bacterial infections, viral infections, parasites and compressed immune system. Various herbs are present in Ayurveda which help to strength the immune system. With the help of proper eating habits and lymph massage therapy one can get rid of swollen lymph node problems.\n\nAyurveda is world's ancient medical system and it is accepted as country's health care ideology. Origin of Ayurveda in India is around more than 3,000 years ago. This system works on concept that with the help of herbs, disease can be cured without any side effects. Moreover, Indian government and many other institutes all over the world encourage the laboratory research on Herbs.\n\nHere we are talking about the Planet Ayurveda which also works in accordance with ancient Ayurveda. This company's main emphasis is to provide the health benefits along the treatment of disease. All the products provided by this company are free from preservatives, starch, colors, additives and completely safe for mankind.\n\nPlanet Ayurveda provides best combination of effective herbal remedies such as Swollen Lymph Nodes Care Pack for ayurvedic treatment of swollen lymph nodes. These herbal remedies are prepared from using best quality herbs and strictly follow the principles of Ayurveda. All these herbal remedies of Planet Ayurveda are 100 percent pure, natural and vegetarian. These are free from chemicals, additives and preservatives. These are safe to use as these are free from side effects.\n• Ashwagandha Capsules - Two capsules twice daily with warm water after meal\n• Kanchnaar Guggul - Two tablets three times in a day with warm water after meal\n• Curcumin Capsules - Two capsules twice daily with warm water after meal.\n\nAshwagandha capsules are miraculous herbal products of Planet Ayurveda. These capsules are prepared from the pure extract of herb Ashwagandha. This herbal remedy for the swollen lymph nodes is quite effective to strength the lymphatic system. It has great medicinal importance in Ayurveda because it is packed with rejuvenating properties. Its antimicrobial and anti-inflammatory properties help to provide the relief in the cases of swollen lymph nodes.\n\nKanchnaar guggul is wonderful herbal formulation of Planet Ayurveda which is packed with antimicrobial, anti inflammatory properties. Lymph nodes are the part of immune system. So these herbs help to strength the immune system and quite effective for the treatment of swollen lymph nodes. This herbal product is the mixture of various herbs like Kachnar Bark (Bauhinia variegata), Amalaki (Emblica officinalis), Haritaki (Terminalia chebula), Bibhitaki (Terminalia bellerica), Ginger (Zingiber officinale), Black pepper (Piper nigrum), Pippali (Piper longum) and Varuna (Crataeva religiosa). This herbal remedy for swollen lymph nodes is quite effective in the problems of swollen lymph nodes.\n\nHaridra contains a phytochemical named as curcumin which has anti-inflammatory properties. It is quite effective to treat swollen lymph nodes present in the throat and necks.\n\nIt happens in the most of cases that people take health issues very casually until it turns into a serious health hazards. It is advised to the patients that they must consult the doctors if enlarged lymph nodes are not cured and new one are also developed. Do visit your doctor if lymph node size is more than 2 centimeters.", "opengraph": {"locale": "en_US", "type": "article", "title": "Swollen Lymph Nodes - Planet Ayurveda", "description": "Planet Ayurveda provides best combination of effective herbal remedies such as Swollen Lymph Nodes Care Pack for ayurvedic treatment of swollen lymph nodes. These remedies are safe to use as these are free from side effects.", "url": "https://www.planetayurveda.com/library/swollen-lymph-nodes/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:published_time": "2019-05-03T08:55:54+00:00", "article:modified_time": "2021-11-16T10:52:30+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#introduction", "#remedies", "http://store.planetayurveda.com/swollen-lymph-nodes-care-pack.html", "http://store.planetayurveda.com/swollen-lymph-nodes-care-pack.html", "http://store.planetayurveda.com/swollen-lymph-nodes-care-pack.html"], "authors": ["Dr. Meenakshi Chauhan"], "publish_date": "2019-05-03T08:55:54+00:00"}