{"result_id": "371034", "URL": "https://www.planetayurveda.com/autoimmune-disease/", "timestamp": "2023-04-25 18:29:22 CEST+0200", "meta": {"description": "Planet Ayurveda offers best combination of effective herbal remedies such as Autoimmune Care Pack for ayurvedic treatment of autoimmune disease, autoimmune disorders.", "lang": "en", "keywords": "", "favicon": "https://www.planetayurveda.com/wp-content/uploads/2019/01/fav.png", "canonical": "https://www.planetayurveda.com/autoimmune-disease/", "encoding": "UTF-8"}, "image": null, "domain": "www.planetayurveda.com", "title": "HERBAL REMEDIES FOR AUTOIMMUNE DISEASE", "cleaned_text": "Immunity is the body's natural ability to fight against disease causing microorganisms and antigens. Immune system is a complex system that involves different body organs at different levels to protect the body against foreign invasion.\n\nIMMUNITY CAN BE BROADLY CLASSIFIED INTO TWO DIFFERENT VARIETIES NAMELY:-\n\nIt is the transfer of readymade or pre-formed antibodies (cells that fight pathogens) from one individual to another. It may occur at the time of birth when specific antibodies are transferred from the mother to fetus. Short term immunization done in case of diseases like immunodeficiency diseases also are a type of passive immunity transfer\n\nIn this case, there is an active involvement of the cellular components (B-cells and T-cells) of the immune system of the body which are activated by pathogens and actively fight against them to support body's defense. Alternatively, vaccines also lead to the activation of these cells imparting active immunity in an artificial manner.\n\nThe immune system of our body is naturally designed to combat the invading foreign microorganisms and allergens. In a few rare cases, this immune system starts attacking its own body cells and tissues. This is known as an auto-immune response. As a result of this faulty immune response, many diseases occur.\n\nThe symptoms of auto–immune diseases vary according to the body part they attack. These diseases have a very broad spectrum ranging from multiple sclerosis to Type-1 Diabetes. While many auto-immune disorders are manageable, a few may turn life threatening. Proper management of auto-immune disorders largely depends on their early diagnosis. But, in most cases, these diseases have a silent onset and often remain hidden for a long time.\n\nAyurveda is an age old system of medicine. Ojas is the term given to the body's natural ability to fight diseases. It can be compared to the normal immune response of the body.\n\nOjas helps to maintain the physical as well as mental wellbeing of the body. It should be strengthened with appropriate diet and lifestyle for living a healthy and long life.\n\nPlanet Ayurveda offers best combination of effective herbal remedies such as Autoimmune Care Pack for ayurvedic treatment of Autoimmune disease. These herbal remedies are prepared from using best quality herbs and strictly follow the principles of Ayurveda. All these herbal remedies of Planet Ayurveda are 100 percent pure, natural and vegetarian. These are free from chemicals, additives and preservatives. These are safe to use as these are free from side effects.\n\nGiloy' is the Hindi name of a climber 'Guduchi', which is widely used in Ayurveda to boost immunity. Its scientific name is Tinospora cordifolia. Giloy is mentioned among rejuvinators (rasayan herbs) in Charaka Samhita. It helps in building up strong immune system. It is magnificent herb, which balances all three doshas i.e. Vata, Pitta and Kapha. It helps in maintaining pH of the body and flushes out the toxins due to its diuretic property. Its stem is used for medicinal purposes. Researchers have found its ability to care Swine flu and effective in enhancing strength in cancer patients. Giloy capsules are therapeutically beneficial as anti-pyretic, anti-arthritic, anti-inflammatory and blood purifying agent. Giloy possess tonic, diuretic, stimulant, digestive, stomachic, bactericidal and aphrodisiac properties. Giloy capsules also enhance memory and bring a face with natural glow by its soothing property. Giloy capsules are gives positive results when used in auto immune diseases. Various ailments such as hyperacidity, abdominal pain, colitis, excessive thirst, liver disorder, hot flushes are treated with Giloy capsules. These Giloy capsules produce right amount of mucin, which protects lining of duodenum and stomach. Giloy increases immunity by enhancing the combating power of macrophages (type of white blood cells).\n\nThe Ayurvedic formulation Immune Booster capsule by Planet Ayurveda is 100% pure manufactured goods taken from the best quality immune-modulating herbs. The ingredients used in this formula are green tea, phyllanthus niruri, bovine colostrums and vitis vinifera. These have been known since centuries for the wonderful actions for enhancing immune power. Pure organic herbs are used for getting their extract, which delivers quality and effectiveness in the best possible way. The processing and packaging of these vegi capsules is done using best technology and with minimal human intervention. Immune Booster capsules are pure herbal supplement for boosting your immunity. The ingredients are very well known and used in Ayurveda and worldwide. Grape seed extract enhances immunity. Bovine colostrums is rich source of many vitamins like A, E, D and natural immunoglobulins , which increases strength and immunity effectively. It is regarded as the best natural body guard. Phyllanthus niruri have antioxidant and is capable to fight against viral infections. It enhances immunity and beneficial in asthma, cough, cold, liver disorders, jaundice, skin ailments, blood impurities. Green tea, botanically known as Camellia sinensis have polyphenols that possess property of a potent antioxidant. It helps in flushing out free radicals and cures a number of health ailments. These Immune Booster capsules provide longevity by improving strength. The regular usage of Ayurvedic Immune Booster capsules reduces the chances of recurrent illness and enhances immunity.\n\nThe Ayurvedic formulation Curcumin capsule is a 100% pure organic product from the best quality Curcumin. Curcumin is a common household spice in India known for its rich flavor. Curcumin is popularly known as turmeric. These Curcumin capsules contain standardized extract of organically grown turmeric. Curcumin capsules give its effective results in the best possible way. Curcumin has numerous health benefits. The Curcumin capsules are vegi capsules and completely natural product. Due to its affluent medicinal properties, Curcumin is a widely used in cancer, auto immune diseases, diabetes, liver disorders, chronic infections, inflammations, allergies and various skin ailments. Anti-oxidants present in it remove free radicals from the body and improves the health and enhances immunity. It also works as a natural antibiotic and cures many infections and allergies. It gives natural shiny glow to the skin as it is a wonderful blood purifier.", "opengraph": {"locale": "en_US", "type": "article", "title": "HERBAL REMEDIES FOR AUTOIMMUNE DISEASE - Planet Ayurveda", "description": "Planet Ayurveda offers best combination of effective herbal remedies such as Autoimmune Care Pack for ayurvedic treatment of autoimmune disease, autoimmune disorders.", "url": "https://www.planetayurveda.com/autoimmune-disease/", "site_name": "Planet Ayurveda", "article:publisher": "https://www.facebook.com/PlanetayurvedaIndia", "article:modified_time": "2021-11-20T06:38:31+00:00", "image": "https://www.planetayurveda.com/wp-content/uploads/2020/04/dr-vikram-chauhan.jpg", "image:width": "413", "image:height": "413", "image:type": "image/jpeg"}, "tags": [], "tweets": [], "movies": [], "links": ["#introduction", "#remedies", "https://store.planetayurveda.com/products/autoimmune-care-pack", "https://store.planetayurveda.com/products/autoimmune-care-pack", "https://store.planetayurveda.com/products/autoimmune-care-pack"], "authors": [], "publish_date": null}